
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// AnimBlueprintGeneratedClass ABP_BS_Door_SecurityGate.ABP_BS_Door_SecurityGate_C
// Size: 0xb61 (Inherited: 0x280)
class UABP_BS_Door_SecurityGate_C : public UAnimInstance {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_93A8467D42C8DD40731A798DA1F5DF75; // 0x288(0x60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_996B9F604855E8B2E703988B2A9DBFA1; // 0x2e8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9CC7AAA14AAABDD8D88A7C8924A04C23; // 0x350(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_273AD5004385840C7945BDA431E56687; // 0x3b8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30818C164D17F07EADDDFC83D6F3EE0E; // 0x420(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7024B80A4FD9D555F377ABA294B3CE1F; // 0x488(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_0AD886714ED3952CCF1B1A85FF65A7EC; // 0x588(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5B8EBF1B4924D53917FAB6B52B7CCF23; // 0x5e8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6BFDE14148256CCB78735ABF54044AE9; // 0x6e8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2D702C7E401F96AC33A8B8A5F28DB29B; // 0x748(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_79A3247447A2A7189B5FFDA5044B4D84; // 0x848(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7CD6D0CB43B28360A6453DBE75647595; // 0x8a8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_BF928FDB4888E32263A3409A23078C7B; // 0x9a8(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_91D177974AB78C342A6D65A988E7F6E2; // 0xa08(0x158)
	bool Open_; // 0xb60(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_BS_Door_SecurityGate.ABP_BS_Door_SecurityGate_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
