
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// AnimBlueprintGeneratedClass ABP_DoorCurtain.ABP_DoorCurtain_C
// Size: 0xb61 (Inherited: 0x280)
class UABP_DoorCurtain_C : public UAnimInstance {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_E03F46A04660A73D485EF68A750CD419; // 0x288(0x60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93997D0F4E7C66B0BD93CB9B569D7430; // 0x2e8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7F2124B64E018DC0D6DFB29F35F9D996; // 0x350(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C3D4431549EDC87AAD6B42A228BB6265; // 0x3b8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8764280F48236796B4334FB21B52906E; // 0x420(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0A747E3A466C1214801C8380D68A333B; // 0x488(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45E06891490407B4C00FB89825E3EDA3; // 0x588(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_FCFFC45B4F2E4FB2DCD4CEBE74DEDACA; // 0x5e8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_1553A87A4E55C1B35F3779B2546CE598; // 0x6e8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5435BD904A6B2EC6551AAEA2E967B1CE; // 0x748(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2BF0A30143BB0D433FB5F6B91854E2BC; // 0x848(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63F55ED74DC2F59DFCD2C1BB63D11E53; // 0x8a8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_E0F945BC4F428DBA631521A396BD485F; // 0x9a8(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2C91BE1947DC830CC060DF9BD669C56C; // 0xa08(0x158)
	bool Open_; // 0xb60(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_DoorCurtain.ABP_DoorCurtain_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
