
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// SMBlueprintGeneratedClass AtomFSM_Vehicle.AtomFSM_Vehicle_C
// Size: 0x9078 (Inherited: 0x640)
class UAtomFSM_Vehicle_C : public UGPFSMInstanceBase {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x640(0x08)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_26_CA49FE8F4BD098096525D4BF03158611; // 0x648(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_25_700285934B69044345492585C6FABE81; // 0x798(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_24_AAB66AB847587660C2F327B76A5B3519; // 0x8e8(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_23_91445D58409B886976D4D8983E309F70; // 0xa38(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_22_1A6D33994EB26CCEA5CE1792435AD90D; // 0xb88(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_21_12B456E5467AA09444D0F9880037CDF5; // 0xcd8(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_20_A8EEC1FA479C17A8E374E6A3D644C808; // 0xe28(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_19_C4BCCCA34A73496DC6DFABB6F316F6E9; // 0xf78(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_18_CE232C814FD9C6D9F7D8C0A5F65A10CB; // 0x10c8(0x150)
	struct FSMState SMGraphK2Node_StateEntryNode_13_D68BCB1B48821C50E6B8AFACDA3F1BC9; // 0x1218(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_12_49FA7BAD47B07859D14685BFABDB630F; // 0x1390(0x178)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_17_C7284DB64C6636E5AC6E919CD144749C; // 0x1508(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_16_3F2C4FB545B038999EEFF0983425F9F5; // 0x1658(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_15_C9AE19454C709AB5689BFCB45A0401C1; // 0x17a8(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_14_2DDFB4754709B1ACB745D6BC3F74B8FD; // 0x18f8(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_13_8BF25C8A45BD09A8AD1AB0B6CCC410AE; // 0x1a48(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_12_1D9C5DDF4B2A309B95CF1CADF8B261C3; // 0x1b98(0x150)
	struct FSMState SMGraphK2Node_StateEntryNode_11_787BBCD049A09CB6AA8E4E935961C4AE; // 0x1ce8(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_10_F4D10FAC46EC6B3846EC31838A9C521B; // 0x1e60(0x178)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_11_D1F1FE254A89DBCFC14A7FB4DC1278CE; // 0x1fd8(0x150)
	struct FSMState SMGraphK2Node_StateEntryNode_9_6C242EDD4402AA7F193209B87BC4C6BC; // 0x2128(0x178)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_10_12FEDE6C4B26085D5763E99A242C7D3F; // 0x22a0(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_9_256F42C04A6FBC09B78209AB4451DC7F; // 0x23f0(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_8_12913AF8420CE2C3E1A52CB96AAEC4F8; // 0x2540(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_7_99BD42374C66AE89CBD619A32F39B71D; // 0x2690(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_6_855710134A3A4064EAF7B8ADDF3E5DA9; // 0x27e0(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_5_7A0F845A4158D5B2E1D2AC9F4AFED9E2; // 0x2930(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_4_C21113154A18FAB7274FA99589F78671; // 0x2a80(0x150)
	struct FSMState SMGraphK2Node_StateEntryNode_8_825EB4B84D063C9809DBC7B9425A55E0; // 0x2bd0(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_7_D5A631194E5DF9E4DE772C8C8E505363; // 0x2d48(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_6_72A83BD640C699C192282B85E465D452; // 0x2ec0(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_5_922754024F00A5459ECCEA97CB715D3E; // 0x3038(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_4_C7AFACA345F894A56F8368BFACB08711; // 0x31b0(0x178)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_3_1B8D02C24C4FBB224A3E8E8FBF0A2595; // 0x3328(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_2_70CE4D13446D631AC1DDE6AFE3233C8A; // 0x3478(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_1_A8C52E484A54FD12C4F8369689C0F84C; // 0x35c8(0x150)
	struct FSMTransition SMGraphK2Node_TransitionResultNode_1119D20F40B25B0892126F8A0C494F0F; // 0x3718(0x150)
	struct FSMState SMGraphK2Node_StateEntryNode_3_8CED0AA348559C4580D66889552A5637; // 0x3868(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_2_1209950E42EE87390E200495DFBB99A4; // 0x39e0(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_1_20636C3B459DE87459EEA288AA980244; // 0x3b58(0x178)
	struct FSMState SMGraphK2Node_StateEntryNode_6CBDDFBA44B80A880DE450BFD8E7AF12; // 0x3cd0(0x178)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_6_F8C978534A21D6667875CBA44E73ED91; // 0x3e48(0x2f0)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_5_66B371EE46F8B38C287882BC41F15C26; // 0x4138(0x2f0)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_4_D31B8889479B505B57C8D4807941371A; // 0x4428(0x2f0)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_3_BD602227477C124FAED9E0846210465A; // 0x4718(0x2f0)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_2_E8C93D634731E7C457DAD08C2B724EFC; // 0x4a08(0x2f0)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_1_B0D481CD4A225BFD767FB699E9FCB190; // 0x4cf8(0x2f0)
	struct FSMStateMachine SMGraphK2Node_StateMachineEntryNode_4D46A586405FCDE8D675A8B5031365C2; // 0x4fe8(0x2f0)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_57_8E3CA8B54D2047F67D9981B6FB28B3F9; // 0x52d8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_56_387A9D5443030CD096CCA8A674AEB2C5; // 0x53e8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_55_AB0996C2444094AFB47EBAB8E157A30E; // 0x54f8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_54_4AEE712A415AD746D8B9A09BDAB3D1AB; // 0x5608(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_53_8C67E904486FDDCA6D3BF99BB265BBB3; // 0x5718(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_52_98908C984D2BBA4DB630968D220C6CBC; // 0x5828(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_51_D560EBCD48CFEDF46066A7875BBD1541; // 0x5938(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_50_48548254489F16276C1C90AA95E5B28D; // 0x5a48(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_49_F4C867A84C067B5A7770AA9E8E2BB60D; // 0x5b58(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_48_362CD45C42910D54EAA33AA86B27C147; // 0x5c68(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_47_B5C3CDD54FF9BAD88590F7AF581B8567; // 0x5d78(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_46_5295C0904765D4A7B1556CAFD1359AC2; // 0x5e88(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_45_4571F8C141E7A4AB70FDB08B929D2A80; // 0x5f98(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_44_895633A24C4EB5DDFAE53983E8A5BFF9; // 0x60a8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_43_4A18D2FA4A7F558635B91B86BB1FBC66; // 0x61b8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_42_BAB0CA714BB11A379B01E19734CD5F84; // 0x62c8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_41_E1A138D548D9931A57DE35B7AFF58876; // 0x63d8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_40_C9B9C22040CD8121D77226BE9380B8B4; // 0x64e8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_39_82D7A1524A2F192CA0B4CDBE6E563E52; // 0x65f8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_38_FFCA077E4045F863330C378B7A870119; // 0x6708(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_37_25480C9C4321799BD49BEDAEEAABF889; // 0x6818(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_36_C6E6BF9D494533853E5EEB871D241812; // 0x6928(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_35_AC0844D040C39EBFDAA79F9B4B4F3556; // 0x6a38(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_34_8EB1F26443CABB358C3ADBABD7F857EF; // 0x6b48(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_33_E3B0408C459E4CB65743AFAD343D5360; // 0x6c58(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_32_1DC9FF9E4A1EE1B45368C1A4E56DB636; // 0x6d68(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_31_C0DF54D543D18E409BC180B504401A43; // 0x6e78(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_30_6A0C936C46731257D676B4902A966364; // 0x6f88(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_29_1527FC8E4868BFF90C4FEE8B9A61DD9E; // 0x7098(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_28_345061F542383AABA3BF17BA58143CB0; // 0x71a8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_27_917811C94889E688B110C1851948307E; // 0x72b8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_26_5AF0878C46ED1A6F6C3406AF9B612B4D; // 0x73c8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_25_1B5C8AE54312F7DF48FB339B2EF97AC1; // 0x74d8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_24_62EBD97342ED197DED27FABE579887FA; // 0x75e8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_23_B47A45034ED0F8066466038820842469; // 0x76f8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_22_1FDE37364325568F3D3901A954EC7CD4; // 0x7808(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_21_E73CBE5849DF6D806C8FBFB22E513445; // 0x7918(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_20_71B5F98F49E67C78BD41F698BBC145B2; // 0x7a28(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_19_6153C1EA4118878DF62C899171E2573F; // 0x7b38(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_18_1EEBF2234B343E8B1C53A3BE018E2A65; // 0x7c48(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_17_57C3999847B2552146E681BD7F7A7B78; // 0x7d58(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_16_15E485174E7455DF378DE983F804812C; // 0x7e68(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_15_40DEC7B04588C290B516C398F256CED3; // 0x7f78(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_14_380121264208A5AB1A37D781AF16119C; // 0x8088(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_13_E262A8CF4C02385A91576782B590ACF8; // 0x8198(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_12_18967AF9477B7DA05115598C644CED52; // 0x82a8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_11_0C66FF9642D7D4849B6C659FF53E818C; // 0x83b8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_10_EF9D0113488B2A1CBE6187B15A03A9EC; // 0x84c8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_9_958B2D134DCF061F2C24FF827775E5F0; // 0x85d8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_8_BC7349584D7F216178A5EFAE820DD788; // 0x86e8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_7_6B3539E24280D7444280CF9ADDB13E73; // 0x87f8(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_6_6345EAFC4B55DF9B0BA0FCBA9C23E3C7; // 0x8908(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_5_CA47C0B0418F43F4FAB245A9C1E476CC; // 0x8a18(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_4_49738EC64F0004354E9D2EB83053B771; // 0x8b28(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_3_3CC34F7D4E76A51ED60E14838DE708CC; // 0x8c38(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_2_22B29BD2452D5E724725F88EB539BACD; // 0x8d48(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_1_A9423092402B9E19957E889B69886CC2; // 0x8e58(0x110)
	struct FSMGraphProperty SMGraphK2Node_GraphPropertyNode_9254DBBF4192FEE320F3A2BD833158ED; // 0x8f68(0x110)

	void SMGraphK2Node_TransitionInitializedNode_0_AutoDriveCar_to_GetOn_5206C81E40701CE923AAA2AC0CB61BE9_E1E9305A4CDC49EB959BE0B04711381E(); // Function AtomFSM_Vehicle.AtomFSM_Vehicle_C.SMGraphK2Node_TransitionInitializedNode_0_AutoDriveCar to GetOn_5206C81E40701CE923AAA2AC0CB61BE9_E1E9305A4CDC49EB959BE0B04711381E // (BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
