
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// AnimBlueprintGeneratedClass BP_Anim_HallMainCharacter.BP_Anim_HallMainCharacter_C
// Size: 0x4c88 (Inherited: 0x520)
class UBP_Anim_HallMainCharacter_C : public UHallMainCharacterAnimInstance {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_6DD1356940876CFDEAA98DB49E3CC144; // 0x528(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_0AFFD0554FBA2A1740CEE89089D2E0D2; // 0x588(0x78)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B14FF53E4A42372DDA4B56BC4861D148; // 0x600(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_858576A9458C95CBE6C27EA4DF69E798; // 0x668(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42052D67472BE5D7DE91CE9DDBF3D02C; // 0x6d0(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A44B6E1F4F3A7B9AC9EA28B942ECEA3F; // 0x738(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_BAC428C64450F84186C36FAA8C4FDD9E; // 0x838(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6ABDDE584B5095D954A243B980FF9B86; // 0x898(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2597E65D445445B04E3A85BAE6AFA53E; // 0x998(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_09B40F4A4CBD32386ABD01B73BBE6E97; // 0x9f8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_B0705E084F76F0BA707A8AADA7A929F5; // 0xaf8(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4912F8A74BF1D8BC89E347A76A32F8C2; // 0xb58(0x158)
	struct FAnimNode_CCDLookAt ZZAnimGraphNode_CCDLookAt_1EBA6EC545183D4F03E98391C10D79C9; // 0xcb0(0x210)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24719ACD471CC393ACDDD690857B43AC; // 0xec0(0xf8)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_C27644BE4F7C568286A1EE8FA300BDF4; // 0xfb8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C31710AA4D3004BA12A5DFA90B4FE74D; // 0x1000(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92F36AC74CE3F591CE4660B297B9451C; // 0x1068(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A10E9BC743C7956120E68BB36FD654A5; // 0x10d0(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48BA9D624FFC5CC14E6EBE89C68BC2F2; // 0x11d0(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B65F306C47C12E36B212608804004ABF; // 0x1230(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_77B45AB34EE5EBE50137628693F2FA75; // 0x1330(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_992FE6A14E354DF0896E9E97BE98102F; // 0x1390(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6E89DA254848BE255BED6798ED7470F5; // 0x14e8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C09B101D4F608FDDED9E66964C8F8F3F; // 0x1550(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A083B8DA4B358AE86F2B7D8B4D4FB4B4; // 0x15b8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56BC82DD41C6A5022A6429A5A93FAF6E; // 0x1620(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1DC53D4243151165EF2AB09FEC90E1DB; // 0x1688(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C327D92841EEF97CD66A498592B5032E; // 0x16f0(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C2F7828C457EEAF3BEE731BB793E9C76; // 0x1758(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45D143B641B8870C186F239A40BF7495; // 0x17c0(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_836E29EF4D4961B6DF65139BEB250F5C; // 0x1828(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CB72D21F44C24F0878DA499502B1B0A1; // 0x1890(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EA1382BC419B8ECA9DFADD948EE10B13; // 0x18f8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7A9F57184FDFA7C3E3303B8CE7457A97; // 0x1960(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E46D907D458AB801B69F8DA4BCB61586; // 0x19c8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D1FDBBF1412BFD9CCC17F199E239CD9F; // 0x1a30(0x68)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_C35E69A6437B5676730951B95F05F6E5; // 0x1a98(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1D1B3E344BFA443EFD27FCB2459EE928; // 0x1ba0(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25D9E6574E491DB8FAF1C7B1D7F3CB92; // 0x1ca0(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7DF618B74BC887B79D0D098362C9ED8F; // 0x1da0(0x60)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_183548F740560915C4A064923BAEF1ED; // 0x1e00(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4C2049AF4C54DA91EC5C7384C286DDF0; // 0x1f08(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4AFFF88748FB75DE86175C895F2FF82C; // 0x2008(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_B67E0E2B4B18005EE50667B66BCA9DEB; // 0x2108(0x60)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_725E747D4F417C5794D50680D426E7EF; // 0x2168(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B252866244E4FF1057C46BA469FE049B; // 0x2270(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B5ADECEB4602063744E03E8C98F89FF7; // 0x2370(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_EECE27FF4D74B615469659AAF4E9080E; // 0x2470(0x60)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5561920845890CF2FB2D79A8CBD7275A; // 0x24d0(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9EEF01A646DBA22EDBC3289D4DA5813F; // 0x25d8(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0B0B5D8B4091F007246DD6A14EA09087; // 0x26d8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_373C3B9D4DD930C8A35CA59F66B601B5; // 0x27d8(0x60)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_B7F1DC6F46AFF907D75F8FACC1B272C0; // 0x2838(0x88)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_BF5286BD4438CCC11709AB99F022A76F; // 0x28c0(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_A5E4AF8B43ACEC6CE3AE9CAE493F932F; // 0x29c0(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32CE1294454B11263151ACBDAFA47DE5; // 0x2a20(0x100)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_EEB248F441F24C96ED8181ADFDF3A123; // 0x2b20(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C765B233413D062C891288B959FE910B; // 0x2c28(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_D8291E724E72B57E838D9E8A459E7CE8; // 0x2d28(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_551D886A424B383A82967B96CC9D47FD; // 0x2d88(0x158)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_239D42574B0CCF4D209B85B16CBF9CD9; // 0x2ee0(0x1c0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3C622EE048E67EE824295D9EBA8CD672; // 0x30a0(0x150)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_59467AED43B9AD550FC3C8BAE134FED0; // 0x31f0(0x1c0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_225D23714DF1F6F49EE0F5BFFA736380; // 0x33b0(0x150)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1390D7FB45F4D4F52E24AA87E6DA0BD0; // 0x3500(0x50)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_06F85F934C41F849322264928D1807A6; // 0x3550(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_05D01504408BA43C09FBFCAA23E12A99; // 0x35a0(0x150)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_B98D97A941C0F19EABCD6CB29E6CECE5; // 0x36f0(0xd8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_819946FD47B6F4CC9464A3B695862BFD; // 0x37c8(0xf8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_532E0BB942CF4F3677395695DF49C34F; // 0x38c0(0xd8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14A8248546FB82FBE98627B20EDE8DE6; // 0x3998(0xd8)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_9DAC3937407C162859A15B8A9471F8E9; // 0x3a70(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6FEA343D49B5D5394FD4B789527A26A3; // 0x3ab8(0xf0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_B09DFBBC4237BFF19E4C6298664155B7; // 0x3ba8(0x100)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_DE628AE245BFAFBD9D1CA881815F30C5; // 0x3ca8(0xd8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_F8FEA2BC4793D6F7E08E6CB689B6FF5D; // 0x3d80(0xd8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_9B17E76C435C02C54C2E84A5BD414E86; // 0x3e58(0x68)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9D6054224749E4ADCB2B95B6C9C08363; // 0x3ec0(0x58)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_FDE5C02B4D8DB71D510CDBB5EA25230C; // 0x3f18(0x110)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63248952497FBD27D90653B5BEBF1A81; // 0x4028(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_D7B864ED4C47FA8463A28CBC1D381AD4; // 0x4080(0x88)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_AAB4A86845D4B30B60CE36AB6D6A79E6; // 0x4108(0x120)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_F297909542A2649BAF655393950981AC; // 0x4228(0x120)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_A1B0506548E6B44DB6AEBCA5C5937770; // 0x4348(0x120)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_DB2E8DA54D84E160024520B9F11F64C9; // 0x4468(0x120)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97539B2341FD2FDB4A772FA387FC32A0; // 0x4588(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_B9C196BD43E7E0D38E4F62B025FFBCAE; // 0x4688(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_F65FE9624494CE4A4059AB9C4C56FC8B; // 0x46e8(0x158)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2033704D4DFFA90C7BF7B59EFAF4C3F7; // 0x4840(0xd8)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_1F4862944762704C5707E69181CD03D1; // 0x4918(0x120)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_AADD48B44E06F64AFAB441B06A5FB439; // 0x4a38(0x120)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_D541CE8B4FF49FC83665C3ADDC72B468; // 0x4b58(0x120)
	struct UAnimSequenceBase* FaceAnim; // 0x4c78(0x08)
	struct UAnimSequenceBase* BodyAnim; // 0x4c80(0x08)

	void SyncFaceAnim(struct UAnimSequenceBase* BodyAnim, struct UAnimSequenceBase* FaceAnim, bool IsResetPlay, bool SetOrGet, struct UAnimSequenceBase*& GetBodyAnim, struct UAnimSequenceBase*& GetFaceAnim, bool& GetIsResetPlay); // Function BP_Anim_HallMainCharacter.BP_Anim_HallMainCharacter_C.SyncFaceAnim // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
