
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// BlueprintGeneratedClass BP_HallLight_MatchNew.BP_HallLight_MatchNew_C
// Size: 0x3f8 (Inherited: 0x398)
class ABP_HallLight_MatchNew_C : public ADFMLightGroup {
public:

	struct URectLightComponent* RectLight; // 0x398(0x08)
	struct USpotLightComponent* SpotLight_7; // 0x3a0(0x08)
	struct USpotLightComponent* SpotLight_3; // 0x3a8(0x08)
	struct USpotLightComponent* SpotLight_2; // 0x3b0(0x08)
	struct USpotLightComponent* SpotLight_6; // 0x3b8(0x08)
	struct USpotLightComponent* SpotLight_5; // 0x3c0(0x08)
	struct UPointLightComponent* PointLight_2; // 0x3c8(0x08)
	struct USpotLightComponent* SpotLight_4; // 0x3d0(0x08)
	struct USkyLightComponent* SkyLight; // 0x3d8(0x08)
	struct UPointLightComponent* PointLight_3; // 0x3e0(0x08)
	struct UDirectionalLightComponent* direct; // 0x3e8(0x08)
	struct USceneComponent* SharedRoot; // 0x3f0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
