
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// BlueprintGeneratedClass BP_Miniworld_Operator_Common_01.BP_Miniworld_Operator_Common_01_C
// Size: 0x448 (Inherited: 0x378)
class ABP_Miniworld_Operator_Common_01_C : public AActor {
public:

	struct UInstancedStaticMeshComponent* InstancedStaticMesh2; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent21; // 0x380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent19; // 0x390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x3a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x3a8(0x08)
	struct UInstancedStaticMeshComponent* InstancedStaticMesh1; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x430(0x08)
	struct UInstancedStaticMeshComponent* InstancedStaticMesh; // 0x438(0x08)
	struct USceneComponent* SharedRoot; // 0x440(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
