
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// AnimBlueprintGeneratedClass BP_SafeHouseNPCAnim_Interact_3pTest.BP_SafeHouseNPCAnim_Interact_3pTest_C
// Size: 0x21a8 (Inherited: 0xa50)
class UBP_SafeHouseNPCAnim_Interact_3pTest_C : public UDFMSafeHouseNPCAnimInstance {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa50(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_8D6B2C474FE49825E283D79B67189D19; // 0xa58(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_A5F6F26045BB15DE716BC682CB230472; // 0xab8(0xf8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_44EBE99E4436FB2B3A71A788B148244E; // 0xbb0(0x3a0)
	struct FAnimNode_Slot AnimGraphNode_Slot_CD25B535402C88D99313A089E6ED8559; // 0xf50(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_ED4EED974E81BEEBA22220B1FD1A6349; // 0xfc8(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_C5F9640A4DB9B16DCCDE2DA0BA5FB346; // 0x10b8(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_89A8E2B7445BAE876E0142BFA6F720F3; // 0x1110(0xf0)
	struct FAnimNode_Slot AnimGraphNode_Slot_CCA2A890413E0DC219488587964BEE36; // 0x1200(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_0B1C29B04FE6EAED11B56C8764A80901; // 0x1278(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_AC5FC9CD4632DE36227CC2AA212F46FE; // 0x12d0(0x78)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9D9AE9C74F6DA70F5A4582BB16EBD51F; // 0x1348(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2FD8DD2941F065E71B929BA822B6AD0A; // 0x13b0(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3B8890EA40B1DE216A4100B975F59E09; // 0x1418(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0408B1CE49C8FC9AA12524918285EECC; // 0x1480(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E77728F34D578E69F26158A6B68314ED; // 0x14e8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1FAE35AE48E77B1B761E668D249913C5; // 0x1550(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8118E62A4B2E82886244F48D199CEA40; // 0x15b8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1154F7C54321C6D2AE301C8ECD0C784F; // 0x1620(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E97D2EA94D2D93BBE022218BE358AF85; // 0x1688(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C1CA0DAA4419590B25595A85F4EE0CD3; // 0x16f0(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40F97EBD43152D402634838C9AE7A416; // 0x1758(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_73E860C341EC1715BDCEC386FE780202; // 0x1858(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75E225044FE48E5F72E8869E548203D9; // 0x18b8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2F0FAE03443C9F3C26E7418F88AC50BB; // 0x19b8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33948A0E489AD5C2E93F428207DE5594; // 0x1a18(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7ACEB8124F907A80118D41BFC76F1F85; // 0x1b18(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E73D66B840F714744C32A7B59D2ED5E2; // 0x1b78(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_A1AEE23F4D5C75E60D965188C28706C5; // 0x1c78(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24712AEF44BF75AFCDBF2A8D21D752B3; // 0x1cd8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_AEBB96654CD27C9CBB1F28B0893A47EB; // 0x1dd8(0x60)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5BE04E904729237F9CF17BA5C016B5B3; // 0x1e38(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3474DCC84C7F894EA3595FA355586000; // 0x1e98(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_265D1A994968580F27AB749FD97E774B; // 0x1f98(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_663D543D49BEA62B90154E82A33871BE; // 0x1ff8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1A9AD66640851DC90186DE905C956FBB; // 0x2150(0x58)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function BP_SafeHouseNPCAnim_Interact_3pTest.BP_SafeHouseNPCAnim_Interact_3pTest_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
