
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// AnimBlueprintGeneratedClass BP_TestAnimBP_3P.BP_TestAnimBP_3P_C
// Size: 0x8d74 (Inherited: 0x18c0)
class UBP_TestAnimBP_3P_C : public UGPAnimInstance {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x18c0(0x08)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9BC7AD3848DD2DB1513167957C32FE62; // 0x18c8(0xf8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_96E3B3514E982ED75F900AA6E1052303; // 0x19c0(0xd8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_462A583C411A1CC0225336B8679BA51F; // 0x1a98(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_03B2835E4F264AF27F4E58BFC922D458; // 0x1af0(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_6CBA2899417A61F33247828CE41919DB; // 0x1b48(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot_C8F0ACAD4F2957C3EEF8DC8AA7DBF593; // 0x1bc0(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot_7853641C41F6937A5DFFC6B4B0C9C03F; // 0x1c38(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_49DF74654734E30C3C21B08DC940D00A; // 0x1cb0(0x100)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7FFDC38946CA00232EE8DEB2DD743EFD; // 0x1db0(0x100)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_F1A36A3D4D465DBB9B0E05891696BCE8; // 0x1eb0(0xf8)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_C971EAB6466ADDFC95504BA1296F2B7F; // 0x1fa8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8C16BAA345208D075FAFBD966A5513C9; // 0x2070(0x58)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_0E6E7BAC4246AE1D4EA89E927577925E; // 0x20c8(0xf8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_999E2C0F495E542E02847EB4F23F8052; // 0x21c0(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1D334E4448D8EAD0A55FEE86C655233F; // 0x22b0(0x58)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E2280F4D4A7C24351377EE81D7A2E401; // 0x2308(0x100)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_169199534D9F24AB68F77AA8C7FD256F; // 0x2408(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6C1BF3F14F3EB325B9D01DBF0BD4AE92; // 0x2460(0xf0)
	struct FAnimNode_Slot AnimGraphNode_Slot_039B72E94962B1793962ECBFA0209E8E; // 0x2550(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_D29175FC4F28AA894225C997DFDE40F0; // 0x25c8(0xf8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4CA2DF514D066029AA3AF4A16C0FE8F7; // 0x26c0(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_DAA30F6F45B6679F5B7B3BA183A0DA1A; // 0x2738(0x100)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_EEE530684446DF629B9F25AC965925F1; // 0x2838(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87A19343470712AF58EB4F9EE1E8A48E; // 0x2930(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25CEDB8C42BACD1FCCFE6DB144CA41F2; // 0x2988(0xf0)
	float __CustomProperty_Left_Foot_IK_Modify_Alpha_44B37135469D1F6E545896BF144CDFB2; // 0x2a78(0x04)
	struct FVector __CustomProperty_Left_Foot_IK_Location_44B37135469D1F6E545896BF144CDFB2; // 0x2a7c(0x0c)
	struct FRotator __CustomProperty_Left_Foot_IK_Rotation_44B37135469D1F6E545896BF144CDFB2; // 0x2a88(0x0c)
	float __CustomProperty_Right_Foot_IK_Modify_Alpha_44B37135469D1F6E545896BF144CDFB2; // 0x2a94(0x04)
	struct FRotator __CustomProperty_Right_Foot_IK_Rotation_44B37135469D1F6E545896BF144CDFB2; // 0x2a98(0x0c)
	struct FVector __CustomProperty_Right_Foot_IK_Location_44B37135469D1F6E545896BF144CDFB2; // 0x2aa4(0x0c)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_44B37135469D1F6E545896BF144CDFB2; // 0x2ab0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_0E66D552482DBF7BB69597AFF17F9E36; // 0x2b78(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8ECCE76C4BECA32B04D1029AF6D95A35; // 0x2c68(0x58)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6091E6F147104DE3F4679F8476204352; // 0x2cc0(0x50)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0ACA590E418D854A3539318BECDAD2D6; // 0x2d10(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_98EE10CE4F32B5B233BCA3B4936F768A; // 0x2d60(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71C403C54CB262A12C355D862E342782; // 0x2e58(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_B24457F34E57F7CF90C62D9F3BBE3803; // 0x2eb0(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91C759E44017C9B7B1CD58A806E42619; // 0x2fa0(0x58)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A663F7D74E5C8D30E79CC3920129D2A0; // 0x2ff8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6048853843304E160836D9875959A5B4; // 0x3060(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5F4AEAD34E305851DDDE01A19B1C97CB; // 0x30c8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27F8010043BE390C7F2EDEB30A9FA312; // 0x31c8(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_ECA54E094705C25932D8E8B2911DA7C1; // 0x3228(0x78)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_CDEF1FCC4072B3998EBB4099FE0C83AB; // 0x32a0(0x2f8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_383C31B64A801AD60A9F78B6544402C2; // 0x3598(0x60)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_F15EBE084EA445945599A5AED597B3FC; // 0x35f8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_0023DA104E391FD322214DA9F9BA937E; // 0x3640(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_BDCB123C4343E21636F6B99B1E46A8C1; // 0x36a0(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_A9DB383F4663C864D586528AE2FAC401; // 0x37f8(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8F65144249511C9E96559192EA553B4C; // 0x3900(0xf8)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1FCD138F430385349EEE2D9FD01C2B85; // 0x39f8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4851D4F946E415205AF3FA8AC631101E; // 0x3ab8(0xf0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_145B1CC0456F16C52638949FA74936C9; // 0x3ba8(0xf0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4C8237794F5E1B027574C1BA1C330DC3; // 0x3c98(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_162A93F148F3916C269030BC57D6135A; // 0x3d00(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BD1720E94ED2E7B5B7845D925784AAD2; // 0x3d68(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127AF8774257907ADA18DDB281ECCC92; // 0x3dd0(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B4BFFD154B495E35C5A828AE6E2FE013; // 0x3e38(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5BAA03744DA5569F2EE2B3B94C725F2B; // 0x3ea0(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_077123704EC6D5ED957B90A9B0A095B2; // 0x3fa0(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49514FF2435EDF83FAEC49A5905CD9FE; // 0x4000(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0895CC534207572C0D17FF9AF75E13B6; // 0x4100(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A5A6DF1F41E5951C68EF6DA39DE1064C; // 0x4200(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83968CC34D44856ABC9E7BAF8E612F6F; // 0x4300(0x100)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_FF45805B41DB324501DC179369777383; // 0x4400(0xf8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_246C5C094AD3C4D602E79493C2B41DB8; // 0x44f8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_EC144292431330BFE6791BA3372D655D; // 0x45f8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A0F6000C4EB0D72CEA8EF9B5403C7FB8; // 0x4658(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B8AEFFC0434E2826FFC535BDDEE264FF; // 0x4758(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_922ED7D841F0FCEEA24F5C84CF61E99A; // 0x4858(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_093CA0D74ACC351E6DE08180F7B381DD; // 0x4958(0x100)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_D09FCE78487B58AEAEE71BB7CEAA1C3B; // 0x4a58(0xf8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9C1CDA8B482FDF250FE45DB595B9C85D; // 0x4b50(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3D88B75540236DB5EAD04E98566E8204; // 0x4c50(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_183B3C0849C750B2EE610D81E15DC901; // 0x4cb0(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_B3F9BAAE4178EEECE66B338C7BB456DA; // 0x4db0(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E403414443B64ECE3D3B628E7146C5C3; // 0x4e10(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_379263BD46CF4E0A9F01F98915EFA276; // 0x4f10(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8DB137264416DAFA6DD6BB95CC75A413; // 0x5010(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D2FE54C847B108FA1294F3A723462094; // 0x5110(0x100)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1FB255B64E49BE648649EE8AD3BBB6FE; // 0x5210(0xf8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B2268BAF4508BA0A629FF5B41937027F; // 0x5308(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6084BC7C490D7BC562DE2694A1354089; // 0x5408(0x60)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_2C0639C24ED1FBE7AF8D16B5BFD9FCD9; // 0x5468(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_08727F9D462FF7356EDFC395E09A0F6D; // 0x54b0(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_C8523AB14996D3DC3323A3B7F894E8B3; // 0x5510(0x158)
	char pad_5668[0x8]; // 0x5668(0x08)
	struct FAnimNode_LookAt AnimGraphNode_LookAt_ABC8DDC64D55E74ABCDCF69961B062EC; // 0x5670(0x1e0)
	struct FAnimNode_Slot AnimGraphNode_Slot_931FD73D471C65BF12F9338216E6FAD0; // 0x5850(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30AF0E444CEF6E24C5DB5DAD60890EB0; // 0x58c8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_B68113FE47556D087C76BFA68762FD30; // 0x5920(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_C31522F342917FB460A1039F2AE99C7F; // 0x5978(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_A455154744914E5B56B2619D36BD7A89; // 0x59d0(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4CDBCB794DD8E0D4E16D5190CB443B06; // 0x5a48(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2E74725849509AC89B942E8009512EB3; // 0x5aa0(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_A6C453D1447F78041FB4818A02B5BFB6; // 0x5af8(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_64BE8A1340043CC6E628D9911420AEFE; // 0x5b70(0x100)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2A4CEB7F41064C8331EC90BDBA862EE2; // 0x5c70(0xf8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_F429ADEB4F142413501725B71D1292C0; // 0x5d68(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75D6FCA148C50F3176BF5083B7796E21; // 0x5e58(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_EDC17E104B9551B95922B09943392729; // 0x5eb0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_C6659F734D8E901080D3DF97622637EF; // 0x5f28(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32ED818B47BEE1984AD13197BFB0746A; // 0x6020(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_29A85A1B4736322A0A19FEB11B467CEA; // 0x6078(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_CC3F9676498E565739769F867197DF2A; // 0x60f0(0x58)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_CF78DA7D468A2FF4C21150B2B7334178; // 0x6148(0x100)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_A7DAAFC5424BA4DA5C3F48980118ACE3; // 0x6248(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_00B120CF401CDD4DB75316A0DCC1416E; // 0x62a0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_CB1E81A84F849B1C00DD3281C922199A; // 0x62f8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_09E41AF842A522C10F31F88640F4EAB9; // 0x6350(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4F6002044872A06B4F8745B51F43FEEC; // 0x63a8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_845B6C094BF22274561FE8B3966C87D4; // 0x6400(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_A95FA690477AD3AEB4FB50ADA1065FA9; // 0x6458(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_B46178814ACD5AECAB708AA23A3CB937; // 0x64b0(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9E14E487431B098A5B6368BA8A6E7752; // 0x6508(0xf0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_D56D69644409279C315A4AB8B85799F4; // 0x65f8(0xf8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_EF0432D34709FAAFC796CE921EEF249C; // 0x66f0(0xf0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7846B52A41AC5367A3D61F927EF7C68B; // 0x67e0(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_CC1D7C5E4DDA342B8B888B85E42D6C25; // 0x68d0(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_FE7163DE456B6878705362B3A732F933; // 0x6928(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_BFD63E654826F978A41A1DB49E1333B3; // 0x69a0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_07D030AE4758FEBF8B4A218A79FC8E22; // 0x69f8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_699E9E3147971C3207E45294CFA7F685; // 0x6a50(0x58)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C4F0628A4F972B3D43C8079B5F674245; // 0x6aa8(0x2f8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_51FE47F84CBE7DA78E819B86E51BED07; // 0x6da0(0x110)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_FE1420444D8FA9570A8C8A8ADCD73217; // 0x6eb0(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7146FB7D445E4647F99F8EA5E5E75CC0; // 0x6fa8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98C118D44D8593762DD76285FECAC276; // 0x7000(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_57998E3B47EFDFD3DD96A8B1959A661F; // 0x7058(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_BD89A1BE40DBFB2D78E177A77E228E38; // 0x7148(0x58)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_CF8976944518C58C6291E892EB0EE770; // 0x71a0(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_839A886C4A0C1B628FA1E78D27A864BC; // 0x72a0(0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_764C8F814AB1E3F5042BD3A7EA93BBCF; // 0x73a0(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_F54C6F8642DE6700693E23B90CCE4F67; // 0x7490(0x58)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_CF723F294D7A2D7D9C94E09E97EA2E98; // 0x74e8(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2C93FA8141DAAB1348800195E61856B0; // 0x75e0(0x58)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_633118B5437A81F2CA621E980BA07B68; // 0x7638(0x120)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_1F607DBE4D9F278404A634B48F531656; // 0x7758(0x120)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_80603BF949E0C06BA40465B1AB99BB8C; // 0x7878(0x50)
	char pad_78C8[0x8]; // 0x78c8(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_CB4D5A48420284215E2401A201645D10; // 0x78d0(0x1c0)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_E8A6DF5F49EB599B39A5B39102BA34B1; // 0x7a90(0x1c0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4E358EFE440895AC75C67D8440DD7B2D; // 0x7c50(0xf0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3B34546546B9703BE9D38B8078FEA380; // 0x7d40(0xf8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_685B0C944DB2FE772548CF95EA7CAABF; // 0x7e38(0xf0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7F028EC34E46A7652CD96780C30A904C; // 0x7f28(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_558D158B4FC3CDCA0A555BAB83DE1321; // 0x8020(0x58)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_215843384E752EE2E0BE038C702744EA; // 0x8078(0x3a0)
	struct FAnimNode_Root AnimGraphNode_Root_956218CF4F9051E274F29D953FF06F0E; // 0x8418(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_1271B0A94A956E1B8F4B10B62E5F3509; // 0x8478(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_B51E98E343C9C5C2A1A4B0BA0EF0FE53; // 0x84f0(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2292E93E47B7FAA69F851197E41CFD1A; // 0x85e8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30CA2EEA47E6CEC60489E69D335B13BD; // 0x8640(0x58)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_A5C1BEF04BD109043273C8B242713ED6; // 0x8698(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_FCB63C3E47CC122AB1CE42BD4765DFC1; // 0x8790(0x58)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_DB393A87448BDC017CAD338CFE3DDF41; // 0x87e8(0x150)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_139C4D5344010D8F6A7CD9BE929FD8DE; // 0x8938(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6E65A0F74C5C033360DD07AD1C490C50; // 0x8a88(0xf8)
	struct FAnimNode_Slot AnimGraphNode_Slot_44F0E4F24E57A683894599AF6D0EC494; // 0x8b80(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_D162EF12408F0BA96DE7CCA4607FA0CC; // 0x8bf8(0x58)
	bool Use_Orientation_Warping; // 0x8c50(0x01)
	char pad_8C51[0x3]; // 0x8c51(0x03)
	float Locomotion_Angle; // 0x8c54(0x04)
	enum class ECharacterLocalDirection Strafe_Direction; // 0x8c58(0x01)
	char pad_8C59[0x3]; // 0x8c59(0x03)
	float Orientation_Warping_North_Angle; // 0x8c5c(0x04)
	float Orientation_Warping_West_Angle; // 0x8c60(0x04)
	float Orientation_Warping_South_Angle; // 0x8c64(0x04)
	float Orientation_Warping_East_Angle; // 0x8c68(0x04)
	float Orientation_Warping_Blend_Time; // 0x8c6c(0x04)
	struct FCustomizedOrientationWarpingAngleSetting Customized_Orientation_Warping_Setting; // 0x8c70(0x20)
	int32_t Cusomized_Orientation_Warping_Direction; // 0x8c90(0x04)
	char pad_8C94[0x4]; // 0x8c94(0x04)
	struct TArray<float> Customized_Orientation_Warping_Angles; // 0x8c98(0x10)
	float Orientation_Warping_Buffer_Value; // 0x8ca8(0x04)
	char pad_8CAC[0x4]; // 0x8cac(0x04)
	struct FCustomizedOrientationWarpingAngleSetting Customized_Orientation_Warping_Setting_8_Directions; // 0x8cb0(0x20)
	struct TArray<float> Customized_Orientation_Warping_Angles_8_Directions; // 0x8cd0(0x10)
	int32_t Cusomized_Orientation_Warping_Direction_8_Directions; // 0x8ce0(0x04)
	float Left_Foot_IK_Modify_Alpha; // 0x8ce4(0x04)
	struct FVector Left_Foot_IK_Location; // 0x8ce8(0x0c)
	struct FRotator Left_Foot_IK_Rotation; // 0x8cf4(0x0c)
	float Right_Foot_IK_Modify_Alpha; // 0x8d00(0x04)
	struct FVector Right_Foot_IK_Location; // 0x8d04(0x0c)
	struct FRotator Right_Foot_IK_Rotation; // 0x8d10(0x0c)
	int32_t Delay_IK; // 0x8d1c(0x04)
	struct FVector Gun_Focus_Location; // 0x8d20(0x0c)
	float Gun_Focus_Length; // 0x8d2c(0x04)
	float Look_At_Alpha; // 0x8d30(0x04)
	char pad_8D34[0x4]; // 0x8d34(0x04)
	struct UCurveFloat* Aim_At_Weight_Curve; // 0x8d38(0x08)
	bool Is_Locally_Controlled; // 0x8d40(0x01)
	char pad_8D41[0x7]; // 0x8d41(0x07)
	struct UObject* Debug_Widget; // 0x8d48(0x08)
	bool Debug_Draw; // 0x8d50(0x01)
	bool Debug_Draw_IK; // 0x8d51(0x01)
	char pad_8D52[0x6]; // 0x8d52(0x06)
	struct UObject* Foot_IK_Widget; // 0x8d58(0x08)
	bool NeedStartLock; // 0x8d60(0x01)
	char pad_8D61[0x3]; // 0x8d61(0x03)
	float IKLock; // 0x8d64(0x04)
	bool MovingCache; // 0x8d68(0x01)
	char pad_8D69[0x3]; // 0x8d69(0x03)
	int32_t Current_Valid_Direction; // 0x8d6c(0x04)
	int32_t CacheStartDirection; // 0x8d70(0x04)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function BP_TestAnimBP_3P.BP_TestAnimBP_3P_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
