
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass DFCommonButtonV2S2.DFCommonButtonV2S2_C
// Size: 0x2848 (Inherited: 0x27d8)
class UDFCommonButtonV2S2_C : public UDFCommonButton {
public:

	struct UWidgetAnimation* DeNormalAni; // 0x27d8(0x08)
	struct UWidgetAnimation* NormalAni; // 0x27e0(0x08)
	struct UWidgetAnimation* RecoverDeHoverAni; // 0x27e8(0x08)
	struct UWidgetAnimation* RecoverHoverAni; // 0x27f0(0x08)
	struct UWidgetAnimation* FadeOutAni; // 0x27f8(0x08)
	struct UWidgetAnimation* FadeInAni; // 0x2800(0x08)
	struct UWidgetAnimation* DeHoverAni; // 0x2808(0x08)
	struct UWidgetAnimation* HoverAni; // 0x2810(0x08)
	struct UWidgetAnimation* DeDownAni; // 0x2818(0x08)
	struct UWidgetAnimation* DeUpAni; // 0x2820(0x08)
	struct UWidgetAnimation* DownAni; // 0x2828(0x08)
	struct UWidgetAnimation* UpAni; // 0x2830(0x08)
	struct UDFNamedSlot* DFNamedSlot_Content; // 0x2838(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_271; // 0x2840(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
