
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass DFCommonCheckButton.DFCommonCheckButton_C
// Size: 0x2868 (Inherited: 0x2818)
class UDFCommonCheckButton_C : public UDFCommonCheckButton {
public:

	struct UWidgetAnimation* RecoverCheckedHoveredAni; // 0x2818(0x08)
	struct UWidgetAnimation* RecoverUncheckedHoveredAni; // 0x2820(0x08)
	struct UWidgetAnimation* FadeOutAni; // 0x2828(0x08)
	struct UWidgetAnimation* FadeInAni; // 0x2830(0x08)
	struct UWidgetAnimation* UncheckedHoveredAni; // 0x2838(0x08)
	struct UWidgetAnimation* CheckedHoveredAni; // 0x2840(0x08)
	struct UWidgetAnimation* UncheckedDownAni; // 0x2848(0x08)
	struct UWidgetAnimation* UncheckedUpAni; // 0x2850(0x08)
	struct UWidgetAnimation* CheckedDownAni; // 0x2858(0x08)
	struct UWidgetAnimation* CheckedUpAni; // 0x2860(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
