/**
 * Name: DeltaForceClient-Win64-Shipping
 * Version : default
 */ 
#pragma once


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif


namespace Dumper
{
	struct Function_DFMGameplay_DFMAbilityThrowBlockingBaseActor_SetIsBurning_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityThrowBlockingBaseActor_DoCustomDestroy_Param
	{
	public:

		struct TArray<struct FOverlapResult> Overlaps; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ItemPreviewActor_LocationValidChange_Param
	{
	public:

		bool Valid; // 0x00(0x01)
	};

	struct Function_DFMGameplay_AddAmbientLightFatorVolumeActor_OnEndOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AddAmbientLightFatorVolumeActor_OnBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AdjutantNoticeActor_ShowAdjutantMapInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_AdjutantNoticeActor_SetNeedShowAdjutantInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_AdjutantNoticeActor_ServerShowSubtitleSequence_Param
	{
	public:

		struct AGPCharacter* CHARACTER; // 0x00(0x08)
		struct FName SubtitleId; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AdjutantNoticeActor_ServerShowAdjutantKilledTips_Param
	{
	public:

		struct AGPCharacter* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AdjutantNoticeActor_OnRep_AdjutantInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_AdjutantNoticeActor_OnPlayerKilledServerNotify_Param
	{
	public:

		struct FKillInfo NewAddKillInfo; // 0x00(0x148)
		struct UGPModularWeaponDesc* Desc; // 0x148(0x08)
	};

	struct Function_DFMGameplay_AdjutantNoticeActor_OnLoadedAllControllerClass_Param
	{
	public:

	};

	struct Function_DFMGameplay_AdjutantNoticeActor_GetHUD_Param
	{
	public:

		struct ABaseHUD* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AdjutantNoticeActor_CheckStartMatchInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_AdjutantNoticeActor_CheckIfHasAdjutantActivity_Param
	{
	public:

	};

	struct Function_DFMGameplay_AdjutantNoticeActor_CheckAdjutantActivityValid_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AdjutantNoticeSpawner_SpawnAdjutantNoticeActor_Param
	{
	public:

		struct AAdjutantNoticeActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AerialVehicle_OnDead_Param
	{
	public:

	};

	struct Function_DFMGameplay_AerialVehicle_BPOnDead_Param
	{
	public:

	};

	struct Function_DFMGameplay_AerialVehicleHealthComponent_SetHP_Param
	{
	public:

		float HP; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AerialVehicleHealthComponent_OnRep_OnHealthChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_AerialVehicleHealthComponent_IsDead_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_AerialVehicleHealthComponent_GetHP_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AICharacterAnimSnapshotManager_GetBoneTransform_Param
	{
	public:

		struct FName ConfigName; // 0x00(0x08)
		enum class EGPCharacterPoseStateType Pose; // 0x08(0x01)
		enum class EGPCharacterFightStateType FightState; // 0x09(0x01)
		char pad_A[0x2]; // 0x0a(0x02)
		struct FName BoneName; // 0x0c(0x08)
		char pad_14[0xc]; // 0x14(0x0c)
		struct FTransform OutTransform; // 0x20(0x30)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_DFMGameplay_AICharacterAnimSnapshotManager_GetAICharacterSnapShotPoseType_Param
	{
	public:

		struct ADFMAICharacter* InAICharacter; // 0x00(0x08)
		enum class EGPCharacterPoseStateType ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AICoordinator_Instance_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct AAICoordinator* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AICoordinator_GetGroupAISystem_Param
	{
	public:

		struct UGroupAISystem* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AICoordinator_GetAIStyleSystem_Param
	{
	public:

		struct UAIStyleSystem* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AICoordinator_CanBeAttackBySkill_Param
	{
	public:

		struct ADFMCharacter* Player; // 0x00(0x08)
		enum class ESkillType SkillType; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_AIFlameDetectorActor_StopEffectInternal_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIFlameDetectorActor_StopEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIFlameDetectorActor_PlayEffectInternal_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIFlameDetectorActor_PlayEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIGroupDramaVoiceComponent_PlayGroupDramaVoice_Param
	{
	public:

		struct FName RowName; // 0x00(0x08)
		struct FName Type; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_AIGroupDramaVoiceComponent_OnCharacterDied_Param
	{
	public:

		struct AGPCharacterBase* InCharacter; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_AIGroupDramaVoiceComponent_OnCharacterDestroyed_Param
	{
	public:

		struct AActor* SpawnedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroupSpawnerBase_StartSpawn_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIGroupSpawnerBase_GetSpawnedGroupList_Param
	{
	public:

		struct TArray<struct AAIGroup*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIGroupSpawnerBase_GetSpawnedActorList_Param
	{
	public:

		struct TArray<struct APawn*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIGroupSpawnerBase_FireSpawnEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIGroupSpawnerInterface_StartSpawn_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_AIGroupSpawnerInterface_OnSpawnEnd_Broadcast_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIGroupSpawnerInterface_OnActorDied_Broadcast_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIGroupSpawnerInterface_GetSpawnedActorList_Param
	{
	public:

		struct TArray<struct FSpawnedActorInfo> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIGroupSpawnerInterface_GetFirstSpawnedActor_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroupSpawnerInterface_GetCurrentActorNum_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AIHelicopterSteeringComponent_ServerSetSteeringData_Param
	{
	public:

		struct FRepSteeringData InData; // 0x00(0x14)
	};

	struct Function_DFMGameplay_AIHelicopterSteeringComponent_ServerRevertSteeringData_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIHelicopterSteeringComponent_ResetPathFollowSteering_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIHelicopterSteeringComponent_OnRepVelocityData_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIHelicopterSteeringComponent_DebugDrawPath_Param
	{
	public:

		struct TArray<struct FVector> Points; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIInteractorComponent_OnPawnOut_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AIInteractorComponent_OnPawnEnter_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AILabAIJobManagerComponent_GetCurrMoveTargetPosition_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_AILabAIJobManagerComponent_GetAIJobType_Param
	{
	public:

		struct ADFMCharacter* Cha; // 0x00(0x08)
		enum class EAILabJobType ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AILabConfManager_GetSingleton_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UAILabConfManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AILabSpawnArea_OnEndOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnArea_OnBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AILabSpawnArea_ForceCreateAILab_Param
	{
	public:

		int32_t Num; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetPlayerNearExitDist_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetPlayerLastHurtTime_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetPlayerLastFireTime_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetPlayerHpRate_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetPlayerBloody_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetPlayerArmRate_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetModelNoDeliverAssets_Param
	{
	public:

		float TimeSecs; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetModelExtDeliverInterval_Param
	{
	public:

		float TimeSecs; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetModelDeliverTime_Param
	{
	public:

		float TimeSecs; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetModelDeliverInterval_Param
	{
	public:

		float TimeSecs; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetModelAINum_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetModelAIDiffcult_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetCurTeamDeliverModel_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		int32_t CourseId; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FAILabFullMapModel ReturnValue; // 0x10(0x40)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_GetCurDeliverModel_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		struct FAILabDeliverModel ReturnValue; // 0x08(0x68)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_IfDeliverAILabForTeam_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		int32_t CourseId; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_IfDeliverAILabForPlayer_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float LastMoveTime; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetSpawnInterval_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetFinalAILabDiffcult_Param
	{
	public:

		float Index; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabNum_Param
	{
	public:

		float DiffIndex; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabLastIdle_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float LastIdleTime; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabLastHurt_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabLastFire_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabKillScore_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		int32_t KillNum; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabHpScore_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabDiffcult_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		int32_t KillNum; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabBloodyScore_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AILabSpawnRuleBase_BP_GetAILabArmScore_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_AIMovePath_GetWayPoint_Param
	{
	public:

		struct TArray<struct FVector> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIMovePathManager_GetAIMovePathManager_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UAIMovePathManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIMovePathManager_FindMovePathByUniqueKey_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FString Key; // 0x08(0x10)
		struct TArray<struct AAIMovePath*> ReturnValue; // 0x18(0x10)
	};

	struct Function_DFMGameplay_AIPatrolPath_GetWayPoint_Param
	{
	public:

		struct TArray<struct FVector> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIPatrolPath_GetFormationPatternClass_Param
	{
	public:

		struct UClass* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_NewPatrolJob_GetDestinationWithRandom_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
		struct FVector CurDestLocation; // 0x08(0x0c)
		struct FVector Dest; // 0x14(0x0c)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_DFMGameplay_NewPatrolJob_GetDestination_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
		struct FVector Dest; // 0x08(0x0c)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_DFMGameplay_NewPatrolJob_FindDramaAreaOrJoin_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
		struct ADramaArea* CurDramaArea; // 0x08(0x08)
		struct ADramaArea* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_NewPatrolJob_CreatePatrolJobByKP_Param
	{
	public:

		struct ADramaArea* Area; // 0x00(0x08)
		struct TArray<struct FVector> Keypoints; // 0x08(0x10)
		struct UNewPatrolJob* ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_NewPatrolJob_CreatePatrolJob_Param
	{
	public:

		struct ADramaArea* Area; // 0x00(0x08)
		struct UNewPatrolJob* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_NewGuardJob_GetNextGruardPoint_Param
	{
	public:

		struct AAIController* Controller; // 0x00(0x08)
		struct UGuardPoint* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_NewGuardJob_CreateGuardJob_Param
	{
	public:

		struct ADramaArea* Area; // 0x00(0x08)
		struct UNewGuardJob* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIPersetMovePathManager_GetAIPresetMovePathManager_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UAIPersetMovePathManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIPersetMovePathManager_FindPresetPathGroupByUniqueKey_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FString Key; // 0x08(0x10)
		struct AAIPresetMovePathGroup* ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_AIPresetMovePathGroup_GetRandomGroupPoint_Param
	{
	public:

		struct AAIPresetMovePathPoint* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AirDropActor_ServerStopFly_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropActor_ServerPlayTimeOver_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropActor_ServerPlay_Param
	{
	public:

		int64_t InOwnerUin; // 0x00(0x08)
		struct AActor* InAttachedActor; // 0x08(0x08)
		struct FTransform InTargetTransform; // 0x10(0x30)
		int32_t InAirDropID; // 0x40(0x04)
		float InSpawnHeight; // 0x44(0x04)
	};

	struct Function_DFMGameplay_AirDropActor_ServerCheckLanded_Param
	{
	public:

		struct FVector DeltaMove; // 0x00(0x0c)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_AirDropActor_OnRepIsFlying_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropActor_OnRepAirDropID_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropActor_OnRep_bLanding_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropActor_OnRep_AttachedActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropActor_DebugDrawCapsule_Param
	{
	public:

		struct FVector Center; // 0x00(0x0c)
		float HalfHeight; // 0x0c(0x04)
		float radius; // 0x10(0x04)
		struct FColor Color; // 0x14(0x04)
	};

	struct Function_DFMGameplay_AirDropDeadZoneVolumeActor_OnBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AirDropGeneratorGroup_ActiveGroup_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropItemComponent_OnRep_bIsLanding_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropVehicleSubsystem_PreloadAirDropMaterials_Param
	{
	public:

	};

	struct Function_DFMGameplay_AirDropVehicleSubsystem_OnVehicleDeadNtf_Param
	{
	public:

		struct AGPVehicleBase* DFMVehicle; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AirDropVehicleSubsystem_OnServerMatchEnded_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AirDropVehicleSubsystem_OnPreloadAirDropMaterialsCompleted_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> AssetRefs; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AirDropVehicleSubsystem_LocalPlayerEnterAirDropState_Param
	{
	public:

		int64_t VehicleId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AirDropVehicleSubsystem_GetAirDropVehicleSubsystem_Param
	{
	public:

		struct UObject* ObjectContext; // 0x00(0x08)
		struct AAirDropVehicleSubsystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AirHitDetectorComponent_OnDetectAirHit_Param
	{
	public:

		struct APawn* SourcePawn; // 0x00(0x08)
		struct FHitResult HitReslut; // 0x08(0x88)
	};

	struct Function_DFMGameplay_AirHitManager_OnCharacterAirHit_Param
	{
	public:

		struct APawn* SourcePawn; // 0x00(0x08)
		struct FHitResult HitReslut; // 0x08(0x88)
	};

	struct Function_DFMGameplay_AISpawnChecker_StopSpawn_Param
	{
	public:

	};

	struct Function_DFMGameplay_AISpawnChecker_StartSpawn_Param
	{
	public:

		struct FAISpawnFactor factor; // 0x00(0x28)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnTestAIUnitTest_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDataTable* DataTable; // 0x08(0x08)
		struct FName NpcName; // 0x10(0x08)
		struct FVector Location; // 0x18(0x0c)
		char pad_24[0x4]; // 0x24(0x04)
		struct ADFMCharacter* ReturnValue; // 0x28(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnTestAIAtDesignatedTransform_Param
	{
	public:

		struct AActor* WorldContext; // 0x00(0x08)
		struct FVector Location; // 0x08(0x0c)
		struct FName NpcName; // 0x14(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnTestAIArgsEx_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct FName NpcName; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct FString extraArg; // 0x20(0x10)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnTestAIArgs_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName NpcName; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct FString extraArg; // 0x20(0x10)
		bool bIsWearingEquipment; // 0x30(0x01)
		bool TPToStart; // 0x31(0x01)
		char pad_32[0x6]; // 0x32(0x06)
		struct ADFMCharacter* ReturnValue; // 0x38(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnSimulateAIAtDesignatedTransform_Param
	{
	public:

		struct ADFMCharacter* Player; // 0x00(0x08)
		struct FCharacterTemplateTable npcTemplateRow; // 0x08(0x540)
		struct FSpawnBaseAIInfo AIInfo; // 0x548(0x30)
		struct FVector CentLocation; // 0x578(0x0c)
		char pad_584[0x4]; // 0x584(0x04)
		struct TArray<struct AAIController*> ReturnValue; // 0x588(0x10)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnAIWithDefaultFactor_Param
	{
	public:

	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnAIAtDesignatedTransform_Param
	{
	public:

		struct TArray<struct AAIController*> AIControllerList; // 0x00(0x10)
		struct AActor* WorldContext; // 0x10(0x08)
		char pad_18[0x8]; // 0x18(0x08)
		struct FTransform Transform; // 0x20(0x30)
		struct FAINpcSelector npcSelector; // 0x50(0x88)
		struct UDataTable* NpcTemplateTable; // 0xd8(0x08)
		struct UDataTable* NpcGroupTable; // 0xe0(0x08)
		bool bSpawnCheck; // 0xe8(0x01)
		bool bSpawnGroup; // 0xe9(0x01)
		char pad_EA[0x6]; // 0xea(0x06)
		struct AAIGroup* ReturnValue; // 0xf0(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnAIAtDesignatedPoint_Param
	{
	public:

		struct TArray<struct AAIController*> AIControllerList; // 0x00(0x10)
		struct AAISpawnPoint* SpawnPoint; // 0x10(0x08)
		struct FAINpcSelector npcSelector; // 0x18(0x88)
		struct UDataTable* NpcTemplateTable; // 0xa0(0x08)
		struct UDataTable* NpcGroupTable; // 0xa8(0x08)
		bool bSpawnCheck; // 0xb0(0x01)
		bool bSpawnGroup; // 0xb1(0x01)
		char pad_B2[0x6]; // 0xb2(0x06)
		struct AAIGroup* ReturnValue; // 0xb8(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_SpawnAerialVehicle_Param
	{
	public:

		struct TArray<struct AAerialVehicleController*> AerialVehicleControllerList; // 0x00(0x10)
		struct AAISpawnPoint* SpawnPoint; // 0x10(0x08)
		struct FAerialVehicleSelector AerialVehicleSelector; // 0x18(0x28)
		struct AAIGroup* ReturnValue; // 0x40(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_SetSpawnTransfrom_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
		char pad_1[0xf]; // 0x01(0x0f)
		struct FTransform Trans; // 0x10(0x30)
	};

	struct Function_DFMGameplay_AISpawnChecker_SetPauseSpawnTime_Param
	{
	public:

		float Duration; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AISpawnChecker_RemoveSpawnAvoidArea_Param
	{
	public:

		struct UAISpawnNearbyPawnDetectorComponent* avoidArea; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_OnSpawnedCharacterDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_OnSpawnedActorDestroyed_Param
	{
	public:

		struct AActor* SpawnedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_GetSpawnedCharacters_Param
	{
	public:

		struct FName Tag; // 0x00(0x08)
		struct TArray<struct ACHARACTER*> ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_AISpawnChecker_GetSpawnedCharacterAIControllers_Param
	{
	public:

		struct FName Tag; // 0x00(0x08)
		struct TArray<struct AAIController*> ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_AISpawnChecker_GetCurrentActorNum_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AISpawnChecker_DestroyAllSpawnedActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_AISpawnChecker_DefaultOnSpawnEvent_Param
	{
	public:

		struct AAISpawnChecker* Checker; // 0x00(0x08)
		struct AActor* SpawnedActor; // 0x08(0x08)
		int32_t SpawnIndex; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AISpawnChecker_BPOnSpawn_Param
	{
	public:

		struct AActor* SpawnedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_BPOnDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_BPOnDestroyed_Param
	{
	public:

		struct AActor* SpawnedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AISpawnChecker_AIReset_Param
	{
	public:

	};

	struct Function_DFMGameplay_AISpawnChecker_AddSpawnAvoidArea_Param
	{
	public:

		struct UAISpawnNearbyPawnDetectorComponent* avoidArea; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AsyncAISpawnAction_StartSpawnByFactorWithFunc_Param
	{
	public:

	};

	struct Function_DFMGameplay_AsyncAISpawnAction_StartSpawnByFactor_Param
	{
	public:

		struct AAISpawnChecker* Checker; // 0x00(0x08)
		struct FAISpawnFactor factor; // 0x08(0x28)
		struct UAsyncAISpawnAction* ReturnValue; // 0x30(0x08)
	};

	struct Function_DFMGameplay_AsyncAISpawnAction_OnEnd_Param
	{
	public:

		struct AAISpawnChecker* Checker; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AsyncAISpawnAction_OnClear_Param
	{
	public:

		struct AAISpawnChecker* Checker; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AsyncAISpawnAction_OnActorEnd_Param
	{
	public:

		struct AActor* A; // 0x00(0x08)
		enum class EEndPlayReason reason; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AsyncTaskAISpawnCheck_RegisterSpawnCheck_Param
	{
	public:

		struct ADramaArea* Drama; // 0x00(0x08)
		float ForceDistance; // 0x08(0x04)
		bool DirectSpawn; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		float RetryDelay; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct UAsyncTaskAISpawnCheck* ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_AIDelaySpawnSystem_RespawnDramas_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIDelaySpawnSystem_RegisterAISpawnDrama_Param
	{
	public:

		struct UAsyncTaskAISpawnCheck* Checker; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIDelaySpawnSystem_QARegisterAISpawnDrama_Param
	{
	public:

		struct ADramaArea* Drama; // 0x00(0x08)
		bool UseBP; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_AIDelaySpawnSystem_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UAIDelaySpawnSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIDelaySpawnSystem_AddNeedRespawnDrama_Param
	{
	public:

		struct ADramaArea* Drama; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AISpawnNearbyPawnDetectorComponent_RegisterChecker_Param
	{
	public:

		struct AAISpawnChecker* Checker; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AISpawnNearbyPawnDetectorComponent_OnDetectedPawnOut_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AISpawnNearbyPawnDetectorComponent_OnDetectedPawnEnter_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AISpeakContextManager_UpdateContext_Param
	{
	public:

		struct ACHARACTER* responsor; // 0x00(0x08)
		int32_t Handler; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FAISpeakContext newContext; // 0x10(0x28)
		bool ReturnValue; // 0x38(0x01)
	};

	struct Function_DFMGameplay_AISpeakContextManager_ResponseContext_Param
	{
	public:

		struct ACHARACTER* responsor; // 0x00(0x08)
		int32_t Handler; // 0x08(0x04)
		int32_t nextStatus; // 0x0c(0x04)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_AISpeakContextManager_QueryContextByDistance_Param
	{
	public:

		struct ACHARACTER* responsor; // 0x00(0x08)
		enum class EAISpeakContextType Type; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		float DistanceLimit; // 0x0c(0x04)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AISpeakContextManager_GetContext_Param
	{
	public:

		struct ACHARACTER* responsor; // 0x00(0x08)
		int32_t Handler; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FAISpeakContext Result; // 0x10(0x28)
		bool ReturnValue; // 0x38(0x01)
	};

	struct Function_DFMGameplay_AISpeakContextManager_DestroyContextDelay_Param
	{
	public:

		struct ACHARACTER* responsor; // 0x00(0x08)
		int32_t Handler; // 0x08(0x04)
		float Timeout; // 0x0c(0x04)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_AISpeakContextManager_DestroyContext_Param
	{
	public:

		struct ACHARACTER* responsor; // 0x00(0x08)
		int32_t Handler; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_AISpeakContextManager_CreateContext_Param
	{
	public:

		struct ACHARACTER* creator; // 0x00(0x08)
		enum class EAISpeakContextType Type; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		float DistanceLimit; // 0x0c(0x04)
		float Timeout; // 0x10(0x04)
		float CoolDown; // 0x14(0x04)
		int32_t ReturnValue; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AIUnitTestManager_ResetTestResult_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIUnitTestManager_ReportSightTestResult_Param
	{
	public:

		struct FName AiName; // 0x00(0x08)
		enum class EGPCharacterFightStateType FightState; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		float Angle; // 0x0c(0x04)
		float Distance; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AIUnitTestManager_ReportKillEnemyTestResult_Param
	{
	public:

		struct FName AiName; // 0x00(0x08)
		struct FString Equipment; // 0x08(0x10)
		float Distance; // 0x18(0x04)
		float KillTime; // 0x1c(0x04)
		struct AActor* Killer; // 0x20(0x08)
		struct AActor* Target; // 0x28(0x08)
	};

	struct Function_DFMGameplay_AIUnitTestManager_ReportHearingTestResult_Param
	{
	public:

		struct FName AiName; // 0x00(0x08)
		enum class EAIUnitTestPlayerState PlayerState; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		float Distance; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_AIUnitTestManager_OnGlobalPreTakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_AIUnitTestManager_FinishTest_Param
	{
	public:

		bool TestDone; // 0x00(0x01)
	};

	struct Function_DFMGameplay_Prefecture_SetReplenishScheme_Param
	{
	public:

		enum class EPrefectureReplenishScheme NewReplenishScheme; // 0x00(0x01)
	};

	struct Function_DFMGameplay_Prefecture_SetPrefectureEnabled_Param
	{
	public:

		bool IsEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_Prefecture_SetPrefectureAllAISpeakNextCoolDown_Param
	{
	public:

		float cdMin; // 0x00(0x04)
		float cdMax; // 0x04(0x04)
	};

	struct Function_DFMGameplay_Prefecture_RequestStyle_Param
	{
	public:

	};

	struct Function_DFMGameplay_Prefecture_ReplenishAI_Param
	{
	public:

	};

	struct Function_DFMGameplay_Prefecture_RegisterAlarmTower_Param
	{
	public:

		struct AGPAlarmTower* AlarmTower; // 0x00(0x08)
	};

	struct Function_DFMGameplay_Prefecture_OnSpawnedCharacterDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_Prefecture_OnSpawnedActorDestroyed_Param
	{
	public:

		struct AActor* SpawnedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_Prefecture_OnReplenishAISpawned_Param
	{
	public:

		struct TArray<struct ACHARACTER*> SpawnedAIs; // 0x00(0x10)
	};

	struct Function_DFMGameplay_Prefecture_OnCharacterSpawn_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_Prefecture_IsInPrefecture_Param
	{
	public:

		struct FVector GoalLoc; // 0x00(0x0c)
		struct FVector Extent; // 0x0c(0x0c)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_Prefecture_GetTotalAIByPOI_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName Tag; // 0x08(0x08)
		struct TArray<struct AGPCharacterBase*> ReturnValue; // 0x10(0x10)
	};

	struct Function_DFMGameplay_Prefecture_GetPrefecturesByTag_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ContainsNotEnabledPrefecture; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		struct FName Tag; // 0x0c(0x08)
		char pad_14[0x4]; // 0x14(0x04)
		struct TArray<struct APrefecture*> ReturnValue; // 0x18(0x10)
	};

	struct Function_DFMGameplay_Prefecture_GetPrefectureEnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_Prefecture_GetPrefectureAllAISpeakNextCoolDownTime_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_Prefecture_GetLivingAINumInPrefecture_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_Prefecture_GetForcedInPrefecture_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_Prefecture_GetAttractionRatio_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_Prefecture_GetAllAIInPrefecture_Param
	{
	public:

		struct TArray<struct AGPCharacterBase*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_Prefecture_GetAlarmTowerList_Param
	{
	public:

	};

	struct Function_DFMGameplay_Prefecture_FindClosestPoint_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_DFMGameplay_Prefecture_ChangeDrawPrefecture_Param
	{
	public:

	};

	struct Function_DFMGameplay_Prefecture_BPOnDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_Prefecture_BPOnDestroyed_Param
	{
	public:

		struct AActor* SpawnedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_Prefecture_BP_OnLevelSelectionChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_Prefecture_AIRequestStyle_Param
	{
	public:

		struct ADFMAIController* AIController; // 0x00(0x08)
		struct TArray<enum class EAIStyleType> AllowedStyles; // 0x08(0x10)
		enum class EAIStyleType OutStyle; // 0x18(0x01)
		bool ReturnValue; // 0x19(0x01)
	};

	struct Function_DFMGameplay_Prefecture_AIRequestSpecifyStyle_Param
	{
	public:

		struct ADFMAIController* AIController; // 0x00(0x08)
		enum class EAIStyleType Style; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_AmbientLightEditorPreviewActor_EditorSyncLoadMesh_Param
	{
	public:

		struct FSoftObjectPath Path; // 0x00(0x18)
		struct UObject* ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_AmbientLightVolumeActor_OnLocalPlayerPawnCreated_Param
	{
	public:

	};

	struct Function_DFMGameplay_AmbientLightVolumeActor_OnEndOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AmbientLightVolumeActor_OnBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AmbientLightVolumeActor_GetBoxFromBlueprint_Param
	{
	public:

		struct UBoxComponent* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AmmoUtil_UpdateAmmoItems_Param
	{
	public:

		struct TArray<struct FAmmoDataItem> AmmoDataItems; // 0x00(0x10)
		int32_t CurAmmoNum; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AmmoUtil_UpdateAmmoContextOnDynamicAttribute_Param
	{
	public:

		struct FModularWeaponDynamicAttrbuites DynamicAttrbuites; // 0x00(0x50)
		uint64_t RootGid; // 0x50(0x08)
		int32_t CurAmmoNum; // 0x58(0x04)
	};

	struct Function_DFMGameplay_AmmoUtil_UpdateAmmoContext_Param
	{
	public:

		struct FAmmoContext AmmoContext; // 0x00(0x10)
		int32_t CurAmmoNum; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AmmoUtil_PushAmmoToContext_Param
	{
	public:

		struct FAmmoContext AmmoContext; // 0x00(0x10)
		struct FAmmoDataItem AmmoDataItem; // 0x10(0x20)
	};

	struct Function_DFMGameplay_AmmoUtil_GetWeaponReloadTime_Param
	{
	public:

		struct FWeaponDataAttribute WeaponDataAttribute; // 0x00(0x638)
		int32_t CurrentAmmoCount; // 0x638(0x04)
		int32_t ItemAmmoNum; // 0x63c(0x04)
		float ReturnValue; // 0x640(0x04)
	};

	struct Function_DFMGameplay_AmmoUtil_FillReloadAmmoParams_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		uint64_t WeaponID; // 0x08(0x08)
		struct TArray<struct FInventoryItemInfo> ItemInfos; // 0x10(0x10)
		struct TArray<struct FAmmoDataItem> OutReloadParams; // 0x20(0x10)
		int32_t InMaxReloadCount; // 0x30(0x04)
		int32_t OutFindAmmoNum; // 0x34(0x04)
		bool bPreviewOnly; // 0x38(0x01)
	};

	struct Function_DFMGameplay_AreaTriggerActor_OnOverlapEndDoing_Param
	{
	public:

	};

	struct Function_DFMGameplay_AreaTriggerActor_OnOverlapEnd_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_AreaTriggerActor_OnOverlapBeginDoing_Param
	{
	public:

	};

	struct Function_DFMGameplay_AreaTriggerActor_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_ArmorDurabilityMgr_Get_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UArmorDurabilityMgr* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AvoidanceBoxComponent_OnStartMove_Param
	{
	public:

	};

	struct Function_DFMGameplay_AvoidanceBoxComponent_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_AvoidanceBoxComponent_OnFinishMove_Param
	{
	public:

	};

	struct Function_DFMGameplay_AvoidanceBoxComponent_MovePlan_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		struct UAvoidanceBoxComponent* OtherComp; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AvoidanceBoxComponent_ForceStopMove_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleFieldBackgroundCharacterVoiceDataManager_OnVoiceDataLoadComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Assets; // 0x00(0x10)
	};

	struct Function_DFMGameplay_BattleFieldBackgroundCharacterVoiceDataManager_GetBackgroundCharacterVoiceRow_Param
	{
	public:

		int32_t InMapID; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FBattleFieldBackgroundCharacterVoiceRow OutRow; // 0x08(0x60)
	};

	struct Function_DFMGameplay_BattleFieldDeduceDataManager_OnDeduceDataLoadComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Assets; // 0x00(0x10)
	};

	struct Function_DFMGameplay_BattleFieldDeduceDataManager_GetDeduceRow_Param
	{
	public:

		int32_t InMapID; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FBattleFieldDeduceRow OutRow; // 0x08(0x108)
	};

	struct Function_DFMGameplay_BattleRouteNav_SecondTick_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_OnLevelSelectionChanged_Param
	{
	public:

		struct UObject* NewSelection; // 0x00(0x08)
	};

	struct Function_DFMGameplay_BattleRoutePoint_FixInnerLinkAfterLevelCopy_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorTestReleaseAllOccupy_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorTestFindDest_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorTestCheckRouteVaild_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorRefresh_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorHideRoutePath_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorFillBindSector_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorDrawRoutePathUpdateCost_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorDrawRoutePathOnly_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_EditorCreateLink_Param
	{
	public:

	};

	struct Function_DFMGameplay_BattleRoutePoint_AllAttachToNav_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_SOLEventEstimatedTimeCreated_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_SOLEventBannerInit_Param
	{
	public:

		bool bInit; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BlueprintPlunder_ServerWaitingRecycleEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_ServerResetDecipherDeviceEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_RandomSpawnBlueprintWeapon_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_PlayerDangerVONextTick_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_OnTakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnSOLTrainHighValueBoxEvacuate_Param
	{
	public:

		struct AActor* TrainHighValueBox; // 0x00(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnSOLTimelineEventStateChange_Param
	{
	public:

		struct TArray<enum class ESOLEventState> EventStates; // 0x00(0x10)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnShowSOLEventBannerFlyIcon_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnServerLocalPlayerIsAliveChanged_Param
	{
	public:

		struct AController* InPlayer; // 0x00(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnServerGameEnd_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnRep_BlueprintPlunderInfo_Intro_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_OnRep_BlueprintPlunderInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_OnPlayerKilledServerNotify_Param
	{
	public:

		struct FKillInfo NewAddKillInfo; // 0x00(0x148)
		struct UGPModularWeaponDesc* WeaponDesc; // 0x148(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnPlayerEscape_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		struct AController* Controller; // 0x08(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnMandelUIAudioLoadedComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> EventAssetsToLoad; // 0x00(0x10)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnMandel3DAudioLoadedComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> EventAssetsToLoad; // 0x00(0x10)
		struct TArray<enum class EInteract3DAudioType> AudioTypes; // 0x10(0x10)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnLoadedAllControllerClass_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_OnClientPlayerEnterOrLeftExitPoint_Param
	{
	public:

		struct APlayerExitBase* ExitPoint; // 0x00(0x08)
		bool ExitOrNotice; // 0x08(0x01)
		bool bEnterOrLeft; // 0x09(0x01)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnClientPlayerEnteredExitPoint_Param
	{
	public:

		struct APlayerExitBase* ExitPoint; // 0x00(0x08)
		bool ExitOrNotice; // 0x08(0x01)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnBlueprintPlunderRefreshGenerator_Param
	{
	public:

		int32_t SpawnerID; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BlueprintPlunder_OnBlueprintPlunderDisableDelay_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_OBClientBroadcastPlunderInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_NotCheckStartMatchHandle_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_MultiCastLoseMandelBrick_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BlueprintPlunder_LocalPlayerEnterBattleDecipherDevice_Param
	{
	public:

		struct AInteractor_DecipherDevice* DecipherDevice; // 0x00(0x08)
		bool bEnter; // 0x08(0x01)
	};

	struct Function_DFMGameplay_BlueprintPlunder_HudLoaded_SOLEventBanner_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_HudLoaded_LeftProgressTipsHudView_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_HudLoaded_EventProgress_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_HudLoaded_CenterEventHintView_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BlueprintPlunder_GetDecipherRemainCountDownTime_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BlueprintPlunder_GetDecipherAndRecycleProgress_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BlueprintPlunder_GetCurrentCountDownTime_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BlueprintPlunder_DSUpdateBlueprintWeaponLocation_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_DSReportLoc_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_DelayPlayMandelLp_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_ClientShowEstimatedTimeHud_Inner2Copy_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_ClientShowEstimatedTimeHud_Inner_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_ClientEnemyUpdateScreenMarkersInner_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_ClientCreateMapIcons_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_CheckMandelBrickOccur_Param
	{
	public:

	};

	struct Function_DFMGameplay_BlueprintPlunder_BroadcastPlunderInfoUpdate_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakableEnvDetectorComponent_OnDetecteAirHit_Param
	{
	public:

		struct APawn* SourcePawn; // 0x00(0x08)
		struct FHitResult HitReslut; // 0x08(0x88)
	};

	struct Function_DFMGameplay_BreakableEnvDetectorComponent_NotifyBreak_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakableFoliage_SpawnFoliagePerformanceBpAsync_Param
	{
	public:

		struct FString MeshName; // 0x00(0x10)
		struct FTransform Transform; // 0x10(0x30)
	};

	struct Function_DFMGameplay_BreakableFoliage_OnTakeRadialDamage_Param
	{
	public:

		struct FVector HitPosition; // 0x00(0x0c)
		float HitRadius; // 0x0c(0x04)
		float DamageVal; // 0x10(0x04)
	};

	struct Function_DFMGameplay_BreakableFoliage_OnTakePointDamage_Param
	{
	public:

		int32_t UniqueId; // 0x00(0x04)
		float DamageVal; // 0x04(0x04)
	};

	struct Function_DFMGameplay_BreakableFoliage_OnServerPostRadialDamage_Param
	{
	public:

		struct FDamageSourceInfo DamageSource; // 0x00(0x2a8)
		struct TArray<struct FDamageResultInfo> DamageResults; // 0x2a8(0x10)
	};

	struct Function_DFMGameplay_BreakableFoliage_OnDestructRigid_Param
	{
	public:

		struct UBreakableFoliageHealthComponent* Comp; // 0x00(0x08)
		int32_t UnitIndex; // 0x08(0x04)
	};

	struct Function_DFMGameplay_BreakableFoliage_OnDestructEnd_Param
	{
	public:

		struct AActor* From; // 0x00(0x08)
		struct FString MeshName; // 0x08(0x10)
		struct TArray<int32_t> InsIndices; // 0x18(0x10)
		struct TArray<struct FTransform> Scatters; // 0x28(0x10)
	};

	struct Function_DFMGameplay_BreakableFoliage_OnDestructCover_Param
	{
	public:

		struct UBreakableFoliageHealthComponent* Comp; // 0x00(0x08)
		struct FVector Position; // 0x08(0x0c)
		float radius; // 0x14(0x04)
	};

	struct Function_DFMGameplay_BreakableFoliage_MultiPlayTreeDestructibleEffect_Param
	{
	public:

		struct FString MeshName; // 0x00(0x10)
		struct FTransform WorldTrans; // 0x10(0x30)
	};

	struct Function_DFMGameplay_BreakableFoliageHealthComponent_GetHPPercent_Param
	{
	public:

		int32_t UnitID; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_BreakableFoliageHealthComponent_GetHealth_Param
	{
	public:

		int32_t UnitID; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_BreakableHealthComponent_SetHP_Param
	{
	public:

		float HP; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BreakableHealthComponent_OnRep_DamageInfoChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakableHealthComponent_GetHPRate_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BreakableHealthLossComponent_GetHitDoing_Param
	{
	public:

		float HealthAfterHit; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FDamageResultInfo DamageResult; // 0x08(0x5e0)
	};

	struct Function_DFMGameplay_BreakableHealthLossComponent_ExplosionDoing_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakableItemsReplication_OnRep_ItemBreakStateChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawn_SetTickEnable_Param
	{
	public:

		bool bEnabled; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_SetSkeletalMeshInManagerControl_Param
	{
	public:

		struct UGPSkeletalMeshComponent* SkeletalMeshComponent; // 0x00(0x08)
		bool IsPlayAnim; // 0x08(0x01)
		bool IsPlayPhysic; // 0x09(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_SetPawnState_Param
	{
	public:

		enum class EPawnState NewState; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_SetIsDestructibleEnd_Param
	{
	public:

		bool IsEnd; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_SetHP_Param
	{
	public:

		float HP; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_ServerSuicide_Param
	{
	public:

		struct AActor* AttackerActor; // 0x00(0x08)
		struct FHitResult HitInfo; // 0x08(0x88)
	};

	struct Function_DFMGameplay_BreakablePawn_Reset_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawn_PlayBreakAndClearHealthAll_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawn_OnRep_HasBreaked_Param
	{
	public:

		bool Pre; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_OnDestructionComponentPlayEffectEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawn_OnDestructionComponentPlayEffectBegin_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawn_OnDestructionComponentPhysicsSimulation_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawn_OnCollisionLogic_Param
	{
	public:

		struct UPrimitiveComponent* HitComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_BreakablePawn_OnCollisionHitted_Param
	{
	public:

		struct UPrimitiveComponent* HitComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		struct FVector NormalImpulse; // 0x18(0x0c)
		struct FHitResult Hit; // 0x24(0x88)
	};

	struct Function_DFMGameplay_BreakablePawn_OnCollisionBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct DelegateFunction_DFMGameplay_BreakablePawn_OnBreakablePlayDestructionAnimation__DelegateSignature_Param
	{
	public:

		struct USkeletalMeshComponent* SkeletalMeshComp; // 0x00(0x08)
	};

	struct DelegateFunction_DFMGameplay_BreakablePawn_OnBreakablePawnStateChange__DelegateSignature_Param
	{
	public:

		struct ABreakablePawn* BreakablePawnObj; // 0x00(0x08)
		enum class EPawnState NewState; // 0x08(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_OnBeginPreLoadFinishComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Path; // 0x00(0x10)
	};

	struct Function_DFMGameplay_BreakablePawn_GetPawnState_Param
	{
	public:

		enum class EPawnState ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BreakablePawn_GetHP_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_BreakablePawnManager_SetIsSimulatePhysics_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawnManager_SetIsPlayAnimation_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawnManager_SetConfig_Param
	{
	public:

		int32_t InMaxBreakActorCount; // 0x00(0x04)
		int32_t InMaxBreakingBoneCount; // 0x04(0x04)
		int32_t InMaxPhysicsSimualteCount; // 0x08(0x04)
	};

	struct Function_DFMGameplay_BreakablePawnManager_RemoveBreakablePawn_Param
	{
	public:

		struct ABreakablePawn* BreakablePawn; // 0x00(0x08)
	};

	struct Function_DFMGameplay_BreakablePawnManager_GetInstIfExist_Param
	{
	public:

		struct ABreakablePawnManager* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_BreakablePawnManager_GetInst_Param
	{
	public:

		struct UWorld* World; // 0x00(0x08)
		struct ABreakablePawnManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_BreakablePawnManager_EndPlay_Param
	{
	public:

		enum class EEndPlayReason EndPlayReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_BreakablePawnManager_CanPlayMorePhysics_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePawnManager_BeginPlay_Param
	{
	public:

	};

	struct Function_DFMGameplay_BreakablePhysics_OnHitEffect_Param
	{
	public:

		struct UPrimitiveComponent* HitComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		struct FVector NormalImpulse; // 0x18(0x0c)
		struct FHitResult Hit; // 0x24(0x88)
	};

	struct Function_DFMGameplay_BreakableSpawnPickupComponent_SpawnPickup_Param
	{
	public:

		struct ABreakablePawn* BreakablePawnObj; // 0x00(0x08)
		enum class EPawnState NewState; // 0x08(0x01)
	};

	struct Function_DFMGameplay_BTTask_RunDynamicTemplateBehavior_SetBtNodeValueUint8_Param
	{
	public:

		struct FString TargetNodeName; // 0x00(0x10)
		struct FString FieldName; // 0x10(0x10)
		char Val; // 0x20(0x01)
		bool ReturnValue; // 0x21(0x01)
	};

	struct Function_DFMGameplay_BTTask_RunDynamicTemplateBehavior_SetBtNodeValueInt_Param
	{
	public:

		struct FString TargetNodeName; // 0x00(0x10)
		struct FString FieldName; // 0x10(0x10)
		int32_t Val; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_DFMGameplay_BTTask_RunDynamicTemplateBehavior_SetBtNodeValueFloat_Param
	{
	public:

		struct FString TargetNodeName; // 0x00(0x10)
		struct FString FieldName; // 0x10(0x10)
		float Val; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_DFMGameplay_BTTask_RunDynamicTemplateBehavior_SetBtNodeValueBool_Param
	{
	public:

		struct FString TargetNodeName; // 0x00(0x10)
		struct FString FieldName; // 0x10(0x10)
		bool Val; // 0x20(0x01)
		bool ReturnValue; // 0x21(0x01)
	};

	struct Function_DFMGameplay_BTTask_RunDynamicTemplateBehavior_SelectTemplateName_Param
	{
	public:

		struct UBehaviorTreeComponent* OwnerComp; // 0x00(0x08)
		struct AAIController* AIController; // 0x08(0x08)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_BTTask_RunDynamicTemplateBehavior_OnNewTempBhtSwitched_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_BuffActions_HandleBuffActionTrigger_Param
	{
	public:

		struct UDFMCharacterBuffEntityBase* InBuffEntity; // 0x00(0x08)
		enum class EBuffActionTriggerType TriggerType; // 0x08(0x01)
	};

	struct Function_DFMGameplay_BuffActions_CureSOLHealthBody_Param
	{
	public:

		struct UDFMCharacterBuffEntityBase* InBuffEntity; // 0x00(0x08)
		int32_t Num; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMBuffBaseClassTableManager_OnLoadBuffEntityClassFinish_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Paths; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMBuffMonitorConfigTableManager_OnLoadClassFinish_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Paths; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ChangeableContainer_GenerateCorrespondingActorByEventId_Param
	{
	public:

		struct TArray<uint64_t> BattlefieldEventId; // 0x00(0x10)
		uint64_t Timestamp; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CharacterFashionComponent_20V20_OnUpdateTeamInfo_Param
	{
	public:

		uint64_t Camp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_CharacterFashionComponent_20V20_OnRep_FashionConfigName_Param
	{
	public:

	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_PreloadAudio_Param
	{
	public:

		struct AGPCharacter* AvatarCharacter; // 0x00(0x08)
		struct FName AudioName; // 0x08(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_PreloadAllAudio_Param
	{
	public:

		struct FName AudioName; // 0x00(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_PlayLocationAudio_Param
	{
	public:

		struct AGPCharacter* AvatarCharacter; // 0x00(0x08)
		struct FName AudioName; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct AActor* SourceActor; // 0x20(0x08)
		struct FGPAudioFuturePlayingID ReturnValue; // 0x28(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_PlayEffect_Param
	{
	public:

		struct AGPCharacter* AvatarCharacter; // 0x00(0x08)
		struct FName EffectId; // 0x08(0x08)
		struct FTransform PlayTransform; // 0x10(0x30)
		struct AActor* CreatorOwner; // 0x40(0x08)
		bool bUseObjectPool; // 0x48(0x01)
		char pad_49[0x7]; // 0x49(0x07)
		struct USceneComponent* Socket; // 0x50(0x08)
		bool bIsHighFrequency; // 0x58(0x01)
		enum class EFXResourceCompPriority Priority; // 0x59(0x01)
		bool bEnableInstanceLimit; // 0x5a(0x01)
		char pad_5B[0x5]; // 0x5b(0x05)
		struct UFXResourceContainerComponent* ReturnValue; // 0x60(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_PlayActorAudio_Param
	{
	public:

		struct AGPCharacter* AvatarCharacter; // 0x00(0x08)
		struct FName AudioName; // 0x08(0x08)
		struct AActor* TargetActor; // 0x10(0x08)
		struct FGPAudioFuturePlayingID ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_OnLoadedPreload_Param
	{
	public:

		struct FSoftObjectPath SoftObjectPath; // 0x00(0x18)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetResourcePathByName_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct FName AvatarID; // 0x08(0x08)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetLocalResourcePath_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct FName ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetLocalAudioResourcePath_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct FName ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetInstance_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UCharacterHeroResourceDataSingleton* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetCharacterResourceData_Param
	{
	public:

		struct FAbilityPlayMontageResources ResourceData; // 0x00(0x30)
		struct FName Key; // 0x30(0x08)
		struct AGPCharacter* GPCharacter; // 0x38(0x08)
		enum class EChracterPoseType Pose; // 0x40(0x01)
		bool IsSlidingTackle; // 0x41(0x01)
		enum class EWeaponItemType WeaponType; // 0x42(0x01)
		bool ReturnValue; // 0x43(0x01)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetAvatarSourceNameBySkillId_Param
	{
	public:

		int32_t SkillId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct AGPCharacter* GPCharacter; // 0x08(0x08)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetAvatarResourcePath_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct AGPCharacter* GPCharacter; // 0x08(0x08)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetAvatarAudioResourcePath_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct AGPCharacter* GPCharacter; // 0x08(0x08)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetAvatarAttachMeshResourcePath_Param
	{
	public:

	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetAvatarAttachMeshResourceInfo_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct AGPCharacter* GPCharacter; // 0x08(0x08)
		struct FCharacterHeroResourceAttachMeshData MeshInfo; // 0x10(0x1d0)
		bool ReturnValue; // 0x1e0(0x01)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_GetAudioResourcePathByName_Param
	{
	public:

		struct FName Key; // 0x00(0x08)
		struct FName AvatarID; // 0x08(0x08)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CharacterHeroResourceDataSingleton_AsyncLoadResource_Param
	{
	public:

		struct FSoftObjectPath SoftObjectPath; // 0x00(0x18)
		uint64_t ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_SetStaggerable_Param
	{
	public:

		bool Value; // 0x00(0x01)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_SetDamageScale_Param
	{
	public:

		float Value; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_RequestStagger_Param
	{
	public:

		struct FName StaggerMotionConfigName; // 0x00(0x08)
		bool bOverrideCurStagger; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		float TargetYawWorld; // 0x0c(0x04)
		enum class ECharacterPart HitPart; // 0x10(0x01)
		enum class EWeaponStaggerType WeaponType; // 0x11(0x01)
		char pad_12[0x6]; // 0x12(0x06)
		struct UAnimMontage* ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_OnServerTakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
		enum class ECharacterPart HitPart; // 0x5e0(0x01)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_IsStaggering_Param
	{
	public:

		enum class ECharacterStaggerType StaggerType; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_IsStaggerable_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_GetWeaponDamageType_Param
	{
	public:

		struct ADFMWeapon* Weapon; // 0x00(0x08)
		enum class EWeaponStaggerType ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_GetLastStaggerTimeTillNow_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_GetDamageScale_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CharacterStaggerComponent_ClearStaggerCooldown_Param
	{
	public:

	};

	struct Function_DFMGameplay_CharacterStaggerComponent_ClearDamageSum_Param
	{
	public:

	};

	struct Function_DFMGameplay_CharacterTemplate_ResetToCharacterTemplate_Param
	{
	public:

		struct FCharacterTemplateTable templateRow; // 0x00(0x540)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_SetCollisionAvoidanceVelocity_Param
	{
	public:

		struct FVector Vel; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentVelocity_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentTimeHorizon_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentRadius_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentNeighborDist_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentMaxSpeed_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_CollisionAvoidanceAgentInterface_GetCollisionAvoidanceAgentHeight_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_OnSolTimelineEventIdChange_Param
	{
	public:

		struct TArray<uint64_t> SOLEventIdArray; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_GetUniqueName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_GetSmallAreaCustomName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_GetPreviewActorClass_Param
	{
	public:

		struct UClass* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_GetOpenBoxTypeName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_GetMapName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_GetBigAreaName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_ContainerSpawnPoint_BP_OnCreate_Param
	{
	public:

		struct AInteractorBase* Interactor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_CountDownVolumeActor_ServerSetVolumeEnable_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_CountDownVolumeActor_OnVolumeEndOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_CountDownVolumeActor_OnVolumeBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComp; // 0x00(0x08)
		struct AActor* Other; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_CountDownVolumeActor_OnRep_SetVolumeEnable_Param
	{
	public:

	};

	struct Function_DFMGameplay_CrashableDrone_SpawnDroneContainer_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_CrashableDrone_SpawnAntiAircraftBullet_Param
	{
	public:

	};

	struct Function_DFMGameplay_CrashableDrone_SetDestinationAndFlightPath_Param
	{
	public:

		struct FVector Dest; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct ADroneFlightPathSpline* Spline; // 0x10(0x08)
	};

	struct Function_DFMGameplay_CrashableDrone_RegisterDroneInteract_Param
	{
	public:

		struct ASOLTimeLineEventActor* TLActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_CrashableDrone_OnRep_DroneState_Param
	{
	public:

	};

	struct Function_DFMGameplay_CrashableDrone_OnLootSearchDone_Param
	{
	public:

		struct AInventoryPickup_Container* OpenBox; // 0x00(0x08)
	};

	struct Function_DFMGameplay_CrashableDrone_IntoLanded_Param
	{
	public:

	};

	struct Function_DFMGameplay_CrashableDrone_IntoDamaged_Param
	{
	public:

	};

	struct Function_DFMGameplay_CrashableDrone_IntoCrashed_Param
	{
	public:

	};

	struct Function_DFMGameplay_DataStatisticsBaseComponent_SetDamageInfo_Param
	{
	public:

		struct FDamageInfo DamageInfo; // 0x00(0x20)
	};

	struct Function_DFMGameplay_DataStatisticsBaseComponent_OnDamageTake_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DeadbodyAmmoBox_OnSimulateEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_DeadbodyAmmoBox_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_DeadbodyAmmoBox_GetInitVelocity_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DeadBodyAmmoComponent_OnOverlapedCharacter_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DeadBodyAmmoComponent_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_DeadBodyDrug_OnRep_GivenCharacters_Param
	{
	public:

	};

	struct Function_DFMGameplay_DeadBodyDrug_OnCliendDestroy_Param
	{
	public:

	};

	struct Function_DFMGameplay_DeadZoneVolumeActor_OnBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_DebugLogGenerator_Get_Param
	{
	public:

		struct UWorld* WorldContextObject; // 0x00(0x08)
		struct UDebugLogGenerator* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DesTerrainRuntimeComponent_MultiTryCreateCraterMesh_Param
	{
	public:

		struct FName SectorID; // 0x00(0x08)
		struct FVector InRelativeLocation; // 0x08(0x0c)
		int32_t CraterID; // 0x14(0x04)
	};

	struct Function_DFMGameplay_DesTerrainGameplayComponent_OnServerPostRadialDamage_Param
	{
	public:

		struct FDamageSourceInfo DamageSource; // 0x00(0x2a8)
		struct TArray<struct FDamageResultInfo> DamageResults; // 0x2a8(0x10)
	};

	struct Function_DFMGameplay_DesTerrainGameplayComponent_OnRep_ClientCraterArray_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFFlameComponent_TryProcessFlameBurnDamage_Param
	{
	public:

		struct AActor* Cha; // 0x00(0x08)
		struct FHitResult Hit; // 0x08(0x88)
	};

	struct Function_DFMGameplay_DFFlameComponent_ServerStopFlame_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFFlameComponent_ServerStartFlame_Param
	{
	public:

		struct AActor* InOwner; // 0x00(0x08)
		struct USceneComponent* InSocket; // 0x08(0x08)
		struct FName InSocketName; // 0x10(0x08)
		char pad_18[0x8]; // 0x18(0x08)
		struct FTransform InTrans; // 0x20(0x30)
	};

	struct Function_DFMGameplay_DFFlameComponent_OnRep_bFiring_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFFlameComponent_BroadcastMsg_StopBurnVolume_Param
	{
	public:

		int32_t Key; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFFlameComponent_BroadcastMsg_PlayBurnVolume_Param
	{
	public:

		int32_t Key; // 0x00(0x04)
		struct FVector Location; // 0x04(0x0c)
		struct FVector Normal; // 0x10(0x0c)
	};

	struct Function_DFMGameplay_DFFlameComponent_BroadcastMsg_PlayBurnDecal_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		float ScaleRange; // 0x88(0x04)
	};

	struct Function_DFMGameplay_DFFlameComponent_BroadcastMsg_Debug_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		float ScaleRange; // 0x88(0x04)
	};

	struct Function_DFMGameplay_DFHDDisplayInputActionHandler_GetStringFromActionBindings_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFHDDisplayInputActionManager_OnInputGateChanged_Param
	{
	public:

		bool bBlocked; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDDisplayInputActionManager_Get_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UDFHDDisplayInputActionManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetRowKeyInfoAxisKeyDir_Param
	{
	public:

		struct FKeyMappingsDataTableRow InRow; // 0x00(0x138)
		int32_t ReturnValue; // 0x138(0x04)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetRowKeyInfo_SecondAxisKeyDir_Param
	{
	public:

		struct FKeyMappingsDataTableRow InRow; // 0x00(0x138)
		int32_t ReturnValue; // 0x138(0x04)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetNameByKeyName_Param
	{
	public:

		struct FName KeyName; // 0x00(0x08)
		struct FText ReturnValue; // 0x08(0x18)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetNameByFKey_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		struct FText ReturnValue; // 0x18(0x18)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetKeyIconPathByKeyName_Param
	{
	public:

		struct FName KeyName; // 0x00(0x08)
		int32_t dir; // 0x08(0x04)
		enum class EKeyIconType KeyIconType; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FSoftObjectPath ReturnValue; // 0x10(0x18)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetKeyIconPathByFKey_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		int32_t dir; // 0x18(0x04)
		enum class EKeyIconType KeyIconType; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FSoftObjectPath ReturnValue; // 0x20(0x18)
	};

	struct Function_DFMGameplay_DFHDKeyIconDataTableManager_GetKeyIconPath_Param
	{
	public:

		struct FKeyIconDataTableRow Row; // 0x00(0x78)
		enum class EKeyIconType KeyIconType; // 0x78(0x01)
		char pad_79[0x7]; // 0x79(0x07)
		struct FSoftObjectPath ReturnValue; // 0x80(0x18)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_UpdateCachedPlayerController_Param
	{
	public:

		struct APlayerController* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_TickCenterizeMouseCursor_Param
	{
	public:

		float DeltaTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_SetMouseCursorShowHide_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_SetIsAppHasFocus_Param
	{
	public:

		bool bHasFocus; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_SetCenterizeInvisibleMouseCursor_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_OnEnterGameFlow_Param
	{
	public:

		enum class EGameFlowStageType GameFlowStageType; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_Get_Param
	{
	public:

		struct UObject* GameInstanceContext; // 0x00(0x08)
		struct UDFHDMouseCursorManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFHDMouseCursorManager_CheckCachedPlayerController_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_VehicleSensitivityRealTimeRatio_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_SensitivityRealTime_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_SensitivityHip_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_SensitivityByWeapon_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_RefreshSensitivity_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFHDPlayerInput_IsUsingGamepad_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_IsPlayerFPP_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_IsKeyPressing_Param
	{
	public:

		struct FKey InKey; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_InitVehicleDefaultSensitivity_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFHDPlayerInput_InitDefaultSensitivity_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFHDPlayerInput_HDistToVDist_Param
	{
	public:

		float HDist; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_GetCurWeaponZoomRate_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_FetchDefaultFOV_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFHDPlayerInput_CalcMDRadiansWithZoomRate_Param
	{
	public:

		float BaseVFOV; // 0x00(0x04)
		float InMDV; // 0x04(0x04)
		float ZoomRate; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_CalcMDRadians_Param
	{
	public:

		float FOV; // 0x00(0x04)
		float MD; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFHDPlayerInput_CalcDist_Param
	{
	public:

		float FOV; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFInteractableInterface_GetAllActiveTags_Param
	{
	public:

		struct ACHARACTER* InOperatorCharacter; // 0x00(0x08)
		struct AActor* InInteractableCompOwner; // 0x08(0x08)
		struct UDFInteractableComponentBase* InInteractableComp; // 0x10(0x08)
		struct FGameplayTagContainer ReturnValue; // 0x18(0x20)
	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_SetFPPLockingState_Param
	{
	public:

		enum class EStingerMissileLockingState LockingState; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_SetFPPLockingObject_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_RemoveVisableCounter_Param
	{
	public:

		bool bIsVehicleWeapon; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_RefreshState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_RefreshEffectState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_PoolItem_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_MulticastTargetLockingStateInfo_Param
	{
	public:

		struct AActor* Taker; // 0x00(0x08)
		int32_t CampId; // 0x08(0x04)
		enum class EStingerMissileLockingState ServerLockingState; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_MulticastTargetLockingParamInfo_Param
	{
	public:

		struct AActor* Taker; // 0x00(0x08)
		int32_t CampId; // 0x08(0x04)
		float IncreaseSpeed; // 0x0c(0x04)
		float DecreaseSpeed; // 0x10(0x04)
		float PersistentTime; // 0x14(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityLockerComponent_AddVisableCounter_Param
	{
	public:

		bool bIsVehicleWeapon; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityLockerGroup_OnUnregisterActor_Param
	{
	public:

		struct AActor* NewActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_UpdateSneakHUDState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_UpdateClientPostProcessEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_UpdateBeTracingLevel_Param
	{
	public:

		bool IsAdd; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t SourceUin; // 0x04(0x04)
		float Dis; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_UpdataTotalTracingTime_Param
	{
	public:

		bool HasTracingTarget; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_TryTrackingTarget_Param
	{
	public:

		struct ADFMCharacter* OwnerChar; // 0x00(0x08)
		struct ADFMCharacter* TargetChar; // 0x08(0x08)
		struct FVector PathStartPos; // 0x10(0x0c)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct FAbilityTracingPathData PathData; // 0x20(0x38)
		bool ReturnValue; // 0x58(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_TryInitPathMeshInstance_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_TrackingTargetTeammates_Param
	{
	public:

		struct ADFMCharacter* TargetChar; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_SyncOutLineItemLocationsToTeamMates_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_SyncDetectorLocationsToTeamMates_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_StopPathTracing_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_StartPathTracing_Param
	{
	public:

		float SkillTotalTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_SetFlashDronePathIndex_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerStartScan_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerSetFlashDronePathIndex_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerRefreshWarning_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerRefreshPaths_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerPrepareForShortPath_Param
	{
	public:

		struct FAbilityTracingPathData PathData; // 0x00(0x38)
		bool bIsBlocked; // 0x38(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerGetEdgeLength_Param
	{
	public:

		struct FPathTracingVertex StartVertex; // 0x00(0x1c)
		struct FPathTracingVertex EndVertex; // 0x1c(0x1c)
		float ReturnValue; // 0x38(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerFindShortestPath_Param
	{
	public:

		int32_t StartVertexIndex; // 0x00(0x04)
		int32_t EndVertexIndex; // 0x04(0x04)
		struct TArray<struct FVector> Path; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerFindNavMeshPath_Param
	{
	public:

		struct FVector StartPos; // 0x00(0x0c)
		struct FVector EndPos; // 0x0c(0x0c)
		float Length; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct TArray<struct FVector> ResPath; // 0x20(0x10)
		bool ReturnValue; // 0x30(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerFindClimbLadder_Param
	{
	public:

		struct FVector StartPos; // 0x00(0x0c)
		float ScanDis; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerAddTracingBuff_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ServerAddFlashBuff_Param
	{
	public:

		uint32_t FlashBuffID; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct AActor* SourceChar; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ResetFlashDronePathIndex_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_Rep_UpdateTracingEnemyFlag_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_Rep_UpdateBeTracingLevel_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_PrintShortPath_Param
	{
	public:

		int32_t StartVertexIndex; // 0x00(0x04)
		int32_t EndVertexIndex; // 0x04(0x04)
		struct TArray<struct FVector> Path; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_OnCharacterOBStateChanged_Param
	{
	public:

		bool bIsStartOB; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_OnAsyncPathTracingCallBack_Param
	{
	public:

		int32_t PathIndex; // 0x00(0x04)
		int32_t DrawStartIndex; // 0x04(0x04)
		struct FVector PathStartPos; // 0x08(0x0c)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_OBClientStopTracing_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_OBClientDrawPath_Param
	{
	public:

		struct TArray<struct FAbilityTracingPathData> ServerTracingPaths; // 0x00(0x10)
		struct TArray<struct FAbilityTracingPathData> ServerKnifeTracingPaths; // 0x10(0x10)
		float SkillStartTime; // 0x20(0x04)
		bool bIsRefreshPath; // 0x24(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_NotifyOBClientStopTracing_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_NotifyOBClientDrawPath_Param
	{
	public:

		struct TArray<struct FAbilityTracingPathData> ServerTracingPaths; // 0x00(0x10)
		struct TArray<struct FAbilityTracingPathData> ServerKnifeTracingPaths; // 0x10(0x10)
		float SkillStartTime; // 0x20(0x04)
		bool bIsRefreshPath; // 0x24(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_LocalPlayerSilentMoveStateChanged_Param
	{
	public:

		bool IsSilentMove; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_LocalPlayerBasePoseStatusChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_IsOnwerEnemyWithCharacter_Param
	{
	public:

		struct AGPCharacterBase* Charecter; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_GetShortestDistancePointToLineSegment_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector LineStart; // 0x0c(0x0c)
		struct FVector LineEnd; // 0x18(0x0c)
		float ReturnValue; // 0x24(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_GetShortestDistanceBetweenLines_Param
	{
	public:

		struct FVector Line1Start; // 0x00(0x0c)
		struct FVector Line1End; // 0x0c(0x0c)
		struct FVector Line2Start; // 0x18(0x0c)
		struct FVector Line2End; // 0x24(0x0c)
		float ReturnValue; // 0x30(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_GetPathByIndex_Param
	{
	public:

		int32_t PathIndex; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FAbilityTracingPathData Result; // 0x08(0x38)
		bool ReturnValue; // 0x40(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_GetFlashDronePathIndex_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_FindNearestPointOnPath_Param
	{
	public:

		struct FVector PointA; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct TArray<struct FVector> PathPoints; // 0x10(0x10)
		struct TArray<float> PathLengths; // 0x20(0x10)
		int32_t NextIndex; // 0x30(0x04)
		struct FVector ReturnValue; // 0x34(0x0c)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientTryChoosePath_Param
	{
	public:

		float DeltaTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientTryChooseFlashDronePath_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientStopTracing_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientPreprocessPaths_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientPreprocessPath_Param
	{
	public:

		struct FAbilityTracingPathData Path; // 0x00(0x38)
		bool ReturnValue; // 0x38(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientGetViewPointPathIndex_Param
	{
	public:

		struct FVector ViewPoint; // 0x00(0x0c)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientGetScreenPointWorldLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientGetScreenPointStartLocation_Param
	{
	public:

		struct FVector2D ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientGetLineStartLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientDrawPathTracing_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientDrawPath_Param
	{
	public:

		struct TArray<struct FAbilityTracingPathData> ServerTracingPaths; // 0x00(0x10)
		struct TArray<struct FAbilityTracingPathData> ServerKnifeTracingPaths; // 0x10(0x10)
		float SkillStartTime; // 0x20(0x04)
		bool bIsRefreshPath; // 0x24(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientConfirmFlashDronePathIndex_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientCalculatePath_Param
	{
	public:

		bool bAttachToSurface; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientCalculateFlashLevel_Param
	{
	public:

		struct AActor* FlashDrone; // 0x00(0x08)
		float FaceAngle; // 0x08(0x04)
		float NearDis; // 0x0c(0x04)
		float FarDis; // 0x10(0x04)
		uint32_t FlashBuffID_Back; // 0x14(0x04)
		uint32_t FlashBuffID_Near; // 0x18(0x04)
		uint32_t FlashBuffID_Mid; // 0x1c(0x04)
		uint32_t FlashBuffID_Far; // 0x20(0x04)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClientAttachToSurface_Param
	{
	public:

		struct FVector pos; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClearAllPath_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ClearAllAsyncTrace_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_CaculatePath_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAbilityPathTracingComponent_ActiveClientPostProcessEffect_Param
	{
	public:

		bool Active; // 0x00(0x01)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_TlogFightFlow_Param
	{
	public:

		enum class EAIAnalysisFightState State; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FString reason; // 0x08(0x10)
		struct ADFMCharacter* mainTarget; // 0x18(0x08)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_OnMatchEnd_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_OnLeaveFight_Param
	{
	public:

		struct FVector SelfLocation; // 0x00(0x0c)
		struct FVector enemyLocation; // 0x0c(0x0c)
		struct ADFMCharacter* Enemy; // 0x18(0x08)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_OnIntoFight_Param
	{
	public:

		struct FVector SelfLocation; // 0x00(0x0c)
		struct FVector enemyLocation; // 0x0c(0x0c)
		struct ADFMCharacter* Enemy; // 0x18(0x08)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_CollectThreatNum_Param
	{
	public:

		struct FVector PlayerLocation; // 0x00(0x0c)
		struct FVector AILocation; // 0x0c(0x0c)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_CollectThreatData_Param
	{
	public:

		enum class EAIThreatFlagName Flag; // 0x00(0x01)
	};

	struct Function_DFMGameplay_AIAnalysisComponent_CollectFightData_Param
	{
	public:

		bool isOut; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FVector Location; // 0x04(0x0c)
		struct FVector PlayerLocation; // 0x10(0x0c)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct ADFMCharacter* mainTarget; // 0x20(0x08)
	};

	struct Function_DFMGameplay_DFMAICharacterScoringComponent_OnPlayerMakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DFMAICharacterScoringComponent_OnPickupItem_Param
	{
	public:

		struct FItemMoveCmd MoveCmd; // 0x00(0x120)
	};

	struct Function_DFMGameplay_DFMAICharacterScoringComponent_OnKillPlayer_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
	};

	struct Function_DFMGameplay_DFMAICharacterScoringComponent_OnHealthPointChange_Param
	{
	public:

		float ChangeValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAICharacterScoringComponent_OnAttributeArmorChangeEvent_Param
	{
	public:

		struct AActor* Owner; // 0x00(0x08)
		float CurrentValue; // 0x08(0x04)
		float MaxValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMAICharacterScoringComponent_GetScore_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAIConfigItemComponent_AddConfigItemsToInventory_Param
	{
	public:

		struct ADFMCharacter* Owner; // 0x00(0x08)
		bool Remove; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAICoverManager_SetupCoverContextToAIController_Param
	{
	public:

		struct ADFMAIController* AIController; // 0x00(0x08)
		struct FSOLEqsCoverPointInfo coverPoint; // 0x08(0x28)
		bool bTryToStand; // 0x30(0x01)
		bool ReturnValue; // 0x31(0x01)
	};

	struct Function_DFMGameplay_DFMAICoverManager_ReleaseCoverContext_Param
	{
	public:

		struct FDFMCoverContext CoverContextIn; // 0x00(0x1b0)
	};

	struct Function_DFMGameplay_DFMAICoverManager_OnUpdateCoverInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAICoverManager_OccupyCurrentCover_Param
	{
	public:

		struct ADFMAIController* AIController; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAICoverManager_GetNearbyLeftCover_Debug_Param
	{
	public:

		struct FVector Location; // 0x00(0x0c)
		struct FVector BoxExtent; // 0x0c(0x0c)
		struct TArray<struct FDFMCoverContext> ReturnValue; // 0x18(0x10)
	};

	struct Function_DFMGameplay_DFMAICoverManager_GetNearByCover_Param
	{
	public:

		struct FVector Center; // 0x00(0x0c)
		float Extent; // 0x0c(0x04)
		bool bIgnoreCoverOccupied; // 0x10(0x01)
		enum class ESOLCoverDirQuery dir; // 0x11(0x01)
		enum class ESOLCoverHeightQuery Height; // 0x12(0x01)
		char pad_13[0x5]; // 0x13(0x05)
		struct TArray<struct FDFMCoverContext> ReturnValue; // 0x18(0x10)
	};

	struct Function_DFMGameplay_DFMAICoverManager_GetInstance_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct ADFMAICoverManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAICoverManager_GetDirectTransCover_Param
	{
	public:

		struct ADFMAIController* AIController; // 0x00(0x08)
		char pad_8[0x8]; // 0x08(0x08)
		struct FDFMCoverContext ReturnValue; // 0x10(0x1b0)
	};

	struct Function_DFMGameplay_DFMAICoverManager_DebugSetupNearbyCover_Param
	{
	public:

		struct ADFMAIController* AICtrler; // 0x00(0x08)
		struct FVector BoxExtent; // 0x08(0x0c)
		bool bIsLeftCover; // 0x14(0x01)
		bool bIsRightCover; // 0x15(0x01)
		bool bIsHighCover; // 0x16(0x01)
		bool ReturnValue; // 0x17(0x01)
	};

	struct Function_DFMGameplay_DFMAICoverManager_BuildCover_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAICoverModifier_OnSelectionChanged_Param
	{
	public:

		struct UObject* NewSelection; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAICustomLinkReachDelegates_Get_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UDFMAICustomLinkReachDelegates* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_SliderSpecSpringArmLen_OnValueChanged_Param
	{
	public:

		float Value; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_ShowAIDebugPanelV2_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_IsLocalPlayerSpectating_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetSpecSpringArmLength_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetSortedAIUTs_Param
	{
	public:

		struct TArray<struct AActor*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetRagdollPhysicsWeightText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetPainText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetMotionPlanText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetGunIKText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetFootIKText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetFocusText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetCurrWeaponName_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetCurrStateText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetCurAnimText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetCurAnimDetailText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetAITemplateNames_Param
	{
	public:

		struct TArray<struct FName> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_GetAimText_Param
	{
	public:

		struct FText ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_FlushCoverDebugDraw_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_DebugDrawCover_Param
	{
	public:

		struct FGMCoverDrawInfo cover; // 0x00(0x24)
		float LifeTime; // 0x24(0x04)
	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_ClosePanel_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIDebugPanelV2_ChooseNewTarget_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIEnvironmentInteractComponent_StartInteraction_SceneWeapon_Param
	{
	public:

		struct ADFScenceWeaponPawn* SceneWeapon; // 0x00(0x08)
		bool bSmoothCorrection; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAIEnvironmentInteractComponent_PlayDebugTurret_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIEnvironmentInteractComponent_OnRep_AssembleThreeAnim_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_SetCharacterForceExtraScore_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float extraScore; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_SetCharacterBasicScore_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
		float bacisScore; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetTargetThreatLevel_Param
	{
	public:

		struct ADFMCharacter* TargetCharacter; // 0x00(0x08)
		enum class EAIThreatLevel ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetTargetByThreatLevel_Param
	{
	public:

		enum class EAIThreatLevel ThreatLevel; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct ADFMCharacter* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetCurrentMainTargetWithRandomOffset_Param
	{
	public:

		struct ADFMCharacter* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetCurrentMainTargetWithDist_Param
	{
	public:

		float Dist; // 0x00(0x04)
		bool bInside; // 0x04(0x01)
		char pad_5[0x3]; // 0x05(0x03)
		struct ADFMCharacter* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetCurrentMainTargetInfo_Custom_Param
	{
	public:

		struct FAIFightTargetInfo Info; // 0x00(0x44)
		float dealyTime_sight; // 0x44(0x04)
		bool ReturnValue; // 0x48(0x01)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetCurrentMainTargetInfo_Param
	{
	public:

		struct FAIFightTargetInfo Info; // 0x00(0x44)
		bool ReturnValue; // 0x44(0x01)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetCurrentMainTarget_Param
	{
	public:

		struct ADFMCharacter* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_GetAssinedTarget_Param
	{
	public:

		struct ADFMCharacter* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_ForceUpdateTargets_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIFightTargetManagementComponent_BatchUpdateAIFightTargets_Param
	{
	public:

		struct TArray<struct ADFMAIController*> AIList; // 0x00(0x10)
		struct TArray<struct ADFMCharacter*> charList; // 0x10(0x10)
		float LockLocation; // 0x20(0x04)
		bool bFightOnly; // 0x24(0x01)
	};

	struct Function_DFMGameplay_DFMAIFightTargetManager_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDFMAIFightTargetManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_TryProcessFlameBurnDamage_Param
	{
	public:

		struct AActor* Cha; // 0x00(0x08)
		struct FHitResult Hit; // 0x08(0x88)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_ThrowerStartFire_Param
	{
	public:

		bool Start; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_RemoveFirebatBurnBuff_Param
	{
	public:

		struct ADFMCharacter* Cha; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_PrintDebugStr_Param
	{
	public:

		struct FString str; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_PlayBurnScreenEffect_Param
	{
	public:

		struct ADFMCharacter* Cha; // 0x00(0x08)
		struct FName Name; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_OnRep_IsInFire_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_OnRep_CurrentBurnScaleRange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_FlameBlock_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_BroadcastMsg_StopBurnVolume_Param
	{
	public:

		int32_t Key; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_BroadcastMsg_PlayBurnVolume_Param
	{
	public:

		int32_t Key; // 0x00(0x04)
		struct FVector Location; // 0x04(0x0c)
		struct FVector Normal; // 0x10(0x0c)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_BroadcastMsg_PlayBurnDecal_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		float ScaleRange; // 0x88(0x04)
	};

	struct Function_DFMGameplay_DFMAIFlameThrowerComponent_BroadcastMsg_Debug_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		float ScaleRange; // 0x88(0x04)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_ScenesActorUseTimeout_Param
	{
	public:

		struct AAIScenesActor* scenesActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_GetScenesActorsForDistance_Param
	{
	public:

		bool bTooOften; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<struct FScenesFailureReasons> ScenesFailureReasons; // 0x08(0x10)
		float radius; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct TArray<struct AAIScenesActor*> ReturnValue; // 0x20(0x10)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_GetPatrolArrayScenesActors_Param
	{
	public:

		float radius; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct TArray<struct AAIPatrolPath*> ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_GetCurrentScene_Param
	{
	public:

		struct AAIScenesActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_GetCategoryScenesActors_Param
	{
	public:

		bool bTooOften; // 0x00(0x01)
		char ScenesActorType; // 0x01(0x01)
		char pad_2[0x6]; // 0x02(0x06)
		struct TArray<struct FScenesFailureReasons> ScenesFailureReasons; // 0x08(0x10)
		float radius; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct TArray<struct AAIScenesActor*> ReturnValue; // 0x20(0x10)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_GetCategoryArrayScenesActors_Param
	{
	public:

		bool bTooOften; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<char> ScenesActorTypeList; // 0x08(0x10)
		struct TArray<struct FScenesFailureReasons> ScenesFailureReasons; // 0x18(0x10)
		float radius; // 0x28(0x04)
		char pad_2C[0x4]; // 0x2c(0x04)
		struct TArray<struct AAIScenesActor*> ReturnValue; // 0x30(0x10)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_GetALLScenesActors_Param
	{
	public:

		bool bTooOften; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<struct FScenesFailureReasons> ScenesFailureReasons; // 0x08(0x10)
		struct TArray<struct AAIScenesActor*> ReturnValue; // 0x18(0x10)
	};

	struct Function_DFMGameplay_AIGroupScenesComponent_CreateWayPoints_Param
	{
	public:

		struct AAIScenesActor* SceneActor; // 0x00(0x08)
		struct TArray<struct FVector> WayPoints; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_SetTargetExtraData_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		struct FAIGroupThreatExtraData Result; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_OnPlayerDied_Param
	{
	public:

		struct AGPCharacterBase* Player; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_IsCharacterThreatExist_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_IsCharacterThreatDetailExist_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		enum class EAIThreatDetailName detail; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetVisibleThreatTargetList_Param
	{
	public:

		struct TArray<struct FAIGroupThreatResult> Result; // 0x00(0x10)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetThreatTargetList_Param
	{
	public:

		struct TArray<struct FAIGroupThreatResult> Result; // 0x00(0x10)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetThreatTargetLength_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetThreatTargetLastVisible_Param
	{
	public:

		float Time; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct ACHARACTER* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetTargetExtraData_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		struct FAIGroupThreatExtraData Result; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetRecordByNameOrder_Param
	{
	public:

		enum class EAIThreatDetailName Name; // 0x00(0x01)
		bool includeDeadCharacter; // 0x01(0x01)
		char pad_2[0x6]; // 0x02(0x06)
		struct FGroupThreatCharacterQueryDetail ReturnValue; // 0x08(0x18)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetNameOrder_Param
	{
	public:

		bool includeDeadCharacter; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FGroupThreatCharacterQueryDetail ReturnValue; // 0x08(0x18)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetLocationToSearchForThreatSource_Param
	{
	public:

		struct TArray<enum class EAIThreatDetailName> detailNames; // 0x00(0x10)
		float Distance; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct TArray<struct FAIGroupThreatSource> Players; // 0x18(0x10)
		bool ReturnValue; // 0x28(0x01)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetArrayNoFilter_Param
	{
	public:

		struct TArray<struct ACHARACTER*> Result; // 0x00(0x10)
		bool includeDeadCharacter; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		int32_t ReturnValue; // 0x14(0x04)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_GetArrayByName_Param
	{
	public:

		enum class EAIThreatDetailName Name; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<struct ACHARACTER*> Result; // 0x08(0x10)
		bool includeDeadCharacter; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		int32_t ReturnValue; // 0x1c(0x04)
	};

	struct Function_DFMGameplay_AIGroupThreatComponent_ClearTargetThreat_Param
	{
	public:

		struct ACHARACTER* Player; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_StopFire_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_StartDropHelmet_Param
	{
	public:

		bool PlayAudio; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FVector hitDir; // 0x04(0x0c)
		int64_t PlayerUin; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_SetUpMachineGun_Param
	{
	public:

		struct USkeletalMeshComponent* ChainMain; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_PlayFx_Param
	{
	public:

		struct FName Name; // 0x00(0x08)
		char pad_8[0x8]; // 0x08(0x08)
		struct FTransform Transform; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_OpenFire_Param
	{
	public:

		bool Fire; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		float PlayAnimVec; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_OnPreTakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_OnMasterTakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
		enum class ECharacterPart HitPart; // 0x5e0(0x01)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_Fire_Param
	{
	public:

		bool PlayPreFireAnim; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIHeavyMachineGunComponent_CharacterPlayFx_Param
	{
	public:

		struct FName Name; // 0x00(0x08)
		char pad_8[0x8]; // 0x08(0x08)
		struct FTransform Transform; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_SetKeyPosition_Param
	{
	public:

		struct FVector KeyPos; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_SetAIHelicopterState_Param
	{
	public:

		enum class EAIHelicopterSpawnState InState; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_SetAIHelicopterParam_Param
	{
	public:

		struct FAIHelicopterSpawnParam InParam; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_ServerSetTransportParam_Param
	{
	public:

		struct FAITransportHelicopterRepParam Param; // 0x00(0x90)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_ServerSetAnimIndex_Param
	{
	public:

		enum class EAITransportPoseType PoseType; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct UAnimMontage* Montage; // 0x08(0x08)
		bool bHasRootMotion; // 0x10(0x01)
		char pad_11[0xf]; // 0x11(0x0f)
		struct FTransform MotionWarpingTarget; // 0x20(0x30)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_OnVehicleDead_Param
	{
	public:

		struct AGPVehicleBase* DFMVehicle; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_OnRep_TransportParam_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_OnRep_Param_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_IsMontageHasRootMotion_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_GetAnimNotifyTriggerTime_Param
	{
	public:

		struct UAnimSequenceBase* Anim; // 0x00(0x08)
		int32_t Index; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMAIHelicopterSpawnComponent_DrawDebug_Param
	{
	public:

		struct FVector PosT; // 0x00(0x0c)
		struct FColor Color; // 0x0c(0x04)
		float LifeTime; // 0x10(0x04)
	};

	struct Function_DFMGameplay_DFMAINameManager_GetRankIconByName_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAINameManager_GetHalfBodyImageByAINameText_Param
	{
	public:

		struct FText AINameText; // 0x00(0x18)
		struct FSoftObjectPath ReturnValue; // 0x18(0x18)
	};

	struct Function_DFMGameplay_DFMAINameManager_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDFMAINameManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAIOilTankComponent_PlayOilTankFx_Param
	{
	public:

		int32_t Type; // 0x00(0x04)
		char pad_4[0xc]; // 0x04(0x0c)
		struct FTransform Transform; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMAIOilTankComponent_HitOilTankCheck_Param
	{
	public:

		struct FDamageSourceInfo SourceInfo; // 0x00(0x2a8)
		struct FDamageResultInfo DamageResult; // 0x2a8(0x5e0)
		struct UPrimitiveComponent* OilTankMeshComp; // 0x888(0x08)
		bool ReturnValue; // 0x890(0x01)
	};

	struct Function_DFMGameplay_DFMAIPlayerPathFollowingComponent_IsUsingNavLink_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIPlayerPathFollowingComponent_GetVaultTryTimes_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAIPlayerPathFollowingComponent_GetStuckBypassPoints_Param
	{
	public:

		struct TArray<struct FVector> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMAIPlayerPathFollowingComponent_GetCurrentFootLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMAIPlayerPathFollowingComponent_ClearPathStuckFlag_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_UpdateNavObstacle_Param
	{
	public:

		bool EnableObstacle; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_UpdateDynamicCover_Param
	{
	public:

		bool EnableCover; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SuicideCarSpawnInit_Param
	{
	public:

		struct AActor* RCVParent; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SetVectorParameter_Param
	{
	public:

		struct FName ParameterName; // 0x00(0x08)
		struct FVector Param; // 0x08(0x0c)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SetHomingTarget_Param
	{
	public:

		struct AActor* Target; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SetHomingLocation_Param
	{
	public:

		struct AActor* Target; // 0x00(0x08)
		struct FVector Location; // 0x08(0x0c)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SetFloatParameter_Param
	{
	public:

		struct FName ParameterName; // 0x00(0x08)
		float Param; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SetCrazyRotationSpeed_Param
	{
	public:

		float Speed; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_SetColorParameter_Param
	{
	public:

		struct FName ParameterName; // 0x00(0x08)
		struct FLinearColor Param; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_PrepareSuicideCar_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_PlaySoundFx_Param
	{
	public:

		enum class ERCVAISoundFxType Type; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_OnRep_SuicideCarPrepare_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_OnRep_FollowingParent_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_OnRep_CrazyRotation_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_LaunchMissile_Param
	{
	public:

		struct AActor* Commander; // 0x00(0x08)
		int32_t TargetCount; // 0x08(0x04)
		int32_t MaxMissilePerTarget; // 0x0c(0x04)
		int32_t MaxMissileCount; // 0x10(0x04)
		float Delay; // 0x14(0x04)
		float Interval; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_IsCrazyRotationEnable_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_IsAnyCoverOccupied_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMAIRCVDataComponent_GetBoneTransform_Param
	{
	public:

		struct FName Socket; // 0x00(0x08)
		char pad_8[0x8]; // 0x08(0x08)
		struct FTransform ReturnValue; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMAIRCVExplosionComponent_ExplodeImpl_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIRCVExplosionComponent_Explode_Param
	{
	public:

		float DelaySeconds; // 0x00(0x04)
	};

	struct Function_DFMGameplay_RCVAIAnimInstance_GetWheelIKLookAt_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		struct FVector LookAt; // 0x04(0x0c)
		struct FVector Target; // 0x10(0x0c)
	};

	struct Function_DFMGameplay_AIScenesActor_UseScencesActor_Param
	{
	public:

		struct AAIGroup* Group; // 0x00(0x08)
		struct TArray<struct FVector> WayPoints; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_AIScenesActor_StartSceneTiming_Param
	{
	public:

		struct AAIGroup* Group; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesActor_IsUse_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_AIScenesActor_GetRandomSpawnPoint_Param
	{
	public:

		struct UScenesSpawnPoint* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIScenesActor_GetInterActiveLocation_Param
	{
	public:

		struct TArray<struct FVector> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIScenesActor_GetInteractiveActorList_Param
	{
	public:

		struct TArray<struct FInteractiveInfo> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIScenesActor_FinishScencesActor_Param
	{
	public:

		struct AAIGroup* Group; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesActor_DeleteInteractiveActor_Param
	{
	public:

		struct UAIScenesInteractiveComponent* InteractiveComp; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesActor_DeleteGroup_Param
	{
	public:

		struct AAIGroup* Group; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIScenesActor_ClearInteractiveActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIScenesActor_AddInteractiveActor_Param
	{
	public:

		struct UAIScenesInteractiveComponent* InteractiveComp; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_UseInteractiveActor_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_ToFindThePath_Param
	{
	public:

		struct AActor* Actor; // 0x00(0x08)
		struct FVector StartLocation; // 0x08(0x0c)
		struct FVector EndLocation; // 0x14(0x0c)
		struct TArray<struct FVector> WayPoints; // 0x20(0x10)
		bool IsVehiclePath; // 0x30(0x01)
		bool ReturnValue; // 0x31(0x01)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_StartInteractiveTiming_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_OnLevelSelectionChanged_Param
	{
	public:

		struct FVector SceneActorLocation; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_IsUse_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_FinishInteractiveActor_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_AIScenesInteractiveComponent_DeleteController_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAISpeakManager_SetAllAISpeakGlobalNextCoolDown_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float cdMin; // 0x08(0x04)
		float cdMax; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMAISpeakManager_SetAISpeakDebugEnable_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool Enable; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMAISpeakManager_GetAllAISpeakGlobalNextCoolDownTime_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMAISpeakManager_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDFMAISpeakManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAITask_AttributeDetectorBase_OnDetectorTriggerBlueprint_Param
	{
	public:

		struct AAIController* AIController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAITask_AttributeDetectorBase_OnDetectorTrigger_Param
	{
	public:

		struct AController* OwnerComp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAITask_ChangeLocomotionType_BP_PreExecuteTask_Param
	{
	public:

		struct ADFMAICharacter* AIChara; // 0x00(0x08)
		struct ADFMAIController* AICtrler; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMAITask_PlaySpecialAnimBP_BP_PreExecuteTask_Param
	{
	public:

		struct ADFMAICharacter* AIChara; // 0x00(0x08)
		struct ADFMAIController* AICtrler; // 0x08(0x08)
		float TimeElapsed; // 0x10(0x04)
		enum class EBTNodeResult Progress; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMAITask_FormationMove_GetScenesAnimates_Param
	{
	public:

		struct UDataTable* DataTable; // 0x00(0x08)
		struct FName RowName; // 0x08(0x08)
		struct UScenesAnimates* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMAITask_PlayAudioWithSubtitle_PlaySubtitle_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct FText txt; // 0x08(0x18)
		struct UGPAudioEventAsset* Audio; // 0x20(0x08)
	};

	struct Function_DFMGameplay_DFMAIUnitSpawn_UpdateUnitSpawnParams_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIUnitSpawn_UpdateUnitLocation_Param
	{
	public:

		struct FVector NewLocation; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMAIUnitSpawn_StopUnitSpawn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIUnitSpawn_StartUnitSpawn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIUnitSpawn_OnReset_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMAIUnitSpawn_OnReplayStage_Param
	{
	public:

		struct AGPQuestStage* InStage; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMAttributeSetBehaviorFactor_OnRep_NormalBehaviorFactor_Param
	{
	public:

		struct FGPGameplayAttributeData OldData; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAttributeSetBehaviorFactor_OnRep_DistanceApartBehaviorFactor_Param
	{
	public:

		struct FGPGameplayAttributeData OldData; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAttributeSetBehaviorFactor_OnRep_DefensiveBehaviorFactor_Param
	{
	public:

		struct FGPGameplayAttributeData OldData; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMAttributeSetBehaviorFactor_OnRep_AgressiveBehaviorFactor_Param
	{
	public:

		struct FGPGameplayAttributeData OldData; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMBattleFieldSystem_UnRegisterCharacterOnOutlineEffect_Param
	{
	public:

		struct ADFMCharacter* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBattleFieldSystem_SetBlockWallVisable_Param
	{
	public:

		bool visable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMBattleFieldSystem_RegisterCharacterOnOutlineEffect_Param
	{
	public:

		struct ADFMCharacter* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBattleFieldSystem_NotifyCharacterOnOutlineEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBattleFieldSystem_AddBlockWall_Param
	{
	public:

		struct AActor* wall; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_ServerRequestSpectificLiveSpectatingLogic_Param
	{
	public:

		enum class EDFMGamePlayMode GamePlayerMode; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_ProcessKillInfo_Param
	{
	public:

		struct FKillInfo NewAddKillInfo; // 0x00(0x148)
		struct UGPModularWeaponDesc* WeaponDesc; // 0x148(0x08)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_OnStreamingLoadingPercentage_Param
	{
	public:

		int32_t Percentage; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_OnSetViewTargetTransitionTimeoutFunc_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_OnSetViewTargetReleaseWorldStreamingFunc_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_OnPlayerServerMatchEnd_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_OnLocalFocusChange_Param
	{
	public:

		struct AActor* OldTarget; // 0x00(0x08)
		struct AActor* NewTarget; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_NextTimeMustStartFade_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_ClientSpectateLeaveMatch_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_ClientChangeWatchTarget_Param
	{
	public:

		struct FVector TargetLocation; // 0x00(0x0c)
		bool bResetViewOwner; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMBattleSpectateModeLogicComponent_CheckObserverNeedWaitStreaming_Param
	{
	public:

		struct FVector TargetLocation; // 0x00(0x0c)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMBehaviorFactorComponent_OnBehaviorFactorChange_Param
	{
	public:

		enum class EGPSpecificBehaviorType factorType; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		uint32_t NewValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMBlackboardComponent_OnVaultAndClimbEnd_Param
	{
	public:

		struct UGPVaultAndClimbComponent* InVaultAndClimbComp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBlackboardComponent_OnVaultAndClimbBegin_Param
	{
	public:

		struct UGPVaultAndClimbComponent* InVaultAndClimbComp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBlackboardComponent_NotifyActorLocationAndRotation_Param
	{
	public:

		struct FVector pos; // 0x00(0x0c)
		struct FRotator Rot; // 0x0c(0x0c)
	};

	struct Function_DFMGameplay_DFMBlackboardComponent_GetArmorLevel_Param
	{
	public:

		enum class EEquipmentType EquipmentType; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnServerPlayerRescueSucceed_Param
	{
	public:

		struct AGPCharacterBase* Player; // 0x00(0x08)
		struct AGPCharacterBase* RescueTarget; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnServerPlayerLoginDelegate_Param
	{
	public:

		struct APlayerController* PC; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnServerPlayerEscapeDelegate_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		struct AController* Controller; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnServerPlayerBan_Param
	{
	public:

		int64_t InPlayerUin; // 0x00(0x08)
		int32_t reason; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FString custom_reson; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnPlayerKnockDownNotifySignature_Param
	{
	public:

		struct FKillInfo KnockDownInfo; // 0x00(0x148)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnPlayerExitAwakeChangeDelegate_Param
	{
	public:

		struct APlayerExitBase* PlayerExitBase; // 0x00(0x08)
		bool bAwake; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnGameStateKillInfoNotifySignature_Param
	{
	public:

		struct TArray<struct FKillInfo> NewAddKillInfo; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_OnClientReadyToPlayDelegate_Param
	{
	public:

		struct APlayerController* PC; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBroadcastComponent_DispatchMsg_Param
	{
	public:

		struct FGameBrocastMsg Msg; // 0x00(0xe8)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_UpdateBloomIntensity_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_StopPlayBloomEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_StartPlayBloomEffect_Param
	{
	public:

		struct UCurveFloat* CurrCurve; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_ShowRemoveBuffTips_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_OnCharacterOBStateChanged_Param
	{
	public:

		bool bFocus; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_NotifyTriggerInstantBuff_Param
	{
	public:

		struct FCharacterBuff BuffInfo; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_NotifyRemoveBuff_Param
	{
	public:

		struct FCharacterBuff BuffInfo; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_NotifyRefreshBuff_Param
	{
	public:

		struct FCharacterBuff OldBuffInfo; // 0x00(0x70)
		struct FCharacterBuff NewBuffInfo; // 0x70(0x70)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_NotifyBuffEventTag_Param
	{
	public:

		uint32_t BuffId; // 0x00(0x04)
		struct FName EventTag; // 0x04(0x08)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_NotifyBuffApplyAttributeEffect_Param
	{
	public:

		struct FClientAttributeEffectContext EffectContext; // 0x00(0x98)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_NotifyAddBuff_Param
	{
	public:

		struct FCharacterBuff BuffInfo; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_GetSceneDefaultBloomIntensity_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_DisplayRemoveBuffTips_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffEffectsComponent_DelayRemoveCharacter3pParticle_Param
	{
	public:

		struct UParticleSystemComponent* ParticleSystemComponent; // 0x00(0x08)
		float DelayTime; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_UploadSkillDataFlowBuff_Param
	{
	public:

		enum class EDataFlowType Type; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t BuffId; // 0x04(0x04)
		int32_t SkillId; // 0x08(0x04)
		bool UseTimeWheel; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_TestServerRemoveBuff_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		enum class ECharacterPart BuffPart; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_TestServerRemoveAllBuffs_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_TestServerAddBuff_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		enum class ECharacterPart BuffPart; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_TestRemoveBuff_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		enum class ECharacterPart BuffPart; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_TestRemoveAllBuffs_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_TestAddBuff_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		enum class ECharacterPart BuffPart; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveBuffsById_Param
	{
	public:

		struct TArray<uint32_t> RemoveBuffIds; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveBuffDurationRate_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveBuffDisableStatus_Param
	{
	public:

		enum class EBuffDisableTag NewBuffDisableTag; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveBuffByType_Param
	{
	public:

		struct FName BuffType; // 0x00(0x08)
		enum class ECharacterPart BuffPart; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		struct FName reason; // 0x0c(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveBuffByGUID_Param
	{
	public:

		uint64_t InBuffGUID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveBuff_Param
	{
	public:

		uint32_t InBuffId; // 0x00(0x04)
		enum class ECharacterPart InCharacterPart; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RemoveAllBuffs_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_RecordBuffIDToAudioArray_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct TArray<struct FSpecifyTimePlayAudio> Value; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnServerMatchEnd_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnRep_CharacterBuffArray_Param
	{
	public:

		struct FCharacterBuffFastArray OldCharacterBuffArray; // 0x00(0x28)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnClientRemoveBuffEffect_Param
	{
	public:

		struct FCharacterBuff ClientBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnClientRefreshBuffEffect_Param
	{
	public:

		struct FCharacterBuff ClientBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnClientPauseBuffEffect_Param
	{
	public:

		struct FCharacterBuff ClientBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnClientAddBuffEffect_Param
	{
	public:

		struct FCharacterBuff ClientBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnCharaterHealthChange_Param
	{
	public:

		int32_t Health; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnBuffTimeOutCallback_Param
	{
	public:

		struct UDFMCharacterBuffEntityBase* BuffEntityBase; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_OnAttributeSetReady_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_NotifyClientApplyAttributeEffect_Param
	{
	public:

		struct FClientAttributeEffectContext EffectContext; // 0x00(0x98)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_NotifyBuffEventTag_Param
	{
	public:

		uint32_t BuffId; // 0x00(0x04)
		struct FName EventTag; // 0x04(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_GetCharacterVisbleBuffs_Param
	{
	public:

		struct TArray<struct FCharacterBuff> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_GetCharacterVisbleBuffGroups_Param
	{
	public:

		struct TArray<struct FCharacterBuffGroup> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_GetCharacterBuffs_Param
	{
	public:

		struct TArray<struct FCharacterBuff> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_GetBuffIDToAudioArray_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct TArray<struct FSpecifyTimePlayAudio> ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_GetBuffDurationRate_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_GetBuffAudios_Param
	{
	public:

		struct FBuffAudioPriority BuffAudioPriority; // 0x00(0x08)
		struct TArray<struct FSpecifyTimePlayAudio> ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_DumpBuffInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_DeleteBuffAudioPriority_Param
	{
	public:

		uint32_t BuffId; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_ClientTriggerInstantBuffEffect_Param
	{
	public:

		struct FCharacterBuff ClientBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_ClientRemoveBuffEffectNotify_Param
	{
	public:

		struct FName EffectNotify; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_ClientMulticastBuffApplyAttributeEffect_Param
	{
	public:

		struct FClientAttributeEffectContext EffectContext; // 0x00(0x98)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_ClientEffectBuffRefresh_Param
	{
	public:

		struct FCharacterBuff ClientBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_ClientBuffApplyAttributeEffect_Param
	{
	public:

		struct FClientAttributeEffectContext EffectContext; // 0x00(0x98)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_AddBuffDurationRate_Param
	{
	public:

		int32_t BuffId; // 0x00(0x04)
		float Rate; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_AddBuffDisableStatus_Param
	{
	public:

		enum class EBuffDisableTag NewBuffDisableTag; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_AddBuff_Param
	{
	public:

		uint32_t InBuffId; // 0x00(0x04)
		enum class ECharacterPart InCharacterPart; // 0x04(0x01)
		char pad_5[0x3]; // 0x05(0x03)
		struct AActor* SourceActor; // 0x08(0x08)
		struct AActor* MakerInstigator; // 0x10(0x08)
		int32_t SkillId; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		uint64_t ReturnValue; // 0x20(0x08)
	};

	struct Function_DFMGameplay_DFMBuffSystemComponent_AccurateNotifyBuffRefresh_Param
	{
	public:

		struct FCharacterBuff CurrBuff; // 0x00(0x70)
	};

	struct Function_DFMGameplay_DFMBuffUtil_ToUnixSecondTimestamp_Param
	{
	public:

		uint32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMBuffUtil_ToUnixMilliSecondTimestamp_Param
	{
	public:

		uint64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMBuffUtil_TimeFormat_Param
	{
	public:

		double Secs; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMBuffUtil_RemoveBuff_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		int32_t BuffId; // 0x08(0x04)
		enum class ECharacterPart BuffPart; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMBuffUtil_HasHadBuff_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		uint32_t BuffId; // 0x08(0x04)
		float TimeLimit; // 0x0c(0x04)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_DFMBuffUtil_HasBuff_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		uint32_t BuffId; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMBuffUtil_GetBuffIconName_Param
	{
	public:

		struct FName Buff; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMBuffUtil_GetBuffEndTimeByPart_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		struct FName BuffType; // 0x08(0x08)
		enum class ECharacterPart BuffPart; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		float ReturnValue; // 0x14(0x04)
	};

	struct Function_DFMGameplay_DFMBuffUtil_GetBuffEffectRowStruct_Param
	{
	public:

		uint32_t BuffId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FDFMBuffEffectRow ReturnValue; // 0x08(0x1e8)
	};

	struct Function_DFMGameplay_DFMBuffUtil_ContainAttributeAdditionByType_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		struct FName BuffType; // 0x08(0x08)
		enum class ECharacterPart BuffPart; // 0x10(0x01)
		bool ReturnValue; // 0x11(0x01)
	};

	struct Function_DFMGameplay_DFMBuffUtil_ContainAttributeAddition_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		uint32_t BuffId; // 0x08(0x04)
		enum class ECharacterPart BuffPart; // 0x0c(0x01)
		bool ReturnValue; // 0x0d(0x01)
	};

	struct Function_DFMGameplay_DFMBuffUtil_AddBuff_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		int32_t BuffId; // 0x08(0x04)
		enum class ECharacterPart BuffPart; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct AActor* SourceActor; // 0x10(0x08)
		struct AActor* MakerInstigator; // 0x18(0x08)
		int32_t SkillId; // 0x20(0x04)
		char pad_24[0x4]; // 0x24(0x04)
		int64_t ReturnValue; // 0x28(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_TestLog_Param
	{
	public:

		struct FString Text; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2WildRoamState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2WarnState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2ProwlState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2FireState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2BossGuardState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2BossBattleState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_Switch2BossAreaState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_ResetAISound_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_PlayFightAudioEvent_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_PlayAudioEventByName_Param
	{
	public:

		struct FName AudioEventName; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_PlayAlertAudioEvent_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2WildRoamState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2WarnState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2ProwlState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2FireState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2BossGuardState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2BossBattleState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnSwitch2BossAreaState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnShotByAI_Param
	{
	public:

		struct ADFMCharacter* AI; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnRep_ClosestBossName_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnRep_AudioState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_OnBossDead_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_NotifyFightAI_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_NotifyAlertAI_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_GetAliveEnemyAroundNum_Param
	{
	public:

		struct FVector SphereSpawnLocation; // 0x00(0x0c)
		float SphereRadius; // 0x0c(0x04)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_FindOtherAliveCharacterAround_Param
	{
	public:

		struct FVector SphereSpawnLocation; // 0x00(0x0c)
		float SphereRadius; // 0x0c(0x04)
		struct TArray<struct AActor*> OutActors; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_ExitBossBattle_Param
	{
	public:

		bool bBossDead; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_ExitBossArea_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_AmplifyAISound_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientAudioFSM_AddAIToAlertArray_Param
	{
	public:

		struct ADFMAICharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientLightControlComponent_RefreshCharacterLightParameter_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientLightControlComponent_RefreshAllCharactersLightParameter_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientLightControlComponent_OnLocalPlayerPawnCreated_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAmbientLightControlComponent_OnLocalCutSceneStateChange_Param
	{
	public:

		bool IsInCutscene; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientLightControlComponent_OnGPSequenceActorStatusChange_Param
	{
	public:

		struct AActor* Sequence; // 0x00(0x08)
		char Status; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMCharacterAmbientLightControlComponent_DebugSetCharacterEdgeLightSwitch_Param
	{
	public:

		float Enable; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMCharacterAttributeCenterComponent_OnAttributeSetReady_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterAttributeCenterComponent_AddHealth_Param
	{
	public:

		int32_t Health; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMCharacterAttributeCenterComponent_AddArmor_Param
	{
	public:

		int32_t ARMOR; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_UpdateFootStepAudioStyleID_Param
	{
	public:

		int64_t CurrExpertID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_SpawnClassEquipment_Param
	{
	public:

		uint64_t EquipID; // 0x00(0x08)
		uint32_t EquipCount; // 0x08(0x04)
		enum class EAttachPosition EquipAttachPosition; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_OnRep_ExpertID_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_OnRep_BattleClassType_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_OnPossessedBy_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_OnLiveStatusChanged_Param
	{
	public:

		struct AGPCharacterBase* OwnerCharacter; // 0x00(0x08)
		char OldStauts; // 0x08(0x01)
		char NewStatus; // 0x09(0x01)
	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_OnAsyncLoadArmedForceDataConfigTable_Param
	{
	public:

		struct FSoftObjectPath AssetRef; // 0x00(0x18)
		struct TArray<uint32_t> AbilityIdArr; // 0x18(0x10)
	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_OnAsyncLoadAbilityDataConfigTable_Param
	{
	public:

		struct FSoftObjectPath AssetRef; // 0x00(0x18)
		struct TArray<uint32_t> AbilityIdArr; // 0x18(0x10)
	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_ClearBattleClassBuff_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterBattleClassComponent_AddBattleClassBuff_Param
	{
	public:

		struct TArray<uint32_t> BuffIdArr; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMCharacterSequenceBindingComponent_SwitchUIMesh_Param
	{
	public:

		bool bValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMCharacterSequenceBindingComponent_ResetPassengerPosition_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterSequenceBindingComponent_OnOwnerCharacterReborn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterSequenceBindingComponent_OnOwnerCharacterDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMCharacterSequenceBindingComponent_GetOnVehicle_Param
	{
	public:

		bool bDrive; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMCharacterSequenceBindingComponent_GetOffVehicle_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMCharacterStrategyManager_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDFMCharacterStrategyManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMComBoardComponent_StopCharacterBittenAnim_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_ServerTryAssassinate_Param
	{
	public:

		struct FAssassinateRepInfo RepInfo; // 0x00(0x80)
	};

	struct Function_DFMGameplay_DFMComBoardComponent_PlayCharacterBittenAnim_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnTouchBushChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnSoftCoverStatusChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnHealthDamaged_Param
	{
	public:

		float Damage; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FTakeHitInfo TakeHitInfo; // 0x08(0xd0)
	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnDelaySetMontagePos_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnDelayDrawLeftHandPos_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnBasePoseStatusChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_OnAIFightAndFocusOnMe_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
		enum class EAIMsgType MsgType; // 0x08(0x01)
		bool AIFocusOnMe; // 0x09(0x01)
		char pad_A[0x2]; // 0x0a(0x02)
		struct FAIMsgExtendInfo AIMsgExtendInfo; // 0x0c(0x0c)
	};

	struct Function_DFMGameplay_DFMComBoardComponent_NotifyAlignAnim_Param
	{
	public:

		struct UAnimSequenceBase* FPPAnim; // 0x00(0x08)
		struct UAnimSequenceBase* TPPAnim; // 0x08(0x08)
		float AnimPos; // 0x10(0x04)
		float AlignTime; // 0x14(0x04)
		char pad_18[0x8]; // 0x18(0x08)
		struct FTransform RootAlignTransform; // 0x20(0x30)
		struct FVector LeftHadnPos; // 0x50(0x0c)
		float LeftHandAligntime; // 0x5c(0x04)
	};

	struct Function_DFMGameplay_DFMComBoardComponent_EndCrocodileBite_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_ClientTryAssassinateBtnRelease_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_ClientTryAssassinateBtnDown_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_ClientTryAssassinate_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMComBoardComponent_ClientCheckCanAssassinate_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMContainerDataCollector_OnRep_PlayerInContainerVolumeInfoArr_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMContainerDataCollector_OnPlayerLeaveMapContainerVolume_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		uint64_t VolumeId; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMContainerDataCollector_OnPlayerEnterMapContainerVolume_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		uint64_t VolumeId; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMContainerDataCollector_CollectHiddenInteractorData_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMContainerDataCollector_CheckContainerInsideVolume_Param
	{
	public:

		struct FVector BoxExtent; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTransform BoxTransform; // 0x10(0x30)
		struct FContainerVolumeData ContainerVolume; // 0x40(0x60)
	};

	struct Function_DFMGameplay_DFMContainerVolumeActor_OnOverlapEnd_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_DFMContainerVolumeActor_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_SetInteractorsEnable_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMContractManagerComponent_ServerVoteCancelContract_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
		int32_t TeamInnerIndex; // 0x04(0x04)
		enum class EVoteStatus VoteStatus; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_ServerUpdateTeamVoteMap_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FContractData ContractData; // 0x08(0x40)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_ServerRemoveContract_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_ServerAcceptContract_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
		int32_t ContractID; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_RandomContract_Param
	{
	public:

		bool bFromGM; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnRep_ContractLocDataArr_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnRep_AcceptedContractIDArray_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnMatchStart_Param
	{
	public:

		struct AActor* inActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnDelaySetInteractorEnable_Param
	{
	public:

		struct AActor* inActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnContractEndResetData_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		int64_t ContractID; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnCharacterOffline_Param
	{
	public:

		struct AGPPlayerState* GPPlayerState; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnCharacterEscaped_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
		struct AController* Controller; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_OnCharacterDied_Param
	{
	public:

		struct ACHARACTER* DeadCharactet; // 0x00(0x08)
		struct AActor* KillerActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_NtfServerRegisterInteractor_Param
	{
	public:

		struct AActor* InteractorBase; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_IsHighValueContract_Param
	{
	public:

		int64_t QuestID; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_GetTeammatesByContractID_Param
	{
	public:

		int32_t ContractID; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct TArray<struct AGPCharacter*> CharacterArray; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_GetContractRewardConfigStatic_Param
	{
	public:

		int64_t QuestID; // 0x00(0x08)
		int32_t MapID; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FSOLContractRewardRow ReturnValue; // 0x10(0xb0)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_GetContractRewardConfig_Param
	{
	public:

		int64_t QuestID; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMContractManagerComponent_DelayCancelVote_Param
	{
	public:

		int32_t TeamId; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMCoverStatics_IsTakingHighCover_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		bool ReturnValue; // 0x1b0(0x01)
	};

	struct Function_DFMGameplay_DFMCoverStatics_IsRightCover_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		bool ReturnValue; // 0x1b0(0x01)
	};

	struct Function_DFMGameplay_DFMCoverStatics_IsMiddleCover_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		bool ReturnValue; // 0x1b0(0x01)
	};

	struct Function_DFMGameplay_DFMCoverStatics_IsLeftCover_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		bool ReturnValue; // 0x1b0(0x01)
	};

	struct Function_DFMGameplay_DFMCoverStatics_IsCoverContextValid_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		bool ReturnValue; // 0x1b0(0x01)
	};

	struct Function_DFMGameplay_DFMCoverStatics_IsCoverContextActivated_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		bool ReturnValue; // 0x1b0(0x01)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetUnderCoverYaw_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		float ReturnValue; // 0x1b0(0x04)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetUnderCoverTransform_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		struct FTransform ReturnValue; // 0x1b0(0x30)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetUnderCoverLocation_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		struct FVector ReturnValue; // 0x1b0(0x0c)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetCoverPointYaw_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		float ReturnValue; // 0x1b0(0x04)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetCoverPointLocation_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		struct FVector ReturnValue; // 0x1b0(0x0c)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetCoverLeanYaw_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		float ReturnValue; // 0x1b0(0x04)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetCoverLeanTransform_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		struct FTransform ReturnValue; // 0x1b0(0x30)
	};

	struct Function_DFMGameplay_DFMCoverStatics_GetCoverLeanLocation_Param
	{
	public:

		struct FDFMCoverContext CoverContext; // 0x00(0x1b0)
		struct FVector ReturnValue; // 0x1b0(0x0c)
	};

	struct Function_DFMGameplay_DFMDataEntity_SceneWeaponInfo_SceneWeaponInfoChanged_Param
	{
	public:

		bool bIsDS; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct ADFScenceWeaponPawn* InSceneWeapon; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_SceneWeaponInfo_OnServerSceneWeaponMarkInfoUpdate_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMDataEntity_TeamCharacterHealth_OnServerPlayerHealthChanged_Param
	{
	public:

		struct AActor* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_TeamCharacterHealth_OnServerPlayerArmorHealthChanged_Param
	{
	public:

		struct AActor* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_TeamCharacterHealth_OnServerLocalPlayerIsNeedRescueChanged_Param
	{
	public:

		struct AActor* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_TeamCharacterHealth_OnServerLocalPlayerIsAliveChanged_Param
	{
	public:

		struct AActor* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_TeamCharacterHealth_OnServerLocalPlayerImpendingDeathHealthChanged_Param
	{
	public:

		struct AActor* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_TeamCharacterHealth_OnHealthInfoChanged_Param
	{
	public:

		struct AActor* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_VehicleInfo_OnServerSceneVehicleMarkInfoUpdate_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMDataEntity_VehicleInfo_OnPlayerGetOnVehicle_Param
	{
	public:

		struct AActor* CHARACTER; // 0x00(0x08)
		struct AActor* Vehicle; // 0x08(0x08)
		struct FName Seat; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMDataEntity_VehicleInfo_OnPlayerGetOffVehicle_Param
	{
	public:

		struct AActor* CHARACTER; // 0x00(0x08)
		struct AActor* Vehicle; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMDesSkeletalMeshComponent_OnHitEffect_Param
	{
	public:

		struct UPrimitiveComponent* ThisComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		struct FVector NormalImpulse; // 0x18(0x0c)
		struct FHitResult Hit; // 0x24(0x88)
	};

	struct Function_DFMGameplay_DFMDesStaticMeshComponent_UpdateMeshDestructionStatus_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMDesStaticMeshComponent_ClientSetSubMeshDestructed_Param
	{
	public:

		int32_t MeshIndex; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMDSLogic_OnServerMatchEnd_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMDSLogic_IsCloseAiHint_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMDSLogic_GetScriptedMatchType_Param
	{
	public:

		int64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMDSLogic_GetPlayerAILevel_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMDSLogic_GetMatchType_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMDSLogic_GetGameRule_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMDSLogic_GetDFMDSLogic_Param
	{
	public:

		struct UObject* WorldContextObjec; // 0x00(0x08)
		struct UDFMDSLogic* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMEnteringBattleComponent_OnPrepareEnteringBattle_Param
	{
	public:

		struct APlayerController* InPlayerController; // 0x00(0x08)
		struct UCustomWorldComposition* InWorldComposition; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMEnteringBattleComponent_OnBeginEnteringBattle_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMEQSGenerator_HorizontalLineToQuerier_ShouldAvoidPoint_Param
	{
	public:

		struct FVector avoidTargetPoint; // 0x00(0x0c)
		struct FVector testingPoint; // 0x0c(0x0c)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_DFMExpDataComponent_OnKillPlayer_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
	};

	struct Function_DFMGameplay_DFMGameController_NotifyDsClientLogout_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameController_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct ADFMGameController* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameController_ClientQuit_Param
	{
	public:

		enum class EMatchOverReason QuitReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameDataCenterComponent_ClientSetPlayerData_String_Param
	{
	public:

		uint64_t Uin; // 0x00(0x08)
		struct FName DataName; // 0x08(0x08)
		struct FString Data_String; // 0x10(0x10)
		bool bReplicate; // 0x20(0x01)
	};

	struct Function_DFMGameplay_DFMGameDataCenterComponent_ClientSetPlayerData_Int32_Param
	{
	public:

		uint64_t Uin; // 0x00(0x08)
		struct FName DataName; // 0x08(0x08)
		int32_t Data_Int; // 0x10(0x04)
		bool bReplicate; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMGameDataCenterComponent_ClientSetPlayerData_Float_Param
	{
	public:

		uint64_t Uin; // 0x00(0x08)
		struct FName DataName; // 0x08(0x08)
		float Data_float; // 0x10(0x04)
		bool bReplicate; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMGameDataUtil_SetPlayerData_Param
	{
	public:

		struct APlayerController* PlayerController; // 0x00(0x08)
		uint64_t PlayerUin; // 0x08(0x08)
		struct FName DataName; // 0x10(0x08)
		int32_t Data_Int; // 0x18(0x04)
		bool bReplicated; // 0x1c(0x01)
	};

	struct Function_DFMGameplay_DFMGameDataUtil_GetPlayerData_Param
	{
	public:

		struct APlayerController* PlayerController; // 0x00(0x08)
		uint64_t PlayerUin; // 0x08(0x08)
		struct FName DataName; // 0x10(0x08)
		int32_t Data_Int; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_DFMGameplay_DFMGameDataUtil_AddKnockDownInfo_Param
	{
	public:

		struct UWorld* World; // 0x00(0x08)
		struct AGPCharacter* KillerCharacter; // 0x08(0x08)
		struct AGPCharacter* VictumCharacter; // 0x10(0x08)
		float DamageAmount; // 0x18(0x04)
	};

	struct Function_DFMGameplay_DFMGameModeGameplaySubsystem_SetCharacterEdgeLightSwitchOnLightMaterialCollection_Param
	{
	public:

		float Value; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameModeGameplaySubsystem_SetCharacterEdgeLightDistanceFator_Param
	{
	public:

		float Value; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameModeGameplaySubsystem_SetAddLightInttensityValueOnLightMaterialCollection_Param
	{
	public:

		float Value; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameModeGameplaySubsystem_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct ADFMGameModeGameplaySubsystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_TryWorldLocation2ScreenPos_Param
	{
	public:

		struct FVector2D OutScreenPos2D; // 0x00(0x08)
		bool OutbOnCameraBack; // 0x08(0x01)
		bool OutbIsOutOfSceen; // 0x09(0x01)
		char pad_A[0x2]; // 0x0a(0x02)
		struct FVector InWorldLoc; // 0x0c(0x0c)
		struct AGPPlayerController* PlayerController; // 0x18(0x08)
		struct UWorld* World; // 0x20(0x08)
		bool ReturnValue; // 0x28(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_TryGetInteractorScreenPosByActor_Param
	{
	public:

		struct FVector2D InteractorPos2D; // 0x00(0x08)
		struct AActor* Target; // 0x08(0x08)
		struct AGPPlayerController* PlayerController; // 0x10(0x08)
		struct UWorld* World; // 0x18(0x08)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_TouchPointToWidgetLocal_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector2D TouchPoint; // 0x08(0x08)
		struct UCanvasPanel* Panel; // 0x10(0x08)
		struct FVector2D ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SwitchToWeaponByIndex_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		int32_t Index; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_StopCurrentExitCutScene_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_ShowStaticIconByItemInfo_Param
	{
	public:

		struct FInventoryItemInfo ItemInfo; // 0x00(0x538)
		struct UImage* TargetImage; // 0x538(0x08)
		bool bLazy; // 0x540(0x01)
		bool bWhite; // 0x541(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_ShowRuntimeIconByFItemID_Param
	{
	public:

		struct FItemID ItemID; // 0x00(0x18)
		struct UImage* Image; // 0x18(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_ShowRuntimeIcon_Param
	{
	public:

		int64_t ItemID; // 0x00(0x08)
		struct UImage* Image; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_ShowIconByItemInfo_Param
	{
	public:

		struct FInventoryItemInfo ItemInfo; // 0x00(0x538)
		struct UImage* TargetImage; // 0x538(0x08)
		bool bLazy; // 0x540(0x01)
		bool bWhite; // 0x541(0x01)
		bool bIconShadow; // 0x542(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_ShowDebugMsgFromCharacter_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		struct FText ReturnValue; // 0x08(0x18)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SetUIBatchState_Param
	{
	public:

		bool bInOpen; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SetStaticVelocityDrag_Param
	{
	public:

		float NewStaticVelocityDrag; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SetShowDamageText_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SetItemDurabilityByID_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		struct FName ItemID; // 0x08(0x08)
		int32_t NewDurability; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SetFrictionCoefficient_Param
	{
	public:

		float NewFrictionCoefficient; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SetCharacterFirstCPD_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		float CPDValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SendPresetChatByType_Param
	{
	public:

		struct UWorld* InWorld; // 0x00(0x08)
		struct AGPPlayerController* InLocalPlayerController; // 0x08(0x08)
		enum class EMarkingChatType InMarkingChatType; // 0x10(0x01)
		enum class EChatType InChatType; // 0x11(0x01)
		char pad_12[0x6]; // 0x12(0x06)
		struct TArray<int32_t> ExtraParams; // 0x18(0x10)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_SelectAllAIOfSameType_Param
	{
	public:

		struct ADramaArea* Drama; // 0x00(0x08)
		struct UClass* ActorClass; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_PrintBPLog_Param
	{
	public:

		struct FString Text; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_PreloadShowIconByItemInfo_Param
	{
	public:

		struct FInventoryItemInfo ItemInfo; // 0x00(0x538)
		struct UImage* TargetImage; // 0x538(0x08)
		bool bLazy; // 0x540(0x01)
		bool bWhite; // 0x541(0x01)
		bool bIconShadow; // 0x542(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_OpenMessageDialog_Param
	{
	public:

		struct FString Output; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_LoadGameplayLevel_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_IsTouchPressed_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		enum class ETouchIndex FingerIndex; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_IsSOLMapSoloGame_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_IsSOLMapLevel2_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_IsPlayerHoldingBlueprintWeapon_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int64_t InPlayerUin; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_IsMP_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_IsBlueprintWeaponMainHudShowing_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GMPlayExitCutScene_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t ExitPointId; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_ResetAbility_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_Reset_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_PlayMontage_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		struct FString AnimPathNames; // 0x08(0x10)
		struct FString AnimationPlayTypes; // 0x18(0x10)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_KillMeNoImPendingDeath_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_KillMeForAI_Param
	{
	public:

		struct ADFMAICharacter* AICharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_KillMe_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_HurtMe_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		float InHurtValue; // 0x08(0x04)
		float InImpendingDeathHurtValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_ClearAbilityCD_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AddSpeed_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		float AddedValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AddHP_Param
	{
	public:

		struct AController* GPPlayerController; // 0x00(0x08)
		float AddedValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityE_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityD_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityC_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityByType_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		enum class ESkillLogicType Type; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityByID_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		int32_t ID; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityByExpertID_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
		int64_t ExpertId; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityB_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_AbilityA_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GM_Ability_Param
	{
	public:

		struct AGPPlayerController* GPPlayerController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetTotalImpendingDeathTime_Param
	{
	public:

		struct ADFMCharacter* ImpendingDeathCharater; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetTeamMateCharacterDSLocationByUin_Param
	{
	public:

		struct AGPSceneActorReplicator* GPSceneActorReplicator; // 0x00(0x08)
		struct AGPPlayerState* PlayerState; // 0x08(0x08)
		int64_t InPlayerUin; // 0x10(0x08)
		struct FVector OutDSLocation; // 0x18(0x0c)
		float OutRot; // 0x24(0x04)
		struct FIntVector OriginLocation; // 0x28(0x0c)
		bool ReturnValue; // 0x34(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetStaticVelocityDrag_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetSkillDataRowBySkillId_Param
	{
	public:

		int32_t InSkillID; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FSkillDataRow ReturnValue; // 0x08(0x588)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetRuntimeAllModules_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetPlayerHoldingPveRpg_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int64_t InPlayerUin; // 0x08(0x08)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetMapLevel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetLocalTeamIndex_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetLocalTeamID_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetLocalCampID_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetImpendingDeathTimeByBuffId_Param
	{
	public:

		struct ADFMCharacter* ImpendingDeathCharater; // 0x00(0x08)
		uint32_t InBuffId; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetImpendingDeathTime_Param
	{
	public:

		struct ADFMCharacter* ImpendingDeathCharater; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetImpendingDeathBuffOperateValue_Param
	{
	public:

		uint32_t InBuffId; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetFrictionCoefficient_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetDFMGamePlayMode_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		enum class EDFMGamePlayMode ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetCharacterIconColor_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		int32_t Index; // 0x08(0x04)
		bool bIsLocalPlayer; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FLinearColor ReturnValue; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_GetBattleField_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDFMBattleFieldSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_FindNearestPlayerStartRotation_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct FVector Location; // 0x08(0x0c)
		float Tolerance; // 0x14(0x04)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_EasyRemoveRemoveInventoryByLocation_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		int32_t pos; // 0x08(0x04)
		int32_t PosX; // 0x0c(0x04)
		int32_t PosY; // 0x10(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_EasyRemoveRemoveInventory_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		struct FName ItemID; // 0x08(0x08)
		int32_t Num; // 0x10(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_EasyAddAddInventory_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		struct FName ItemID; // 0x08(0x08)
		int32_t AttachPos; // 0x10(0x04)
		int32_t Num; // 0x14(0x04)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_CheckNavType_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct FVector TargetLoc; // 0x08(0x0c)
		enum class ENavAreaFlag AreaFlag; // 0x14(0x01)
		char pad_15[0x3]; // 0x15(0x03)
		struct FVector ProjectExt; // 0x18(0x0c)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_CallLuaModuleFunction_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct FString ModuleName; // 0x08(0x10)
		struct FString FuncName; // 0x18(0x10)
		struct TArray<struct FLuaBPVar> InParams; // 0x28(0x10)
		struct FLuaBPVar ReturnValue; // 0x38(0x20)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_AttemptUseItemByID_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		struct FName ItemID; // 0x08(0x08)
		enum class ECharacterPart Part; // 0x10(0x01)
		bool ReturnValue; // 0x11(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_AttemptUseFirstFoodItem_Param
	{
	public:

		struct ADFMCharacter* Target; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayBlueprintHelper_AISpawnAnalysis_Param
	{
	public:

		struct UClass* ActorClass; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayDelegates_TryMarkMapFromLua_Param
	{
	public:

		struct FName TargetName; // 0x00(0x08)
		struct FVector Location; // 0x08(0x0c)
		bool bIsAdd; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayDelegates_TryGMSetPlayerNameHD_Param
	{
	public:

		int32_t TeamIndex; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FText InName; // 0x08(0x18)
	};

	struct Function_DFMGameplay_DFMGameplayDelegates_GetUDFMGameplayDelegates_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UDFMGameplayDelegates* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayDelegates_Get_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UDFMGameplayDelegates* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_TestDelegates_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnVersionUpdateEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FString Ext; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnResourceUpdateEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnPreStartLuaVMEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnPreloadResourceEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnPacUpdateEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnOpenHealthTipEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnLuaHotfixEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnLoadAnnounceEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnInstallPathCheckEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnGetCDNInfoEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnDeviceCheckEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCppHotfixEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCheckVideoMemoryEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCheckNetConnectionEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCheckMemoryEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCheckFreeSpaceBeforeLoginEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCheckAppVersionChangeEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_OnCheckAppVersionChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameplayGlobalDelegates_Get_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UDFMGameplayGlobalDelegates* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMGameRuleComponent_RemoveCharacterComponents_Param
	{
	public:

		struct AController* DFMController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameRuleComponent_RemoveAllCharacterComponents_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameRuleComponent_RebornPlayer_Param
	{
	public:

		struct AController* PlayerController; // 0x00(0x08)
		bool RefillArmor; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMGameRuleComponent_OnStartMatchWithAllPlayerReady_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameRuleComponent_OnDeactiveRule_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameRuleComponent_OnActiveRule_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameRuleComponent_DeactivateRule_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameRuleComponent_AddCharacterComponents_Param
	{
	public:

		struct AController* DFMController; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMGameRuleComponent_AddAllCharacterComponents_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameRuleComponent_ActivateRule_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameSDKInterface_OnCheckNetConnectionEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameSDKInterface_OnCheckFreeSpaceBeforeLoginEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameSDKInterface_OnCheckAppVersionChangeEnd_Param
	{
	public:

		bool flg; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGameSDKInterface_OnCheckAppVersionChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGameSDKInterface_BindPreLoginEvents_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGuideManager_OpenGuideDialogUIWithCallback_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMGuideManager_NtfGuidePopWindowClose_Param
	{
	public:

		int32_t GuidePopWindowId; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGuideManager_NtfGuideEnd_Param
	{
	public:

		enum class EGuideStage GuideStageId; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMGuideManager_GetElapsedTime_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMGuideManager_Get_Param
	{
	public:

		struct UWorld* WorldContext; // 0x00(0x08)
		struct UDFMGuideManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMHidingBodyComponent_OnRep_InDustbinBoxID_Param
	{
	public:

		int32_t InPreID; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_ServerSetHighValueItemInspectAnimFinished_Param
	{
	public:

		bool bValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_ServerSetHighValueItem_Param
	{
	public:

		struct FName ItemID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_ResetInspectNotGetWeaponTotalCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_OnReq_HighValueItemId_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_NetMultiBroadcastRestartHighValueItemInspect_Param
	{
	public:

		struct FName ItemID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_GetInspectNotGetWeaponTotalCount_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_ClientInterruptHighValueItemInspect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_CheckIfCanExecuteHighValueItemInspect_Param
	{
	public:

		bool bHighValueItemNeedInspection; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMHighValueInspectionComponent_AddInspectNotGetWeaponTotalCount_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_TickRippleEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMHitEffectComponent_PlayMakeHitAudio_Param
	{
	public:

		enum class EHitEventType InHitEffectType; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_OnTakeWeaponDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResultInfo; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_OnServerWeaponBulletImpact_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMHitEffectComponent_OnMakerMakeDamageFeedback_Param
	{
	public:

		struct FDamageResultInfo DamageResultInfo; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_OnLoadHitAudioTable_Param
	{
	public:

		struct UDataTable* DataTable; // 0x00(0x08)
		enum class EBeHitedType BeHitedType; // 0x08(0x01)
		enum class EDamageType DamageType; // 0x09(0x01)
		char pad_A[0x6]; // 0x0a(0x06)
		struct UGPAudioEventAsset* GPAudioEvent; // 0x10(0x08)
		struct AActor* TargetCharacter; // 0x18(0x08)
		struct AActor* SourceCharacter; // 0x20(0x08)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_OnLoadAudioAssets_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> InPathsjectPath; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_OnHitFeedBackShow_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMHitEffectComponent_LoadAudioAssets_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMHitEffectComponent_LiveStatusChanged_Param
	{
	public:

		struct AGPCharacterBase* MakerActor; // 0x00(0x08)
		char OldStatus; // 0x08(0x01)
		char NewStatus; // 0x09(0x01)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_UpdateData_MPWeaponLevel_Param
	{
	public:

		uint64_t InWeaponId; // 0x00(0x08)
		int32_t InAddExp; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_UpdateData_MPMedalLevel_Param
	{
	public:

		enum class EModalPointType MedalType; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t LevelNum; // 0x04(0x04)
		int32_t CurMedalLevel; // 0x08(0x04)
		float NextMedalProg; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_UpdateData_GameModeLevelMP_Param
	{
	public:

		int32_t InAddExp; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnWeaponLevelUpShow_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnRep_UnlockedWeaponsIDInGame_Param
	{
	public:

		struct TArray<uint64_t> OldUnlockedWeaponsIDInGame; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnRep_CurMedalsLevelStruct_Param
	{
	public:

		struct FMPMedalRepStruct OldMedalsLevelStruct; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnRep_CurGameModeLevelMP_Param
	{
	public:

		struct FGameModeLevelConfig OldGameModeLevelMP; // 0x00(0x20)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnMPLevelUpShow_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnMedalLevelUpShow_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_OnCollectionWeaponUsingTime_Param
	{
	public:

		uint64_t PlayerUin; // 0x00(0x08)
		uint64_t WeaponID; // 0x08(0x08)
		float AddTime; // 0x10(0x04)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_Notify_MPMedalLevelUp_Param
	{
	public:

		enum class EModalPointType MedalType; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t MedalLevel; // 0x04(0x04)
		int32_t AddScore; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_InitPlayerData_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_InitData_MPMedalLevel_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_InitData_MP_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_GetUnlockedWeaponsIDInGame_Param
	{
	public:

		struct TArray<uint64_t> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_GetMedalShowData_Param
	{
	public:

		struct TMap<enum class EModalPointType, struct FMPMedalLevel> OutMap; // 0x00(0x50)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_ClientOnNotifyMPWeaponLevelUp_Param
	{
	public:

		uint64_t WeaponID; // 0x00(0x08)
		int32_t NewLevel; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct TArray<uint64_t> UnlockedPartsID; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_ClientOnNotifyMPMedalLevelUp_Param
	{
	public:

		enum class EModalPointType MedalType; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t MedalLevel; // 0x04(0x04)
		int32_t AddScore; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMInGameUpgradeComponent_ClientOnNotifyGameModeLevelMPLevelUp_Param
	{
	public:

		int32_t NewLevel; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct TArray<uint64_t> WeaponsID; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMInputReloadLogic_OnShowRouletteDelegate_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_StartGetOnHelicopterAction_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_ShowBlackScreen_Param
	{
	public:

		float InTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_ResetFromHelicopterAction_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_PrespawnGPSequence_Param
	{
	public:

		struct AGPSequenceActor* GPSequenceActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_OnSequencePrespawnActorCreate_Param
	{
	public:

		struct AActor* PrespawnActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_OnSequenceEndPlay_Param
	{
	public:

		struct AGPSequenceActor* SeqActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_OnSequenceBeginPlay_Param
	{
	public:

		struct AGPSequenceActor* SeqActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_OnLevelSequenceCreate_Param
	{
	public:

		struct ALevelSequenceActor* LevelSequenceActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_LoadingReadyNotifyServer_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_InitSeamlessEnter_Param
	{
	public:

		bool bInit; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_HideBlackScreen_Param
	{
	public:

		float InTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_HasFinished3CGuide_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_BP_ShowBlackScreen_Param
	{
	public:

		float InTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_BP_HideBlackScreen_Param
	{
	public:

		float InTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMIrisEnterComponent_AllPlayerReady_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMItemSearchSubSystem_OnServerItemMoveNotify_Param
	{
	public:

		struct FItemMoveCmd ItemMoveCmd; // 0x00(0x120)
	};

	struct Function_DFMGameplay_DFMItemSearchSubSystem_OnCharacterDoDying_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMItemSearchSubSystem_Get_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct UDFMItemSearchSubSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMItemSourceSubSystem_Get_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct UDFMItemSourceSubSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMItemSourceSubSystem_DumpAllItemSource_Param
	{
	public:

		struct FString ItemIDPrefix; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMItemSourceSubSystem_DumpAllItemFlows_Param
	{
	public:

		struct FString ItemIDPrefix; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMItemSubsystem_OnLoadAnimationFinishCallback_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> SoftObjectPaths; // 0x00(0x10)
		uint64_t ItemID; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMItemSubsystem_GetDFMItemSubsystem_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UDFMItemSubsystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMLootingSubSystem_Get_Param
	{
	public:

		struct UObject* WorldContextObj; // 0x00(0x08)
		struct UDFMLootingSubSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMDropDurConfigSubSystem_GetInstance_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDFMDropDurConfigSubSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_SetIfBelowManholeCover_Param
	{
	public:

		bool bValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_SetIfAboveManholeCover_Param
	{
	public:

		bool bValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_SetCanInteract_Param
	{
	public:

		bool bValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_SetCanClimbLadder_Param
	{
	public:

		bool bValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_OnRep_IfBelowManholeCover_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_GetIfBelowManholeCover_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMManholeCoverTriggerComponent_GetIfAboveManholeCover_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_SetMapIconData_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName IconName; // 0x08(0x08)
		struct FDFMMapIconData Data; // 0x10(0x38)
		bool ReturnValue; // 0x48(0x01)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_RemoveIconFromMapByController_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMapIconViewController* IconViewController; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_RemoveIconFromMap_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName IconName; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_RemoveAllContractMapItemControllers_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct TArray<struct FName> ContractNames; // 0x08(0x10)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetOrAddMapItemControllerByData_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FDFMMapIconData Data; // 0x08(0x38)
		struct UMapIconViewController* ReturnValue; // 0x40(0x08)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetOrAddMapItemController_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName IconName; // 0x08(0x08)
		enum class EDFMMapIconType MapIconType; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		struct FVector IconLocation; // 0x14(0x0c)
		struct AActor* IconActor; // 0x20(0x08)
		float RotateAngle; // 0x28(0x04)
		char pad_2C[0x4]; // 0x2c(0x04)
		struct UMapIconViewController* ReturnValue; // 0x30(0x08)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetMapIconData_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName IconName; // 0x08(0x08)
		struct FDFMMapIconData Data; // 0x10(0x38)
		bool ReturnValue; // 0x48(0x01)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetMapIconControllerByPos_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector pos; // 0x08(0x0c)
		char pad_14[0x4]; // 0x14(0x04)
		struct UMapIconViewController* ReturnValue; // 0x18(0x08)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetMapIconControllerByName_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName IconName; // 0x08(0x08)
		struct UMapIconViewController* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetMapIconControllerByActor_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct AActor* TargetActor; // 0x08(0x08)
		struct UMapIconViewController* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_GetCurrentModeMapIconDataTableType_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMMapHudUtil_CheckMapInfoComponentExist_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMMarkerControllerComponent_ServerMarkContainerItem_Param
	{
	public:

		struct AActor* ContainerActor; // 0x00(0x08)
		uint64_t ItemGid; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMMarkerManager_OnGuideSolPlayerFreeOperate_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMMarkerManager_OnClientDFMGamePlayModeChanged_Param
	{
	public:

		enum class EDFMGamePlayMode InNewGamePlayMode; // 0x00(0x01)
	};

	struct Function_DFMGameplay_NavArea_Door_UpdateDoorNavAreaClass_Param
	{
	public:

		struct UBoxComponent* DoorNavArea; // 0x00(0x08)
		bool bOpen; // 0x08(0x01)
		bool bNeedKey; // 0x09(0x01)
	};

	struct Function_DFMGameplay_DFMOutLineEffectComponent_OnCharacterAvatarChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMOutLineEffectComponent_ClientUpdateItemOutLineData_Param
	{
	public:

		struct TArray<struct FAbilityItemOutLineData> ServerItemOutLineDataList; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMParachuteComponent_OnRep_HasAIParachuteBegun_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMParachuteComponent_Multicast_OnAIEndParachute_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPerkComponent_OnPerkSPEffectChanged_Param
	{
	public:

		enum class EPerkSpecialEffectType SpecialEffectType; // 0x00(0x01)
		bool bTrigger; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMPerkInstance_OnBuffRemoved_Param
	{
	public:

		uint32_t InBuffId; // 0x00(0x04)
		enum class ECharacterPart InCharacterPart; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_ServerRecordOpenBulletRoulette_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_ServerIncreaseXPPChangeCount_Param
	{
	public:

		bool bSetToFPP; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSwitchToMeleeSuccess_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSOLHealthStateChange_Param
	{
	public:

		struct AGPCharacterBase* Target; // 0x00(0x08)
		enum class ECharacterPart Part; // 0x08(0x01)
		enum class ECharacterPartHealthState OldState; // 0x09(0x01)
		enum class ECharacterPartHealthState NewState; // 0x0a(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSOLBulletSlotRightChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSOLBulletSlotLeftChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnServerNotifyRemoveEquip_Param
	{
	public:

		enum class EEquipmentType EquipType; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnServerNotifyAddEquip_Param
	{
	public:

		enum class EEquipmentType EquipType; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSendKillEvent_Param
	{
	public:

		struct FKillInfo NewAddKillInfo; // 0x00(0x148)
		struct UGPModularWeaponDesc* WeaponDesc; // 0x148(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSendHpChangeEvent_Param
	{
	public:

		struct AActor* Owner; // 0x00(0x08)
		int32_t CurrentValue; // 0x08(0x04)
		int32_t MaxValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnSendArmChangeEvent_Param
	{
	public:

		struct AActor* Owner; // 0x00(0x08)
		float CurrentValue; // 0x08(0x04)
		float MaxValue; // 0x0c(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnKnockDownedInfoNtf_Param
	{
	public:

		struct FKillInfo NewAddKillInfo; // 0x00(0x148)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_OnHealthChanged_Param
	{
	public:

		int32_t DeltaHealth; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_GetSOLWatchFightRecord_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_EndSOLWatchFightRecord_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_bIsInFightState_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddTeammateSaveNum_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddSOLWatchFightRecord_Param
	{
	public:

		uint64_t WatchPlayerUin; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddRebornNum_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddRebornCount_Param
	{
	public:

		struct APlayerController* Conroller; // 0x00(0x08)
		struct APawn* Pawn; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddPlayerSaveNum_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddMachineGunUseCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddLongDistHitCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddKillCount_Param
	{
	public:

		struct AGPCharacterBase* Pawn; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddHitCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddHeadshotHitCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddFireCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddDeathCount_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddDeadTeammateSaveNum_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddCapturePointCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddBreakableCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddBeRescueNum_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataAnalysisComponent_AddAmmoBoxUseCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerDataCenterComponent_ClientSetPlayerData_String_Param
	{
	public:

		uint64_t Uin; // 0x00(0x08)
		struct FName DataName; // 0x08(0x08)
		struct FString Data_String; // 0x10(0x10)
		bool bReplicate; // 0x20(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataCenterComponent_ClientSetPlayerData_Int32_Param
	{
	public:

		uint64_t Uin; // 0x00(0x08)
		struct FName DataName; // 0x08(0x08)
		int32_t Data_Int; // 0x10(0x04)
		bool bReplicate; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerDataCenterComponent_ClientSetPlayerData_Float_Param
	{
	public:

		uint64_t Uin; // 0x00(0x08)
		struct FName DataName; // 0x08(0x08)
		float Data_float; // 0x10(0x04)
		bool bReplicate; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_ServerOnPlayerDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_ServerCaculateResurrectionData_Param
	{
	public:

		int32_t StatisticalTimeRange; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_ResetTotalResurrectCoinCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_ResetResurrectCoin_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnUseResurrectionCoinResultNtf_Param
	{
	public:

		bool bSuccess; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnUseResurrectionCoin_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnStageStateChanged_Param
	{
	public:

		struct AGPQuestStage* InStage; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnServerRebornAllPlayer_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnServerReborn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnRep_EnableUseResurrectionMinTime_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnPlayerReborn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnClientLocalPlayerReborn_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_OnClientLocalPlayerDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_IsTempCoinEnough_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetUseResurrectCoinColdTimeStep_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetTotalResurrectionCoinCount_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetResurrectionTempCoin_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetResurrectionCoinCount_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetRemainUseResurrectionCoinColdDownTime_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetRemainResurrectTime_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetRebornCount_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerResurrectComponent_GetAutoResurrectionTimeStep_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerRouteServerComponent_QuestClientProxyNotifyServerMediaEnd_Param
	{
	public:

		int64_t PlayerUin; // 0x00(0x08)
		uint32_t MediaNameCrc; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerRouteServerComponent_QuestClientProxyNotifyServerLevelsLoaded_Param
	{
	public:

		uint64_t PlayerUin; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerRouteServerComponent_QuestClientProxyNotifyServerInterrupt_Param
	{
	public:

		struct FGameplayTag InterruptTag; // 0x00(0x08)
		struct ACHARACTER* OperatorCharacter; // 0x08(0x08)
		struct AInteractorBase* Interactor; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerRouteServerComponent_QuestClientProxyNotifyHudViewLoaded_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_SetPlayerMatchOver_Param
	{
	public:

		enum class EMatchOverReason InMatchOverReason; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerState_SetMatchOverReason_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerState_SetCurrAvatarId_Param
	{
	public:

		uint64_t InSameTeamAvatarId; // 0x00(0x08)
		uint64_t InDiffTeamAvatarId; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerState_SetAllocatedExits_Param
	{
	public:

		struct TArray<struct APlayerExitBase*> InAllocatedExits; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_PlayerTitle_Param
	{
	public:

		uint64_t oldPlayerTitle; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_PlayerMatchInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_HeroIDChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_HeroAccessoryInfo_Param
	{
	public:

		struct FHeroAccessoryItemsStruct OldInfo; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_HalfJoin_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_ExitState_Param
	{
	public:

		enum class EExitState LastExitState; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_DeadthDamageInfos_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_AssassinateSkinIDInfos_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_OnRep_AllocatedExits_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_OnGVoiceMicAndSpeakerStateChanged_Param
	{
	public:

		struct FString OpenId; // 0x00(0x10)
		bool bMic; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		int32_t ButtonType; // 0x14(0x04)
	};

	struct Function_DFMGameplay_DFMPlayerState_OnClientHalfGameEntry_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_InitMatchStatus_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_InitHeroAccessoryInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_InGameUnlockWeapon_Param
	{
	public:

		uint64_t WeaponItemId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerState_GetCurrAvatarId_Param
	{
	public:

		bool isSameTeam; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		uint64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerState_GetCurPlayerTitle_Param
	{
	public:

		uint64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMPlayerState_GetCurHeroAccessoryItems_Param
	{
	public:

		struct TArray<struct FHeroAccessoryItem> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMPlayerState_ClientReadyToPlayNotify_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPlayerState_CallServerSetPlayerMatchOver_Param
	{
	public:

		enum class EMatchOverReason InMatchOverReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMPriorityMarker_RemovePriorityMarker_Param
	{
	public:

		int32_t Handler; // 0x00(0x04)
		bool Show; // 0x04(0x01)
	};

	struct Function_DFMGameplay_DFMPriorityMarker_HidePriorityMarker_Param
	{
	public:

		int32_t Handler; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMPriorityMarker_GetMarkerCode_Param
	{
	public:

		int32_t Code; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_DFMPriorityMarker_GetMarker_Param
	{
	public:

		int32_t Code; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct AGPQuestMarkerBase* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPriorityMarker_Get_Param
	{
	public:

		struct UWorld* WorldContext; // 0x00(0x08)
		struct UDFMPriorityMarker* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPriorityMarker_AddPriorityMarker_Param
	{
	public:

		struct UClass* MarkerClass; // 0x00(0x08)
		struct AActor* TargetActor; // 0x08(0x08)
		struct FVector OffsetLocation; // 0x10(0x0c)
		int32_t Code; // 0x1c(0x04)
		float DistanceThreshold; // 0x20(0x04)
		enum class EGPQuestActionMarkerType markerType; // 0x24(0x01)
		enum class EDFMMarkerPriority Priority; // 0x25(0x01)
		char pad_26[0x2]; // 0x26(0x02)
		float MarkerScale; // 0x28(0x04)
		struct FName SocketName; // 0x2c(0x08)
		int32_t ReturnValue; // 0x34(0x04)
	};

	struct Function_DFMGameplay_DFMPriorityWidgetLoader_OnViewLoaded_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMPriorityWidgetLoader_OnTimeRemove_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMPriorityWidgetSubsystem_RemovePriorityWidget_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		int32_t Handler; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMPriorityWidgetSubsystem_GetWidgetIns_Param
	{
	public:

		int32_t Handler; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct UUserWidget* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPriorityWidgetSubsystem_Get_Param
	{
	public:

		struct UWorld* WorldContext; // 0x00(0x08)
		struct UDFMPriorityWidgetSubsystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMPriorityWidgetSubsystem_AddPriorityWidget_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UClass* WidgetClass; // 0x08(0x08)
		int32_t PriorityNum; // 0x10(0x04)
		float Time; // 0x14(0x04)
		bool unique; // 0x18(0x01)
		enum class ESlateVisibility Visible; // 0x19(0x01)
		char pad_1A[0x2]; // 0x1a(0x02)
		int32_t ReturnValue; // 0x1c(0x04)
	};

	struct Function_DFMGameplay_DFMProcessAIMsgComponent_ReceiveAIMsg_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
		enum class EAIMsgType MsgType; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct ADFMCharacter* AIAlertCharacter; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMProcessAIMsgComponent_ClientProcessAIMsg_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
		enum class EAIMsgType MsgType; // 0x08(0x01)
		bool AIFocusOnMe; // 0x09(0x01)
		char pad_A[0x2]; // 0x0a(0x02)
		float AlertMsgLastTime; // 0x0c(0x04)
		float FightMsgLastTime; // 0x10(0x04)
		bool bIsSniper; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMProcessAIMsgComponent_ClientProcessAIFocusOnMeMsg_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
		enum class EAIMsgType MsgType; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMProcessAIMsgComponent_AIMsgToCharacter_Param
	{
	public:

		struct ADFMCharacter* AICharacter; // 0x00(0x08)
		enum class EAIMsgType MsgType; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMRebornComponent_RequestReborn_Param
	{
	public:

		struct FRebornInformation RebornInformation; // 0x00(0xc0)
	};

	struct Function_DFMGameplay_DFMRebornComponent_RebornCharacter_Param
	{
	public:

		struct FRebornInformation RebornInformation; // 0x00(0xc0)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_WaitLoadCollision_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_StopMurderOutLineEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetSimulateLODEnable_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetRebornLocation_Param
	{
	public:

		struct FTransform ReborntranTransform; // 0x00(0x30)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetLastRebornToActor_Param
	{
	public:

		struct AActor* InLastRebornToActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetGlobalPreviewCamera_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetCurState_Param
	{
	public:

		enum class ERedeployStateFuture InState; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetClientGravityZero_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_SetClientGravityNormal_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerWaitLoadCollisionTimeOutGoNextState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerWaitLoadCollision_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerSetHaveBeReborn_Param
	{
	public:

		bool HaveReborn; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerRescueWaitDieGoNextState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerRescue_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerEnableController_Param
	{
	public:

		bool bInEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerDelayHideCharacter_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerBreakRedeployFlow_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerBeginRedeploy_Param
	{
	public:

		enum class ERedeployStateFuture InRedployStateFuture; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerApplyNextState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerAfterRequestReborn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ServerAfterRedeployCharacterShow_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ReturnSyncServerCurState_Param
	{
	public:

		enum class ERedeployStateFuture InServerCurState; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ResetCamera_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_RequestSyncServerCurState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_Rep_Murderer_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnSectorActived_Param
	{
	public:

		struct AActor* Sector; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnSeamlessTravelEnd_Param
	{
	public:

		bool bReconnect; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnRep_ServerCurState_Param
	{
	public:

		enum class ERedeployStateFuture InServerCurState; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnRep_RedeployRebornInformation_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnRep_LocalRebornTransform_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnKillerInfoCardShow_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnEnterServerState_Param
	{
	public:

		enum class ERedeployStateFuture InsState; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnEnterClientState_Param
	{
	public:

		enum class ERedeployStateFuture InsState; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_OnClientPlayerMatchOver_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_IsReady_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_IsInRedeployCD_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_Init_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_GetRedeployRemainCD_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_EnableDiscreteSector_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_DoAfterReborn_Param
	{
	public:

		struct AGPPlayerController* Player; // 0x00(0x08)
		char pad_8[0x8]; // 0x08(0x08)
		struct FTransform Location; // 0x10(0x30)
		bool bIsLoadTimeOut; // 0x40(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_DisableCameraModify_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_DelayShowUI_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_CurrentIsWaitLoadCollisionState_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_CurrentIsHighViewState_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientTurnCameraToSelf_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientTurnCameraToEnemyTimerCheck_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientTurnCameraToEnemy_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientStateNoneReset_Param
	{
	public:

		enum class ERedeployStateFuture OldState; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientRising_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientRescue_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientOnSetMurderer_Param
	{
	public:

		struct FRedeployKillerInfo RedeployKillerInfo; // 0x00(0x288)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientLand_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientKillerMark_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientHighView_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientFovZoomOut_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientFovZoomIn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientFallDown_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientCurrentIsInRescueState_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientCreatDeployUI_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientCheckTrackBip_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientApplyNextState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientAfterRequestReborn_Param
	{
	public:

		bool SelfShouldCrouch; // 0x00(0x01)
		bool SelfShouldLieDown; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientAfterRedeployCloseRedeployUI_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientAfterRedeploy_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClientAddMurderOutLineEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClearServerStateHandle_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_ClearLastRebornToActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_CancelServerWaitLoadCollisionTimeOut_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMRedeployComponent_CancelClientTurnCameraToEnemyTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSafeHouseElevatorSwitch_OnOverlapEnd_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_DFMSafeHouseElevatorSwitch_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_DFMSafeHouseElevatorSwitch_OnElevatorStartHandle_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_StartInteract_Param
	{
	public:

		struct AActor* TargetActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_GetPlayerAndNPCAngle_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_GetIsInteracting_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_GetIsFocusing_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_GetInteractingTarget_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_GetFocusingTarget_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_EndInteract_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSafeHouseNPC_AssetsLoadComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> AssetPaths; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMSafeHouseSyncComponent_ToggleDisplaySecretService_Param
	{
	public:

		bool bIsCheck; // 0x00(0x01)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_StopReporting_Param
	{
	public:

	};

	struct Function_DFMGameplay_ScenesAIStateComponent_SetInteractor_Param
	{
	public:

		struct UAIScenesInteractiveComponent* InInteractor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_SendScenesReportEvent_Param
	{
	public:

		struct UAIEvent* Event; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_ReportSelf_Param
	{
	public:

	};

	struct Function_DFMGameplay_ScenesAIStateComponent_InteractorUseTimeout_Param
	{
	public:

		struct UAIScenesInteractiveComponent* interactorComp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetThirstyValue_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetThirstyMaxValue_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetInteractor_Param
	{
	public:

		struct UAIScenesInteractiveComponent* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetHungerValue_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetHungerMaxValue_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetHasState_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetHasMaterials_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_GetHasKey_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_ScenesAIStateComponent_EnableTheReport_Param
	{
	public:

		float Interval; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMScoreStatisticsComponent_RemoveNormalHitDecimal_Param
	{
	public:

		uint64_t PlayerId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMScoreStatisticsComponent_GetOneFromNormalHitDecimal_Param
	{
	public:

		uint64_t PlayerId; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMScoreStatisticsComponent_CalculateAndShowScoreInfo_Param
	{
	public:

		struct FScoreTipsData ScoreTipsData; // 0x00(0x1a0)
	};

	struct Function_DFMGameplay_DFMScoreStatisticsComponent_AddNormalHitDecimal_Param
	{
	public:

		uint64_t PlayerId; // 0x00(0x08)
		float Decimal; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMScoreTipsComponent_SetSOLStatistics_Param
	{
	public:

		int32_t Category; // 0x00(0x04)
		uint32_t Distance; // 0x04(0x04)
		struct FText PlayerName; // 0x08(0x18)
		uint64_t PlayerId; // 0x20(0x08)
		struct FString WeaponName; // 0x28(0x10)
		bool bKillTeam; // 0x38(0x01)
	};

	struct Function_DFMGameplay_DFMScoreTipsComponent_SetScoreInfo_Param
	{
	public:

		int32_t Category; // 0x00(0x04)
		int32_t Score; // 0x04(0x04)
		int32_t Distance; // 0x08(0x04)
		struct FName ScoreNameExt; // 0x0c(0x08)
	};

	struct Function_DFMGameplay_DFMScoreTipsComponent_SetAbilityHitMarker_Param
	{
	public:

		struct ACHARACTER* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSettlementManager_SettlementSendLogoutNtf_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_SettlementFallBack_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_SettlementFailFallBack_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_SettlementEndBroadcast_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_SetSlomo_Param
	{
	public:

		float Coefficient; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMSettlementManager_SetSceneFocus_Param
	{
	public:

		struct FVector FocusLoc; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMSettlementManager_SetLowFrequency_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_SaveSettlementPkg2Locals_Param
	{
	public:

		struct FString Pkg; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMSettlementManager_ResetMatchOverReason_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_Read4Buffer_Param
	{
	public:

		struct FString str; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMSettlementManager_ProcessInspectPlayer_Param
	{
	public:

		bool WillEnterSpecterMode; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct ADFMPlayerController* localDFMPlayerController; // 0x08(0x08)
		struct AGPPlayerController* LocalPlayerController; // 0x10(0x08)
		uint64_t WillEnterSpecterPlayer; // 0x18(0x08)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_OnLoadingPercentage_Param
	{
	public:

		int32_t Percentage; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMSettlementManager_OnInspectTeamEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_InspectTeamNext_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_InspectTeam_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_HideAllVehicleActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_HideAllScreenEffect_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_HideAllPlayerActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_HasTeamMemberWatchFight_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetMatchOverReason_Param
	{
	public:

		enum class EMatchOverReason ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetLastDamageInfoTarget_Param
	{
	public:

		uint64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetLastDamageInfoOrigin_Param
	{
	public:

		uint64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetLastAIDamageLvOrigin_Param
	{
	public:

		uint64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetDFMGamePlayerMode_Param
	{
	public:

		enum class EDFMGamePlayMode ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetArmorPenetrate_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSettlementManager_GetArmorLevel_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMSettlementManager_Get_Param
	{
	public:

		struct UWorld* WorldContext; // 0x00(0x08)
		struct UDFMSettlementManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMSettlementManager_ForceQuitTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_DestroyAllPlayerActor_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_CloseForceQuit_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_ClearAllHud_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_BroadcastSOLFirstUIShow_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_BroadcastServerPlayerBan_Param
	{
	public:

		int64_t PlayerId; // 0x00(0x08)
		int8_t reason; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FString custom_reson; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMSettlementManager_BroadcastCutScene_Param
	{
	public:

		int32_t CurSector; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMSettlementManager_BroadcastChangeGameFlow2GameSettlement_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSettlementManager_AfterLoadSettlementFirstUIShow_Param
	{
	public:

		struct FString FunctionName; // 0x00(0x10)
		struct UBaseUIView* View; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_UpdateLoadCharacterRotator_Param
	{
	public:

		int32_t SkillId; // 0x00(0x04)
		struct FRotator Rotator; // 0x04(0x0c)
	};

	struct Function_DFMGameplay_DFMSkillComponent_UpdateClientBuffDetectorTimeMap_Param
	{
	public:

		struct FBuffDetectorUpdateData UpdateData; // 0x00(0x40)
	};

	struct Function_DFMGameplay_DFMSkillComponent_TryGiveBattleFieldPropSkill_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_TryGiveArmforceId_Param
	{
	public:

		enum class EInGameBattleClassType ArmForceID; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_TryAddZoyaSwarmsKillCount_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
		struct ADFMCharacter* Killer; // 0x148(0x08)
		struct ADFMCharacter* bekiller; // 0x150(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_TryAddIncendiaryKillScore_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
		struct ADFMCharacter* Killer; // 0x148(0x08)
		struct ADFMCharacter* bekiller; // 0x150(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_TryAddIncendiaryDamageLog_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DFMSkillComponent_TryAddIncendiaryAssistScore_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
		struct ADFMCharacter* Killer; // 0x148(0x08)
		struct ADFMCharacter* bekiller; // 0x150(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_SetInSupportShadow_Param
	{
	public:

		bool bIsIn; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_ServerOverlapByBullet_Param
	{
	public:

		struct AGPWeaponBulletProjectile* Bullet; // 0x00(0x08)
		struct AActor* Target; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_ServerGiveArmforceId_Param
	{
	public:

		enum class EInGameBattleClassType ArmForceID; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_PseudoOnEnterStageChanged_Param
	{
	public:

		char NewStageType; // 0x00(0x01)
		char OldStageType; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_PlayActorAudio_Param
	{
	public:

		struct FName AudioName; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_OnServerMatchEnd_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		int64_t PlayerUin; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_OnRep_InSupportShadow_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSkillComponent_OnRep_BattleClassType_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSkillComponent_NetGiveArmforceId_Param
	{
	public:

		enum class EInGameBattleClassType ArmForceID; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_InitBattleFieldPropSkillByItemID_Param
	{
	public:

		int64_t ItemID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_InitBattleFieldPropSkillByDefault_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSkillComponent_GiveArmforceId_Param
	{
	public:

		enum class EInGameBattleClassType ArmForceID; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_ClientTriggerMineDone_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSkillComponent_ClientTriggerMine_Param
	{
	public:

		bool IsActivated; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSkillComponent_ClientShowEngineVehicleHUD_Param
	{
	public:

		bool Show; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct ADFMCharacter* Operator; // 0x08(0x08)
		struct AActor* Actor; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_ClientOverlapByDrone_Param
	{
	public:

		struct FVector Position; // 0x00(0x0c)
		struct FName ImpackAudio; // 0x0c(0x08)
	};

	struct Function_DFMGameplay_DFMSkillComponent_ClientIgnoreFormDetectorBuff_Param
	{
	public:

		struct FName IgnoreTag; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSkillDamageActor_OnServerProjectileHit_Param
	{
	public:

		struct FVector HitLocation; // 0x00(0x0c)
		struct FHitResult HitResult; // 0x0c(0x88)
		char pad_94[0x4]; // 0x94(0x04)
		int64_t AttackerValueId; // 0x98(0x08)
		struct TArray<struct AActor*> IgnoreActors; // 0xa0(0x10)
		float DamageRate; // 0xb0(0x04)
	};

	struct Function_DFMGameplay_DFMSkillDamageActor_OnServerHit_Param
	{
	public:

		struct FHitResult HitResult; // 0x00(0x88)
		int64_t AttackerValueId; // 0x88(0x08)
		float DamageRate; // 0x90(0x04)
	};

	struct Function_DFMGameplay_DFMSkillManager_RemoveTalentAttribute_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		int32_t TalentId; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMSkillManager_AddTalentAttribute_Param
	{
	public:

		struct AActor* DestActor; // 0x00(0x08)
		int32_t TalentId; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DFMSlotChargingComponent_OnSpaceMarkedDirty_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSniperMarkAimedEnemyComponent_TrimCandidateByWeight_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSniperMarkAimedEnemyComponent_OnTriggerBeAimedAlert_Param
	{
	public:

		struct TArray<uint64_t> PlayerUinArr; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMSniperMarkAimedEnemyComponent_OnRep_bVisibleMark_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSniperMarkAimedEnemyComponent_OnRep_bActiveMark_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSOLStatisticsComponent_CalculateAndShowScoreInfo_Param
	{
	public:

		struct FScoreTipsData ScoreTipsData; // 0x00(0x1a0)
	};

	struct Function_DFMGameplay_DFMSOLStatisticsComponent_CalculateAndShowRescueInfo_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
		struct ACHARACTER* CHARACTER; // 0x148(0x08)
	};

	struct Function_DFMGameplay_DFMSOLStatisticsComponent_CalculateAndShowKillInfo_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
		struct ACHARACTER* CHARACTER; // 0x148(0x08)
	};

	struct Function_DFMGameplay_DFMSOLStatisticsComponent_CalculateAndShowKillAssitInfo_Param
	{
	public:

		struct FKillInfo KillInfo; // 0x00(0x148)
	};

	struct Function_DFMGameplay_DFMSoundVisualizeComponent_ProcessSoundDisplayData_Param
	{
	public:

		struct FSoundDataDisplayData DisplayData; // 0x00(0x18)
		struct FMiniMapSoundData SoundData; // 0x18(0x30)
	};

	struct Function_DFMGameplay_DFMSoundVisualizeComponent_OnAsyncLoadItemTable_Param
	{
	public:

		struct FSoftObjectPath AssetRef; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMSoundVisualizeComponent_OnAsyncLoadActionTable_Param
	{
	public:

		struct FSoftObjectPath AssetRef; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMSoundVisualizeComponent_HandleSoundVisualizeEvent_Param
	{
	public:

		struct AActor* MakerActor; // 0x00(0x08)
		char EventType; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FString Param; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMSoundVisualizeComponent_HandleMakeNoise_Param
	{
	public:

		float MaxVolume; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct AActor* SourceActor; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		float radius; // 0x1c(0x04)
		struct FName AudioType; // 0x20(0x08)
	};

	struct Function_DFMGameplay_DFMSoundVisualizeComponent_ClientHandleSoundVisualizeEvent_Param
	{
	public:

		struct FSoundDataDisplayData DisplayData; // 0x00(0x18)
		struct FMiniMapSoundData SoundData; // 0x18(0x30)
	};

	struct Function_DFMGameplay_DFMSpeakDebugComponent_TickingUpdate_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSpeakDebugComponent_AppendSpeakDebugInfo_Param
	{
	public:

		struct FAIAudioDebugRecord Records; // 0x00(0x28)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_StopPlayingSound_Param
	{
	public:

		bool allSound; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_StopLowPriorityAudio_Param
	{
	public:

		char Priority; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_ResetTypeAudioCD_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_ResetGlobalAudioCD_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlaySoundAsset_Param
	{
	public:

		struct UGPAudioEventAsset* AudioAsset; // 0x00(0x08)
		int32_t Priority; // 0x08(0x04)
		struct FName Subtitle; // 0x0c(0x08)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlayAudioNTag_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<struct FName> tagList; // 0x08(0x10)
		bool bForced; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		struct FName Subtitle; // 0x1c(0x08)
		bool BreakLow; // 0x24(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlayAudioDynamicDialogue_Param
	{
	public:

		enum class ECharacterSpeakDynamicDialogueSwitchStatus Status; // 0x00(0x01)
		enum class ECharacterSpeakDynamicDialogueSwitchaAction Action; // 0x01(0x01)
		char pad_2[0x2]; // 0x02(0x02)
		struct FName Subtitle; // 0x04(0x08)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlayAudio3Tag_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FName Tag1; // 0x04(0x08)
		struct FName tag2; // 0x0c(0x08)
		struct FName tag3; // 0x14(0x08)
		bool bForced; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FName Subtitle; // 0x20(0x08)
		bool BreakLow; // 0x28(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlayAudio2Tag_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FName Tag1; // 0x04(0x08)
		struct FName tag2; // 0x0c(0x08)
		bool bForced; // 0x14(0x01)
		char pad_15[0x3]; // 0x15(0x03)
		struct FName Subtitle; // 0x18(0x08)
		bool BreakLow; // 0x20(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlayAudio1Tag_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FName Tag; // 0x04(0x08)
		bool bForced; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FName Subtitle; // 0x10(0x08)
		bool BreakLow; // 0x18(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_PlayAudio0Tag_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
		bool bForced; // 0x01(0x01)
		char pad_2[0x2]; // 0x02(0x02)
		struct FName Subtitle; // 0x04(0x08)
		bool BreakLow; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_OnOwnerMakeDamage_Param
	{
	public:

		struct FDamageResultInfo DamageResult; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_OnOwnerCharacterReborn_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSpeakComponent_OnOwnerCharacterDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_MulticastShowSubtitle_Param
	{
	public:

		struct FName SubtitleSeqId; // 0x00(0x08)
		struct ADFMCharacter* characterRef; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_MulticastDebugSpeakInfo_Param
	{
	public:

		struct FName AudioType; // 0x00(0x08)
		struct FSoftObjectPath AudioAsset; // 0x08(0x18)
		enum class EAIAudioDebugFailReason reason; // 0x20(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_GetLastRecord_Param
	{
	public:

		struct FCharacterSpeakRecord OutValue; // 0x00(0x90)
		bool ReturnValue; // 0x90(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_AbortPendingAudio_Param
	{
	public:

		enum class ECharacterSpeakType Type; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSpeakComponent_AbortAllPendingAudio_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMSubsystemManagerImpl_OnGameFlowLeave_Param
	{
	public:

		enum class EGameFlowStageType GameFlowStage; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSubsystemManagerImpl_OnGameFlowGraphStop_Param
	{
	public:

		struct UGameFlowGraph* GameFlowGraph; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSubsystemManagerImpl_OnGameFlowGraphPlay_Param
	{
	public:

		struct UGameFlowGraph* GameFlowGraph; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSubsystemManagerImpl_OnGameFlowEnter_Param
	{
	public:

		enum class EGameFlowStageType GameFlowStage; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMSubtitleProxy_ShowWirelessSubtitle_Param
	{
	public:

		int32_t WirelessID; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMSubtitleSubSystem_RemoveSubtitleByHandle_Param
	{
	public:

		int64_t Handle; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMSubtitleSubSystem_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct ADFMSubtitleSubSystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMSubtitleSubSystem_AddSingleSubtitle_Param
	{
	public:

		struct FGPQuestObjectiveNoticeInfo NoticeInfo; // 0x00(0x80)
		int64_t ReturnValue; // 0x80(0x08)
	};

	struct Function_DFMGameplay_DFMSubtitleSubSystem_AddNewSubtitle_Param
	{
	public:

		struct FGPQuestObjectiveNoticeInfo NoticeInfo; // 0x00(0x80)
		int64_t ReturnValue; // 0x80(0x08)
	};

	struct Function_DFMGameplay_DFMTailingEffectDrawer_SetupMaterial_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTailingEffectDrawer_SetupDecalComponent_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTailingEffectDrawer_SetMaterialParameter_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTailingEffectDrawer_ClearRenderTarget_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTelescopeComponent_UseTelescope_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTelescopeComponent_ToggleUseTelescope_Param
	{
	public:

		bool bWantToUse; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_SpectorUpdateHUD_Param
	{
	public:

		struct FSpectTelescopeInfo SpectTelescopeInfo; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_SetCurrentZoomRateArrayIndex_Param
	{
	public:

		float Index_Float; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_ServerToggleFSMUseTelescope_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTelescopeComponent_ServerChangeTelescopeInfo_Param
	{
	public:

		bool bUsing; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_ServerChangeTelescopeFOVState_Param
	{
	public:

		bool bUsing; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_ServerChangeSpectPlayerState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTelescopeComponent_OnRep_IsUsingTelescopeChanged_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTelescopeComponent_GetCurrentTelescopeFOV_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_GetCurrentArrayIndex_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTelescopeComponent_DelayCloseZoomTips_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTelescopeComponent_CloseTelescope_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_UpdatePoiEnterExit_Param
	{
	public:

		bool bInPOI; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_UpdateBlueprintPlunderState_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_OnWeaponProcessEvent_Param
	{
	public:

		struct AWeaponBase* Weapon; // 0x00(0x08)
		char RepInfo; // 0x08(0x01)
	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_OnStartLocalFocus_Param
	{
	public:

		struct ADFMCharacter* InCharacter; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_OnLocalFocusChange_Param
	{
	public:

		struct AActor* OldTarget; // 0x00(0x08)
		struct AActor* NewTarget; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_OnHudStateChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_OnBlueprintPlunderInfoUpdate_Param
	{
	public:

		struct FBlueprintPlunderInfo BlueprintPlunderInfo; // 0x00(0xb0)
	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_CharacterPOIChange_Param
	{
	public:

		bool bInPOI; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTGPAInfoComponent_CharacterFightStateChange_Param
	{
	public:

		bool bInFight; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTGPASceneLogSystem_OnEnterGameFlowStage_Param
	{
	public:

		enum class EGameFlowStageType GameFlowStage; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTieBreakerHealthComponent_SetMaxHP_Param
	{
	public:

		float MaxHP; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTieBreakerHealthComponent_SetHP_Param
	{
	public:

		float HP; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTieBreakerHealthComponent_OnRep_OnHealthChange_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTieBreakerHealthComponent_GetMaxHP_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTieBreakerHealthComponent_GetHPPercent_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTieBreakerHealthComponent_GetCurrentHP_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTODLevelSequenceActor_SetupFogMesh_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTODLevelSequenceActor_SetTODSystemRunningStatus_Param
	{
	public:

		bool Status; // 0x00(0x01)
		bool bChangeSkyboxStatus; // 0x01(0x01)
		char pad_2[0x6]; // 0x02(0x06)
		struct UClass* ActorClassToSwitchStatus; // 0x08(0x08)
		struct FString ActorNameToSwitchStatus; // 0x10(0x10)
	};

	struct Function_DFMGameplay_DFMTODLevelSequenceActor_SetSequenceManagerRunningStatus_Param
	{
	public:

		bool Status; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTODLightingActor_BP_RefreshTODLight_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMTODSubSystem_TransToNewWeather_Param
	{
	public:

		int64_t InWeatherId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_SetSequenceManagerRunningStatus_Param
	{
	public:

		bool Status; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_OnLoadTODSubLevelSequenceTableCompelete_Param
	{
	public:

		struct FSoftObjectPath AssetRef; // 0x00(0x18)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_OnLoadTODSettingsTableFinished_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Assets; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_OnGameFlowLeave_Param
	{
	public:

		enum class EGameFlowStageType GameFlowStage; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_OnGameFlowEnter_Param
	{
	public:

		enum class EGameFlowStageType GameFlowStage; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_OnClientPlayerMatchOver_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GMTransToNewWeather_Param
	{
	public:

		int64_t InWeatherId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GetEnableVolumeKeyArr_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GetEditorOnlyCurrentWeatherID_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GetEditorOnlyCurrentCurAddLightParms_Param
	{
	public:

		struct FName ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GetEditorEnableVolumeKeyArr_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GetCurWeatherID_Param
	{
	public:

		int64_t ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_GetCharacterTODLightParmsFactor_Param
	{
	public:

		struct FName ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_Get_Param
	{
	public:

		struct UDFMTODSubSystem* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMTODSubSystem_EditorApplyWeatherSubSequence_Param
	{
	public:

		struct FString WeatherID; // 0x00(0x10)
	};

	struct Function_DFMGameplay_DFMVehicleMarkerItem_OnVehicleTakeHit_Param
	{
	public:

		struct AActor* DamageMaker; // 0x00(0x08)
		struct AActor* DamageTaker; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMVehicleMarkerItem_OnShowHealthBarTimeEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMVehicleMarkerItem_OnBreakthroughBroadcastShowMarkerTimerHandleEnd_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMVehicleMarkerItem_OnBreakthroughBroadcastShowMarker_Param
	{
	public:

		enum class EBreakthroughBroadcastMarkerType BreakthroughBroadcastMarkerType; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<struct AActor*> MarkedItems; // 0x08(0x10)
		float ShowTime; // 0x18(0x04)
	};

	struct Function_DFMGameplay_DFMWaterInteractionUtil_StopRippleEffect_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct ADFMWaterRippleEffect* RippleEffect; // 0x08(0x08)
	};

	struct Function_DFMGameplay_DFMWaterInteractionUtil_PlayRippleEffect_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName EffectId; // 0x08(0x08)
		struct AActor* Target; // 0x10(0x08)
		char pad_18[0x8]; // 0x18(0x08)
		struct FTransform RelativeTransform; // 0x20(0x30)
		struct ADFMWaterRippleEffect* ReturnValue; // 0x50(0x08)
	};

	struct Function_DFMGameplay_DFMWaterMaskActor_OnTargetDestroyed_Param
	{
	public:

		struct AActor* DestroyedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMWaterRippleEffect_Stop_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMWaterRippleEffect_Play_Param
	{
	public:

		struct FName EffectId; // 0x00(0x08)
		struct AActor* AttachParent; // 0x08(0x08)
		struct FTransform AttachTransform; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMWaterRippleEffect_OnTargetDestroyed_Param
	{
	public:

		struct AActor* DestroyedActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMWaterRippleEffect_OnReadyToStop_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMilitaryPropsAnimInstance_SetMaxRotationYaw_Param
	{
	public:

		float InMaxRotationYaw; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMilitaryPropsAnimInstance_GetMoveToPoint_Param
	{
	public:

		float Z; // 0x00(0x04)
		char pad_4[0xc]; // 0x04(0x0c)
		struct FTransform ReturnValue; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMilitaryPropsAnimInstance_GetMaxRotationYaw_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMilitaryPropsAnimInstance_GetEnterPoint_Param
	{
	public:

		float Z; // 0x00(0x04)
		char pad_4[0xc]; // 0x04(0x0c)
		struct FTransform ReturnValue; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_UpdateCacheCarriedAmmoCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_ServerSetPendingReloadType_Param
	{
	public:

		enum class EPendingReloadType ReloadType; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_ServerSelectPendingReloadAmmoByGid_Param
	{
	public:

		struct FInventoryItemInfo ItemInfo; // 0x00(0x538)
	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_ServerSelectAmmoByRoulette_Param
	{
	public:

		uint64_t SelectAmmoByRoulette; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_OnServerItemMoveNotify_Param
	{
	public:

		struct FItemMoveCmd ItemMoveCmd; // 0x00(0x120)
	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_OnRep_CarriedAmmo_Param
	{
	public:

		int32_t PreCarriedAmmoNum; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_OnRep_AmmoData_Param
	{
	public:

	};

	struct Function_DFMGameplay_DFMWeaponDataComponentAmmo_Item_NotifyClientSelectPendingReloadAmmoByGid_Param
	{
	public:

		struct FInventoryItemInfo ItemInfo; // 0x00(0x538)
		struct AWeaponBase* Weapon; // 0x538(0x08)
		enum class EPendingReloadType InPendingReloadType; // 0x540(0x01)
	};

	struct Function_DFMGameplay_DFMWidgetComponentInvalidate_InvalidateLayer_Param
	{
	public:

	};

	struct Function_DFMGameplay_DialogStateMachine_OnStateExecuteComplete_Param
	{
	public:

	};

	struct Function_DFMGameplay_DramaAISpawnComponent_StartSpawnWithTransform_Param
	{
	public:

		struct FTransform Transform; // 0x00(0x30)
	};

	struct Function_DFMGameplay_DramaAISpawnComponent_StartSpawn_Param
	{
	public:

		int32_t Difficulty; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DramaAISpawnComponent_SetSpawnData_Param
	{
	public:

		int32_t SpawnStart; // 0x00(0x04)
		int32_t SpawnEnd; // 0x04(0x04)
		int32_t SpawnCountLimit; // 0x08(0x04)
	};

	struct Function_DFMGameplay_DramaAISpawnComponent_SetRespawnPosibility_Param
	{
	public:

		float Percentage; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DramaAISpawnComponent_OnAICheckerSpawnEnd_Param
	{
	public:

		struct AAISpawnChecker* SpawnChecker; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_UnBindDramaArea_Param
	{
	public:

	};

	struct Function_DFMGameplay_DramaActingCustomInterface_SetStandaloneDramaMontages_Param
	{
	public:

		struct TMap<struct FName, struct UAnimMontage*> Montages; // 0x00(0x50)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_SetStandaloneDramaBTAsset_Param
	{
	public:

		struct UBehaviorTree* BTAsset; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_SetDramaBehaviorNeedRestart_Param
	{
	public:

		bool isNeedRestart; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_OnUnBindDramaArea_Param
	{
	public:

		struct ADramaArea* DramaArea; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_OnBindDramaArea_Param
	{
	public:

		struct ADramaArea* DramaArea; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_IsStandaloneDrama_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_IsDramaBehaviorNeedRestart_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_IsDramaActing_Param
	{
	public:

		enum class EAIDramaPriority Priority; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_DFMGameplay_DramaActingCustomInterface_GetDramaBTAsset_Param
	{
	public:

		struct UBehaviorTree* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_DramaDebugInterface_GetDramaDebugLineWidth_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DramaDebugInterface_GetDramaDebugLineType_Param
	{
	public:

		enum class EAIDramaDebugLineType ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DramaDebugInterface_GetDramaDebugLineColor_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIHearingModifyVolume_OnVolumeEndOverlap_Param
	{
	public:

		struct AActor* OverlappedActor; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIHearingModifyVolume_OnVolumeBeginOverlap_Param
	{
	public:

		struct AActor* OverlappedActor; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_RoleSeeker_EvaluateAIScore_Param
	{
	public:

		struct ADramaScript* DramaStarring; // 0x00(0x08)
		enum class EDramaRole AsRole; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct AAIController* WhichAI; // 0x10(0x08)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_DFMGameplay_DroneFlightPathSpline_Test_Param
	{
	public:

	};

	struct Function_DFMGameplay_DroneFlightPathSpline_GetWholeDistance_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DroneFlightPathSpline_GetTransformByDistance_Param
	{
	public:

		float Distance; // 0x00(0x04)
		char pad_4[0xc]; // 0x04(0x0c)
		struct FTransform ReturnValue; // 0x10(0x30)
	};

	struct Function_DFMGameplay_DroneFlightPathSpline_GetStraightDistance_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_DroneFlightPathSpline_CalcSplineRelativeScale_Param
	{
	public:

		float StraightDistance; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_DFMGameplay_EnterMovePath_GetSpline_Param
	{
	public:

		struct USplineComponent* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_EnterMovePath_AdjustTransformToFitPlayerStart_BP_Param
	{
	public:

		struct FRotator WorldRotator; // 0x00(0x0c)
		struct FVector WorldLocation; // 0x0c(0x0c)
	};

	struct Function_DFMGameplay_EnvManageSubsystem_ReturnSpecialPos_Param
	{
	public:

		struct FSpecialPosInfo LastSpecialPos; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_EnvManageSubsystem_GetNearestSpecialPos_Angle_Param
	{
	public:

		struct FSpecialPosInfo LastSpecialPos; // 0x00(0x10)
		struct ACHARACTER* CHARACTER; // 0x10(0x08)
		float MaxDistance; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct TArray<struct FAngleRange> AngleRanges; // 0x20(0x10)
		struct FSpecialPosInfo OutSpecialPos; // 0x30(0x10)
		bool ReturnValue; // 0x40(0x01)
	};

	struct Function_DFMGameplay_EnvManageSubsystem_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UEnvManageSubsystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_EnvManageSubsystem_AddSpecialPos_Param
	{
	public:

		struct AEnvSpecialPos* SpecialPos; // 0x00(0x08)
	};

	struct Function_DFMGameplay_EnvQueryContext_BlackBoardActor_BP_ProvideContext_Param
	{
	public:

		struct AActor* QueryOwner; // 0x00(0x08)
		struct TArray<struct AActor*> OutActors; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_EnvSpecialPos_RefreshSpecialPos_Param
	{
	public:

	};

	struct Function_DFMGameplay_EquipComponentManager_ShowSeamless_Param
	{
	public:

	};

	struct Function_DFMGameplay_EquipComponentManager_OnUnequip_Param
	{
	public:

		enum class EEquipmentType EquipType; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		uint64_t ItemID; // 0x08(0x08)
	};

	struct Function_DFMGameplay_EquipComponentManager_OnEquip_Param
	{
	public:

		enum class EEquipmentType EquipType; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		uint64_t ItemID; // 0x08(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_DoorTrigger_TriggerPass_Param
	{
	public:

		struct UEscortBoss_PushMoveComponent* InBossComp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_DoorTrigger_OnTriggerEndOverlapInternal_Param
	{
	public:

		struct AActor* OverlappedActor; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_DoorTrigger_OnTriggerBeginOverlapInternal_Param
	{
	public:

		struct AActor* OverlappedActor; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_DoorTrigger_IsDoorOpen_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_EscortBoss_DoorTrigger_BP_TriggerPassAudio_Param
	{
	public:

		struct AActor* InDoor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_DoorTrigger_BP_TriggerDenyAudio_Param
	{
	public:

		struct AActor* InDoor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_SetPushMoveRaidus_Param
	{
	public:

		float PushMoveRaidus; // 0x00(0x04)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_ServerSubmitTextTips2ContractTeam_Param
	{
	public:

		struct FText TextTips; // 0x00(0x18)
		int32_t ContractTeamID; // 0x18(0x04)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_ServerRangeCircle_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_ServerOpenLootDoors_Param
	{
	public:

		float Time2OpenLootDoor; // 0x00(0x04)
		struct FName LootDoorTag; // 0x04(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_ServerEnablePushMove_Param
	{
	public:

		int32_t ContractTeamID; // 0x00(0x04)
		bool bEnable; // 0x04(0x01)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_ServerChangeContractTeamCamp_Param
	{
	public:

		int32_t ContractTeamID; // 0x00(0x04)
		enum class ECampType CampId; // 0x04(0x01)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_RebornRomytheusFromImpendingDeath_Param
	{
	public:

	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_OnServerGPCharacterPreDropCarryBody_Param
	{
	public:

		struct AGPCharacterBase* CurrentCarrySelfBuddy; // 0x00(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_OnServerGPCharacterBeingCarry_Param
	{
	public:

		bool bCarrying; // 0x00(0x01)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_OnServerAddExitQA_Param
	{
	public:

		struct APlayerExitBase* InPlayerExit; // 0x00(0x08)
		float Time2CloseExit; // 0x08(0x04)
		struct FName QATag; // 0x0c(0x08)
		char pad_14[0x4]; // 0x14(0x04)
		struct FText InExitUIInfoOpenDesc; // 0x18(0x18)
		struct FText InExitUIInfoCloseDesc; // 0x30(0x18)
		struct FText InExitUIInfoFinishDesc; // 0x48(0x18)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_OnLootDoorTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_OnEndOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_OnBeginOverlap_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComponent; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_IsTeammatesInArea_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_FireReturnAction_OnActorEndOverlap_Param
	{
	public:

		struct AActor* OverlappedActor; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_EscortBoss_PushMoveComponent_FireReturnAction_OnActorBeginOverlap_Param
	{
	public:

		struct AActor* OverlappedActor; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
	};

	struct Function_DFMGameplay_ExitTipsComponent_OnAwakeChanged_Param
	{
	public:

		bool bAwake; // 0x00(0x01)
	};

	struct Function_DFMGameplay_DFMCoverEQInstanceBPWrapper_GetResultsAsCover_Param
	{
	public:

		struct TArray<struct FSOLEqsCoverPointInfo> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_FirebatFloorBurnVolume_ApplyDamage_Param
	{
	public:

		struct ADFMCharacter* Char; // 0x00(0x08)
		struct FVector ImpactPoint; // 0x08(0x0c)
	};

	struct Function_DFMGameplay_FixedTrackRocketMovementComponent_StopMovementImmdiately_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixedTrackRocketMovementComponent_OnRep_GuidedRocketMovementParam_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixedTrackRocketMovementComponent_OnRep_Flying_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixedTrackRocketMovementComponent_OnRep_Explode_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixedTrackRocketMovementComponent_InitMovementParam_Param
	{
	public:

		struct FGuidedRocketMovementParam InMovementParam; // 0x00(0x30)
	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_ServerFireAutoTrack_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_ServerFire_Param
	{
	public:

		struct FVector InTargetLoc; // 0x00(0x0c)
		bool bSpecialExplode; // 0x0c(0x01)
	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_ServerDelayFireAutoTrack_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_OnVehicleDiedNtf_Param
	{
	public:

		struct FDamageResultInfo DestroyedDamageInfo; // 0x00(0x5e0)
	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_OnRep_ReverseAiming_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_OnRep_Firing_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_OnRep_Actived_Param
	{
	public:

	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_OnHelicopterMoveStateChange_Param
	{
	public:

		int32_t MoveState; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct AActor* Vehicle; // 0x08(0x08)
	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_OnFireMissileOnInteract_Param
	{
	public:

		struct AGPCharacter* CHARACTER; // 0x00(0x08)
		struct AActor* InteractActor; // 0x08(0x08)
		bool bReadToFire; // 0x10(0x01)
	};

	struct Function_DFMGameplay_FixTrackRocketLauncher_ActivateLauncher_Param
	{
	public:

		bool Activate; // 0x00(0x01)
	};

	struct Function_DFMGameplay_FlameTower_SetEnableRotating_Param
	{
	public:

		bool bRotating; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FRotator RotationRate; // 0x04(0x0c)
	};

	struct Function_DFMGameplay_Formation_SetWayPointsNoLoop_Param
	{
	public:

		struct TArray<struct FVector> Path; // 0x00(0x10)
	};

	struct Function_DFMGameplay_Formation_SetWayPoints_Param
	{
	public:

		struct TArray<struct FVector> Path; // 0x00(0x10)
	};

	struct Function_DFMGameplay_Formation_SetLoopCount_Param
	{
	public:

		int32_t InLoopCount; // 0x00(0x04)
	};

	struct Function_DFMGameplay_Formation_SetFormationPattern_Param
	{
	public:

		struct UFormationSlotPattern* pattern; // 0x00(0x08)
	};

	struct Function_DFMGameplay_Formation_IsFinish_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_Formation_GetMembers_Param
	{
	public:

		struct TArray<struct AAIController*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_GadgetItemActorInterface_InitGadgetActor_Param
	{
	public:

		struct ACHARACTER* CharacterOwner; // 0x00(0x08)
	};

	struct Function_DFMGameplay_GameplayMonitorManager_GetMonitorsByGroup_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName Group; // 0x08(0x08)
		struct TArray<struct AGameplayMonitor*> ReturnValue; // 0x10(0x10)
	};

	struct Function_DFMGameplay_GameplayMonitorManager_Get_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct AGameplayMonitorManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GMWeaponComponent_ServerProcessGMWeapon_Param
	{
	public:

		struct FName CmdName; // 0x00(0x08)
		struct FString Params; // 0x08(0x10)
	};

	struct Function_DFMGameplay_GMWeaponComponent_GMWeapon_Param
	{
	public:

		struct FName CmdName; // 0x00(0x08)
		struct FString Params; // 0x08(0x10)
	};

	struct Function_DFMGameplay_GMWeaponComponent_GMW_CheatSpread_Param
	{
	public:

	};

	struct Function_DFMGameplay_GMWeaponComponent_GMW_CheatRecoil_Param
	{
	public:

	};

	struct Function_DFMGameplay_GMWeaponComponent_GMServerWeapon_Param
	{
	public:

		struct FName CmdName; // 0x00(0x08)
		struct FString Params; // 0x08(0x10)
	};

	struct Function_DFMGameplay_GMWeaponComponent_GMServerSpawnProjectile_Param
	{
	public:

		uint64_t Guid; // 0x00(0x08)
		struct FString ClassPath; // 0x08(0x10)
		struct FVector InitLoc; // 0x18(0x0c)
		struct FRotator InitRot; // 0x24(0x0c)
	};

	struct Function_DFMGameplay_GMWeaponComponent_ClientProcessGMWeapon_Param
	{
	public:

		struct FName CmdName; // 0x00(0x08)
		struct FString Params; // 0x08(0x10)
	};

	struct Function_DFMGameplay_GPBuffEffectFunctions_TriggerCameraShakeAnim_Param
	{
	public:

		struct AActor* Actor; // 0x00(0x08)
		enum class EJoggleCameraType CameraType; // 0x08(0x01)
	};

	struct Function_DFMGameplay_GPBuffEffectFunctions_SetPostProcessActive_Param
	{
	public:

		struct FString PostEffectName; // 0x00(0x10)
		bool bEnabled; // 0x10(0x01)
	};

	struct Function_DFMGameplay_GPBuffEffectFunctions_RemovePostProcess_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPBuffEffectFunctions_GetLocalGPPlayerController_Param
	{
	public:

		struct AActor* Actor; // 0x00(0x08)
		struct AGPPlayerController* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GPBuffEffectFunctions_BE_PlayVoice_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPBuffEffectFunctions_AddPostProcess_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_AssaultShockEffect_SetAssaultShockEffectSlowRotation_Param
	{
	public:

		bool bSlowRotation; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		float InLastTime; // 0x04(0x04)
	};

	struct Function_DFMGameplay_GPCameraModifier_AssaultShockEffect_SetAssaultShockEffectDelay_Param
	{
	public:

		bool bDelay; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		float InDelayTime; // 0x04(0x04)
		float InLastTime; // 0x08(0x04)
	};

	struct Function_DFMGameplay_GPCameraModifier_JoggleCamera_TryJoggleCamera_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
		enum class EJoggleCameraType JoggleCameraType; // 0x01(0x01)
	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_SwitchToTPP_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_SwitchToFPP_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_OnClientPlayerMatchOver_Param
	{
	public:

		enum class EMatchOverReason MatchOverReason; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_InheritBodyDiePlayerLocation_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_InheritBodyDieCameraParam_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_CreateSwitchToTPPTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_CreateSwitchToFPPTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_CancelSwitchToTPPTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPCameraModifier_RebornEffect_CancelSwitchToFPPTimer_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPEQSGenerator_CircleBetweenQuerierAndTarget_ShouldAvoidPoint_Param
	{
	public:

		struct FVector avoidTargetPoint; // 0x00(0x0c)
		struct FVector testingPoint; // 0x0c(0x0c)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_SetItemInfo_Param
	{
	public:

		struct FInventoryItemInfo _ItemInfo; // 0x00(0x538)
	};

	struct Function_DFMGameplay_GPInventoryBase_SetGunDesc_Param
	{
	public:

		struct TArray<struct FGunDescRow> _GunDesc; // 0x00(0x10)
	};

	struct Function_DFMGameplay_GPInventoryBase_ReplicateOwnerCharacter_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPInventoryBase_OnRep_TotalCount_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPInventoryBase_OnRep_Durability_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPInventoryBase_OnRep_AttachPos_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPInventoryBase_ModifyDamageTaken_Param
	{
	public:

		int32_t Damage; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct AGPInventoryBase* HitArmor; // 0x08(0x08)
		struct FHitResult HitInfo; // 0x10(0x88)
		struct AActor* DamageCauser; // 0x98(0x08)
		bool ReturnValue; // 0xa0(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsWeapon_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsThrowableWeapon_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsPistolWeapon_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsMeleeWeapon_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsMainWeapon_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsEquipped_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsEquipment_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsAvatarItem_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsApparel_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_IsAmmo_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_InventoryIdNameUpdated_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPInventoryBase_GetSellPrice_Param
	{
	public:

		uint32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetPrice_Param
	{
	public:

		uint32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetPreUseAnimType_Param
	{
	public:

		char ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetItemMesh_Param
	{
	public:

		bool bForceCreate; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct UStaticMeshComponent* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetItemInfo_Param
	{
	public:

		struct FInventoryItemInfo ReturnValue; // 0x00(0x538)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetID_Param
	{
	public:

		struct FItemID ReturnValue; // 0x00(0x18)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetGunDesc_Param
	{
	public:

		struct TArray<struct FGunDescRow> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetExtraInfoData_Param
	{
	public:

		struct UModularWeaponDesc* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_GPInventoryBase_GetAttachPosition_Param
	{
	public:

		enum class EAttachPosition ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_GPInventoryBase_ClientRemoved_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPInventoryBase_ClientGivenTo_Param
	{
	public:

		struct APawn* NewInstigator; // 0x00(0x08)
	};

	struct Function_DFMGameplay_GPPerfManager_OnNetReconnectSuccess_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPPerfManager_OnNetReconnectFail_Param
	{
	public:

		int32_t RetryTime; // 0x00(0x04)
	};

	struct Function_DFMGameplay_GPPerfManager_OnNetDisconnectInSeamless_Param
	{
	public:

		struct UWorld* World; // 0x00(0x08)
		struct UNetDriver* NetDriver; // 0x08(0x08)
		enum class ENetworkFailure FailureType; // 0x10(0x01)
	};

	struct Function_DFMGameplay_GPPerfManager_OnGameFlowStageChanged_Param
	{
	public:

		enum class EGameFlowStageType Stage; // 0x00(0x01)
	};

	struct Function_DFMGameplay_GPReplayStageInterface_ResetForReplay_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPReplayStageInterface_BackUpForReplay_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPReplayStageManager_UnRegisterInReplayStageManager_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPReplayStageManager_StartReplay_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPReplayStageManager_ReplayCurStage_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
	};

	struct Function_DFMGameplay_GPReplayStageManager_RegisterInReplayStageManager_Param
	{
	public:

	};

	struct Function_DFMGameplay_GPReplayStageManager_GetInstance_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct AGPReplayStageManager* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_OnWorldThrowableWeaponProjectileCreate_Param
	{
	public:

		struct AActor* ProjectileActor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_OnOverlapEnd_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_OnOverlapBegin_Param
	{
	public:

		struct UPrimitiveComponent* OverlappedComp; // 0x00(0x08)
		struct AActor* OtherActor; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		int32_t OtherBodyIndex; // 0x18(0x04)
		bool bFromSweep; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FHitResult SweepResult; // 0x20(0x88)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_NotifySupportStomExploded_Param
	{
	public:

		struct AActor* ProjectileActor; // 0x00(0x08)
		struct ACHARACTER* OwnerCharacter; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_NotifySupportFrogExploded_Param
	{
	public:

		struct AActor* ProjectileActor; // 0x00(0x08)
		struct ACHARACTER* OwnerCharacter; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_NotifyStunGrenadeExploded_Param
	{
	public:

		struct AActor* ProjectileActor; // 0x00(0x08)
		struct ACHARACTER* OwnerCharacter; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_NotifyFlashBangExploded_Param
	{
	public:

		struct AActor* ProjectileActor; // 0x00(0x08)
		struct ACHARACTER* OwnerCharacter; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_IsProjectileInSight_Param
	{
	public:

		struct AActor* Projectile; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_IsGrenadeExist_Param
	{
	public:

		float SpecifyRadius; // 0x00(0x04)
		bool bContainFriend; // 0x04(0x01)
		bool ReturnValue; // 0x05(0x01)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_IsBlindByFlashBang_Param
	{
	public:

		float Time; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_IsAvoidProjectile_Param
	{
	public:

		float SpecifyRadius; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_GetGrenadeNumBySelf_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_GrenadeDetectComponent_CanSeeAnySmokeBomb_Param
	{
	public:

	};

	struct Function_DFMGameplay_GrenadeDetectComponent_CalcSightBlockRate_Param
	{
	public:

		struct FVector Start; // 0x00(0x0c)
		struct FVector End; // 0x0c(0x0c)
		enum class EDrawDebugTrace enableDebugDraw; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		float ReturnValue; // 0x1c(0x04)
	};

	struct Function_DFMGameplay_AIMission_Start_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIMission_Resume_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIMission_Interrupt_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIMission_Finish_Param
	{
	public:

	};

	struct Function_DFMGameplay_AIGroup_SendEventToSelf_Param
	{
	public:

		struct UAIEvent* Event; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroup_SendEventToMemberByController_Param
	{
	public:

		struct AAIController* MemberRef; // 0x00(0x08)
		struct UAIEvent* Event; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIGroup_SendEventToMember_Param
	{
	public:

		int32_t MemberId; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct UAIEvent* Event; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIGroup_QueryMemberGroupAI_Param
	{
	public:

		struct AAIController* MemberRef; // 0x00(0x08)
		struct AAIGroup* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_AIGroup_OnGroupMemberDied_Param
	{
	public:

		struct AGPCharacterBase* GPCharacterBase; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_AIGroup_OnGroupMemberAerialVehicleDied_Param
	{
	public:

		struct AAerialVehicle* AerialVehicle; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroup_GetSingleAIReport_Param
	{
	public:

		struct UAIReportEvent* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_AIGroup_GetMemberNum_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_AIGroup_GetMember_Param
	{
	public:

		struct TArray<struct FGroupMember> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIGroup_GetGroupLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_DFMGameplay_AIGroup_GetControllerFromMember_Param
	{
	public:

		struct FGroupMember member; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct AAIController* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_AIGroup_GetAllSingleStateList_Param
	{
	public:

		struct UAIScenesInteractiveComponent* InteractiveComp; // 0x00(0x08)
		struct TArray<struct FAISingleState> ReturnValue; // 0x08(0x10)
	};

	struct Function_DFMGameplay_AIGroup_GetAIControllers_Param
	{
	public:

		struct TArray<struct AAIController*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_AIGroup_FindPath_Param
	{
	public:

		struct FVector Start; // 0x00(0x0c)
		struct FVector End; // 0x0c(0x0c)
		struct TArray<struct FVector> ReturnValue; // 0x18(0x10)
	};

	struct Function_DFMGameplay_AIGroup_ContainController_Param
	{
	public:

		struct AAIController* MemberRef; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_GroupAISystem_TemporaryMergedGroup_Param
	{
	public:

		struct AAIGroup* groupA; // 0x00(0x08)
		struct AAIGroup* groupB; // 0x08(0x08)
		struct AAIGroup* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_GroupAISystem_RecoverGroups_Param
	{
	public:

		struct AAIGroup* Group; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_DFMGameplay_GroupAISystem_NewGroup_Param
	{
	public:

		struct UClass* AIGroupClassIn; // 0x00(0x08)
		struct AAIGroup* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GroupAISystem_NewFormation_Param
	{
	public:

		struct AFormation* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_GroupAISystem_MergeGroup_Param
	{
	public:

		struct AAIGroup* groupA; // 0x00(0x08)
		struct AAIGroup* groupB; // 0x08(0x08)
		struct AAIGroup* ReturnValue; // 0x10(0x08)
	};

	struct Function_DFMGameplay_GroupAISystem_JoinGroup_Param
	{
	public:

		struct AAIGroup* GoalGroup; // 0x00(0x08)
		struct AAIController* AIController; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_DFMGameplay_GroupAISystem_Instance_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UGroupAISystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_GroupAISystem_GetScenesActorsInWorld_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_GroupAISystem_GetAllGroups_Param
	{
	public:

		struct TArray<struct AAIGroup*> ReturnValue; // 0x00(0x10)
	};

	struct Function_DFMGameplay_GuidedRocketMovementComponent_InitMovementParam_Param
	{
	public:

		struct FGuidedRocketMovementParam InMovementParam; // 0x00(0x30)
	};

	struct Function_DFMGameplay_HackGameComponent_OnTableLoadComplete_Param
	{
	public:

		struct FSoftObjectPath AssetRef; // 0x00(0x18)
	};

	struct Function_DFMGameplay_HackGameComponent_CreateNarratives_Param
	{
	public:

		struct TArray<struct FHackGameNarrativeProps> NarrativeProps; // 0x00(0x10)
	};

	struct Function_DFMGameplay_HallCharacterBase_UnlockSkeletalMeshComp_Param
	{
	public:

	};

	struct Function_DFMGameplay_HallCharacterBase_UnequipWatch_Param
	{
	public:

		struct FName watchItemId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HallCharacterBase_UnequipByEquipmentType_Param
	{
	public:

		enum class EEquipmentType EquipmentType; // 0x00(0x01)
	};

	struct Function_DFMGameplay_HallCharacterBase_Unequip_Param
	{
	public:

		struct FName ItemID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HallCharacterBase_TryLockNotEmptyMeshComp_Param
	{
	public:

	};

	struct Function_DFMGameplay_HallCharacterBase_SetUIMatSlotIngoreRender_Param
	{
	public:

		bool isIngore; // 0x00(0x01)
	};

	struct Function_DFMGameplay_HallCharacterBase_SetSkeletalMeshTickEnabled_Param
	{
	public:

		bool bEnabled; // 0x00(0x01)
	};

	struct Function_DFMGameplay_HallCharacterBase_SetAvatar_Param
	{
	public:

		struct FName InAvatarId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HallCharacterBase_EquipWatch_Param
	{
	public:

		struct FName watchItemId; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HallCharacterBase_Equip_Param
	{
	public:

		struct FName ItemID; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HelicopterInteractorActor_SetbFollowPath_Param
	{
	public:

		bool bFollow; // 0x00(0x01)
	};

	struct Function_DFMGameplay_HelicopterInteractorActor_OnSpineEndFollow_Param
	{
	public:

		struct AActor* PathFollower; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HelicopterInteractorActor_GetOnHelicopter_Param
	{
	public:

		struct AActor* Actor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HelicopterInteractorActor_GetOffHelicopter_Param
	{
	public:

		struct AActor* Actor; // 0x00(0x08)
	};

	struct Function_DFMGameplay_HelicopterInteractorActor_GetHelicopterCharactersNum_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_DFMGameplay_HelicopterInteractorActor_GetbFollwPath_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_DFMGameplay_HelmetComponent_ServerToggleMask_Param
	{
	public:

		bool InOpen; // 0x00(0x01)
	};

	struct Function_DFMGameplay_HelmetComponent_OnRep_Opened_Param
	{
	public:

	};

	struct Function_DFMGameplay_HelmetComponent_OnRep_Config_Param
	{
	public:

	};

	struct Function_DFMGameplay_HelmetFaceMaskStateSubsystem_Get_Param
	{
	public:

		struct UObject* WorldContext; // 0x00(0x08)
		struct UHelmetFaceMaskStateSubsystem* ReturnValue; // 0x08(0x08)
	};

	struct Function_DFMGameplay_HitFaceMaskEffectComponent_ResetAllEffects_Param
	{
	public:

	};

	struct Function_DFMGameplay_HitFaceMaskEffectComponent_OnOwnerCharacterReborn_Param
	{
	public:

	};

	struct Function_DFMGameplay_HitFaceMaskEffectComponent_OnOwnerCharacterDied_Param
	{
	public:

		struct AGPCharacterBase* CHARACTER; // 0x00(0x08)
		struct AController* Killer; // 0x08(0x08)
		struct UDamageType* DamageType; // 0x10(0x08)
	};

	struct Function_DFMGameplay_HitFaceMaskEffectComponent_FaceMaskTakeDamage_Param
	{
	public:

		float BulletBaseDamage; // 0x00(0x04)
		struct FVector DamageMakerLocalLocation; // 0x04(0x0c)
	};

	struct Function_DFMGameplay_HitNotifyInterface_OnNtfHit_Param
	{
	public:

		struct FHitResult HitResult; // 0x00(0x88)
	};

	struct Function_DFMGameplay_HoldAndUseItemInterface_GetUseAndHoldItemClass_Param
	{
	public:

	};

	struct Function_DFMGameplay_InactivePlayerDetectSystem_RemoveFromLongTimeInactivePlayerMap_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InactivePlayerDetectSystem_RemoveFromInactivePlayerMap_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InactivePlayerDetectSystem_AddToLongTimeInactivePlayerMap_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InactivePlayerDetectSystem_AddToInactivePlayerMap_Param
	{
	public:

		struct ADFMCharacter* CHARACTER; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InactivePlayerDetectSystem_AcquireInactivePlayerCharacter_Param
	{
	public:

		struct ADFMCharacter* ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InteractAcquireItemBase_UpdateSkeletonMeshLod_Param
	{
	public:

		struct USkeletalMeshComponent* SkeletalMeshComp; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InteractAcquireItemBase_SetUpdateSkeletonMeshLodImmediately_Param
	{
	public:

	};

	struct Function_DFMGameplay_InteractAcquireItemBase_RefreshTppAppearance_Param
	{
	public:

	};

	struct Function_DFMGameplay_InteractAcquireItemBase_RefreshFppAppearance_Param
	{
	public:

	};

	struct Function_DFMGameplay_InteractAcquireItemBase_OnLoadComplete_Param
	{
	public:

		struct TArray<struct FSoftObjectPath> Path; // 0x00(0x10)
	};

	struct Function_DFMGameplay_InteractAcquireItemBase_GetInventoryId_Param
	{
	public:

		struct FName ReturnValue; // 0x00(0x08)
	};

	struct Function_DFMGameplay_InteractAcquireItemBase_CheckIfSkeletalMeshOrStaticMesh_Param
	{
	public:

		struct UObject* TargetMeshObject; // 0x00(0x08)
		enum class ECheckItemMeshType CheckItemMeshType; // 0x08(0x01)
	};

	struct Function_DFMGameplay_Interactor_ChildLight_OnRepLightInfo_Param
	{
	public:

	};

	struct Function_DFMGameplay_Interactor_ChildLight_OnLightInfoChange_Param
	{
	public:

		bool IsPower; // 0x00(0x01)
		bool IsDamaged; // 0x01(0x01)
	};

	struct Function_DFMGameplay_Interactor_ChildLight_OnDamaged_Param
	{
	public:

	};

	struct Function_DFMGameplay_Interactor_ChildLight_BroadcastDamaged_Param
	{
	public:

	};

	struct Function_DFMGameplay_Interactor_CodedLock_SubNumberActor_OnRep_Number_Param
	{
	public:

		int32_t old; // 0x00(0x04)
	};

	struct Function_DFMGameplay_Interactor_CodedLock_SubNumberActor_OnRep_Index_Param
	{
	public:

		int32_t old; // 0x00(0x04)
	};

	struct Function_DFMGameplay_Interactor_CodedLock_SubNumberActor_InitSubNumberActor_Param
	{
	public:

		int32_t InIndex; // 0x00(0x04)
		int32_t InNumber; // 0x04(0x04)
		char pad_8[0x8]; // 0x08(0x08)
		struct FTransform InTransform; // 0x10(0x30)
		struct UStaticMesh* InMesh; // 0x40(0x08)
	};

	struct Function_DFMGameplay_Interactor_ElevatorDoor_OnRep_CurDoorStateChange_Param
	{
	public:

	};

