
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Class DFMGameHud.AbilityBaseEffectView
// Size: 0x390 (Inherited: 0x388)
class UAbilityBaseEffectView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AbilityDectorMapIconViewController
// Size: 0x2a0 (Inherited: 0x290)
class UAbilityDectorMapIconViewController : public UMapIconViewController {
public:

	char pad_290[0x10]; // 0x290(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AbilityDetectorEnemyItemView
// Size: 0x3b8 (Inherited: 0x388)
class UAbilityDetectorEnemyItemView : public UBaseUIView {
public:

	struct AGPCharacter* Target; // 0x388(0x08)
	struct UImage* AvatarImg; // 0x390(0x08)
	struct UTextBlock* HealthTextBlock; // 0x398(0x08)
	struct UTextBlock* ArmorTextBlock; // 0x3a0(0x08)
	char pad_3A8[0x10]; // 0x3a8(0x10)

	void OnEquipChanged(); // Function DFMGameHud.AbilityDetectorEnemyItemView.OnEquipChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AbilityDetectorEnemyLstHudView
// Size: 0x428 (Inherited: 0x388)
class UAbilityDetectorEnemyLstHudView : public UBaseUIView {
public:

	float DelayHideTime; // 0x388(0x04)
	float KeepingTime; // 0x38c(0x04)
	char pad_390[0x8]; // 0x390(0x08)
	struct UHorizontalBox* HorizontalBox_177; // 0x398(0x08)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_1; // 0x3a0(0x08)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_2; // 0x3a8(0x08)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_3; // 0x3b0(0x08)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_4; // 0x3b8(0x08)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_5; // 0x3c0(0x08)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_6; // 0x3c8(0x08)
	struct UCanvasPanel* RootPanel; // 0x3d0(0x08)
	struct UCanvasPanel* ItemPanel; // 0x3d8(0x08)
	struct UTextBlock* NotFound; // 0x3e0(0x08)
	struct UTextBlock* NearBy; // 0x3e8(0x08)
	struct UWidgetAnimation* Anim_In; // 0x3f0(0x08)
	struct UWidgetAnimation* Anim_Out; // 0x3f8(0x08)
	struct TArray<struct UAbilityDetectorEnemyItemView*> TipsLst; // 0x400(0x10)
	char pad_410[0x10]; // 0x410(0x10)
	struct FTimerHandle Handle; // 0x420(0x08)

	void OnDetectorEnemyChanged(struct AGPCharacter* CHARACTER, bool bShow); // Function DFMGameHud.AbilityDetectorEnemyLstHudView.OnDetectorEnemyChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AbilityDetectorHudController
// Size: 0xb0 (Inherited: 0xb0)
class UAbilityDetectorHudController : public UBaseUIController {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AbilityEngineerVehicleHudController
// Size: 0xb0 (Inherited: 0xb0)
class UAbilityEngineerVehicleHudController : public UBaseUIController {
public:


	void OnVehicleOperate(bool On, struct AActor* Actor, struct ACHARACTER* CHARACTER); // Function DFMGameHud.AbilityEngineerVehicleHudController.OnVehicleOperate // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AbilityLockerView
// Size: 0x480 (Inherited: 0x388)
class UAbilityLockerView : public UBaseUIView {
public:

	struct UCanvasPanel* MarkerCanvas; // 0x388(0x08)
	struct TMap<enum class EGPAbilityLockerType, struct FGameMarkerPool2> MarkerUsingPool; // 0x390(0x50)
	struct TMap<enum class EGPAbilityLockerType, struct FGameMarkerPool2> MarkerNotUsePool; // 0x3e0(0x50)
	struct TMap<enum class EGPAbilityLockerType, struct UClass*> MarkerWidgetsMap; // 0x430(0x50)

	void RemoveWidgetFromUsingPool(enum class EGPAbilityLockerType markerType, int32_t Index); // Function DFMGameHud.AbilityLockerView.RemoveWidgetFromUsingPool // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ActorLocationTipsWidget
// Size: 0x298 (Inherited: 0x298)
class UActorLocationTipsWidget : public UUserWidget {
public:


	void UpdateView(struct AActor* Actor); // Function DFMGameHud.ActorLocationTipsWidget.UpdateView // (Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ActorLocationTipsView
// Size: 0x4a0 (Inherited: 0x388)
class UActorLocationTipsView : public UBaseUIView {
public:

	struct TArray<struct FActorTipsConfig> ActorConfig; // 0x388(0x10)
	struct UCanvasPanel* RootPanel; // 0x398(0x08)
	char pad_3A0[0x50]; // 0x3a0(0x50)
	struct TMap<struct UClass*, struct UCanvasPanel*> SubPanelMap; // 0x3f0(0x50)
	char pad_440[0x60]; // 0x440(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AILabDebugView
// Size: 0x3c0 (Inherited: 0x3b8)
class UAILabDebugView : public UMobileGamePadView {
public:

	struct UAILabOBTeamItemView* AILabDeTeamItem; // 0x3b8(0x08)

	void OnUinInfoChanged(); // Function DFMGameHud.AILabDebugView.OnUinInfoChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AILabOBHudView
// Size: 0x490 (Inherited: 0x388)
class UAILabOBHudView : public UBaseUIView {
public:

	struct UAILabOBTeamItemView* AILabTeamItem_00; // 0x388(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_01; // 0x390(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_02; // 0x398(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_03; // 0x3a0(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_11; // 0x3a8(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_12; // 0x3b0(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_13; // 0x3b8(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_14; // 0x3c0(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_21; // 0x3c8(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_22; // 0x3d0(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_23; // 0x3d8(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_24; // 0x3e0(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_31; // 0x3e8(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_32; // 0x3f0(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_33; // 0x3f8(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem_34; // 0x400(0x08)
	struct UAILabOBTeamItemView* AILabTeamItem; // 0x408(0x08)
	struct UAILabOBTeamItemView* AITeamItem; // 0x410(0x08)
	struct UAILabOBTeamItemView* AILabControlTeamItem; // 0x418(0x08)
	struct UAILabStyleView* AILabStyleItem; // 0x420(0x08)
	struct TArray<struct UAILabOBTeamItemView*> AllPlayerTeamInfo; // 0x428(0x10)
	char pad_438[0x28]; // 0x438(0x28)
	struct FString CurrentSpectatorName; // 0x460(0x10)
	struct FString CurrentSpectatorUin; // 0x470(0x10)
	struct TArray<struct ADFMCharacter*> AllClientCharacters; // 0x480(0x10)

	void OnSpectateBriefInfoChanged(); // Function DFMGameHud.AILabOBHudView.OnSpectateBriefInfoChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AILabOBTeamItemView
// Size: 0x2d8 (Inherited: 0x298)
class UAILabOBTeamItemView : public UUserWidget {
public:

	struct UComboBoxString* ComboBoxString_Team; // 0x298(0x08)
	struct UAILabOBHudView* ParentWidget; // 0x2a0(0x08)
	int32_t MyTeamID; // 0x2a8(0x04)
	int32_t CampId; // 0x2ac(0x04)
	struct TArray<struct FSpectatorBriefInfo> AllBriefInfo; // 0x2b0(0x10)
	struct TArray<struct FString> DropDownListItem; // 0x2c0(0x10)
	char pad_2D0[0x4]; // 0x2d0(0x04)
	int32_t Uin; // 0x2d4(0x04)

	void OnUinClicked(struct FString Value); // Function DFMGameHud.AILabOBTeamItemView.OnUinClicked // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AILabStyleView
// Size: 0x2c0 (Inherited: 0x298)
class UAILabStyleView : public UUserWidget {
public:

	struct UComboBoxString* ComboBoxString_Team; // 0x298(0x08)
	struct UAILabOBHudView* ParentWidget; // 0x2a0(0x08)
	int32_t Style; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct TArray<struct FString> DropDownListItem; // 0x2b0(0x10)

	void OnItemClicked(struct FString Value); // Function DFMGameHud.AILabStyleView.OnItemClicked // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AIMsgHUDView
// Size: 0x460 (Inherited: 0x388)
class UAIMsgHUDView : public UBaseUIView {
public:

	struct UClass* VisionDirMsgWidget; // 0x388(0x08)
	float SafeRatio; // 0x390(0x04)
	float AlertMsgLastTime; // 0x394(0x04)
	float FightMsgLastTime; // 0x398(0x04)
	char pad_39C[0x4]; // 0x39c(0x04)
	struct UCanvasPanel* ViewPanel; // 0x3a0(0x08)
	struct TMap<struct ADFMCharacter*, struct FAIMsgWidgets> AIMsgMap; // 0x3a8(0x50)
	struct UDFMCharacterAmbientAudioFSM* DFMCharacterAmbientAudioFSM; // 0x3f8(0x08)
	struct UDFMProcessAIMsgComponent* ProcessAIMsgComponent; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
	struct TMap<struct ADFMCharacter*, struct UPlayerMarkerAIMakerWidget*> AIMarkerMap; // 0x410(0x50)

	void PlayerControllerChanged(struct APlayerController* NewController); // Function DFMGameHud.AIMsgHUDView.PlayerControllerChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AmmoAddTips
// Size: 0x418 (Inherited: 0x388)
class UAmmoAddTips : public UBaseUIView {
public:

	struct UImage* Image; // 0x388(0x08)
	struct UImage* Image_2; // 0x390(0x08)
	struct UImage* Image_3; // 0x398(0x08)
	struct UImage* Image_4; // 0x3a0(0x08)
	struct UImage* Image_5; // 0x3a8(0x08)
	struct UImage* Image_6; // 0x3b0(0x08)
	struct URichTextBlock* wRichText_2; // 0x3b8(0x08)
	struct URichTextBlock* wRichText_3; // 0x3c0(0x08)
	struct URichTextBlock* wRichText_4; // 0x3c8(0x08)
	struct URichTextBlock* wRichText_5; // 0x3d0(0x08)
	struct URichTextBlock* wRichText_6; // 0x3d8(0x08)
	struct URichTextBlock* wRichText_7; // 0x3e0(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x3e8(0x08)
	struct UWidgetAnimation* WeaponAnimIn; // 0x3f0(0x08)
	struct UWidgetAnimation* WeaponAnimOut; // 0x3f8(0x08)
	char pad_400[0x8]; // 0x400(0x08)
	struct TArray<struct FLinearColor> BulletColorByLevel; // 0x408(0x10)

	void OnShowTips(struct TArray<int32_t>& BulletLevelArray); // Function DFMGameHud.AmmoAddTips.OnShowTips // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ReloadRouletteHUDView
// Size: 0x530 (Inherited: 0x388)
class UReloadRouletteHUDView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct TArray<enum class GameHUDSate> InvisibleFocusHUDState; // 0x390(0x10)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem; // 0x3a0(0x08)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_2; // 0x3a8(0x08)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_3; // 0x3b0(0x08)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_4; // 0x3b8(0x08)
	struct UUserWidget* WBP_ReloadRouletteText; // 0x3c0(0x08)
	struct UUserWidget* WBP_ReloadRouletteText_2; // 0x3c8(0x08)
	struct UUserWidget* WBP_ReloadRouletteText_3; // 0x3d0(0x08)
	struct UUserWidget* WBP_ReloadRouletteText_4; // 0x3d8(0x08)
	struct UTextBlock* wtCenterText; // 0x3e0(0x08)
	struct UTextBlock* wtSubText; // 0x3e8(0x08)
	struct UVerticalBox* VerticalBox_2; // 0x3f0(0x08)
	struct UImage* DFImage_9; // 0x3f8(0x08)
	struct UImage* TouchPoint; // 0x400(0x08)
	struct UCommonRouletteInfoView* WBP_CommonRouletteInfo; // 0x408(0x08)
	struct UWidgetAnimation* Anim_RotateRight; // 0x410(0x08)
	struct UWidgetAnimation* Anim_RotateLeft; // 0x418(0x08)
	float InnerRadius; // 0x420(0x04)
	float OuterRadius; // 0x424(0x04)
	bool bEnableDebugView; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct TMap<int32_t, struct FText> NameTextMap; // 0x430(0x50)
	struct FText CancelText; // 0x480(0x18)
	struct FVector2D CurrentCenterPos; // 0x498(0x08)
	struct FVector2D CurrentTouchPointPos; // 0x4a0(0x08)
	struct UGPInputReloadLogic* ReloadLogic; // 0x4a8(0x08)
	struct TArray<struct FInventoryItemInfo> AmmoSortedList; // 0x4b0(0x10)
	struct FText AmmoInfoText; // 0x4c0(0x18)
	struct TArray<struct UReloadRouletteItemView*> ReloadRouletteItems; // 0x4d8(0x10)
	struct UDFMWeaponDataComponentAmmo_Item* DCAmmo_Item; // 0x4e8(0x08)
	struct TArray<struct UUserWidget*> ReloadRouletteTextItems; // 0x4f0(0x10)
	struct TArray<struct UTextBlock*> ReloadRouletteTexts; // 0x500(0x10)
	struct TArray<struct UDFMImage*> ReloadRouletteImages; // 0x510(0x10)
	char pad_520[0x10]; // 0x520(0x10)

	void OnTouchPointNumChanged(int32_t TouchPointNum); // Function DFMGameHud.ReloadRouletteHUDView.OnTouchPointNumChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ReloadRouletteItemView
// Size: 0x298 (Inherited: 0x298)
class UReloadRouletteItemView : public UUserWidget {
public:


	void BPSetType(bool Selected, int32_t InType); // Function DFMGameHud.ReloadRouletteItemView.BPSetType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AnimShowSettings
// Size: 0x48 (Inherited: 0x30)
class UAnimShowSettings : public UObject {
public:

	bool bShowFPP; // 0x30(0x01)
	bool bShowTPP; // 0x31(0x01)
	bool bShowMontage; // 0x32(0x01)
	bool bShowBSDetail; // 0x33(0x01)
	bool bShowCurves; // 0x34(0x01)
	bool bShowVars; // 0x35(0x01)
	bool bShowEvals; // 0x36(0x01)
	bool bShowWpn; // 0x37(0x01)
	struct FString SearchString; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AnimDebugLogView
// Size: 0x488 (Inherited: 0x3b8)
class UAnimDebugLogView : public UMobileGamePadView {
public:

	char pad_3B8[0x20]; // 0x3b8(0x20)
	struct URichTextBlock* RichTextBlockLog; // 0x3d8(0x08)
	enum class EAnimDebugType DebugType; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)
	struct UEditableTextBox* RichTextBlockLogFilterText; // 0x3e8(0x08)
	struct UEditableTextBox* SearchTextBox; // 0x3f0(0x08)
	struct UComboBoxString* SelectCharacterCmd; // 0x3f8(0x08)
	char pad_400[0x20]; // 0x400(0x20)
	struct UCheckbox* AnimShowFPPCheckBox; // 0x420(0x08)
	struct UCheckbox* AnimShowTPPCheckBox; // 0x428(0x08)
	struct UCheckbox* AnimShowMontageCheckBox; // 0x430(0x08)
	struct UCheckbox* AnimShowBSDetailCheckBox; // 0x438(0x08)
	struct UCheckbox* AnimShowCurvesCheckBox; // 0x440(0x08)
	struct UCheckbox* AnimShowVarsCheckBox; // 0x448(0x08)
	struct UCheckbox* AnimShowEvalsCheckBox; // 0x450(0x08)
	struct UCheckbox* AnimShowWpnCheckBox; // 0x458(0x08)
	struct TArray<struct AActor*> AllActors; // 0x460(0x10)
	int32_t CurrentActorId; // 0x470(0x04)
	char pad_474[0x14]; // 0x474(0x14)

	void ShowDebugPanel(bool Show, enum class EAnimDebugType ShowDebugType); // Function DFMGameHud.AnimDebugLogView.ShowDebugPanel // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AccessAnimInstance
// Size: 0x280 (Inherited: 0x280)
class UAccessAnimInstance : public UAnimInstance {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AnimTrackingWidget
// Size: 0x298 (Inherited: 0x298)
class UAnimTrackingWidget : public UUserWidget {
public:


	void BP_PlayTrackingAnimation(); // Function DFMGameHud.AnimTrackingWidget.BP_PlayTrackingAnimation // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.AssistedAimingDebugLogView
// Size: 0x410 (Inherited: 0x3b8)
class UAssistedAimingDebugLogView : public UMobileGamePadView {
public:

	struct FAssistedAimingDebugViewInfo LogAssistedAimingInfo; // 0x3b8(0x50)
	bool bEnableRecoilGraph; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)

	void OnRotateStickyLogInfo(float StickyParam, float Friction, float MoveSpeed, float DistanceHorizontal, float ReduceScale, bool bHitPreventMissEnable, int32_t HitContinueMissNumber, float HitPreventMissStartTime, float HitBulletRadius); // Function DFMGameHud.AssistedAimingDebugLogView.OnRotateStickyLogInfo // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BallisticTargetHUDView
// Size: 0x438 (Inherited: 0x388)
class UBallisticTargetHUDView : public UBaseUIView {
public:

	struct FSlateBrush CraterBrush; // 0x388(0x90)
	struct FVector2D CraterSize; // 0x418(0x08)
	struct UCanvasPanel* GraphPanel; // 0x420(0x08)
	struct TArray<struct UImage*> Craters; // 0x428(0x10)

	void ResetCraters(); // Function DFMGameHud.BallisticTargetHUDView.ResetCraters // (Final|Native|Protected|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BattleFieldSafeAreaScreenEffectHUD
// Size: 0x498 (Inherited: 0x388)
class UBattleFieldSafeAreaScreenEffectHUD : public UBaseUIView {
public:

	/*struct TSoftObjectPtr<UMaterialInstance>*/char LeaveSafeAreaStartMI[0x28]; // 0x388(0x28)
	/*struct TSoftObjectPtr<UMaterialInstance>*/char LeaveSafeAreaLoopMI[0x28]; // 0x3b0(0x28)
	/*struct TSoftObjectPtr<UMaterialInstance>*/char LeaveSafeAreaEndMI[0x28]; // 0x3d8(0x28)
	struct AGPCharacter* GPCharacter; // 0x400(0x08)
	char pad_408[0x30]; // 0x408(0x30)
	float SafeAreaFadeInTime; // 0x438(0x04)
	float SafeAreaFadeOutTime; // 0x43c(0x04)
	float SafeAreaFadeDeltaTime; // 0x440(0x04)
	float CountDownRefreshDeltaTime; // 0x444(0x04)
	float GuideRefreshFrequency; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct UTextBlock* HintText; // 0x450(0x08)
	struct UImage* ArrowImage; // 0x458(0x08)
	struct UTextBlock* countdown; // 0x460(0x08)
	struct UWidgetAnimation* NumbAnim; // 0x468(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_in; // 0x470(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_loop; // 0x478(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_out; // 0x480(0x08)
	struct FLinearColor ArrowImageColor; // 0x488(0x10)

	void OnMatchOver(enum class EMatchOverReason& MatchOverReason); // Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.OnMatchOver // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BattleStatusHud
// Size: 0x3a8 (Inherited: 0x388)
class UBattleStatusHud : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)
	struct UBaseBattleStatusItem* CurrentActiveWidget; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)

	void RefreshSneakView(); // Function DFMGameHud.BattleStatusHud.RefreshSneakView // (Final|Native|Private) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BaseBattleStatusItem
// Size: 0x298 (Inherited: 0x298)
class UBaseBattleStatusItem : public UUserWidget {
public:


	void BPShow(); // Function DFMGameHud.BaseBattleStatusItem.BPShow // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BloodBarTipsHud
// Size: 0x470 (Inherited: 0x388)
class UBloodBarTipsHud : public UBaseUIView {
public:

	struct TArray<struct UBloodBarTipsHudItem*> BloodUIitems; // 0x388(0x10)
	struct UCanvasPanel* Container; // 0x398(0x08)
	struct UClass* ItemClass; // 0x3a0(0x08)
	struct FVector2D offset; // 0x3a8(0x08)
	char pad_3B0[0x30]; // 0x3b0(0x30)
	struct TMap<uint64_t, struct UBloodBarTipsHudItem*> BloodCharacterMap; // 0x3e0(0x50)
	struct ADFMCharacter* CurShowCharacter; // 0x430(0x08)
	char pad_438[0x10]; // 0x438(0x10)
	struct TArray<struct UBloodBarTipsHudItem*> AllUIItems; // 0x448(0x10)
	char pad_458[0x18]; // 0x458(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BloodBarTipsHudItem
// Size: 0x2c8 (Inherited: 0x298)
class UBloodBarTipsHudItem : public UUserWidget {
public:

	struct UTextBlock* NameTxt; // 0x298(0x08)
	struct ACHARACTER* OwnCharacter; // 0x2a0(0x08)
	bool IsFinshed; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct UBloodBarTipsHud* ParentHud; // 0x2b0(0x08)
	char pad_2B8[0x10]; // 0x2b8(0x10)

	void OnUpdateHealthBar(float Health, bool Initialize); // Function DFMGameHud.BloodBarTipsHudItem.OnUpdateHealthBar // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BloodBarTipsUIController
// Size: 0xf0 (Inherited: 0xb0)
class UBloodBarTipsUIController : public UBaseUIController {
public:

	struct UBloodBarTipsHud* BloodBarTipsHud; // 0xb0(0x08)
	float CheckDistance; // 0xb8(0x04)
	float ZoomCheckDistance; // 0xbc(0x04)
	float FrameTime; // 0xc0(0x04)
	char pad_C4[0x1]; // 0xc4(0x01)
	bool bIsAsync; // 0xc5(0x01)
	char pad_C6[0xa]; // 0xc6(0x0a)
	struct ADFMCharacter* HitCharater; // 0xd0(0x08)
	char pad_D8[0x18]; // 0xd8(0x18)

	void OnCharRestart(struct AGPCharacterBase* CHARACTER); // Function DFMGameHud.BloodBarTipsUIController.OnCharRestart // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BossBeLaserScreenEffectHUD
// Size: 0x3e8 (Inherited: 0x388)
class UBossBeLaserScreenEffectHUD : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct UImage* Image_Right; // 0x390(0x08)
	struct UImage* Image_Left; // 0x398(0x08)
	struct AActor* BossActor; // 0x3a0(0x08)
	struct AActor* SelfActor; // 0x3a8(0x08)
	float BlockSightValue; // 0x3b0(0x04)
	float InAlphaValue; // 0x3b4(0x04)
	float BlockSightDelay; // 0x3b8(0x04)
	float InAlphaDelay; // 0x3bc(0x04)
	float MaxAliveTime; // 0x3c0(0x04)
	bool EnableTraceTest; // 0x3c4(0x01)
	char pad_3C5[0x3]; // 0x3c5(0x03)
	float ForwardMin; // 0x3c8(0x04)
	float ForwardMax; // 0x3cc(0x04)
	float RightMin; // 0x3d0(0x04)
	float RightMax; // 0x3d4(0x04)
	float DirectionMin; // 0x3d8(0x04)
	float DirectionMax; // 0x3dc(0x04)
	float FocusClamp; // 0x3e0(0x04)
	bool bDebugDraw; // 0x3e4(0x01)
	char pad_3E5[0x3]; // 0x3e5(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BossBeLaserScreenEffectController
// Size: 0x150 (Inherited: 0x148)
class UBossBeLaserScreenEffectController : public UScreenEffectControllerBase {
public:

	struct TWeakObjectPtr<struct UBossBeLaserScreenEffectHUD> CacheBossLaserScreenUI; // 0x148(0x08)

	void SetupBossActor(struct AActor* Boss); // Function DFMGameHud.BossBeLaserScreenEffectController.SetupBossActor // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BossLocationViewController
// Size: 0x2b0 (Inherited: 0x290)
class UBossLocationViewController : public UMapIconViewController {
public:

	char pad_290[0x20]; // 0x290(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BreakAwayScreenEffectHUD
// Size: 0x3a8 (Inherited: 0x388)
class UBreakAwayScreenEffectHUD : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)
	struct UWidgetAnimation* WBP_ScreenEff_Recharge_Loop_In; // 0x398(0x08)
	struct UWidgetAnimation* WBP_ScreenEff_Recharge_Loop_out; // 0x3a0(0x08)

	void OnOutAnimaPlayEnd(); // Function DFMGameHud.BreakAwayScreenEffectHUD.OnOutAnimaPlayEnd // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BreakAwayScreenEffectController
// Size: 0x150 (Inherited: 0x148)
class UBreakAwayScreenEffectController : public UScreenEffectControllerBase {
public:

	struct TWeakObjectPtr<struct UBaseUIView> CacheLowHealthScreenUI; // 0x148(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BroadcastHudItem
// Size: 0x700 (Inherited: 0x388)
class UBroadcastHudItem : public UBaseUIView {
public:

	struct UTextBlock* KillerNameText; // 0x388(0x08)
	struct UImage* KillIcon; // 0x390(0x08)
	struct UTextBlock* BekilledNameText; // 0x398(0x08)
	struct UImage* RankIcon_Killer; // 0x3a0(0x08)
	struct UImage* KnockDownIcon; // 0x3a8(0x08)
	struct UImage* RankIcon_Killee; // 0x3b0(0x08)
	struct UImage* GameInfoIcon; // 0x3b8(0x08)
	struct UImage* Icon_Testing; // 0x3c0(0x08)
	bool bIsFinished; // 0x3c8(0x01)
	char pad_3C9[0x1]; // 0x3c9(0x01)
	bool bIfNeedAlwaysShow; // 0x3ca(0x01)
	char pad_3CB[0x5]; // 0x3cb(0x05)
	struct TMap<enum class EBroadcastNameColorType, struct FBroadcastHudNameColor> NameColorMap; // 0x3d0(0x50)
	struct TMap<enum class EBroadcastTeamInfoType, struct UPaperSprite*> TeamIconMap; // 0x420(0x50)
	struct TMap<enum class EBroadcastGameInfoType, struct UPaperSprite*> GameInfoIconMap; // 0x470(0x50)
	struct TMap<enum class EDeadType, struct UPaperSprite*> KillIconMap; // 0x4c0(0x50)
	struct TMap<enum class EBroadcastKillIconType, struct UPaperSprite*> KillTypeIconMap; // 0x510(0x50)
	struct FSoftObjectPath DefaultKillIcon; // 0x560(0x18)
	bool bUseVehicleIcon; // 0x578(0x01)
	char pad_579[0x7]; // 0x579(0x07)
	struct FSlateColor SelfNameColor; // 0x580(0x28)
	struct FLinearColor SelfNameOutlineColor; // 0x5a8(0x10)
	struct FSlateColor SelfNameColor_MP; // 0x5b8(0x28)
	struct FLinearColor SelfNameOutlineColor_MP; // 0x5e0(0x10)
	struct FSlateColor TeamNameColor; // 0x5f0(0x28)
	struct FLinearColor TeamNameOutColor; // 0x618(0x10)
	struct FSlateColor EnemyNameColor; // 0x628(0x28)
	struct FLinearColor EnemyNameOutColor; // 0x650(0x10)
	struct FSlateColor GameInfoColor; // 0x660(0x28)
	struct FLinearColor GameInfoOutlineColor; // 0x688(0x10)
	struct FSlateColor BF_Camp_NameColor; // 0x698(0x28)
	struct FLinearColor BF_Camp_NameColor_Outline; // 0x6c0(0x10)
	char pad_6D0[0x30]; // 0x6d0(0x30)

	void SetHidden(); // Function DFMGameHud.BroadcastHudItem.SetHidden // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BroadcastHudView
// Size: 0x5e0 (Inherited: 0x388)
class UBroadcastHudView : public UBaseUIView {
public:

	float DisplayTime; // 0x388(0x04)
	float Interval; // 0x38c(0x04)
	float MoveTime; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct FRuntimeFloatCurve MoveCurve; // 0x398(0xa0)
	int32_t MaxShowNum; // 0x438(0x04)
	float Vertical_Spacing; // 0x43c(0x04)
	struct UCanvasPanel* TipContainer; // 0x440(0x08)
	struct FVector2D ChildPanelSlotSize; // 0x448(0x08)
	struct UClass* BroadcastTipItemClass; // 0x450(0x08)
	int32_t PreSpwanItemNum; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct TArray<struct UBroadcastHudItem*> BroadcastUIItemArr; // 0x460(0x10)
	char pad_470[0x10]; // 0x470(0x10)
	struct ADFMGameState* GPGameState; // 0x480(0x08)
	struct ADFMPlayerController* GPPlayerController; // 0x488(0x08)
	struct TMap<uint64_t, struct FSoftObjectPath> WeaponIconCache; // 0x490(0x50)
	char pad_4E0[0x10]; // 0x4e0(0x10)
	struct TArray<struct UBroadcastHudItem*> RemoveItems; // 0x4f0(0x10)
	struct TArray<struct UBroadcastHudItem*> ReuseableItems; // 0x500(0x10)
	char pad_510[0xc8]; // 0x510(0xc8)
	float Vertical_Offset; // 0x5d8(0x04)
	char pad_5DC[0x4]; // 0x5dc(0x04)

	void PopBroadcastMsg(); // Function DFMGameHud.BroadcastHudView.PopBroadcastMsg // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BuffAndStaminaViewPC
// Size: 0x768 (Inherited: 0x5a8)
class UBuffAndStaminaViewPC : public ULuaUIHudBaseView {
public:

	bool bAlwayseShowHealthTipBox; // 0x5a8(0x01)
	char pad_5A9[0x3]; // 0x5a9(0x03)
	int32_t HealthTipAnimationCount; // 0x5ac(0x04)
	struct FUIAnimationController AnimationController; // 0x5b0(0x20)
	struct UBorder* wtBuffDetialTipWindow; // 0x5d0(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_HealthTipBox; // 0x5d8(0x08)
	struct UImage* ProgressBar_Base; // 0x5e0(0x08)
	struct UImage* ProgressBar_Extra; // 0x5e8(0x08)
	struct UImage* ProgressBar_Front_FX; // 0x5f0(0x08)
	struct UCanvasPanel* StaminaCanvasPanel; // 0x5f8(0x08)
	struct FName KeyProgress; // 0x600(0x08)
	struct FName KeyProgressDown; // 0x608(0x08)
	struct FName Num; // 0x610(0x08)
	struct FName KeyColor; // 0x618(0x08)
	struct FName KeyColorDown; // 0x620(0x08)
	float StaminaChangeSpeed; // 0x628(0x04)
	float ChangeAnimThreshold; // 0x62c(0x04)
	float LowStaminaValue; // 0x630(0x04)
	float BaseStaminaMaxValue; // 0x634(0x04)
	float FullStaminaFlushTime; // 0x638(0x04)
	float BackCountdownTime; // 0x63c(0x04)
	float playStaminaChangeFlushThreshold; // 0x640(0x04)
	struct FLinearColor BaseFrontColor; // 0x644(0x10)
	struct FLinearColor BaseDownColor; // 0x654(0x10)
	struct FLinearColor ExtraFrontColor; // 0x664(0x10)
	struct FLinearColor ExtraDownColor; // 0x674(0x10)
	struct FLinearColor ConsumeDownColor; // 0x684(0x10)
	struct FLinearColor LowStaminaColor; // 0x694(0x10)
	char pad_6A4[0x2c]; // 0x6a4(0x2c)
	struct UMaterialInstanceDynamic* BaseMaterial; // 0x6d0(0x08)
	struct UMaterialInstanceDynamic* ExtraMaterial; // 0x6d8(0x08)
	struct UMaterialInstanceDynamic* FXMaterial; // 0x6e0(0x08)
	struct AGPCharacter* LocalCharacter; // 0x6e8(0x08)
	struct UGPStaminaDataComponent* StaminaComp; // 0x6f0(0x08)
	struct UWidgetAnimation* LowStaminaAnimation; // 0x6f8(0x08)
	struct ADFMCharacter* DFMCharacter; // 0x700(0x08)
	bool bIsOpenBag; // 0x708(0x01)
	char pad_709[0x3]; // 0x709(0x03)
	int32_t HasHealthDebuffCount; // 0x70c(0x04)
	struct TArray<uint32_t> HealthDebuffList; // 0x710(0x10)
	struct UGPInputAimLogic* InputAimLogic; // 0x720(0x08)
	bool bCacheIsZooming; // 0x728(0x01)
	char pad_729[0x7]; // 0x729(0x07)
	struct UHoldBreathIconView* WBP_HoldBreathIcon; // 0x730(0x08)
	float LowBreathPercent; // 0x738(0x04)
	float ShowIconPercent; // 0x73c(0x04)
	bool bHasPlayExhaustAnim; // 0x740(0x01)
	bool bInFadeIn; // 0x741(0x01)
	bool bInFadeOut; // 0x742(0x01)
	bool bFadeInAndOutCompleted; // 0x743(0x01)
	char pad_744[0x24]; // 0x744(0x24)

	void UpdateKeyTip(); // Function DFMGameHud.BuffAndStaminaViewPC.UpdateKeyTip // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BuffItemHUDView
// Size: 0x3b0 (Inherited: 0x388)
class UBuffItemHUDView : public UBaseUIView {
public:

	struct UTextBlock* CountText; // 0x388(0x08)
	struct UButton* BuffBtn; // 0x390(0x08)
	struct UImage* Image_91; // 0x398(0x08)
	struct UImage* BuffImage; // 0x3a0(0x08)
	bool bLoading; // 0x3a8(0x01)
	char pad_3A9[0x3]; // 0x3a9(0x03)
	uint32_t CurrentBuffId; // 0x3ac(0x04)

	void UpdatePrograss(uint64_t InArg1, uint64_t InArg2, uint64_t InArg3); // Function DFMGameHud.BuffItemHUDView.UpdatePrograss // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BuffListDetailHUDView
// Size: 0x3f8 (Inherited: 0x3b8)
class UBuffListDetailHUDView : public UMobileGamePadView {
public:

	struct TArray<struct UBuffListDetailItemView*> ItemList; // 0x3b8(0x10)
	struct UScrollBox* Scroll_Box; // 0x3c8(0x08)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo; // 0x3d0(0x08)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_2; // 0x3d8(0x08)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_3; // 0x3e0(0x08)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_4; // 0x3e8(0x08)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_5; // 0x3f0(0x08)

	void SetBuffList(struct TArray<struct FCharacterBuff>& buffArray); // Function DFMGameHud.BuffListDetailHUDView.SetBuffList // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BuffListDetailItemView
// Size: 0x2c0 (Inherited: 0x298)
class UBuffListDetailItemView : public UUserWidget {
public:

	struct UBuffItemHUDView* BuffItem1_2; // 0x298(0x08)
	struct UTextBlock* TextName; // 0x2a0(0x08)
	struct UTextBlock* TextTime; // 0x2a8(0x08)
	struct UTextBlock* TextDesc; // 0x2b0(0x08)
	char pad_2B8[0x8]; // 0x2b8(0x08)

	void SetCharacterBuffEffectEntity(struct FName Ebuff, struct UDFMCharacterBuffEntityBase* BuffEntity, uint32_t Cnt, uint32_t BuffId); // Function DFMGameHud.BuffListDetailItemView.SetCharacterBuffEffectEntity // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ButtonClickProxy
// Size: 0x50 (Inherited: 0x30)
class UButtonClickProxy : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct UButton* Button; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)

	void OnButtonClick(); // Function DFMGameHud.ButtonClickProxy.OnButtonClick // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CaptureTextView
// Size: 0x2a0 (Inherited: 0x298)
class UCaptureTextView : public UUserWidget {
public:

	bool bIsRed; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)

	void ShowCapturedBgImage(bool bShow); // Function DFMGameHud.CaptureTextView.ShowCapturedBgImage // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterArmorBarItem
// Size: 0x300 (Inherited: 0x298)
class UCharacterArmorBarItem : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct UImage* ProgressBar_Fore; // 0x2a0(0x08)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	struct UMaterialInstanceDynamic* FrontMaterial; // 0x2b0(0x08)
	char pad_2B8[0x48]; // 0x2b8(0x48)

	void SetCharacterArmorBarView(struct FCharacterArmorBarItemView ViewData); // Function DFMGameHud.CharacterArmorBarItem.SetCharacterArmorBarView // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterArmorStatusItem
// Size: 0x310 (Inherited: 0x298)
class UCharacterArmorStatusItem : public UUserWidget {
public:

	struct FLinearColor ColorDown_Add; // 0x298(0x10)
	struct FLinearColor ColorDown_Reduce; // 0x2a8(0x10)
	struct URadialImage* DFProgressBar_Damage; // 0x2b8(0x08)
	struct URadialImage* DFProgressBar_Base; // 0x2c0(0x08)
	struct URadialImage* DFProgressBar_Extra; // 0x2c8(0x08)
	float HitAnimSpeed; // 0x2d0(0x04)
	bool bEnableTickAnim; // 0x2d4(0x01)
	char pad_2D5[0xb]; // 0x2d5(0x0b)
	struct FArmorStatusDataView Data; // 0x2e0(0x10)
	char pad_2F0[0x18]; // 0x2f0(0x18)
	struct TWeakObjectPtr<struct ADFMCharacter> CharacterPtr; // 0x308(0x08)

	void Update(float Delta); // Function DFMGameHud.CharacterArmorStatusItem.Update // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterAttrsDebugItem
// Size: 0x2a0 (Inherited: 0x298)
class UCharacterAttrsDebugItem : public UUserWidget {
public:

	struct URichTextBlock* TextBlock; // 0x298(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterAttrsDebugHud
// Size: 0x3c8 (Inherited: 0x388)
class UCharacterAttrsDebugHud : public UBaseUIView {
public:

	struct UComboBoxString* AttributeSetSelectComboBoxStringx; // 0x388(0x08)
	struct UScrollBox* AttributesList; // 0x390(0x08)
	char pad_398[0x20]; // 0x398(0x20)
	struct ADFMCharacter* CHARACTER; // 0x3b8(0x08)
	struct UCharacterAttributesCenterComponent* CacheAttributesCenterComponent; // 0x3c0(0x08)

	void RefreshAttributesOpDatas(); // Function DFMGameHud.CharacterAttrsDebugHud.RefreshAttributesOpDatas // (Final|Native|Private) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterBloodBase
// Size: 0x390 (Inherited: 0x298)
class UCharacterBloodBase : public UUserWidget {
public:

	struct UTextBlock* wtHealthValueTxt; // 0x298(0x08)
	struct UTextBlock* wtMaxValueTxt; // 0x2a0(0x08)
	struct UImage* ArmBarImage; // 0x2a8(0x08)
	struct UImage* AddImg; // 0x2b0(0x08)
	struct UImage* HeathBarBottomLine; // 0x2b8(0x08)
	char pad_2C0[0x8]; // 0x2c0(0x08)
	struct URadialImage* DFProgressBar_Base; // 0x2c8(0x08)
	struct URadialImage* DFProgressBar_Extra; // 0x2d0(0x08)
	struct UProgressBar* ProgressBar_Stripe; // 0x2d8(0x08)
	struct UWidgetAnimation* ProgressBar_Stripe_Anim_In; // 0x2e0(0x08)
	struct UWidgetAnimation* ProgressBar_Stripe_Anim_Out; // 0x2e8(0x08)
	struct TArray<struct FLinearColor> RefColorArray; // 0x2f0(0x10)
	char pad_300[0x8]; // 0x300(0x08)
	struct UMaterialInstanceDynamic* FrontMaterial; // 0x308(0x08)
	char pad_310[0x28]; // 0x310(0x28)
	struct UWidgetAnimation* DebuffBloodAnimation; // 0x338(0x08)
	struct TWeakObjectPtr<struct ADFMCharacter> CharacterPtr; // 0x340(0x08)
	char pad_348[0x8]; // 0x348(0x08)
	bool bNeedHandleLowHealthColor; // 0x350(0x01)
	char pad_351[0x3]; // 0x351(0x03)
	struct FLinearColor IncreaseColor; // 0x354(0x10)
	struct FLinearColor DecreaseColor; // 0x364(0x10)
	float LowHealthPercent; // 0x374(0x04)
	float HitAnimSpeed; // 0x378(0x04)
	float CacheLastHealth; // 0x37c(0x04)
	struct UCharacterBloodHandleBase* HandleClass; // 0x380(0x08)
	char pad_388[0x8]; // 0x388(0x08)

	void SetListenBuffEventTag(struct ADFMCharacter* InCharacter, struct FName InListenBuffEventTag); // Function DFMGameHud.CharacterBloodBase.SetListenBuffEventTag // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterBuffListView
// Size: 0x90 (Inherited: 0x30)
class UCharacterBuffListView : public UObject {
public:

	struct TArray<struct UCommonBuffItemView*> wtBuffItemViewLists; // 0x30(0x10)
	struct UPanelWidget* wtBuffContent; // 0x40(0x08)
	struct UClass* wtBuffItemViewClass; // 0x48(0x08)
	struct UCharaterBuffDetailTipView* BuffDetailTipView; // 0x50(0x08)
	struct FVector2D ItemBoxSize; // 0x58(0x08)
	struct TWeakObjectPtr<struct ADFMCharacter> CHARACTER; // 0x60(0x08)
	char pad_68[0x18]; // 0x68(0x18)
	struct TArray<uint32_t> HealthDebuffList; // 0x80(0x10)

	void UpdateBuffList(); // Function DFMGameHud.CharacterBuffListView.UpdateBuffList // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterHealthInfoHud
// Size: 0x3f0 (Inherited: 0x388)
class UCharacterHealthInfoHud : public UBaseUIView {
public:

	struct UUserWidget* wtArmorRoot; // 0x388(0x08)
	struct UCharacterArmorStatusItem* wtArmorHelmet; // 0x390(0x08)
	struct UCharacterArmorStatusItem* wtArmorBreastPlate; // 0x398(0x08)
	struct UCharacterBloodBase* wtCharacterBloodBar; // 0x3a0(0x08)
	struct UClass* wtBuffItemViewClass; // 0x3a8(0x08)
	struct UCharacterBuffListView* CharacterBuffListView; // 0x3b0(0x08)
	struct UCharacterBuffListView* CharacterBuffDetailTipItemView; // 0x3b8(0x08)
	struct UCharaterBuffDetailTipView* BuffDetailTipView; // 0x3c0(0x08)
	struct UClass* wtBuffDetailTipItemViewClass; // 0x3c8(0x08)
	struct UCharacterMiniManView* MiniManView; // 0x3d0(0x08)
	struct TWeakObjectPtr<struct ADFMCharacter> CacheChar; // 0x3d8(0x08)
	struct TWeakObjectPtr<struct USOLCharacterEquipComponent> CacheEquipComponent; // 0x3e0(0x08)
	struct TWeakObjectPtr<struct UDFMHealthDataComponent> CacheHealthCom; // 0x3e8(0x08)

	void OnWatchCharEquipmentChanage(); // Function DFMGameHud.CharacterHealthInfoHud.OnWatchCharEquipmentChanage // (Final|Native|Private) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharacterMiniManView
// Size: 0x2b8 (Inherited: 0x298)
class UCharacterMiniManView : public UUserWidget {
public:

	struct TArray<struct UPaperSprite*> PoseSprites; // 0x298(0x10)
	struct UImage* MinimanImage; // 0x2a8(0x08)
	struct TWeakObjectPtr<struct ADFMCharacter> CHARACTER; // 0x2b0(0x08)

	void UpdatePose(); // Function DFMGameHud.CharacterMiniManView.UpdatePose // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharaterBuffDetailTipItemView
// Size: 0x2f8 (Inherited: 0x298)
class UCharaterBuffDetailTipItemView : public UUserWidget {
public:

	struct URichTextBlock* DescText; // 0x298(0x08)
	struct UCommonBuffItemView* BuffItemView; // 0x2a0(0x08)
	struct FText DebuffDesc; // 0x2a8(0x18)
	struct FText BuffDesc; // 0x2c0(0x18)
	struct FText CommonDesc; // 0x2d8(0x18)
	struct UImage* Image_33; // 0x2f0(0x08)

	void SetSepLineVisibility(enum class ESlateVisibility InVisibility); // Function DFMGameHud.CharaterBuffDetailTipItemView.SetSepLineVisibility // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CharaterBuffDetailTipView
// Size: 0x68 (Inherited: 0x30)
class UCharaterBuffDetailTipView : public UObject {
public:

	struct UUserWidget* UserWidget; // 0x30(0x08)
	struct UPanelWidget* wtBuffContent; // 0x38(0x08)
	struct UPanelWidget* WindowRoot; // 0x40(0x08)
	struct UClass* wtBuffItemViewClass; // 0x48(0x08)
	struct TArray<struct UCharaterBuffDetailTipItemView*> wtBuffItemViewLists; // 0x50(0x10)
	struct UUserWidget* TargetUI; // 0x60(0x08)

	void UpdateBuffTipView(struct TArray<struct FCharacterBuffListViewData>& VisibleArray); // Function DFMGameHud.CharaterBuffDetailTipView.UpdateBuffTipView // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonBuffItemView
// Size: 0x350 (Inherited: 0x298)
class UCommonBuffItemView : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct UButton* PressArea; // 0x2a0(0x08)
	struct URadialImage* wtBuffProgressBar1; // 0x2a8(0x08)
	struct UTextBlock* wtBuffNumTxt; // 0x2b0(0x08)
	struct FVector2D ItemBoxSize; // 0x2b8(0x08)
	struct UWidgetAnimation* DebuffBloodAnimation; // 0x2c0(0x08)
	struct UDFImage* _wtBuffIcon; // 0x2c8(0x08)
	/*struct FMulticastInlineDelegate*/char OnPressEvent[0x10]; // 0x2d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnClickEvent[0x10]; // 0x2e0(0x10)
	/*struct FMulticastInlineDelegate*/char HoverdEvent[0x10]; // 0x2f0(0x10)
	/*struct FMulticastInlineDelegate*/char UnHoverdEvent[0x10]; // 0x300(0x10)
	int32_t CacheBuffNum; // 0x310(0x04)
	int32_t CacheWidgetBuffId; // 0x314(0x04)
	char pad_318[0x8]; // 0x318(0x08)
	struct FCommonBuffItemDataView Data; // 0x320(0x20)
	float HoldJudgeTime; // 0x340(0x04)
	char pad_344[0x8]; // 0x344(0x08)
	int32_t HealthTipAnimationCount; // 0x34c(0x04)

	void TryPlayBuffAnimation(); // Function DFMGameHud.CommonBuffItemView.TryPlayBuffAnimation // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonBuffItemViewHD
// Size: 0x300 (Inherited: 0x298)
class UCommonBuffItemViewHD : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct UButton* PressArea; // 0x2a0(0x08)
	struct UProgressBar* wtBuffProgressBar_2; // 0x2a8(0x08)
	struct UTextBlock* wtBuffNumTxt; // 0x2b0(0x08)
	int32_t CacheBuffNum; // 0x2b8(0x04)
	int32_t CacheWidgetBuffId; // 0x2bc(0x04)
	char pad_2C0[0x20]; // 0x2c0(0x20)
	/*struct FMulticastInlineDelegate*/char OnPressEvent[0x10]; // 0x2e0(0x10)
	/*struct FMulticastInlineDelegate*/char OnHoverEvent[0x10]; // 0x2f0(0x10)

	void SetBuffData(struct FCommonBuffItemDataView ViewData); // Function DFMGameHud.CommonBuffItemViewHD.SetBuffData // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonButtonView
// Size: 0x390 (Inherited: 0x388)
class UCommonButtonView : public UBaseUIView {
public:

	struct UButton* CommonButton; // 0x388(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonIconMapItemHUDController
// Size: 0x2b0 (Inherited: 0x290)
class UCommonIconMapItemHUDController : public UMapIconViewController {
public:

	enum class ECommonIconMapMarkerType markerType; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)
	uint64_t PlayerUin; // 0x298(0x08)
	bool bIsEnemy; // 0x2a0(0x01)
	char pad_2A1[0xf]; // 0x2a1(0x0f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonRouletteItemView
// Size: 0x398 (Inherited: 0x388)
class UCommonRouletteItemView : public UBaseUIView {
public:

	struct UUserWidget* ItemWidget; // 0x388(0x08)
	enum class EDFRouletteType RouletteType; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)

	void InitItemWidgetThroughCpp(); // Function DFMGameHud.CommonRouletteItemView.InitItemWidgetThroughCpp // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonRouletteItemInnerContentView
// Size: 0x398 (Inherited: 0x388)
class UCommonRouletteItemInnerContentView : public UBaseUIView {
public:

	struct UDFImage* InnerImage; // 0x388(0x08)
	struct UDFTextBlock* InnerTextBlock; // 0x390(0x08)

	void SetContentImageOpacity(float InOpacity); // Function DFMGameHud.CommonRouletteItemInnerContentView.SetContentImageOpacity // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonRouletteView
// Size: 0x3f0 (Inherited: 0x388)
class UCommonRouletteView : public UBaseUIView {
public:

	int32_t ItemNumUsing; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct TArray<struct UCommonRouletteItemView*> ItemContainerWidgetsPool; // 0x390(0x10)
	struct TArray<struct UUserWidget*> ItemLineWidgetsPool; // 0x3a0(0x10)
	struct TArray<struct UImage*> DisabledMaterialImagesPool; // 0x3b0(0x10)
	struct UImage* HoverEffect; // 0x3c0(0x08)
	struct UWidgetAnimation* Anim_In; // 0x3c8(0x08)
	struct UWidgetAnimation* Anim_Out; // 0x3d0(0x08)
	struct UWidgetAnimation* Hover; // 0x3d8(0x08)
	struct UWidgetAnimation* UnHover; // 0x3e0(0x08)
	struct UWidgetAnimation* Select; // 0x3e8(0x08)

	void SetDisabledIndexs(float RouletteStartAngle, struct TArray<int32_t> InItemsIndex); // Function DFMGameHud.CommonRouletteView.SetDisabledIndexs // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CommonRouletteInfoView
// Size: 0x3b0 (Inherited: 0x388)
class UCommonRouletteInfoView : public UBaseUIView {
public:

	struct UTextBlock* CenterText; // 0x388(0x08)
	struct UTextBlock* SubText; // 0x390(0x08)
	struct UDFMImage* MoveIcon; // 0x398(0x08)
	struct UHDKeyIconBoxWidget* WBP_CommonKeyIconBox; // 0x3a0(0x08)
	struct UTextBlock* KeyIconText; // 0x3a8(0x08)

	void BP_SetType(int32_t Type); // Function DFMGameHud.CommonRouletteInfoView.BP_SetType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ContractObjectionIconViewController
// Size: 0x620 (Inherited: 0x290)
class UContractObjectionIconViewController : public UMapIconViewController {
public:

	char pad_290[0x390]; // 0x290(0x390)

	void UpdateQuestProgress(int64_t UpdateQuestId, char QuestState); // Function DFMGameHud.ContractObjectionIconViewController.UpdateQuestProgress // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ContractPointIconViewController
// Size: 0x510 (Inherited: 0x2c8)
class UContractPointIconViewController : public USelectableMapIconController {
public:

	char pad_2C8[0x228]; // 0x2c8(0x228)
	struct AGameState_PVPVE* GameState; // 0x4f0(0x08)
	char pad_4F8[0x18]; // 0x4f8(0x18)

	void UpdateQuestProgress(int64_t UpdateQuestId, char QuestState); // Function DFMGameHud.ContractPointIconViewController.UpdateQuestProgress // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.CustomPolygonWidget
// Size: 0x228 (Inherited: 0x168)
class UCustomPolygonWidget : public UWidget {
public:

	struct FSlateBrush Brush; // 0x168(0x90)
	struct UMaterialInterface* Material; // 0x1f8(0x08)
	struct TArray<struct FVector2D> Points; // 0x200(0x10)
	bool UseMat; // 0x210(0x01)
	char pad_211[0x17]; // 0x211(0x17)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DamageHintStatWidget
// Size: 0x2a8 (Inherited: 0x298)
class UDamageHintStatWidget : public UUserWidget {
public:

	struct UTextBlock* TitleText; // 0x298(0x08)
	struct URichTextBlock* DataText; // 0x2a0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DamageHintPopupWidget
// Size: 0x2a0 (Inherited: 0x298)
class UDamageHintPopupWidget : public UUserWidget {
public:

	struct URichTextBlock* DamageHintText; // 0x298(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DamageHudView
// Size: 0x3f0 (Inherited: 0x388)
class UDamageHudView : public UBaseUIView {
public:

	struct UCanvasPanel* RootCanvas; // 0x388(0x08)
	struct UClass* ViewTextClass; // 0x390(0x08)
	struct TArray<struct FDamageHudAnimData> AnimConfigData; // 0x398(0x10)
	bool bUseProcdualAnim; // 0x3a8(0x01)
	char pad_3A9[0x3]; // 0x3a9(0x03)
	int32_t MaxShowTxtNum; // 0x3ac(0x04)
	struct TArray<struct UDamageHudViewTextItem*> AllUIItems; // 0x3b0(0x10)
	char pad_3C0[0x30]; // 0x3c0(0x30)

	void OnReceiveDamage(struct AActor* Taker, struct FVector& WorldPos, float DamageValue, float ArmorReduceDamageValue, enum class EDamageShowType DamageShowType, enum class ECharacterPart HitPart); // Function DFMGameHud.DamageHudView.OnReceiveDamage // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DamageHudViewTextItem
// Size: 0x3d8 (Inherited: 0x388)
class UDamageHudViewTextItem : public UBaseUIView {
public:

	struct UTextBlock* ValueTxt; // 0x388(0x08)
	char pad_390[0x30]; // 0x390(0x30)
	struct TArray<struct UWidgetAnimation*> Animations; // 0x3c0(0x10)
	struct UUMGSequencePlayer* SequencePlayer; // 0x3d0(0x08)

	void BPSetStyle(int32_t ColorType); // Function DFMGameHud.DamageHudViewTextItem.BPSetStyle // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeadBodyIconViewController
// Size: 0x2a0 (Inherited: 0x290)
class UDeadBodyIconViewController : public UMapIconViewController {
public:

	struct FName BodyUin; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathCloseEyeScreenEffectHUD
// Size: 0x3b0 (Inherited: 0x388)
class UDeathCloseEyeScreenEffectHUD : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	float CloseEyeBeginDelay; // 0x390(0x04)
	float CloseEyeBlendInTime; // 0x394(0x04)
	float CloseEyeDurationTime; // 0x398(0x04)
	float CloseEyeBlendOutTime; // 0x39c(0x04)
	struct FName BlurEffectName; // 0x3a0(0x08)
	char pad_3A8[0x8]; // 0x3a8(0x08)

	void RemoveBlurEffect(); // Function DFMGameHud.DeathCloseEyeScreenEffectHUD.RemoveBlurEffect // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathDamageInfoDetailItem
// Size: 0x2b8 (Inherited: 0x298)
class UDeathDamageInfoDetailItem : public UUserWidget {
public:

	struct UTextBlock* FirstTextBlock; // 0x298(0x08)
	struct UTextBlock* SecondTextBlock; // 0x2a0(0x08)
	struct UTextBlock* ExtraInfoTextBlock; // 0x2a8(0x08)
	struct UCanvasPanel* LastDamagePanel; // 0x2b0(0x08)

	void CallBPSetType(bool bLastDamage); // Function DFMGameHud.DeathDamageInfoDetailItem.CallBPSetType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathDamageInfoPanel
// Size: 0x550 (Inherited: 0x388)
class UDeathDamageInfoPanel : public UBaseUIView {
public:

	struct UButton* CloseBtn; // 0x388(0x08)
	struct URichTextBlock* CloseRemainTimeTips; // 0x390(0x08)
	struct UTextBlock* CloseRemainTimeTxt; // 0x398(0x08)
	struct UDFScrollBox* DamageInfosScrollBox; // 0x3a0(0x08)
	char pad_3A8[0x1a8]; // 0x3a8(0x1a8)

	int32_t OnDamageInfosScrollBoxGetItemCount(); // Function DFMGameHud.DeathDamageInfoPanel.OnDamageInfosScrollBoxGetItemCount // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathDamageInfoViewNew
// Size: 0x558 (Inherited: 0x550)
class UDeathDamageInfoViewNew : public ULuaUIBaseView {
public:

	struct UDeathDamageInfoViewNew* WBP_DeathDamageInfoViewNew; // 0x550(0x08)

	void OpenDeathInfoView(); // Function DFMGameHud.DeathDamageInfoViewNew.OpenDeathInfoView // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathDamageInfoCharacterBodyViewNew
// Size: 0x550 (Inherited: 0x550)
class UDeathDamageInfoCharacterBodyViewNew : public ULuaUIBaseView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathDamageInfoDamageDetailNew
// Size: 0x550 (Inherited: 0x550)
class UDeathDamageInfoDamageDetailNew : public ULuaUIBaseView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeathDamageInfoDetailListView
// Size: 0x550 (Inherited: 0x550)
class UDeathDamageInfoDetailListView : public ULuaUIBaseView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DeployPointsPanel
// Size: 0x688 (Inherited: 0x5a8)
class UDeployPointsPanel : public ULuaUIHudBaseView {
public:

	struct TMap<struct FName, struct FMarkerPool> MarkerUsingPool; // 0x5a8(0x50)
	struct TMap<struct FName, struct FMarkerPool> MarkerNotUsePool; // 0x5f8(0x50)
	char pad_648[0x8]; // 0x648(0x08)
	float AimCheckDistance; // 0x650(0x04)
	float AimCheckDistanceWhenZooming; // 0x654(0x04)
	float AimRadialDistance; // 0x658(0x04)
	float UpdateCharacterInterval; // 0x65c(0x04)
	float LowFrequencyUpdateInterval; // 0x660(0x04)
	float MiddleFrequencyUpdateInterval; // 0x664(0x04)
	struct TArray<struct ACHARACTER*> OutCharacterArray; // 0x668(0x10)
	char pad_678[0x10]; // 0x678(0x10)

	void UnInitView(); // Function DFMGameHud.DeployPointsPanel.UnInitView // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFCodedLockView
// Size: 0x430 (Inherited: 0x388)
class UDFCodedLockView : public UBaseUIView {
public:

	struct UDFTextBlock* DFTextBlock_Tips; // 0x388(0x08)
	struct UDFHDKeyIconBoxTextWidget* WBP_CommonKeyIconBoxText; // 0x390(0x08)
	struct UDFTipsAnchor* wtTipsAnchor; // 0x398(0x08)
	struct UUserWidget* wtCommonCheckInstruction; // 0x3a0(0x08)
	struct UWidgetAnimation* Anima_in; // 0x3a8(0x08)
	struct UWidgetAnimation* Anima_out; // 0x3b0(0x08)
	struct UWidgetAnimation* Anima_wrong; // 0x3b8(0x08)
	struct AInteractor_CodedLock* CodedLock; // 0x3c0(0x08)
	struct AInventoryPickup_OpenBox* CachedSafeBox; // 0x3c8(0x08)
	char pad_3D0[0x8]; // 0x3d0(0x08)
	struct TArray<int32_t> PwdDigits; // 0x3d8(0x10)
	char pad_3E8[0x4]; // 0x3e8(0x04)
	float ErrorCooldownTime; // 0x3ec(0x04)
	struct FName HudName; // 0x3f0(0x08)
	char pad_3F8[0x38]; // 0x3f8(0x38)

	void OnNumBtnClick(int32_t Num); // Function DFMGameHud.DFCodedLockView.OnNumBtnClick // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFCommonCancelBtnView
// Size: 0x390 (Inherited: 0x388)
class UDFCommonCancelBtnView : public UBaseUIView {
public:

	struct UMobileDraggableButton* CancelButton; // 0x388(0x08)

	void OnCancelButtonClk(); // Function DFMGameHud.DFCommonCancelBtnView.OnCancelButtonClk // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFCommonHUDScreenMutex
// Size: 0x98 (Inherited: 0x30)
class UDFCommonHUDScreenMutex : public UObject {
public:

	/*struct FMulticastInlineDelegate*/char OnMutexChanged[0x10]; // 0x30(0x10)
	struct FName MutexName; // 0x40(0x08)
	struct UDataTableSystemManagerBase* MutexRegisterTableManager; // 0x48(0x08)
	struct FMutexQueueItem CurrentHolder; // 0x50(0x30)
	struct TArray<struct FMutexQueueItem> MutexWaitingQueue; // 0x80(0x10)
	uint64_t LocalPlayerUin; // 0x90(0x08)

	void TickMutex(float DeltaTime); // Function DFMGameHud.DFCommonHUDScreenMutex.TickMutex // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HUDMutexHDEventTipsDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UHUDMutexHDEventTipsDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HUDMutexMiniMapBottomDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UHUDMutexMiniMapBottomDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFCommonLineWidget
// Size: 0x2e0 (Inherited: 0x298)
class UDFCommonLineWidget : public UUserWidget {
public:

	struct UCanvasPanel* MainRoot; // 0x298(0x08)
	struct UHorizontalBox* ArrowRoot; // 0x2a0(0x08)
	struct UCanvasPanel* MovableRoot; // 0x2a8(0x08)
	struct UImage* Arrow; // 0x2b0(0x08)
	float LineWidth; // 0x2b8(0x04)
	float LineOffsetToStopPoint; // 0x2bc(0x04)
	/*struct FDelegate*/char OnGetStartPosition[0x10]; // 0x2c0(0x10)
	/*struct FDelegate*/char OnGetStopPosition[0x10]; // 0x2d0(0x10)

	void UpdatePosition(); // Function DFMGameHud.DFCommonLineWidget.UpdatePosition // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFCountdownView
// Size: 0x440 (Inherited: 0x388)
class UDFCountdownView : public UBaseUIView {
public:

	char pad_388[0x30]; // 0x388(0x30)
	struct UCanvasPanel* Event_CanvasPanel; // 0x3b8(0x08)
	struct UCanvasPanel* TenSecondsExit_CanvasPanel; // 0x3c0(0x08)
	struct UWidgetAnimation* Anim_FinalCutDownNum_loop; // 0x3c8(0x08)
	struct UWidgetAnimation* Anim_FinalCutDown_in; // 0x3d0(0x08)
	struct UWidgetAnimation* Anim_FinalCutDown_out; // 0x3d8(0x08)
	char pad_3E0[0x8]; // 0x3e0(0x08)
	struct UTextBlock* Event_TimeText; // 0x3e8(0x08)
	struct UTextBlock* TenSecondsExit_TimeText; // 0x3f0(0x08)
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct UTextBlock* Event_TitleText; // 0x400(0x08)
	struct UTextBlock* TenSecondsExit_TitleText; // 0x408(0x08)
	char pad_410[0x18]; // 0x410(0x18)
	struct UDFCommonHUDScreenMutex* HDEventTipsMutex; // 0x428(0x08)
	struct FName MutexRegName; // 0x430(0x08)
	bool bGotMutex; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)

	void UpdateColorView(int32_t InCurCountdownTime); // Function DFMGameHud.DFCountdownView.UpdateColorView // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFFixedWeaponBarHUD
// Size: 0x3f8 (Inherited: 0x2d8)
class UDFFixedWeaponBarHUD : public UDFUserWidgetBase {
public:

	struct UDFProgressBar* AmmoProcessBarWidget; // 0x2d8(0x08)
	struct UDFRichTextBlock* AmmoNumWidget; // 0x2e0(0x08)
	struct UDFProgressBar* OverHeatProcessBarWidget; // 0x2e8(0x08)
	struct UDFRadialImage* ProcessTipsBarWidget; // 0x2f0(0x08)
	struct UUserWidget* ProcessTipWidget; // 0x2f8(0x08)
	struct UWidgetAnimation* CoolDownInAnim; // 0x300(0x08)
	struct UWidgetAnimation* CoolDownOutAnim; // 0x308(0x08)
	struct UWidgetAnimation* ChangeclipInAnim; // 0x310(0x08)
	struct UWidgetAnimation* ChangeclipoutAnim; // 0x318(0x08)
	struct TMap<int32_t, struct FLinearColor> OverHeatMap; // 0x320(0x50)
	struct TMap<float, int32_t> OverHeatLevelMap; // 0x370(0x50)
	int32_t CoolDownLevel; // 0x3c0(0x04)
	float CoolDownOverHeat; // 0x3c4(0x04)
	char pad_3C8[0x10]; // 0x3c8(0x10)
	struct TWeakObjectPtr<struct ADFMSceneWeapon> SenceWeapon; // 0x3d8(0x08)
	struct TWeakObjectPtr<struct UDFMFixedWeaponCommonView> CommonView; // 0x3e0(0x08)
	bool IsOverHeat; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct UFunction* Func_SetType; // 0x3f0(0x08)

	void SetLevelColor(int32_t InLevel); // Function DFMGameHud.DFFixedWeaponBarHUD.SetLevelColor // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDActionCommonProgressBar
// Size: 0x2c8 (Inherited: 0x298)
class UDFHDActionCommonProgressBar : public UUserWidget {
public:

	struct UTextBlock* Action; // 0x298(0x08)
	struct FName ActionName; // 0x2a0(0x08)
	struct UTextBlock* ElapseTimeText; // 0x2a8(0x08)
	struct FName ElapseTimeTextName; // 0x2b0(0x08)
	struct UProgressBar* Bar; // 0x2b8(0x08)
	struct FName BarName; // 0x2c0(0x08)

	void SetActionName(struct FText InActionName); // Function DFMGameHud.DFHDActionCommonProgressBar.SetActionName // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDActionTipsView
// Size: 0x3d8 (Inherited: 0x388)
class UDFHDActionTipsView : public UBaseUIView {
public:

	struct UHDKeyIconBoxWidget* WBP_CommonKeyIconBox; // 0x388(0x08)
	struct UTextBlock* TipsText; // 0x390(0x08)
	struct UWidgetAnimation* Anim_Out; // 0x398(0x08)
	float KeyIconHeight; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct FTimerHandle AnimOutEndTimer; // 0x3a8(0x08)
	struct FName CurrShowActionOrAxisName; // 0x3b0(0x08)
	struct FName CurWantShowLongPressProgActionOrAxisName; // 0x3b8(0x08)
	struct TArray<struct FHDActionTips> ActionTipsStack; // 0x3c0(0x10)
	int32_t NextShowAnimType; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)

	void OnDFHDActionTipsUpdatePressedProgress(struct FName ActionOrAxisName, float Perc); // Function DFMGameHud.DFHDActionTipsView.OnDFHDActionTipsUpdatePressedProgress // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDBloodBarBase
// Size: 0x298 (Inherited: 0x298)
class UDFHDBloodBarBase : public UUserWidget {
public:


	void BPSetStyle(int32_t BloodColorType, bool bHeal); // Function DFMGameHud.DFHDBloodBarBase.BPSetStyle // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDGMAimingDebugView
// Size: 0x5e8 (Inherited: 0x550)
class UDFHDGMAimingDebugView : public ULuaUIBaseView {
public:

	struct UWidget* OffsetPaintArea; // 0x550(0x08)
	struct UTextBlock* MaxDelta; // 0x558(0x08)
	bool bRecordNonZero; // 0x560(0x01)
	char pad_561[0x3]; // 0x561(0x03)
	float RecordPrecision; // 0x564(0x04)
	int32_t OffsetRecordFrames; // 0x568(0x04)
	char pad_56C[0x38]; // 0x56c(0x38)
	float OffsetLineThickness; // 0x5a4(0x04)
	char pad_5A8[0x40]; // 0x5a8(0x40)

	void ResetRecord(); // Function DFMGameHud.DFHDGMAimingDebugView.ResetRecord // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorExposeItem_Detail
// Size: 0x2a0 (Inherited: 0x298)
class UDFHDInteractorExposeItem_Detail : public UUserWidget {
public:

	struct AActor* CachedActor; // 0x298(0x08)

	void BP_StopInAni(); // Function DFMGameHud.DFHDInteractorExposeItem_Detail.BP_StopInAni // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorMarkerView
// Size: 0x410 (Inherited: 0x388)
class UDFHDInteractorMarkerView : public UBaseUIView {
public:

	struct UUserWidget* WBP_InteractTips_Marker_PC; // 0x388(0x08)
	struct UHDKeyIconBoxWidget* WBP_CommonKeyIconBox; // 0x390(0x08)
	struct URichTextBlock* OperationText; // 0x398(0x08)
	struct UHorizontalBox* ArrowRoot; // 0x3a0(0x08)
	struct FName ArrowRootName; // 0x3a8(0x08)
	struct UTextBlock* DistTextBlock; // 0x3b0(0x08)
	struct FName DistTextBlockName; // 0x3b8(0x08)
	float ArrowLineLengthScale; // 0x3c0(0x04)
	char pad_3C4[0x4]; // 0x3c4(0x04)
	struct UWidgetAnimation* Anim_In; // 0x3c8(0x08)
	struct UWidgetAnimation* Anim_Out; // 0x3d0(0x08)
	struct ADFMPlayerController* LocalPlayerController; // 0x3d8(0x08)
	struct ADFMCharacter* FocusDFMCharacter; // 0x3e0(0x08)
	struct ADFMMarkerManager* MarkerManager; // 0x3e8(0x08)
	char pad_3F0[0x18]; // 0x3f0(0x18)
	bool bThisViewShouldShow_NOTWantToUseAbusedGameHUDSate; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)

	void UpdateUI(struct FString Name, int32_t Distance, int32_t KeyTipsType, struct FVector2D MarkerPosition); // Function DFMGameHud.DFHDInteractorMarkerView.UpdateUI // (Final|Native|Private|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorMissionItem
// Size: 0x298 (Inherited: 0x298)
class UDFHDInteractorMissionItem : public UUserWidget {
public:


	void BP_ShowMissionType(int32_t InMissionType); // Function DFMGameHud.DFHDInteractorMissionItem.BP_ShowMissionType // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorMissionItem_Detail
// Size: 0x2b0 (Inherited: 0x298)
class UDFHDInteractorMissionItem_Detail : public UUserWidget {
public:

	struct UTextBlock* DescText; // 0x298(0x08)
	struct FName DescTextName; // 0x2a0(0x08)
	struct AActor* CachedActor; // 0x2a8(0x08)

	void BP_StopInAni(); // Function DFMGameHud.DFHDInteractorMissionItem_Detail.BP_StopInAni // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorNameNumItem
// Size: 0x2e8 (Inherited: 0x298)
class UDFHDInteractorNameNumItem : public UUserWidget {
public:

	struct UTextBlock* Name; // 0x298(0x08)
	struct FName NameName; // 0x2a0(0x08)
	struct UTextBlock* Num; // 0x2a8(0x08)
	struct FName NumName; // 0x2b0(0x08)
	struct TArray<struct FLinearColor> QualityColorArray; // 0x2b8(0x10)
	struct FLinearColor NotSearched; // 0x2c8(0x10)
	struct FLinearColor AlreadySearched; // 0x2d8(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorPanelItem
// Size: 0x608 (Inherited: 0x298)
class UDFHDInteractorPanelItem : public UUserWidget {
public:

	struct UWidget* SimpleView; // 0x298(0x08)
	struct FName SimpleViewName; // 0x2a0(0x08)
	struct UDFHDInteractorMissionItem* MissionItem; // 0x2a8(0x08)
	struct FName MissionItemName; // 0x2b0(0x08)
	struct UDFHDInteractorZoomItem* ZoomItem1; // 0x2b8(0x08)
	struct FName ZoomItem1Name; // 0x2c0(0x08)
	struct UDFHDInteractorZoomItem* ZoomItem2; // 0x2c8(0x08)
	struct FName ZoomItem2Name; // 0x2d0(0x08)
	struct UUserWidget* InteractDistMarker; // 0x2d8(0x08)
	struct FName InteractDistMarkerName; // 0x2e0(0x08)
	struct UHorizontalBox* ArrowMarker; // 0x2e8(0x08)
	struct FName ArrowMarkerName; // 0x2f0(0x08)
	struct UDFTextBlock* DistText; // 0x2f8(0x08)
	struct FName DistTextName; // 0x300(0x08)
	struct UImage* LockIcon; // 0x308(0x08)
	struct FName LockIconName; // 0x310(0x08)
	struct USizeBox* ItemIconSizeBox; // 0x318(0x08)
	struct FName ItemIconSizeBoxName; // 0x320(0x08)
	struct UImage* ItemIcon; // 0x328(0x08)
	struct FName ItemIconName; // 0x330(0x08)
	struct UDFHDInteractorNameNumItem* NameNumItem; // 0x338(0x08)
	struct FName NameNumItemName; // 0x340(0x08)
	struct UWidget* DetailView; // 0x348(0x08)
	struct FName DetailViewName; // 0x350(0x08)
	struct UDFHDInteractorMissionItem_Detail* MissionItem_Detail; // 0x358(0x08)
	struct FName MissionItemName_Detail; // 0x360(0x08)
	struct UDFHDInteractorExposeItem_Detail* ExposeItem_Detail; // 0x368(0x08)
	struct FName ExposeItemName_Detail; // 0x370(0x08)
	struct UDFMCommonQuality* QualityItem; // 0x378(0x08)
	struct FName QualityItemName; // 0x380(0x08)
	struct UDFMCommonIconImage* IconImageItem; // 0x388(0x08)
	struct FName IconImageItemName; // 0x390(0x08)
	struct UDFHDInteractorSpaceItem* SpaceItem; // 0x398(0x08)
	struct FName SpaceItemName; // 0x3a0(0x08)
	struct UTextBlock* ItemNameText; // 0x3a8(0x08)
	struct FName ItemNameTextName; // 0x3b0(0x08)
	struct UTextBlock* ItemNumText; // 0x3b8(0x08)
	struct FName ItemNumTextName; // 0x3c0(0x08)
	struct UTextBlock* ItemDescText; // 0x3c8(0x08)
	struct FName ItemDescTextName; // 0x3d0(0x08)
	struct UClass* DescTextBP; // 0x3d8(0x08)
	struct UDFHDInteractorPanelItem_DescText* DescText; // 0x3e0(0x08)
	struct FName DescTextName; // 0x3e8(0x08)
	struct UPanelWidget* DescTextParent; // 0x3f0(0x08)
	struct FName DescTextParentName; // 0x3f8(0x08)
	struct UDFHDInteractorZoomItem* ZoomItem1_Detail; // 0x400(0x08)
	struct FName ZoomItem1Name_Detail; // 0x408(0x08)
	struct UDFHDInteractorZoomItem* ZoomItem2_Detail; // 0x410(0x08)
	struct FName ZoomItem2Name_Detail; // 0x418(0x08)
	struct UDFHDInteractorZoomItem* ZoomItemMark_Detail; // 0x420(0x08)
	struct FName ZoomItemMarkName_Detail; // 0x428(0x08)
	struct UVerticalBox* DetailVerticalBox; // 0x430(0x08)
	struct FName DetailVerticalBoxName; // 0x438(0x08)
	float DetailVerticalBoxY; // 0x440(0x04)
	float DetailVerticalBoxYWithZoom2; // 0x444(0x04)
	struct UImage* WhiteDot; // 0x448(0x08)
	struct FName WhiteDotName; // 0x450(0x08)
	struct FDFHDInteractHUDContext HUDContext; // 0x458(0x150)
	struct FInteractableProxy CachedHUDInteractableProxy; // 0x5a8(0x10)
	struct FInteractableProxy CachedWhiteDotInteractableProxy; // 0x5b8(0x10)
	int32_t ShowType; // 0x5c8(0x04)
	char pad_5CC[0xc]; // 0x5cc(0x0c)
	struct AActor* CurrentWeaponForIcon; // 0x5d8(0x08)
	struct UGPModularWeaponDesc* WeaponDesc; // 0x5e0(0x08)
	char pad_5E8[0x8]; // 0x5e8(0x08)
	struct AActor* CurrentDetailWeaponForIcon; // 0x5f0(0x08)
	struct UGPModularWeaponDesc* DetailWeaponDesc; // 0x5f8(0x08)
	char pad_600[0x8]; // 0x600(0x08)

	void OnSwitchAniEnd(); // Function DFMGameHud.DFHDInteractorPanelItem.OnSwitchAniEnd // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorPanelItem_DescText
// Size: 0x5b0 (Inherited: 0x5a8)
class UDFHDInteractorPanelItem_DescText : public ULuaUIHudBaseView {
public:

	struct UDFHDInteractorPanelItem* CachedPanelItem; // 0x5a8(0x08)

	void SetLongWeapon(bool InbLong); // Function DFMGameHud.DFHDInteractorPanelItem_DescText.SetLongWeapon // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorSpaceItem
// Size: 0x298 (Inherited: 0x298)
class UDFHDInteractorSpaceItem : public UUserWidget {
public:


	void BP_ShowGridLayout(int32_t InWidth, int32_t InHeight, bool InbBagIsEnough); // Function DFMGameHud.DFHDInteractorSpaceItem.BP_ShowGridLayout // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorView_CarryBody
// Size: 0x388 (Inherited: 0x388)
class UDFHDInteractorView_CarryBody : public UBaseUIView {
public:


	void OnRefreshCarryBodyPanel(int32_t Type); // Function DFMGameHud.DFHDInteractorView_CarryBody.OnRefreshCarryBodyPanel // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDInteractorZoomItem
// Size: 0x2d8 (Inherited: 0x298)
class UDFHDInteractorZoomItem : public UUserWidget {
public:

	struct UTextBlock* NeedText; // 0x298(0x08)
	struct FName NeedTextName; // 0x2a0(0x08)
	struct UHDKeyIconBoxWidget* KeyIcon; // 0x2a8(0x08)
	struct FName KeyIconName; // 0x2b0(0x08)
	struct UDFRichTextBlock* ZoomText; // 0x2b8(0x08)
	struct FName ZoomTextName; // 0x2c0(0x08)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct UHDKeyIconBoxWidget* KeyIconBox; // 0x2d0(0x08)

	void BP_PlayPressAniWithSpeed(int32_t InState); // Function DFMGameHud.DFHDInteractorZoomItem.BP_PlayPressAniWithSpeed // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDKeyIconBoxTextWidget
// Size: 0x558 (Inherited: 0x550)
class UDFHDKeyIconBoxTextWidget : public ULuaUIBaseView {
public:

	struct UHDKeyIconBoxWidget* WBP_CommonKeyIconBox; // 0x550(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDPerformanceStatus
// Size: 0x4b8 (Inherited: 0x388)
class UDFHDPerformanceStatus : public UBaseUIView {
public:

	struct UDFCanvasPanel* DFCanvasPanel_Settable; // 0x388(0x08)
	struct UDFRichTextBlock* _wtTemperature; // 0x390(0x08)
	struct UTextBlock* _wtFPSText; // 0x398(0x08)
	struct UTextBlock* _wtPingText; // 0x3a0(0x08)
	struct UTextBlock* _wtLossText_2; // 0x3a8(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_Unsettable; // 0x3b0(0x08)
	struct UDFImage* wtSignalImg; // 0x3b8(0x08)
	float UpdateInterval_Quick; // 0x3c0(0x04)
	float UpdateInterval_Slow; // 0x3c4(0x04)
	float BadNetTips_Ping_Warning; // 0x3c8(0x04)
	float BadNetTips_Ping_Poor; // 0x3cc(0x04)
	struct FLinearColor BadNetTipsClr_Warning; // 0x3d0(0x10)
	struct FLinearColor BadNetTipsClr_Poor; // 0x3e0(0x10)
	struct FText Text_Temperature; // 0x3f0(0x18)
	struct FText Text_TemperatureNormal; // 0x408(0x18)
	struct FText Text_TemperatureOverheat; // 0x420(0x18)
	struct FText Text_FrameRate; // 0x438(0x18)
	struct FText Text_Ping; // 0x450(0x18)
	struct FText Text_Loss; // 0x468(0x18)
	float TemperatureHideThreadhold; // 0x480(0x04)
	float LastUpdatePast_Quick; // 0x484(0x04)
	float LastUpdatePast_Slow; // 0x488(0x04)
	char pad_48C[0x2c]; // 0x48c(0x2c)

	void UpdateTemperature(); // Function DFMGameHud.DFHDPerformanceStatus.UpdateTemperature // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDSettingsInputPanel
// Size: 0xb98 (Inherited: 0x550)
class UDFHDSettingsInputPanel : public ULuaUIBaseView {
public:

	struct UBaseKeySettingManager* KeySettingManager; // 0x550(0x08)
	bool bSupportModifierKeys; // 0x558(0x01)
	char pad_559[0x3]; // 0x559(0x03)
	/*struct FDelegate*/char OnEndKeySelecting[0x10]; // 0x55c(0x10)
	/*struct FDelegate*/char NotifyUpdateHoveringRow[0x10]; // 0x56c(0x10)
	char pad_57C[0x4]; // 0x57c(0x04)
	struct TArray<struct FKeyEvent> SelectingDownKeys; // 0x580(0x10)
	struct FKey SelectedKey; // 0x590(0x18)
	struct TArray<bool> SelectedHasModifierKeys; // 0x5a8(0x10)
	struct FPointerEvent SelectingDownMouseBtn; // 0x5b8(0x70)
	bool bIsSelectingKey; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct FKeyMappingsDataTableRow SelectingSettingTableRow; // 0x630(0x138)
	int32_t SelectingKeySN; // 0x768(0x04)
	bool bIsHoveringKey; // 0x76c(0x01)
	char pad_76D[0x3]; // 0x76d(0x03)
	struct FKeyMappingsDataTableRow HoveringSettingTableRow; // 0x770(0x138)
	int32_t HoveringKeySN; // 0x8a8(0x04)
	char pad_8AC[0x4]; // 0x8ac(0x04)
	struct FKeyMappingsDataTableRow ConflictImportantRow; // 0x8b0(0x138)
	struct TArray<struct FKeyMappingsDataTableRow> ConflictRows; // 0x9e8(0x10)
	int32_t ConflictRowKeySN; // 0x9f8(0x04)
	char pad_9FC[0x4]; // 0x9fc(0x04)
	struct FKeyMappingsDataTableRow CachedRow; // 0xa00(0x138)
	bool bForBHD; // 0xb38(0x01)
	char pad_B39[0x7]; // 0xb39(0x07)
	struct TArray<int32_t> KeyFunctionTypeListInThisPanel; // 0xb40(0x10)
	struct FVector2D LastMouseLocation; // 0xb50(0x08)
	struct FTimerHandle CheckMouseMovementTimerHandle; // 0xb58(0x08)
	float MouseMovementCheckInterval; // 0xb60(0x04)
	struct FVector2D MouseMovementThresholdPerSecond; // 0xb64(0x08)
	struct FVector2D AccMouseMovement; // 0xb6c(0x08)
	float AccMouseMovementTrigger; // 0xb74(0x04)
	struct FKey SelectedMouseAxis; // 0xb78(0x18)
	bool IsPositiveInSelectedAxis; // 0xb90(0x01)
	char pad_B91[0x7]; // 0xb91(0x07)

	void UnbindHoveringKey(); // Function DFMGameHud.DFHDSettingsInputPanel.UnbindHoveringKey // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDSettingsVideoPanel
// Size: 0x550 (Inherited: 0x550)
class UDFHDSettingsVideoPanel : public ULuaUIBaseView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDSkillItem
// Size: 0x3d0 (Inherited: 0x388)
class UDFHDSkillItem : public UBaseUIView {
public:

	struct UGPSkillEntity* currentSkil; // 0x388(0x08)
	struct UUserWidget* WBP_ArmsHolding; // 0x390(0x08)
	struct UUserWidget* WBP_ArmsLoading; // 0x398(0x08)
	struct UUserWidget* WBP_ArmsLoadingFinish; // 0x3a0(0x08)
	struct UUserWidget* WBP_ArmsStatus_Disable; // 0x3a8(0x08)
	struct UTextBlock* CooldownText; // 0x3b0(0x08)
	struct UImage* CooldownProcess; // 0x3b8(0x08)
	struct UUserWidget* KeyIcon; // 0x3c0(0x08)
	char pad_3C8[0x8]; // 0x3c8(0x08)

	void OnSkillButtonReleased(); // Function DFMGameHud.DFHDSkillItem.OnSkillButtonReleased // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDTeamPlayerInfoView
// Size: 0x390 (Inherited: 0x388)
class UDFHDTeamPlayerInfoView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHDVehicleSkillButtonWidget
// Size: 0x3a0 (Inherited: 0x298)
class UDFHDVehicleSkillButtonWidget : public UUserWidget {
public:

	struct UWidgetAnimation* Anim_CoolDownFinished; // 0x298(0x08)
	struct UWidget* SkillCountRoot; // 0x2a0(0x08)
	struct UTextBlock* CurrentSkilCountText; // 0x2a8(0x08)
	struct UTextBlock* MaxSkillCountText; // 0x2b0(0x08)
	struct UTextBlock* TimeText; // 0x2b8(0x08)
	struct UUserWidget* WaitIconWidget; // 0x2c0(0x08)
	struct UDFMImage* SkillIcon; // 0x2c8(0x08)
	char pad_2D0[0x90]; // 0x2d0(0x90)
	struct UWidget* KeyWidget; // 0x360(0x08)
	struct UWidget* DisableWidget; // 0x368(0x08)
	struct UDFProgressBar* CoolDownProgressBar; // 0x370(0x08)
	struct UWidget* RechargeRootWidget; // 0x378(0x08)
	struct UDFProgressBar* RechargeProgressBar; // 0x380(0x08)
	struct UDFProgressBar* RechargeIconProgressBar; // 0x388(0x08)
	struct UDFMVehicleSkillInstance* OwnVehicleSkillInstance; // 0x390(0x08)
	char pad_398[0x8]; // 0x398(0x08)

	void OnTickDelegate(); // Function DFMGameHud.DFHDVehicleSkillButtonWidget.OnTickDelegate // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFHitScreenEffectWithDir
// Size: 0x2a8 (Inherited: 0x298)
class UDFHitScreenEffectWithDir : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct UClass* HitEffectDirClass; // 0x2a0(0x08)

	void BP_OnActive(); // Function DFMGameHud.DFHitScreenEffectWithDir.BP_OnActive // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFInteractorExposeTipsItem
// Size: 0x550 (Inherited: 0x550)
class UDFInteractorExposeTipsItem : public ULuaUIBaseView {
public:


	void BP_PlayAni(int32_t InAniType, bool InbPlay); // Function DFMGameHud.DFInteractorExposeTipsItem.BP_PlayAni // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFInteractorMissionTipsItem
// Size: 0x550 (Inherited: 0x550)
class UDFInteractorMissionTipsItem : public ULuaUIBaseView {
public:


	void BP_SetMissionType(int32_t InType); // Function DFMGameHud.DFInteractorMissionTipsItem.BP_SetMissionType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFInteractorPCInfoView
// Size: 0x438 (Inherited: 0x388)
class UDFInteractorPCInfoView : public UBaseUIView {
public:

	struct UButton* CloseBtn; // 0x388(0x08)
	struct UDFPCMorseCodeView* MorseCodeView; // 0x390(0x08)
	struct FName MorseCodeViewName; // 0x398(0x08)
	struct UDFPCOperationsView* OperationsView; // 0x3a0(0x08)
	struct FName OperationsViewName; // 0x3a8(0x08)
	float AutoDuration; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct AInteractor_HackPC* CachedPC; // 0x3b8(0x08)
	char pad_3C0[0x4]; // 0x3c0(0x04)
	float ForceRefreshInterval; // 0x3c4(0x04)
	char pad_3C8[0x40]; // 0x3c8(0x40)
	struct UDFHDKeyIconBoxTextWidget* ExitKeyIconBoxTextWidget; // 0x408(0x08)
	struct FName ExitKeyIconBoxTextWidgetName; // 0x410(0x08)
	bool bUseGameHudStateChanged; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	bool bOpenDelayDestroy; // 0x420(0x01)
	char pad_421[0x3]; // 0x421(0x03)
	float DelayDestroyWaitTime; // 0x424(0x04)
	char pad_428[0x8]; // 0x428(0x08)
	bool bIsReadyClear; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)

	void OnPCMorseCodeSuccess(bool bSuccess, struct AActor* InHackPC); // Function DFMGameHud.DFInteractorPCInfoView.OnPCMorseCodeSuccess // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFInteractorWishTipsItem
// Size: 0x550 (Inherited: 0x550)
class UDFInteractorWishTipsItem : public ULuaUIBaseView {
public:


	void BP_PlayAni(int32_t InAniType, bool InbPlay); // Function DFMGameHud.DFInteractorWishTipsItem.BP_PlayAni // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFKillerInfoCardViewKeyTips
// Size: 0x3a8 (Inherited: 0x388)
class UDFKillerInfoCardViewKeyTips : public UBaseUIView {
public:

	struct UDFHDKeyIconBoxTextWidget* KeyIconBoxReport; // 0x388(0x08)
	struct UDFHDKeyIconBoxTextWidget* KeyIconBoxSkip; // 0x390(0x08)
	struct FName KeyIconBoxReport_Name; // 0x398(0x08)
	struct FName KeyIconBoxSkip_Name; // 0x3a0(0x08)

	void InitSkip(struct FName Name); // Function DFMGameHud.DFKillerInfoCardViewKeyTips.InitSkip // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioDebugView
// Size: 0x428 (Inherited: 0x388)
class UDFMAudioDebugView : public UBaseUIView {
public:

	struct AActor* CurrentSelectedActor; // 0x388(0x08)
	struct TMap<struct FString, struct ACHARACTER*> CharacterNameMap; // 0x390(0x50)
	struct FString CurrentSelectedActorName; // 0x3e0(0x10)
	struct FString CurrentFilterKeyWorldName; // 0x3f0(0x10)
	struct TArray<struct ACHARACTER*> NearByCharacterArray; // 0x400(0x10)
	struct URichTextBlock* EventHistoryTextBlock; // 0x410(0x08)
	struct UComboBoxString* CharacterComboBox; // 0x418(0x08)
	float NearbyCharacterCheckDistance; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)

	void UpdateDropdownList(); // Function DFMGameHud.DFMAudioDebugView.UpdateDropdownList // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.FirePointWidget
// Size: 0x2a8 (Inherited: 0x298)
class UFirePointWidget : public UUserWidget {
public:

	struct UImage* PointImage; // 0x298(0x08)
	struct UTextBlock* FirePriorityText; // 0x2a0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMLoopFirePriorityDebugView
// Size: 0x638 (Inherited: 0x388)
class UDFMLoopFirePriorityDebugView : public UBaseUIView {
public:

	char pad_388[0xf0]; // 0x388(0xf0)
	struct UClass* DefaultFirePointWidgetClass; // 0x478(0x08)
	struct FLinearColor SelfPointColor; // 0x480(0x10)
	struct FLinearColor TeamPointColor; // 0x490(0x10)
	struct FLinearColor EnemyPointColor; // 0x4a0(0x10)
	struct FLinearColor P0Color; // 0x4b0(0x10)
	struct FLinearColor P1Color; // 0x4c0(0x10)
	struct FLinearColor P2Color; // 0x4d0(0x10)
	float radius; // 0x4e0(0x04)
	int32_t FirePointMaxNum; // 0x4e4(0x04)
	struct UCanvasPanel* FirePointWidgetCanvas; // 0x4e8(0x08)
	struct TArray<struct UFirePointWidget*> FirePointArray; // 0x4f0(0x10)
	struct UTextBlock* LogText; // 0x500(0x08)
	char pad_508[0xc0]; // 0x508(0xc0)
	struct UComboBoxString* ComboBoxString_Quality; // 0x5c8(0x08)
	struct USpinBox* SpinBox_P0Num; // 0x5d0(0x08)
	struct USpinBox* SpinBox_P1Num; // 0x5d8(0x08)
	struct USpinBox* SpinBox_FrontAngle; // 0x5e0(0x08)
	struct USpinBox* SpinBox_CircleBorder1; // 0x5e8(0x08)
	struct USpinBox* SpinBox_CircleBorder2; // 0x5f0(0x08)
	struct USpinBox* SpinBox_FNum; // 0x5f8(0x08)
	struct USpinBox* SpinBox_LNum; // 0x600(0x08)
	struct USpinBox* SpinBox_RNum; // 0x608(0x08)
	struct USpinBox* SpinBox_BNum; // 0x610(0x08)
	struct USpinBox* SpinBox_C1Num; // 0x618(0x08)
	struct USpinBox* SpinBox_C2Num; // 0x620(0x08)
	struct USpinBox* SpinBox_C3Num; // 0x628(0x08)
	struct UTextBlock* TextBlock_ConfigLog; // 0x630(0x08)

	void RefreshManagerConfig(); // Function DFMGameHud.DFMLoopFirePriorityDebugView.RefreshManagerConfig // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioHDRDebugViewerItem
// Size: 0x320 (Inherited: 0x298)
class UDFMAudioHDRDebugViewerItem : public UUserWidget {
public:

	int32_t NumChannels; // 0x298(0x04)
	float MaxStateValue; // 0x29c(0x04)
	bool bBusActive; // 0x2a0(0x01)
	bool bCallBackBusActive; // 0x2a1(0x01)
	enum class EBusStateEnum StateEnum; // 0x2a2(0x01)
	char pad_2A3[0x1]; // 0x2a3(0x01)
	float ConfirmWaitTimeLeft; // 0x2a4(0x04)
	float TargetBusPriority; // 0x2a8(0x04)
	float CurrentBusPriority; // 0x2ac(0x04)
	float CurrentFadeInTime; // 0x2b0(0x04)
	float FadeInDelta; // 0x2b4(0x04)
	struct FString BusName; // 0x2b8(0x10)
	struct FString BusRTPCName; // 0x2c8(0x10)
	float StateThreshold; // 0x2d8(0x04)
	float StateConfirmTime; // 0x2dc(0x04)
	float InBusTime; // 0x2e0(0x04)
	float OutBusTime; // 0x2e4(0x04)
	float DefaultBusPriority; // 0x2e8(0x04)
	bool bEnableBusHDR; // 0x2ec(0x01)
	char pad_2ED[0x3]; // 0x2ed(0x03)
	struct FLinearColor ActiveColor; // 0x2f0(0x10)
	struct FLinearColor InactiveColor; // 0x300(0x10)
	struct FLinearColor DisableColor; // 0x310(0x10)

	void UpdateView(); // Function DFMGameHud.DFMAudioHDRDebugViewerItem.UpdateView // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioHDRDebugViewer
// Size: 0x300 (Inherited: 0x298)
class UDFMAudioHDRDebugViewer : public UUserWidget {
public:

	struct UClass* ItemWidgetClass; // 0x298(0x08)
	struct TMap<struct FString, struct UDFMAudioHDRDebugViewerItem*> BusWidgetItemMap; // 0x2a0(0x50)
	struct UVerticalBox* ItemList; // 0x2f0(0x08)
	char pad_2F8[0x8]; // 0x2f8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioPriorityDebugViewerItem
// Size: 0x368 (Inherited: 0x298)
class UDFMAudioPriorityDebugViewerItem : public UUserWidget {
public:

	struct FString EventName; // 0x298(0x10)
	char pad_2A8[0x58]; // 0x2a8(0x58)
	struct UTextBlock* NameText; // 0x300(0x08)
	struct UTextBlock* PriorityText; // 0x308(0x08)
	struct UTextBlock* LocationPriorityText; // 0x310(0x08)
	struct UTextBlock* FireDirPriorityText; // 0x318(0x08)
	struct UTextBlock* DistancePriorityText; // 0x320(0x08)
	struct UTextBlock* ReasonForNotPlayText; // 0x328(0x08)
	struct UTextBlock* AreaText; // 0x330(0x08)
	float TextLastTime; // 0x338(0x04)
	struct FLinearColor PlayColor; // 0x33c(0x10)
	struct FLinearColor NotPlayColor; // 0x34c(0x10)
	struct FVector2D CustomMarkerCircleScale; // 0x35c(0x08)
	char pad_364[0x4]; // 0x364(0x04)

	void OnTimeOut(); // Function DFMGameHud.DFMAudioPriorityDebugViewerItem.OnTimeOut // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioPriorityDebugViewer
// Size: 0x358 (Inherited: 0x298)
class UDFMAudioPriorityDebugViewer : public UUserWidget {
public:

	struct TArray<struct FString> CurrentSelectedWeaponAudioTypes; // 0x298(0x10)
	struct TMap<struct TWeakObjectPtr<struct AActor>, struct UDFMAudioPriorityDebugViewerItem*> ActorPriorityItemMap; // 0x2a8(0x50)
	struct TMap<struct FString, struct FAudioTypeDebugArrayStruct> SelectionTypeMap; // 0x2f8(0x50)
	struct UClass* ItemClass; // 0x348(0x08)
	struct UCanvasPanel* ViewerPanel; // 0x350(0x08)

	void OnShowPriorityTypeChanged(struct FString SelectedType); // Function DFMGameHud.DFMAudioPriorityDebugViewer.OnShowPriorityTypeChanged // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioTestEmitter
// Size: 0x448 (Inherited: 0x378)
class ADFMAudioTestEmitter : public AActor {
public:

	struct FString EmitterName; // 0x378(0x10)
	struct FString EmitterAudioType; // 0x388(0x10)
	struct FString PlayMode; // 0x398(0x10)
	float LoopInterval; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct FString MoveMode; // 0x3b0(0x10)
	float MoveSpeed; // 0x3c0(0x04)
	float CircularMoveRadius; // 0x3c4(0x04)
	bool bIsLoopPlaying; // 0x3c8(0x01)
	bool bIsMoving; // 0x3c9(0x01)
	char pad_3CA[0x6]; // 0x3ca(0x06)
	struct UGPAudioEventAsset* EventToPlay; // 0x3d0(0x08)
	bool bUseEventName; // 0x3d8(0x01)
	char pad_3D9[0x7]; // 0x3d9(0x07)
	struct FString SpecificEventName; // 0x3e0(0x10)
	char pad_3F0[0x10]; // 0x3f0(0x10)
	struct UTextRenderComponent* NameTextComp; // 0x400(0x08)
	struct UStaticMeshComponent* AudioMeshComp; // 0x408(0x08)
	struct UStaticMeshComponent* OutlineComp; // 0x410(0x08)
	struct UGameAkComponent* GameAkComp; // 0x418(0x08)
	struct UMaterialInterface* OutLineGreen; // 0x420(0x08)
	struct UMaterialInterface* OutLineRed; // 0x428(0x08)
	struct UMaterialInstanceDynamic* OutLineGreenInsDynamic; // 0x430(0x08)
	struct UMaterialInstanceDynamic* OutLineRedInsDynamic; // 0x438(0x08)
	bool bShowOutline; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)

	void UpdatePlayMode(struct FString InPlayMode); // Function DFMGameHud.DFMAudioTestEmitter.UpdatePlayMode // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMAudioTestMaster
// Size: 0x548 (Inherited: 0x388)
class UDFMAudioTestMaster : public UBaseUIView {
public:

	struct ADFMAudioTestEmitter* CurrentSelectedEmitter; // 0x388(0x08)
	struct FString CurrentSelectedEmitterName; // 0x390(0x10)
	struct FString CurrentTypedName; // 0x3a0(0x10)
	struct FString CurrentSelectedAudioType; // 0x3b0(0x10)
	struct FString CurrentSelectedPlayMode; // 0x3c0(0x10)
	float CurrentLoopInterval; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct FString CurrentSelectedMoveMode; // 0x3d8(0x10)
	float CurrentMoveSpeed; // 0x3e8(0x04)
	float CurrentCircularMoveRadius; // 0x3ec(0x04)
	bool bUseEventName; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct FString SpecificEventName; // 0x3f8(0x10)
	bool bCurrentIsFindingLocation; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct TArray<struct UGPAudioEventAsset*> LoadedAssetsCache; // 0x410(0x10)
	struct UComboBoxString* SelectEmitterCombo; // 0x420(0x08)
	struct UEditableTextBox* EmitterNameEditBox; // 0x428(0x08)
	struct UDFMAudioHDRDebugViewer* Debug_AudioHDRViewer; // 0x430(0x08)
	struct UDFMAudioPriorityDebugViewer* Debug_AudioPriorityDebugViewer; // 0x438(0x08)
	struct TMap<struct FString, struct ADFMAudioTestEmitter*> EmitterNameMap; // 0x440(0x50)
	int32_t DefaultNameCountNum; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct TMap<struct FString, struct FString> MenuBtnPanelMap; // 0x498(0x50)
	bool bShowGameAkDistance; // 0x4e8(0x01)
	bool bOnlyShowCharacter; // 0x4e9(0x01)
	char pad_4EA[0x2]; // 0x4ea(0x02)
	float GameAkCheckDistanceM; // 0x4ec(0x04)
	struct TMap<struct FString, struct FSoftObjectPath> TypeAssetsMap; // 0x4f0(0x50)
	struct UClass* TestEmitterClass; // 0x540(0x08)

	void UpdateSelectedEmitterInfoView(); // Function DFMGameHud.DFMAudioTestMaster.UpdateSelectedEmitterInfoView // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMBaseUserWidget
// Size: 0x300 (Inherited: 0x298)
class UDFMBaseUserWidget : public UUserWidget {
public:

	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x298(0x50)
	char pad_2E8[0x10]; // 0x2e8(0x10)
	bool bAutoCollectAnimations; // 0x2f8(0x01)
	char pad_2F9[0x7]; // 0x2f9(0x07)

	void Visible(); // Function DFMGameHud.DFMBaseUserWidget.Visible // (Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMBloodStripController
// Size: 0xc0 (Inherited: 0xb0)
class UDFMBloodStripController : public UBaseUIController {
public:

	struct UDFMBloodStripView* BloodStripView; // 0xb0(0x08)
	struct AActor* BindingBossActor; // 0xb8(0x08)

	void OnVehicleHealthUpdate(struct UDFMVehicleHealthComponent* TargetComponent, float NormalizedHpPercent); // Function DFMGameHud.DFMBloodStripController.OnVehicleHealthUpdate // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMBloodStripView
// Size: 0x398 (Inherited: 0x388)
class UDFMBloodStripView : public UBaseUIView {
public:

	struct UCanvasPanel* BloodStripPanel; // 0x388(0x08)
	struct UTextBlock* DescriptionText; // 0x390(0x08)

	void UpdateHpPercent(float Percent); // Function DFMGameHud.DFMBloodStripView.UpdateHpPercent // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMBowCrossHairBPView
// Size: 0x3d8 (Inherited: 0x3b8)
class UDFMBowCrossHairBPView : public UMobileGamePadView {
public:

	float TotalChargeTime; // 0x3b8(0x04)
	bool bIsCharging; // 0x3bc(0x01)
	char pad_3BD[0x1b]; // 0x3bd(0x1b)

	void OnSwitchZoomState(bool bFlag); // Function DFMGameHud.DFMBowCrossHairBPView.OnSwitchZoomState // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCCTVView
// Size: 0x398 (Inherited: 0x388)
class UDFMCCTVView : public UBaseUIView {
public:

	struct FVector HeadExtent; // 0x388(0x0c)
	char pad_394[0x4]; // 0x394(0x04)

	void UpdateMonitorInfo(struct TArray<struct FViewCharacterInfo>& ViewCharacterInfos, struct FText& AreaName); // Function DFMGameHud.DFMCCTVView.UpdateMonitorInfo // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonActionButtonView
// Size: 0x328 (Inherited: 0x298)
class UDFMCommonActionButtonView : public UUserWidget {
public:

	struct UImage* Image_Icon; // 0x298(0x08)
	struct UImage* Image_FX; // 0x2a0(0x08)
	struct UImage* Image_PressedCircle; // 0x2a8(0x08)
	struct UImage* Image_Background; // 0x2b0(0x08)
	struct UImage* Image_CircleBackground; // 0x2b8(0x08)
	struct UTextBlock* ActionName; // 0x2c0(0x08)
	bool bNeedFX; // 0x2c8(0x01)
	bool bUseDefaultIcon; // 0x2c9(0x01)
	char pad_2CA[0x6]; // 0x2ca(0x06)
	struct UPaperSprite* DefaultIconImage; // 0x2d0(0x08)
	int32_t BackgroundImageType; // 0x2d8(0x04)
	struct FLinearColor PressedColor; // 0x2dc(0x10)
	struct FLinearColor NormalColor; // 0x2ec(0x10)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct TArray<struct FLinearColor> BackgroundImageColors; // 0x300(0x10)
	struct TArray<struct FLinearColor> CircleBackgroundColors; // 0x310(0x10)
	struct UButton* OwnerButton; // 0x320(0x08)

	void SetText(struct FText InText); // Function DFMGameHud.DFMCommonActionButtonView.SetText // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonBannerController
// Size: 0xc0 (Inherited: 0xb0)
class UDFMCommonBannerController : public UBaseUIController {
public:

	struct UDFMCommonBannerView* BannerView; // 0xb0(0x08)
	char pad_B8[0x8]; // 0xb8(0x08)

	void HideBanner(); // Function DFMGameHud.DFMCommonBannerController.HideBanner // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonBannerView
// Size: 0x390 (Inherited: 0x388)
class UDFMCommonBannerView : public UBaseUIView {
public:

	struct UDFRichTextBlock* BannerText; // 0x388(0x08)

	void SetBannerText(struct FText Text); // Function DFMGameHud.DFMCommonBannerView.SetBannerText // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonButtonIcon
// Size: 0x560 (Inherited: 0x550)
class UDFMCommonButtonIcon : public ULuaUIBaseView {
public:

	struct UDFCheckBox* Checkbox; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)

	void BP_SetSelected(bool InSelected); // Function DFMGameHud.DFMCommonButtonIcon.BP_SetSelected // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonButtonInstruction
// Size: 0x558 (Inherited: 0x550)
class UDFMCommonButtonInstruction : public ULuaUIBaseView {
public:

	struct UCheckbox* Checkbox; // 0x550(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonButtonV2S1
// Size: 0x558 (Inherited: 0x550)
class UDFMCommonButtonV2S1 : public ULuaUIBaseView {
public:

	struct UButton* Button_Common; // 0x550(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonButtonV2S2
// Size: 0x558 (Inherited: 0x550)
class UDFMCommonButtonV2S2 : public ULuaUIBaseView {
public:

	struct UButton* Button_Common; // 0x550(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonButtonV3S1
// Size: 0x558 (Inherited: 0x550)
class UDFMCommonButtonV3S1 : public ULuaUIBaseView {
public:

	struct UButton* Button_Common; // 0x550(0x08)

	void BP_InitWidget(bool InShowIcon); // Function DFMGameHud.DFMCommonButtonV3S1.BP_InitWidget // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonCountdownView
// Size: 0x3f0 (Inherited: 0x388)
class UDFMCommonCountdownView : public UBaseUIView {
public:

	char pad_388[0x40]; // 0x388(0x40)
	struct UTextBlock* Event_TimeText; // 0x3c8(0x08)
	char pad_3D0[0x8]; // 0x3d0(0x08)
	struct UTextBlock* Event_TitleText; // 0x3d8(0x08)
	char pad_3E0[0x10]; // 0x3e0(0x10)

	void ShowCommonCountdown(struct FSOLCommonCountdownItem& CommonCountdownItem); // Function DFMGameHud.DFMCommonCountdownView.ShowCommonCountdown // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonKeyTipsView
// Size: 0x3c0 (Inherited: 0x388)
class UDFMCommonKeyTipsView : public UBaseUIView {
public:

	struct UUserWidget* WBP_ControllerKeyItem_Eexpression; // 0x388(0x08)
	struct UUserWidget* WBP_ControllerKeyItem_Bag; // 0x390(0x08)
	struct UUserWidget* WBP_ControllerKeyItem_Range; // 0x398(0x08)
	struct UUserWidget* WBP_ControllerKeyItem_AnalysisPanel; // 0x3a0(0x08)
	struct UUserWidget* WBP_ControllerKeyItem_Breath; // 0x3a8(0x08)
	struct UUserWidget* WBP_ControllerKeyItem_SwitchScope; // 0x3b0(0x08)
	struct UUserWidget* WBP_ControllerKeyItem_RangeFinder; // 0x3b8(0x08)

	void OnZoomStateChanged(bool ZoomState); // Function DFMGameHud.DFMCommonKeyTipsView.OnZoomStateChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonQTEButtonView
// Size: 0x298 (Inherited: 0x298)
class UDFMCommonQTEButtonView : public UUserWidget {
public:


	void PlayOutAnim(); // Function DFMGameHud.DFMCommonQTEButtonView.PlayOutAnim // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonIconImage
// Size: 0x558 (Inherited: 0x550)
class UDFMCommonIconImage : public ULuaUIBaseView {
public:

	struct UImage* wtMainIcon; // 0x550(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCommonQuality
// Size: 0x560 (Inherited: 0x550)
class UDFMCommonQuality : public ULuaUIBaseView {
public:

	struct UImage* wtBottomLine; // 0x550(0x08)
	struct UImage* wtArrowIcon_2; // 0x558(0x08)

	void BP_SetQualityByType(int32_t InType); // Function DFMGameHud.DFMCommonQuality.BP_SetQualityByType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCountDownHUDView
// Size: 0x3f0 (Inherited: 0x390)
class UDFMCountDownHUDView : public UCommonHUDView {
public:

	int32_t FinalCountDownTime; // 0x390(0x04)
	int32_t EmergencyCountDownTime; // 0x394(0x04)
	int32_t SuperEmergencyCountDownTime; // 0x398(0x04)
	float FadeOutAnimTime; // 0x39c(0x04)
	struct UCanvasPanel* Event_CanvasPanel; // 0x3a0(0x08)
	struct UTextBlock* Event_TitleText; // 0x3a8(0x08)
	struct UTextBlock* Event_TimeText; // 0x3b0(0x08)
	struct UCanvasPanel* TenSecondsExit_CanvasPanel; // 0x3b8(0x08)
	struct UTextBlock* TenSecondsExit_TitleText; // 0x3c0(0x08)
	struct UTextBlock* TenSecondsExit_TimeText; // 0x3c8(0x08)
	char pad_3D0[0x1]; // 0x3d0(0x01)
	bool bWaitingExit; // 0x3d1(0x01)
	char pad_3D2[0x1e]; // 0x3d2(0x1e)

	void DoOneCountDown(int32_t TimeSeconds, bool InUseTenSecondsType, bool bPlayAudio); // Function DFMGameHud.DFMCountDownHUDView.DoOneCountDown // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCrossHairBPView
// Size: 0x3b8 (Inherited: 0x3b8)
class UDFMCrossHairBPView : public UMobileGamePadView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCrossHairBPItemBase
// Size: 0x2a0 (Inherited: 0x298)
class UDFMCrossHairBPItemBase : public UUserWidget {
public:

	float MinSpreadRadius; // 0x298(0x04)
	bool bScaleMinSpread; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCrossHairFeedback
// Size: 0x4c8 (Inherited: 0x3b8)
class UDFMCrossHairFeedback : public UMobileGamePadView {
public:

	float ShowInterval; // 0x3b8(0x04)
	enum class ECrosshairFeedbackTypes FeedbackType; // 0x3bc(0x01)
	bool IsDuringHitFeedBack; // 0x3bd(0x01)
	char pad_3BE[0x6]; // 0x3be(0x06)
	float AngleMin; // 0x3c4(0x04)
	float AngleMax; // 0x3c8(0x04)
	bool IsNeedMovePosition; // 0x3cc(0x01)
	char pad_3CD[0x3]; // 0x3cd(0x03)
	float RollBackTime; // 0x3d0(0x04)
	float ReplaceTime; // 0x3d4(0x04)
	float ReplaceTimeForKill; // 0x3d8(0x04)
	float StartRollBackTime; // 0x3dc(0x04)
	char pad_3E0[0xc]; // 0x3e0(0x0c)
	float DelayTime; // 0x3ec(0x04)
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct AGPCharacter* OldCharacter; // 0x3f8(0x08)
	char pad_400[0x8]; // 0x400(0x08)
	struct UCanvasPanel* FeedBackPanel; // 0x408(0x08)
	char pad_410[0x8]; // 0x410(0x08)
	float ZoomInSwitchPlaceTypePercent; // 0x418(0x04)
	float ZoomOutSwitchPlaceTypePercent; // 0x41c(0x04)
	enum class EFeedbackAnimType FeedbackAnimType; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct TMap<enum class EFeedbackAnimType, struct FDFMCrossHairFeedbackWidgetAnimationConfig> FeedbackAnimMap; // 0x428(0x50)
	struct TMap<enum class EFeedbackAnimType, struct FString> FeedbackAudioMap; // 0x478(0x50)

	void PlayFeedbackAnimation(enum class EFeedbackAnimType AnimType); // Function DFMGameHud.DFMCrossHairFeedback.PlayFeedbackAnimation // (Native|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCrossHairViewDebugger
// Size: 0x3d8 (Inherited: 0x3b8)
class UDFMCrossHairViewDebugger : public UMobileGamePadView {
public:

	struct UCanvasPanel* Container; // 0x3b8(0x08)
	struct UImage* Dot; // 0x3c0(0x08)
	char pad_3C8[0x10]; // 0x3c8(0x10)

	void OnHitScreenPosition(struct FVector2D& Position); // Function DFMGameHud.DFMCrossHairViewDebugger.OnHitScreenPosition // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCrossHairViewNew
// Size: 0x4d8 (Inherited: 0x3b8)
class UDFMCrossHairViewNew : public UMobileGamePadView {
public:

	struct UCanvasPanel* CanvasPanel_1; // 0x3b8(0x08)
	struct TMap<struct FSoftObjectPath, struct FCrossHairAssetInfo> CacheAssetMap; // 0x3c0(0x50)
	struct USmoothCrosshairViewProxy* CrosshairViewProxy; // 0x410(0x08)
	struct UImage* ImgCrosshair; // 0x418(0x08)
	float LerpSpeed; // 0x420(0x04)
	float CenterMinHideDuration; // 0x424(0x04)
	bool bShouldChangeColor; // 0x428(0x01)
	char pad_429[0x4f]; // 0x429(0x4f)
	struct TArray<struct AActor*> ActorsToIgnore; // 0x478(0x10)
	struct TArray<struct UPrimitiveComponent*> CompsToIgnore; // 0x488(0x10)
	char pad_498[0x8]; // 0x498(0x08)
	struct UWeaponHudModel* HudModel; // 0x4a0(0x08)
	struct ADFMCharacter* CacheCharacter; // 0x4a8(0x08)
	struct UWeaponFuncComponentCrosshair* FuncCrosshair; // 0x4b0(0x08)
	char pad_4B8[0x20]; // 0x4b8(0x20)

	void OnWeaponZoom(bool bZoom); // Function DFMGameHud.DFMCrossHairViewNew.OnWeaponZoom // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCruiseMissileView
// Size: 0x410 (Inherited: 0x388)
class UDFMCruiseMissileView : public UBaseUIView {
public:

	float LerpHeight; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)
	float LerpDistance; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	float CurrentEnergy; // 0x398(0x04)
	struct FVector Velocity; // 0x39c(0x0c)
	bool bIsSecondaryAccelerated; // 0x3a8(0x01)
	bool bIsAimingVehicle; // 0x3a9(0x01)
	char pad_3AA[0x6]; // 0x3aa(0x06)
	struct TMap<struct AActor*, struct UWidget*> MarkersMap; // 0x3b0(0x50)
	char pad_400[0x8]; // 0x400(0x08)
	struct UWidgetAnimation* FadeOutAnim; // 0x408(0x08)

	void UpdateUI(); // Function DFMGameHud.DFMCruiseMissileView.UpdateUI // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCustomLayoutDragBtnChildInterface
// Size: 0x30 (Inherited: 0x30)
class UDFMCustomLayoutDragBtnChildInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCustomLayoutDragBtnForbid
// Size: 0x2e8 (Inherited: 0x2e0)
class UDFMCustomLayoutDragBtnForbid : public UImage {
public:

	char pad_2E0[0x8]; // 0x2e0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMCustomLayoutStackDataCenter
// Size: 0x60 (Inherited: 0x30)
class UDFMCustomLayoutStackDataCenter : public UObject {
public:

	struct TArray<struct UDFMCustomLayoutStack*> RevokeStack; // 0x30(0x10)
	struct TArray<struct UDFMCustomLayoutStack*> RestoreStack; // 0x40(0x10)
	int32_t CurrentFirstIndex; // 0x50(0x04)
	int32_t CurrentNum; // 0x54(0x04)
	int32_t MaxCount; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)

	void PushOldData(); // Function DFMGameHud.DFMCustomLayoutStackDataCenter.PushOldData // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMDisplayQualityController
// Size: 0x3c8 (Inherited: 0x378)
class ADFMDisplayQualityController : public AActor {
public:

	/*struct TMap<struct FString, struct TSoftObjectPtr<APostProcessVolume>>*/char PostEffectVolumeMap[0x50]; // 0x378(0x50)

	void UpdateDisplayStyle(); // Function DFMGameHud.DFMDisplayQualityController.UpdateDisplayStyle // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMBombCountdownView
// Size: 0x3b8 (Inherited: 0x388)
class UDFMBombCountdownView : public UBaseUIView {
public:

	struct AInteractor_TimeBomb* TimeBombA; // 0x388(0x08)
	struct AInteractor_TimeBomb* TimeBombB; // 0x390(0x08)
	struct FName TimeBombATag; // 0x398(0x08)
	struct FName TimeBombBTag; // 0x3a0(0x08)
	struct UTextBlock* TimeText; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)

	void OnTimeBombBCutWire(struct FBombWireInfo& WireInfo); // Function DFMGameHud.DFMBombCountdownView.OnTimeBombBCutWire // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMDisposalBombView
// Size: 0x448 (Inherited: 0x3b8)
class UDFMDisposalBombView : public UMobileGamePadView {
public:

	int32_t PunishTime; // 0x3b8(0x04)
	struct FName TimeBombATag; // 0x3bc(0x08)
	struct FName TimeBombBTag; // 0x3c4(0x08)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct UTextBlock* TimeTextSec; // 0x3d0(0x08)
	struct UTextBlock* TimeTextMilsec; // 0x3d8(0x08)
	struct TMap<struct FName, struct AInteractor_TimeBomb*> TimeBombs; // 0x3e0(0x50)
	struct FName ThisBombTag; // 0x430(0x08)
	char pad_438[0x10]; // 0x438(0x10)

	void UpdateBombProgress(struct AInteractor_TimeBomb* inTimeBomb); // Function DFMGameHud.DFMDisposalBombView.UpdateBombProgress // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMDPICustomScalingRule
// Size: 0x2b8 (Inherited: 0x30)
class UDFMDPICustomScalingRule : public UDPICustomScalingRule {
public:

	struct FRuntimeFloatCurve WideScreenCurve; // 0x30(0xa0)
	struct FRuntimeFloatCurve HighScreenCurve; // 0xd0(0xa0)
	struct FRuntimeFloatCurve WideScreenCurve_PC; // 0x170(0xa0)
	struct FRuntimeFloatCurve HighScreenCurve_PC; // 0x210(0xa0)
	float HighWideThreshold; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMFixedWeaponMainView
// Size: 0x448 (Inherited: 0x388)
class UDFMFixedWeaponMainView : public UBaseUIView {
public:

	struct TWeakObjectPtr<struct ADFMSceneWeapon> SenceWeapon; // 0x388(0x08)
	struct UCanvasPanel* MainPanel; // 0x390(0x08)
	struct UDFMFixedWeaponCommonView* CurrentFixedWeaponCommonView; // 0x398(0x08)
	/*struct TMap<enum class ESceneWeaponType, struct TSoftClassPtr<UObject>>*/char FixedWeaponHudClassMap[0x50]; // 0x3a0(0x50)
	/*struct TSet<struct UDFMFixedWeaponCommonView*>*/char LoadedFixedWeaponHudClass[0x50]; // 0x3f0(0x50)
	char pad_440[0x8]; // 0x440(0x08)

	void OnLoadComplete(struct FSoftObjectPath& Path); // Function DFMGameHud.DFMFixedWeaponMainView.OnLoadComplete // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMFixedWeaponState
// Size: 0x4b0 (Inherited: 0x388)
class UDFMFixedWeaponState : public UBaseUIView {
public:

	struct UImage* WeaponIcon; // 0x388(0x08)
	struct TMap<enum class ESceneWeaponType, struct UObject*> WeaponIconMap; // 0x390(0x50)
	struct TMap<enum class ESceneWeaponType, struct UObject*> LowHealthWeaponIconMap; // 0x3e0(0x50)
	enum class ESceneWeaponType CurrentWeaponType; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	struct TWeakObjectPtr<struct ADFMSceneWeapon> SceneWeapon; // 0x434(0x08)
	char pad_43C[0x14]; // 0x43c(0x14)
	struct UTextBlock* AmmoCountText; // 0x450(0x08)
	struct UImage* ProgressIcon; // 0x458(0x08)
	struct UTextBlock* CharacterHealthNum; // 0x460(0x08)
	struct UTextBlock* FixedWeaponBloodNum; // 0x468(0x08)
	struct UProgressBar* FixedWeaponProgressBar; // 0x470(0x08)
	float LowWeaponBloodRatio; // 0x478(0x04)
	struct FLinearColor NormalWeaponBloodProgressColor; // 0x47c(0x10)
	struct FLinearColor LowWeaponBloodProgressColor; // 0x48c(0x10)
	char pad_49C[0x14]; // 0x49c(0x14)

	void BP_UpdateWeaponHealthPrecent(float InHealthPrecent, float InMaxHealth, float InCurrentHealth); // Function DFMGameHud.DFMFixedWeaponState.BP_UpdateWeaponHealthPrecent // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGameChatHUDView
// Size: 0x3a0 (Inherited: 0x388)
class UDFMGameChatHUDView : public UBaseUIView {
public:

	struct UScrollGridBox* ChatMsgScrollGridBox; // 0x388(0x08)
	struct UTextBlock* FakeMsg; // 0x390(0x08)
	struct UDFMGameChat* DFMGameChatIns; // 0x398(0x08)

	void OnReceiveMsgs(struct TArray<struct FString> Arr); // Function DFMGameHud.DFMGameChatHUDView.OnReceiveMsgs // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGameChatTextWidget
// Size: 0x390 (Inherited: 0x388)
class UDFMGameChatTextWidget : public UBaseUIView {
public:

	struct UTextBlock* MsgText; // 0x388(0x08)

	void SetText(struct FString Msg); // Function DFMGameHud.DFMGameChatTextWidget.SetText // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGameHudDelegates
// Size: 0x638 (Inherited: 0x38)
class UDFMGameHudDelegates : public UGameInstanceSubsystem {
public:

	/*struct FMulticastInlineDelegate*/char OnGameSendSearchGUID[0x10]; // 0x38(0x10)
	/*struct FMulticastInlineDelegate*/char OnGameShareCustomLayoutInfo[0x10]; // 0x48(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandleMouseButtonDownEvent[0x10]; // 0x58(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandleMouseButtonUpEvent[0x10]; // 0x68(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandlePostProcessMouseButtonUpEvent[0x10]; // 0x78(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandleMouseMoveEvent[0x10]; // 0x88(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandleKeyDownEvent[0x10]; // 0x98(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandleKeyUpEvent[0x10]; // 0xa8(0x10)
	/*struct FMulticastInlineDelegate*/char OnGameInventoryReqPickItem[0x10]; // 0xb8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPointPanelUpdateRebornPointSelectStatus[0x10]; // 0xc8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployMarkerBaseWidgetDoubleClick[0x10]; // 0xd8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployMarkerShakeInRedeployCD[0x10]; // 0xe8(0x10)
	/*struct FMulticastInlineDelegate*/char OnHandleSettlementHUD[0x10]; // 0xf8(0x10)
	/*struct FMulticastInlineDelegate*/char OnKillBroadcastRangeChanged[0x10]; // 0x108(0x10)
	/*struct FMulticastInlineDelegate*/char OnWarfareLoadingSkipped[0x10]; // 0x118(0x10)
	/*struct FMulticastInlineDelegate*/char OnTryTrackMapTarget[0x10]; // 0x128(0x10)
	/*struct FMulticastInlineDelegate*/char OnTrackMapTargetSucceed[0x10]; // 0x138(0x10)
	/*struct FMulticastInlineDelegate*/char OnSelectMapTarget[0x10]; // 0x148(0x10)
	/*struct FMulticastInlineDelegate*/char OnTrackMapTarget[0x10]; // 0x158(0x10)
	char pad_168[0x10]; // 0x168(0x10)
	/*struct FMulticastInlineDelegate*/char OnBigMapShowDetailIcon[0x10]; // 0x178(0x10)
	/*struct FMulticastInlineDelegate*/char OnAllMapIconCreatedCompeted[0x10]; // 0x188(0x10)
	/*struct FMulticastInlineDelegate*/char OnMapCurrentScaleChanged[0x10]; // 0x198(0x10)
	/*struct FMulticastInlineDelegate*/char OnMiniMapClipUpdate[0x10]; // 0x1a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnMiniMapAddExitIcon[0x10]; // 0x1b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnCampScoreChange[0x10]; // 0x1c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerStatsChange[0x10]; // 0x1d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerNameHUDViewInitialized[0x10]; // 0x1e8(0x10)
	/*struct FMulticastInlineDelegate*/char OnMVPChange[0x10]; // 0x1f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnOverlapCapPointBegin[0x10]; // 0x208(0x10)
	/*struct FMulticastInlineDelegate*/char OnOverlapCapPointEnd[0x10]; // 0x218(0x10)
	/*struct FMulticastInlineDelegate*/char OnCapturePointHUDConstruct[0x10]; // 0x228(0x10)
	/*struct FDelegate*/char AddMarkWidget[0x10]; // 0x238(0x10)
	/*struct FDelegate*/char RemoveMarkWidget[0x10]; // 0x248(0x10)
	/*struct FDelegate*/char AddRedeployMarkWidget[0x10]; // 0x258(0x10)
	/*struct FDelegate*/char RemoveRedeployMarkWidget[0x10]; // 0x268(0x10)
	/*struct FMulticastInlineDelegate*/char RemoveRedeployMarkWidgetByNetGuid[0x10]; // 0x278(0x10)
	/*struct FMulticastInlineDelegate*/char RedeployPointSelected[0x10]; // 0x288(0x10)
	/*struct FMulticastInlineDelegate*/char RedeployPointFocusOn[0x10]; // 0x298(0x10)
	/*struct FMulticastInlineDelegate*/char RedeployPointPanelUpdateRebornPointSelectStatus[0x10]; // 0x2a8(0x10)
	/*struct FMulticastInlineDelegate*/char RedeployVehicleSelected[0x10]; // 0x2b8(0x10)
	/*struct FMulticastInlineDelegate*/char RedeployViewWidgetOnClick[0x10]; // 0x2c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployHeroItemViewClick[0x10]; // 0x2d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployHeroItemViewHover[0x10]; // 0x2e8(0x10)
	/*struct FMulticastInlineDelegate*/char RedeployLock[0x10]; // 0x2f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnWeaponStoreHudOnHide[0x10]; // 0x308(0x10)
	/*struct FMulticastInlineDelegate*/char OnWeaponPresetStoreHudOnHide[0x10]; // 0x318(0x10)
	/*struct FMulticastInlineDelegate*/char OnRequestRebornResultReturn[0x10]; // 0x328(0x10)
	/*struct FMulticastInlineDelegate*/char OnRequestRebornFinished[0x10]; // 0x338(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployBtnClick[0x10]; // 0x348(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPreloadLevelStateChanged[0x10]; // 0x358(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployViewOpenAnimFinished[0x10]; // 0x368(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeploySelectPointTweenPlayOver[0x10]; // 0x378(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployViewOnHide[0x10]; // 0x388(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnOneHubVehicleSpawner[0x10]; // 0x398(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnVehicleSpawnerStatesRefreshUI[0x10]; // 0x3a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAliveVehicleCountChange[0x10]; // 0x3b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnCurrentHubAndVehicleSpawnerNotAvailable[0x10]; // 0x3c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAllActorInfo[0x10]; // 0x3d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAllTeamPlayerInfo[0x10]; // 0x3e8(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAllNormalPlayerInfo[0x10]; // 0x3f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAllVehicleInfo[0x10]; // 0x408(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAllRebornFlagInfo[0x10]; // 0x418(0x10)
	/*struct FMulticastInlineDelegate*/char OnReturnAllStaticPointInfo[0x10]; // 0x428(0x10)
	/*struct FMulticastInlineDelegate*/char OnSelectSpawnAreaHubVehicleSteeringWheel[0x10]; // 0x438(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPackageViewHoverMainWeapon[0x10]; // 0x448(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPackageViewHoverSecondaryWeapon[0x10]; // 0x458(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPackageViewHoverMeleeWeapon[0x10]; // 0x468(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPackageViewHoverArmItem[0x10]; // 0x478(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPackageViewHoverArmItem2[0x10]; // 0x488(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployPointHover[0x10]; // 0x498(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployChooseItemBaseViewHoverBroadCastInt32[0x10]; // 0x4a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployChooseItemBaseViewHoverBroadCastUint64[0x10]; // 0x4b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployChooseItemBaseViewClickedBroadCastInt32[0x10]; // 0x4c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployChooseItemBaseViewClickedBroadCastUint64[0x10]; // 0x4d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployChooseItemBaseViewRightClickedBroadCastInt32[0x10]; // 0x4e8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployChooseItemBaseViewRightClickedBroadCastUint64[0x10]; // 0x4f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnShowRedeployStoreBaseHudViewPassInitParam[0x10]; // 0x508(0x10)
	/*struct FMulticastInlineDelegate*/char OnShowRedeployWeaponPresetStoreBaseHudViewPassInitParam[0x10]; // 0x518(0x10)
	/*struct FMulticastInlineDelegate*/char OnArmItemHudViewClickArmItem[0x10]; // 0x528(0x10)
	/*struct FMulticastInlineDelegate*/char OnClickPackageWeaponItem[0x10]; // 0x538(0x10)
	/*struct FMulticastInlineDelegate*/char OnClickWeaponStoreItem[0x10]; // 0x548(0x10)
	/*struct FMulticastInlineDelegate*/char OnClickWeaponPresetItem[0x10]; // 0x558(0x10)
	/*struct FMulticastInlineDelegate*/char OnRedeployVehicleItemStatusChanged[0x10]; // 0x568(0x10)
	/*struct FMulticastInlineDelegate*/char OnCurrentWeaponsChanged[0x10]; // 0x578(0x10)
	/*struct FMulticastInlineDelegate*/char TrySwitchWeapon[0x10]; // 0x588(0x10)
	/*struct FMulticastInlineDelegate*/char OnItemDetailPanelClose[0x10]; // 0x598(0x10)
	/*struct FMulticastInlineDelegate*/char OnCommonBtnSelected[0x10]; // 0x5a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnSOLRemainTimeDelayShow[0x10]; // 0x5b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnOpenSystemSettingMainView[0x10]; // 0x5c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnHoverMapTarget[0x10]; // 0x5d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnUnHoverMapTarget[0x10]; // 0x5e8(0x10)
	/*struct FMulticastInlineDelegate*/char OnSpectateShowHUD[0x10]; // 0x5f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnSpectateHideHUD[0x10]; // 0x608(0x10)
	/*struct FMulticastInlineDelegate*/char OnWishBtnSelected[0x10]; // 0x618(0x10)
	/*struct FMulticastInlineDelegate*/char OnBigMapClose[0x10]; // 0x628(0x10)

	void TryTrackDoorFromLua(bool bInTrack, struct FString DoorName, struct FVector& WorldLocation); // Function DFMGameHud.DFMGameHudDelegates.TryTrackDoorFromLua // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMActivityDebugView
// Size: 0x3a8 (Inherited: 0x388)
class UDFMGMActivityDebugView : public UBaseUIView {
public:

	struct URichTextBlock* RichTextBlock_CurActivityObjItemInfo; // 0x388(0x08)
	struct URichTextBlock* RichTextBlock_ActivityChangeHistory; // 0x390(0x08)
	struct UDFMPlayerActivityComponent* PlayerActivityComponent; // 0x398(0x08)
	float TickInterval; // 0x3a0(0x04)
	float TickCountDown; // 0x3a4(0x04)

	void OnUpdateGMView(); // Function DFMGameHud.DFMGMActivityDebugView.OnUpdateGMView // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMAIInfoView
// Size: 0x3c8 (Inherited: 0x3b8)
class UDFMGMAIInfoView : public UMobileGamePadView {
public:

	struct UTextBlock* AIBag; // 0x3b8(0x08)
	struct UTextBlock* AIDeadBag; // 0x3c0(0x08)

	void RefreshTestAI(struct FString NpcName, int32_t NpcDiffculty); // Function DFMGameHud.DFMGMAIInfoView.RefreshTestAI // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMButtonView
// Size: 0x3b8 (Inherited: 0x3b8)
class UDFMGMButtonView : public UMobileGamePadView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMConsoleInputView
// Size: 0x3a8 (Inherited: 0x388)
class UDFMGMConsoleInputView : public UBaseUIView {
public:

	struct TArray<struct FString> HistoryStrings; // 0x388(0x10)
	struct FString CurrentConsoleInputString; // 0x398(0x10)

	struct FString GetHistroyString(); // Function DFMGameHud.DFMGMConsoleInputView.GetHistroyString // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMFootStepDebugView
// Size: 0x3a0 (Inherited: 0x388)
class UDFMGMFootStepDebugView : public UBaseUIView {
public:

	struct UTextBlock* MaterialText; // 0x388(0x08)
	struct UTextBlock* AudioTagText; // 0x390(0x08)
	struct UTextBlock* WetnessText; // 0x398(0x08)

	void PerformMaterialTrace(); // Function DFMGameHud.DFMGMFootStepDebugView.PerformMaterialTrace // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMInputManagerDebugView
// Size: 0x4b8 (Inherited: 0x388)
class UDFMGMInputManagerDebugView : public UBaseUIView {
public:

	struct UGPInputManager* InputManager; // 0x388(0x08)
	struct UDFHDDisplayInputActionManager* DisplayInputActionManager; // 0x390(0x08)
	char pad_398[0x20]; // 0x398(0x20)
	struct UTextBlock* InputManagerValid; // 0x3b8(0x08)
	struct URichTextBlock* InputActionInfo; // 0x3c0(0x08)
	struct URichTextBlock* InputAxisInfo; // 0x3c8(0x08)
	struct URichTextBlock* InputActionHistoryInfo; // 0x3d0(0x08)
	struct URichTextBlock* InputAxisDisable; // 0x3d8(0x08)
	struct URichTextBlock* InputActionDisable; // 0x3e0(0x08)
	struct URichTextBlock* CurValidDisplayInputAction; // 0x3e8(0x08)
	struct UTextBlock* StaminaValue; // 0x3f0(0x08)
	struct UTextBlock* ChangeValue; // 0x3f8(0x08)
	struct UTextBlock* ChangeValuePerSecond; // 0x400(0x08)
	struct UTextBlock* CanRecover; // 0x408(0x08)
	struct UTextBlock* RecoverCD; // 0x410(0x08)
	struct UTextBlock* RecoverRate; // 0x418(0x08)
	struct UTextBlock* SprintChangeRate; // 0x420(0x08)
	struct UTextBlock* StandRun; // 0x428(0x08)
	struct UTextBlock* StandardDeltaAngleX; // 0x430(0x08)
	struct UTextBlock* StandardDeltaAngleY; // 0x438(0x08)
	struct UTextBlock* WorldVelocity; // 0x440(0x08)
	struct UTextBlock* LocalVelocity; // 0x448(0x08)
	struct UTextBlock* VelocityValue; // 0x450(0x08)
	struct UTextBlock* CurrentAccel; // 0x458(0x08)
	struct UTextBlock* CurrentAccelValue; // 0x460(0x08)
	struct UTextBlock* MaxAccelValue; // 0x468(0x08)
	struct UTextBlock* VaultClimbVelocityValue; // 0x470(0x08)
	struct UTextBlock* VaultClimbHorizontalVelocityValue; // 0x478(0x08)
	struct UTextBlock* VelocityHorizontalValue; // 0x480(0x08)
	struct UTextBlock* AnimSpeedValue; // 0x488(0x08)
	struct UTextBlock* VaultStartSpeedValue; // 0x490(0x08)
	struct UTextBlock* VaultInKeepSpeedRateScaleValue; // 0x498(0x08)
	struct UTextBlock* LerpAnimSpeedValue; // 0x4a0(0x08)
	float Gyro_HorizontalRate; // 0x4a8(0x04)
	float Gyro_VerticalRate; // 0x4ac(0x04)
	bool bWeaponCanSprint; // 0x4b0(0x01)
	bool bMovementCanSprint; // 0x4b1(0x01)
	bool bRoleLoadCanSprint; // 0x4b2(0x01)
	bool bBasePoseCanSprint; // 0x4b3(0x01)
	bool bHasSilentWalkInput; // 0x4b4(0x01)
	bool bSprintFiringInterval; // 0x4b5(0x01)
	bool bHasInterruptReason; // 0x4b6(0x01)
	char pad_4B7[0x1]; // 0x4b7(0x01)

	void UpdateSprintInfo(); // Function DFMGameHud.DFMGMInputManagerDebugView.UpdateSprintInfo // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMRecordDebugViewItem
// Size: 0x2c0 (Inherited: 0x298)
class UDFMGMRecordDebugViewItem : public UUserWidget {
public:

	struct FName HudName; // 0x298(0x08)
	struct UDFMGMRecordDebugView* ParentSetting; // 0x2a0(0x08)
	struct UTextBlock* HudNameText; // 0x2a8(0x08)
	struct UTextBlock* HudNameTextDesc; // 0x2b0(0x08)
	struct UCheckbox* HudCheckBox; // 0x2b8(0x08)

	void OnCheckBoxStatusChanged(bool bIsChecked); // Function DFMGameHud.DFMGMRecordDebugViewItem.OnCheckBoxStatusChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.RecordDebugSettings
// Size: 0x170 (Inherited: 0x30)
class URecordDebugSettings : public UObject {
public:

	struct TMap<struct FName, bool> HudMap; // 0x30(0x50)
	struct TMap<struct FName, bool> LuaHudMap; // 0x80(0x50)
	struct TMap<struct FName, bool> TempHudMap; // 0xd0(0x50)
	struct TMap<struct FName, bool> TempLuaHudMap; // 0x120(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMRecordDebugView
// Size: 0x5f0 (Inherited: 0x388)
class UDFMGMRecordDebugView : public UBaseUIView {
public:

	char pad_388[0x20]; // 0x388(0x20)
	struct TArray<struct FName> InputPresetNames; // 0x3a8(0x10)
	char pad_3B8[0x50]; // 0x3b8(0x50)
	struct TArray<struct UDFMGMRecordDebugViewItem*> CreatedHudArray; // 0x408(0x10)
	struct FVector2D offset; // 0x418(0x08)
	bool bApplyOffset; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct UClass* HudItemWidgetClass; // 0x428(0x08)
	struct TArray<struct FName> IgnoredHudItemWidget; // 0x430(0x10)
	struct UVerticalBox* HudVerticalBox; // 0x440(0x08)
	struct TMap<struct FName, bool> HudMap; // 0x448(0x50)
	struct TMap<struct FName, bool> LuaHudMap; // 0x498(0x50)
	struct TMap<struct FName, bool> TempHudMap; // 0x4e8(0x50)
	struct TMap<struct FName, bool> TempLuaHudMap; // 0x538(0x50)
	struct TMap<struct FName, bool> SortedHudMap; // 0x588(0x50)
	char pad_5D8[0x18]; // 0x5d8(0x18)

	void UpdateInputPresets(struct FText InText); // Function DFMGameHud.DFMGMRecordDebugView.UpdateInputPresets // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMGMTrackCameraHudView
// Size: 0x490 (Inherited: 0x388)
class UDFMGMTrackCameraHudView : public UBaseUIView {
public:

	struct UComboBoxString* CharacterComboBox; // 0x388(0x08)
	struct UComboBoxString* CharacterSocketComboBox; // 0x390(0x08)
	struct UComboBoxString* WeaponSocketComboBox; // 0x398(0x08)
	struct UComboBoxString* FocusCharacterSocketComboBox; // 0x3a0(0x08)
	struct TMap<struct FString, struct ACHARACTER*> CharacterNameMap; // 0x3a8(0x50)
	struct TMap<struct FString, struct UMeshComponent*> WeaponSocketNameMap; // 0x3f8(0x50)
	struct FString CurrentTargetString; // 0x448(0x10)
	struct FString CurrentCharacterSocketString; // 0x458(0x10)
	struct FString CurrentWeaponSocketString; // 0x468(0x10)
	struct FString CurrentFocusSocketString; // 0x478(0x10)
	bool bEnableCharacterSocketFollow; // 0x488(0x01)
	bool bEnableWeaponSocketFollow; // 0x489(0x01)
	bool bEnableFocusCharacterSocket; // 0x48a(0x01)
	char pad_48B[0x5]; // 0x48b(0x05)

	void UpdateWeaponSocketDropdownList(); // Function DFMGameHud.DFMGMTrackCameraHudView.UpdateWeaponSocketDropdownList // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ArtCommon
// Size: 0x2b8 (Inherited: 0x298)
class UArtCommon : public UUserWidget {
public:

	struct UDFImage* DFImage_Art; // 0x298(0x08)
	int32_t Number; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct TArray<struct UPaperSprite*> ImageArray; // 0x2a8(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHDWeaponHudView
// Size: 0x720 (Inherited: 0x388)
class UDFMHDWeaponHudView : public UBaseUIView {
public:

	struct UWeaponHudController* HudController; // 0x388(0x08)
	struct AWeaponBase* CurActiveWeaponV; // 0x390(0x08)
	enum class ECurActiveWeaponType CurActiveWeaponTypeV; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	int32_t BulletLevelCount; // 0x39c(0x04)
	char pad_3A0[0x10]; // 0x3a0(0x10)
	struct TMap<struct FSoftObjectPath, struct UPaperSprite*> LoadedTextures; // 0x3b0(0x50)
	struct TArray<struct FLinearColor> AmmoLevel; // 0x400(0x10)
	struct FLinearColor LowAmmoColor; // 0x410(0x10)
	char pad_420[0x8]; // 0x420(0x08)
	struct AActor* FocusActor; // 0x428(0x08)
	struct AWeaponBase* BindFirstWeapon; // 0x430(0x08)
	struct AWeaponBase* BindSecondWeapon; // 0x438(0x08)
	struct AWeaponBase* BindThirdWeapon; // 0x440(0x08)
	struct AWeaponBase* BindFourthWeapon; // 0x448(0x08)
	struct AWeaponBase* CurActiveWeapon; // 0x450(0x08)
	struct AWeaponBase* PreActiveWeapon; // 0x458(0x08)
	struct TArray<enum class GameHUDSate> InvisibleFocusHUDState; // 0x460(0x10)
	struct UCanvasPanel* FireModePanel; // 0x470(0x08)
	struct UButton* PistolSwitchWeaponBtn; // 0x478(0x08)
	struct UButton* MeleeSwitchWeaponBtn; // 0x480(0x08)
	struct UButton* SwitchWeaponBtn; // 0x488(0x08)
	struct UUserWidget* WeaponWidget; // 0x490(0x08)
	struct UDFMImage* WeaponPic; // 0x498(0x08)
	struct UWidgetAnimation* FirstWeaponChangeAnim; // 0x4a0(0x08)
	struct UUserWidget* SubWeaponWidget; // 0x4a8(0x08)
	struct UDFMImage* SecondWeaponPic; // 0x4b0(0x08)
	struct UWidgetAnimation* SecondWeaponChangeAnim; // 0x4b8(0x08)
	struct UUserWidget* MeleeWeaponWidget; // 0x4c0(0x08)
	struct UDFMImage* MeleeWeaponPic; // 0x4c8(0x08)
	struct UWidgetAnimation* ThirdWeaponChangeAnim; // 0x4d0(0x08)
	struct UUserWidget* PistolWeaponWidget; // 0x4d8(0x08)
	struct UDFMImage* PistolWeaponPic; // 0x4e0(0x08)
	struct UWidgetAnimation* FourthWeaponChangeAnim; // 0x4e8(0x08)
	bool bEnableWeaponIconWidgetAnimation; // 0x4f0(0x01)
	bool bEnableWeaponSwitchAnim; // 0x4f1(0x01)
	bool bHasPlayedWeaponSwitchAnim; // 0x4f2(0x01)
	char pad_4F3[0x5]; // 0x4f3(0x05)
	struct UUserWidget* WeaponWidget_Change; // 0x4f8(0x08)
	struct UDFMImage* WeaponPic_Change; // 0x500(0x08)
	struct UUserWidget* SubWeaponWidget_Change; // 0x508(0x08)
	struct UDFMImage* SubWeaponPic_Change; // 0x510(0x08)
	struct UCanvasPanel* CanvasPanel_WeaponChange; // 0x518(0x08)
	struct UCanvasPanel* CanvasPanel_SubWeaponChange; // 0x520(0x08)
	struct FVector2D IconOffsetModify; // 0x528(0x08)
	struct FVector2D IconOffsetModifyDownPosition; // 0x530(0x08)
	struct FVector2D IconOffsetModifyDownTranslation; // 0x538(0x08)
	struct UUserWidget* SwapWidgetDownCache; // 0x540(0x08)
	struct UDFMImage* SwapPicDownCache; // 0x548(0x08)
	struct UArtCommon* WBP_ArtAmmo_2; // 0x550(0x08)
	struct UArtCommon* WBP_ArtAmmo_3; // 0x558(0x08)
	struct UArtCommon* WBP_ArtAmmo_4; // 0x560(0x08)
	struct UArtCommon* WBP_ArtCarriedAmmo_2; // 0x568(0x08)
	struct UArtCommon* WBP_ArtCarriedAmmo_3; // 0x570(0x08)
	struct UArtCommon* WBP_ArtCarriedAmmo_4; // 0x578(0x08)
	struct UCanvasPanel* AmmoPanel; // 0x580(0x08)
	struct UImage* AmmoLevelImg; // 0x588(0x08)
	struct UDFBorder* AmmoQualityBorder; // 0x590(0x08)
	struct UDFTextBlock* AmmoQualityText; // 0x598(0x08)
	struct UTextBlock* WeaponName; // 0x5a0(0x08)
	struct UHDKeyIconBoxWidget* KeyIconBox; // 0x5a8(0x08)
	struct UHDKeyIconBoxWidget* keyIconBoxMelee; // 0x5b0(0x08)
	struct UHDKeyIconBoxWidget* keyIconBoxPistol; // 0x5b8(0x08)
	struct UButton* FlashFuncToolBar; // 0x5c0(0x08)
	struct UCanvasPanel* FlashFuncPanel; // 0x5c8(0x08)
	struct UUserWidget* PowerFlash; // 0x5d0(0x08)
	struct UVerticalBox* WeaponOperationHint; // 0x5d8(0x08)
	struct UButton* WeaponFuncToolbar; // 0x5e0(0x08)
	struct UUserWidget* TacticalEquipsImage; // 0x5e8(0x08)
	struct UUserWidget* FlashLightImage; // 0x5f0(0x08)
	struct UUserWidget* LaserImage; // 0x5f8(0x08)
	struct UUserWidget* AimingRatio; // 0x600(0x08)
	struct UButton* DragBtnChangeSight; // 0x608(0x08)
	struct UCanvasPanel* CanvasPanel_Ability; // 0x610(0x08)
	struct UCanvasPanel* RootPanel; // 0x618(0x08)
	struct UButton* Button_264; // 0x620(0x08)
	struct UWidgetAnimation* GAnimSperadWeaponBar_out; // 0x628(0x08)
	struct FTimerHandle AccessoryAnimTimerHandle; // 0x630(0x08)
	struct UWidgetAnimation* Anim_AccessoryInformation_Show; // 0x638(0x08)
	struct UWidgetAnimation* Anim_AccessoryInformation_Hide; // 0x640(0x08)
	struct FLinearColor NormalGunColor_PC; // 0x648(0x10)
	struct FVector2D WatchFightOffset; // 0x658(0x08)
	struct FName Weapon_Tactical_Gear_Switch; // 0x660(0x08)
	struct FName UI_PowerFlash_Open; // 0x668(0x08)
	struct FName WeaponZoomOutTweenName; // 0x670(0x08)
	struct FName WeaponZoomInTweenName; // 0x678(0x08)
	int32_t CacheZoomRateIndex; // 0x680(0x04)
	bool bHasSetCA0; // 0x684(0x01)
	bool bHasSetCA9; // 0x685(0x01)
	bool bHasSetCA99; // 0x686(0x01)
	bool bHasSetLA0; // 0x687(0x01)
	bool bHasSetLA9; // 0x688(0x01)
	bool bHasSetLA99; // 0x689(0x01)
	bool bHasSetA0; // 0x68a(0x01)
	bool bHasSetA9; // 0x68b(0x01)
	bool bHasSetA99; // 0x68c(0x01)
	char pad_68D[0x3]; // 0x68d(0x03)
	struct FText TextEmpty; // 0x690(0x18)
	struct FText TextZero1; // 0x6a8(0x18)
	struct FText TextZero2; // 0x6c0(0x18)
	struct FText TextZero3; // 0x6d8(0x18)
	struct UFunction* Func_AimingRatio_BP_SetText; // 0x6f0(0x08)
	struct UFunction* Func_AimingRatio_SetSelected; // 0x6f8(0x08)
	struct UFunction* Func_TacticalEquipsImage_BP_SetThumbnial; // 0x700(0x08)
	struct UFunction* Func_PowerFlash_BP_SetText; // 0x708(0x08)
	struct UFunction* Func_PowerFlash_BP_SetType; // 0x710(0x08)
	enum class ESlateVisibility LastRootPanelVisibility; // 0x718(0x01)
	bool bIsOB; // 0x719(0x01)
	bool bPendingHandleKillReconnect; // 0x71a(0x01)
	char pad_71B[0x5]; // 0x71b(0x05)

	void UpdateScopeView(bool bShowZoomRateTip); // Function DFMGameHud.DFMHDWeaponHudView.UpdateScopeView // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHitMarkView
// Size: 0x3e0 (Inherited: 0x3b8)
class UDFMHitMarkView : public UMobileGamePadView {
public:

	struct UDFMCrossHairFeedback* DamageCrossHairFeedBack; // 0x3b8(0x08)
	struct UDFMCrossHairFeedback* KillCrossHairFeedBack; // 0x3c0(0x08)
	struct UDFMCrossHairFeedback* VehicleCrossHairFeedBack; // 0x3c8(0x08)
	char pad_3D0[0x8]; // 0x3d0(0x08)
	struct UDFMCrossHairFeedback* CurrentView; // 0x3d8(0x08)

	void OnMakeHitFeedBack(enum class EHitEventType InHitEventType, enum class ECharacterPart HitPart, struct AGPCharacter* Taker, int32_t ArmorLevel); // Function DFMGameHud.DFMHitMarkView.OnMakeHitFeedBack // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHitViewInterface
// Size: 0x30 (Inherited: 0x30)
class UDFMHitViewInterface : public UInterface {
public:


	void OnShowLoopHitEffect(bool bLoop); // Function DFMGameHud.DFMHitViewInterface.OnShowLoopHitEffect // (Native|Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUD
// Size: 0x718 (Inherited: 0x6d8)
class ADFMHUD : public ABaseHUD {
public:

	struct FName DFMUIDataTable_Name; // 0x6d8(0x08)
	struct UDataTable* DFMUIDataTable; // 0x6e0(0x08)
	struct FString LuaHudTableName; // 0x6e8(0x10)
	struct FString LuaBaseHudTableName; // 0x6f8(0x10)
	struct UDFCommonHUDScreenMutex* HUDScreenMutex_HDEventTips; // 0x708(0x08)
	struct UDFCommonHUDScreenMutex* HUDScreenMutex_MiniMapBottom; // 0x710(0x08)

	void OnWeaponPanelCreated(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameHud.DFMHUD.OnWeaponPanelCreated // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDBleedingView
// Size: 0x390 (Inherited: 0x388)
class UDFMHUDBleedingView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDBloodStainView
// Size: 0x3e8 (Inherited: 0x388)
class UDFMHUDBloodStainView : public UBaseUIView {
public:

	struct UImage* BloodMask; // 0x388(0x08)
	struct UImage* NearDeath_BloodMask; // 0x390(0x08)
	struct UOverlay* Overlay_1; // 0x398(0x08)
	float ShowBloodStainPercent; // 0x3a0(0x04)
	float DeathFadeDelayTime; // 0x3a4(0x04)
	float DeathFadeDurationTime; // 0x3a8(0x04)
	float DeathFadePercent; // 0x3ac(0x04)
	struct UCurveVector* EffectGHostCurve; // 0x3b0(0x08)
	char pad_3B8[0x30]; // 0x3b8(0x30)

	void OnClientBuffEffectPain(struct AGPCharacter* CHARACTER, bool Enable); // Function DFMGameHud.DFMHUDBloodStainView.OnClientBuffEffectPain // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudHelper
// Size: 0x30 (Inherited: 0x30)
class UDFMHudHelper : public UObject {
public:


	void STATIC_TriggerUIClickAudio(struct UObject* WorldContext); // Function DFMGameHud.DFMHudHelper.TriggerUIClickAudio // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitBaseView
// Size: 0x458 (Inherited: 0x388)
class UDFMHUDHitBaseView : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)
	struct FRuntimeFloatCurve ViewCurve; // 0x398(0xa0)
	bool bStartLevel; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float Level1; // 0x43c(0x04)
	float Level2; // 0x440(0x04)
	float Level3; // 0x444(0x04)
	float PainDisplayTime; // 0x448(0x04)
	float PainHideTime; // 0x44c(0x04)
	struct UWidgetAnimation* CacheAnim; // 0x450(0x08)

	void NativePlayLoopAnimation(struct UWidgetAnimation* InAnim, bool bLoop); // Function DFMGameHud.DFMHUDHitBaseView.NativePlayLoopAnimation // (Final|Native|Protected|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitDirView
// Size: 0x3f8 (Inherited: 0x388)
class UDFMHUDHitDirView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct UOverlay* Overlay_1; // 0x390(0x08)
	struct FSoftClassPath HitDirClass; // 0x398(0x18)
	int32_t MaxHitDirInstance; // 0x3b0(0x04)
	float HitShowTime; // 0x3b4(0x04)
	struct TArray<struct UDFMHUDHitDirViewItem*> AllHitDirViews; // 0x3b8(0x10)
	struct UDFMHUDHitDirViewItem* HitDirViewItem_1; // 0x3c8(0x08)
	struct UDFMHUDHitDirViewItem* HitDirViewItem_2; // 0x3d0(0x08)
	struct UDFMHUDHitDirViewItem* HitDirViewItem_3; // 0x3d8(0x08)
	struct UDFMHUDHitDirViewItem* HitDirViewItem_4; // 0x3e0(0x08)
	struct UDFMHUDHitDirViewItem* HitDirViewItem_5; // 0x3e8(0x08)
	struct AGPCharacter* CacheChar; // 0x3f0(0x08)

	void OnVehicleHealthDamaged(float Damage, struct FTakeHitInfo& TakeHitInfo); // Function DFMGameHud.DFMHUDHitDirView.OnVehicleHealthDamaged // (Final|Native|Protected|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitDirViewItem
// Size: 0x3d8 (Inherited: 0x388)
class UDFMHUDHitDirViewItem : public UBaseUIView {
public:

	bool CurrentIsActive; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	float StartTimestamp; // 0x38c(0x04)
	float startFadeTime; // 0x390(0x04)
	float endFadeTime; // 0x394(0x04)
	float BaseDirOffset; // 0x398(0x04)
	float StayTime; // 0x39c(0x04)
	char pad_3A0[0x30]; // 0x3a0(0x30)
	struct AGPPlayerController* DFMPC; // 0x3d0(0x08)

	void ShowHitDir(float Damage, float ShowTime, struct FVector sourceLoc); // Function DFMGameHud.DFMHUDHitDirViewItem.ShowHitDir // (Final|Native|Public|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitDirViewItemV2
// Size: 0x3e0 (Inherited: 0x388)
class UDFMHUDHitDirViewItemV2 : public UBaseUIView {
public:

	bool CurrentIsActive; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	float StartTimestamp; // 0x38c(0x04)
	float startFadeTime; // 0x390(0x04)
	float endFadeTime; // 0x394(0x04)
	float BaseDirOffset; // 0x398(0x04)
	float StayTime; // 0x39c(0x04)
	char pad_3A0[0x4]; // 0x3a0(0x04)
	struct TWeakObjectPtr<struct AActor> TargetActor; // 0x3a4(0x08)
	char pad_3AC[0x2c]; // 0x3ac(0x2c)
	struct AGPPlayerController* DFMPC; // 0x3d8(0x08)

	void ShowHitDir(float Damage, float ShowTime, struct FVector sourceLoc, struct AActor* Target); // Function DFMGameHud.DFMHUDHitDirViewItemV2.ShowHitDir // (Final|Native|Public|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitDirViewV2
// Size: 0x410 (Inherited: 0x388)
class UDFMHUDHitDirViewV2 : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct UOverlay* Overlay_1; // 0x390(0x08)
	struct FSoftClassPath HitDirClass; // 0x398(0x18)
	int32_t MaxHitDirInstance; // 0x3b0(0x04)
	float HitShowTime; // 0x3b4(0x04)
	struct UCurveFloat* DamagePrecentCurve; // 0x3b8(0x08)
	struct UCurveFloat* VehicleDamagePrecentCurve; // 0x3c0(0x08)
	struct TArray<struct UDFMHUDHitDirViewItemV2*> AllHitDirViews; // 0x3c8(0x10)
	struct UDFMHUDHitDirViewItemV2* HitDirViewItem_1; // 0x3d8(0x08)
	struct UDFMHUDHitDirViewItemV2* HitDirViewItem_2; // 0x3e0(0x08)
	struct UDFMHUDHitDirViewItemV2* HitDirViewItem_3; // 0x3e8(0x08)
	struct UDFMHUDHitDirViewItemV2* HitDirViewItem_4; // 0x3f0(0x08)
	struct UDFMHUDHitDirViewItemV2* HitDirViewItem_5; // 0x3f8(0x08)
	struct AGPCharacter* CacheChar; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)

	void OnVehicleHealthDamaged(float DamagePrecent, struct FTakeHitInfo& TakeHitInfo); // Function DFMGameHud.DFMHUDHitDirViewV2.OnVehicleHealthDamaged // (Final|Native|Protected|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitFeedBack
// Size: 0x420 (Inherited: 0x388)
class UDFMHUDHitFeedBack : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct UCanvasPanel* FeedBackTips; // 0x390(0x08)
	struct UImage* TipsIcon; // 0x398(0x08)
	struct UCanvasPanel* Canvas_HitBroke; // 0x3a0(0x08)
	float RollBackTime; // 0x3a8(0x04)
	float StartRollBackTime; // 0x3ac(0x04)
	char pad_3B0[0x10]; // 0x3b0(0x10)
	float AngleMin; // 0x3c0(0x04)
	float AngleMax; // 0x3c4(0x04)
	bool IsDuringHitFeedBack; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct TMap<enum class EFeedbackTipsAnimType, struct FDFMFeedbackWidgetAnimationConfig> FeedbackWidgetAnimationConfig; // 0x3d0(0x50)

	void PlayFeedbackTipsAnimation(enum class EFeedbackTipsAnimType InHitEventType, int32_t Level); // Function DFMGameHud.DFMHUDHitFeedBack.PlayFeedbackTipsAnimation // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHUDHitView
// Size: 0x530 (Inherited: 0x388)
class UDFMHUDHitView : public UBaseUIView {
public:

	float ViewScale; // 0x388(0x04)
	float ViewDyingPercent; // 0x38c(0x04)
	struct TArray<struct FHitViewConf> HitViewConf; // 0x390(0x10)
	struct FSoftClassPath BaseHitView; // 0x3a0(0x18)
	struct TMap<enum class EHitEventType, struct FHitPostProcessEffect> HitPostProcessEffectConfig; // 0x3b8(0x50)
	char pad_408[0x38]; // 0x408(0x38)
	struct UMaterialInstanceDynamic* CurrentPostProessEffectInstance; // 0x440(0x08)
	struct UMaterialInstanceDynamic* CurrentSuppressEffectInstance; // 0x448(0x08)
	char pad_450[0x48]; // 0x450(0x48)
	struct FHitSuppressByBulletEffect SuppressByBulletEffect; // 0x498(0x70)
	char pad_508[0x8]; // 0x508(0x08)
	struct AGPCharacter* CacheChar; // 0x510(0x08)
	char pad_518[0x10]; // 0x518(0x10)
	struct UDFMHUDHitDirViewV2* HitDirView; // 0x528(0x08)

	void PlayLoopHitView(struct UObject* obj, bool Loop); // Function DFMGameHud.DFMHUDHitView.PlayLoopHitView // (Final|Native|Protected|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudLevelSubsystem
// Size: 0x3f8 (Inherited: 0x378)
class ADFMHudLevelSubsystem : public ALevelSubsystem {
public:

	struct UClass* EdgeTrackingBigMapWidgetClass; // 0x378(0x08)
	struct UClass* EdgeTrackingMiniMapWidgetClass; // 0x380(0x08)
	struct UClass* EvacuteTimeWidgetClass; // 0x388(0x08)
	struct UClass* MapItemRippleClass; // 0x390(0x08)
	struct UClass* MapItemRangeClass; // 0x398(0x08)
	struct UClass* SelectedFrameClass; // 0x3a0(0x08)
	struct UClass* FlaggedFrameWidgetClass; // 0x3a8(0x08)
	struct UClass* AnimTrackingWidgetClass; // 0x3b0(0x08)
	struct UClass* BattlefieldFlaggedFrameWidgetClass; // 0x3b8(0x08)
	struct UClass* MapItemProgressWidgetClass; // 0x3c0(0x08)
	struct UClass* BlackScreenWidgetClass; // 0x3c8(0x08)
	struct UUserWidget* BlackScreenWidget; // 0x3d0(0x08)
	struct TArray<struct UAdjustableMapItemBase*> BigMapRangeHUDViewArray; // 0x3d8(0x10)
	struct TArray<struct UAdjustableMapItemBase*> MiniMapRangeHUDViewArray; // 0x3e8(0x10)

	void OnTriggerUIAudio(struct FName& UIAudioName); // Function DFMGameHud.DFMHudLevelSubsystem.OnTriggerUIAudio // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudMvcFieldBase
// Size: 0x30 (Inherited: 0x30)
class UDFMHudMvcFieldBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudMvcViewBase
// Size: 0x310 (Inherited: 0x298)
class UDFMHudMvcViewBase : public UUserWidget {
public:

	struct UDFMHudMvcFieldBase* HudMvcField; // 0x298(0x08)
	struct UDFMHudMvcLogicBase* HudMvcLogic; // 0x2a0(0x08)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x2a8(0x50)
	char pad_2F8[0x10]; // 0x2f8(0x10)
	bool bEnableTimerTick; // 0x308(0x01)
	bool bAutoCollectAnimations; // 0x309(0x01)
	char pad_30A[0x6]; // 0x30a(0x06)

	void Visible(); // Function DFMGameHud.DFMHudMvcViewBase.Visible // (Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudMvcLogicBase
// Size: 0x48 (Inherited: 0x30)
class UDFMHudMvcLogicBase : public UObject {
public:

	struct UDFMHudMvcFieldBase* HudMvcField; // 0x30(0x08)
	struct TArray<struct UDFMHudMvcViewBase*> HudMvcViews; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudMvcConfigInstance
// Size: 0x40 (Inherited: 0x30)
class UDFMHudMvcConfigInstance : public UObject {
public:

	struct UDFMHudMvcFieldBase* FieldInstance; // 0x30(0x08)
	struct UDFMHudMvcLogicBase* LogicInstance; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMHudMvcLevelSubsystem
// Size: 0x438 (Inherited: 0x378)
class ADFMHudMvcLevelSubsystem : public ALevelSubsystem {
public:

	struct TMap<enum class EHudModuleType, struct FDFMHudMvcConfig> HudMvcConfigMap; // 0x378(0x50)
	char pad_3C8[0x8]; // 0x3c8(0x08)
	struct TMap<enum class EHudModuleType, struct UDFMHudMvcConfigInstance*> HudMvcConfigInstanceMap; // 0x3d0(0x50)
	struct FTimerHandle HudMvcLogicTickTimerHandle; // 0x420(0x08)
	char pad_428[0x10]; // 0x428(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorButton
// Size: 0x438 (Inherited: 0x298)
class UDFMInteractorButton : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct UImage* EnableImage; // 0x2a0(0x08)
	struct UImage* EnableImage_2; // 0x2a8(0x08)
	struct UImage* Quality; // 0x2b0(0x08)
	struct UImage* ExImage; // 0x2b8(0x08)
	struct UButton* ItemDetailButton; // 0x2c0(0x08)
	struct UButton* ItemOperatorButton; // 0x2c8(0x08)
	struct UDFRichTextBlock* TitleText; // 0x2d0(0x08)
	struct UImage* Image_Base; // 0x2d8(0x08)
	struct UPaperSprite* EnableBG; // 0x2e0(0x08)
	struct UPaperSprite* DisableBG; // 0x2e8(0x08)
	struct TWeakObjectPtr<struct UInteractExecutor> CurrExecutor; // 0x2f0(0x08)
	struct FPotentialInteractorInfo CurrInteractableInfo; // 0x2f8(0x40)
	struct TMap<int32_t, struct FLinearColor> QualityColorMap; // 0x338(0x50)
	struct UDFMInteractorPanel* CachedDFMInteractorPanel; // 0x388(0x08)
	char pad_390[0x20]; // 0x390(0x20)
	struct FInteractableProxy LastInteractableProxy; // 0x3b0(0x10)
	struct TMap<struct FString, struct UWidgetAnimation*> AnimationMap; // 0x3c0(0x50)
	struct UWidgetAnimation* AnimaIn; // 0x410(0x08)
	struct UWidgetAnimation* AnimaOut; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)

	void OnItemOperatorButtonClick(); // Function DFMGameHud.DFMInteractorButton.OnItemOperatorButtonClick // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorButton_SingleItem
// Size: 0x468 (Inherited: 0x298)
class UDFMInteractorButton_SingleItem : public UUserWidget {
public:

	struct UImage* EnableImage; // 0x298(0x08)
	struct UButton* ItemDetailButton; // 0x2a0(0x08)
	struct UButton* ItemOperatorButton_Object; // 0x2a8(0x08)
	struct UTextBlock* TitleText; // 0x2b0(0x08)
	struct UUserWidget* WBP_SlotCompQuality; // 0x2b8(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x2c0(0x08)
	struct UDFInteractorExposeTipsItem* ExposeTipsItem; // 0x2c8(0x08)
	struct FSoftClassPath ExposeTipsPath; // 0x2d0(0x18)
	struct UDFInteractorWishTipsItem* WishTipsItem; // 0x2e8(0x08)
	struct FSoftClassPath WishTipsPath; // 0x2f0(0x18)
	struct UDFInteractorMissionTipsItem* MissionTipsItem; // 0x308(0x08)
	struct FSoftClassPath MissionTipsPath; // 0x310(0x18)
	struct UImage* Quality; // 0x328(0x08)
	struct UDFMImage* wtMainIcon; // 0x330(0x08)
	struct UImage* wtGridImg; // 0x338(0x08)
	struct UPaperSprite* EnableBG; // 0x340(0x08)
	struct UPaperSprite* DisableBG; // 0x348(0x08)
	struct UUserWidget* ContainerPreview; // 0x350(0x08)
	struct UMaterialInstanceDynamic* GridMID; // 0x358(0x08)
	struct TWeakObjectPtr<struct UInteractExecutor> CurrExecutor; // 0x360(0x08)
	struct FPotentialInteractorInfo CurrInteractableInfo; // 0x368(0x40)
	char pad_3A8[0x38]; // 0x3a8(0x38)
	struct TMap<struct FString, struct UWidgetAnimation*> AnimationMap; // 0x3e0(0x50)
	struct UWidgetAnimation* AnimaIn; // 0x430(0x08)
	struct UWidgetAnimation* AnimaOut; // 0x438(0x08)
	char pad_440[0x10]; // 0x440(0x10)
	struct AInventoryPickup* UsingWeaponDescPickup; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
	struct UDFMInteractorPanel* CachedDFMInteractorPanel; // 0x460(0x08)

	void OnWishTipsLoadComplete(struct FSoftObjectPath& InPath); // Function DFMGameHud.DFMInteractorButton_SingleItem.OnWishTipsLoadComplete // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorRadioInfoItem
// Size: 0x3a0 (Inherited: 0x388)
class UDFMInteractorRadioInfoItem : public UBaseUIView {
public:

	struct UImage* Icon; // 0x388(0x08)
	struct UTextBlock* Desc; // 0x390(0x08)
	struct URichTextBlock* Info; // 0x398(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorRadioInfoView
// Size: 0x600 (Inherited: 0x388)
class UDFMInteractorRadioInfoView : public UBaseUIView {
public:

	struct UImage* MapBaseImg; // 0x388(0x08)
	struct UMaterialInstanceDynamic* MapTextureMID; // 0x390(0x08)
	struct UCanvasPanel* BigMapPanel; // 0x398(0x08)
	struct UScaleBox* BigMapCanvas; // 0x3a0(0x08)
	struct UButton* CloseBtn; // 0x3a8(0x08)
	struct TArray<struct UImage*> ExitIconArray; // 0x3b0(0x10)
	struct TArray<struct FName> ExitIconNameArray; // 0x3c0(0x10)
	struct TArray<struct UDFMInteractorRadioInfoItem*> InfoItemArray; // 0x3d0(0x10)
	struct TArray<struct FName> InfoItemNameArray; // 0x3e0(0x10)
	struct TArray<struct UCanvasPanel*> TeamPanelArray; // 0x3f0(0x10)
	struct TArray<struct FName> TeamPanelNameArray; // 0x400(0x10)
	struct TArray<struct UImage*> TeamIconArray; // 0x410(0x10)
	struct TArray<struct FName> TeamIconNameArray; // 0x420(0x10)
	struct TArray<struct UImage*> TeamArrowArray; // 0x430(0x10)
	struct TArray<struct FName> TeamArrowNameArray; // 0x440(0x10)
	struct TArray<struct UImage*> TeamBigArrowArray; // 0x450(0x10)
	struct TArray<struct FName> TeamBigArrowNameArray; // 0x460(0x10)
	struct UWidgetAnimation* AnimaIn; // 0x470(0x08)
	struct UWidgetAnimation* AnimaOut; // 0x478(0x08)
	struct UWidgetAnimation* AnimaGetInfoIn; // 0x480(0x08)
	struct UWidgetAnimation* AnimaInfoIn; // 0x488(0x08)
	struct UWidgetAnimation* AnimaInfoLoop; // 0x490(0x08)
	struct TMap<struct FString, struct UWidgetAnimation*> AnimationMap; // 0x498(0x50)
	struct UButton* InfoBtn; // 0x4e8(0x08)
	struct UCanvasPanel* InfoPanel; // 0x4f0(0x08)
	char pad_4F8[0x1]; // 0x4f8(0x01)
	bool bHasSetMap; // 0x4f9(0x01)
	char pad_4FA[0x6]; // 0x4fa(0x06)
	struct AInteractor_Radio* CachedRadio; // 0x500(0x08)
	struct FVector2D MapSize; // 0x508(0x08)
	float CurrentScale; // 0x510(0x04)
	struct FVector2D CurrentMapUVPos; // 0x514(0x08)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct UMobilePlayerInput* PlayerInput; // 0x520(0x08)
	char pad_528[0xc]; // 0x528(0x0c)
	float OutTouchDis; // 0x534(0x04)
	bool bTouchOut; // 0x538(0x01)
	char pad_539[0x23]; // 0x539(0x23)
	float FingerLengthValue; // 0x55c(0x04)
	struct FVector WorldCenter; // 0x560(0x0c)
	struct FVector WorldExtent; // 0x56c(0x0c)
	struct UCurveFloat* BigMapZoomCurve; // 0x578(0x08)
	struct FVector UVSwapAndReserve; // 0x580(0x0c)
	char pad_58C[0x18]; // 0x58c(0x18)
	struct FVector2D CurrentScaleAnchor; // 0x5a4(0x08)
	float CurrentNormalizedScale; // 0x5ac(0x04)
	char pad_5B0[0x8]; // 0x5b0(0x08)
	struct TArray<struct APlayerExitBase*> CachedUnExploredExitArray; // 0x5b8(0x10)
	struct TArray<struct APlayerExitBase*> SelectedArray; // 0x5c8(0x10)
	char pad_5D8[0x10]; // 0x5d8(0x10)
	float FadeInKeepTime; // 0x5e8(0x04)
	float GetInfoFadeInKeepTime; // 0x5ec(0x04)
	float InfoFadeInKeepTime; // 0x5f0(0x04)
	float FadeOutKeepTime; // 0x5f4(0x04)
	float InfoLoopKeepTime; // 0x5f8(0x04)
	char pad_5FC[0x4]; // 0x5fc(0x04)

	void OnUseRadio(struct TArray<struct APlayerExitBase*>& InExitArray, struct TArray<struct APlayerExitBase*>& InSelectedArray, struct AActor* InRadio); // Function DFMGameHud.DFMInteractorRadioInfoView.OnUseRadio // (Final|Native|Protected|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorUtil
// Size: 0x30 (Inherited: 0x30)
class UDFMInteractorUtil : public UObject {
public:


	void STATIC_TryInteractKeyDwon(); // Function DFMGameHud.DFMInteractorUtil.TryInteractKeyDwon // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorView
// Size: 0x728 (Inherited: 0x388)
class UDFMInteractorView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct TArray<struct FItemBaseViewInfo> ItemBaseViewsInfo; // 0x390(0x10)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct UDFMInteractorView_Rescue* Interact_Rescue; // 0x3a8(0x08)
	bool bShouldShowControlledByLua; // 0x3b0(0x01)
	char pad_3B1[0x3]; // 0x3b1(0x03)
	float AllowMergeMaxDistSquare; // 0x3b4(0x04)
	/*struct TMap<struct FGameplayTag, struct TSoftClassPtr<UObject>>*/char ItemSoftClassMap[0x50]; // 0x3b8(0x50)
	struct TArray<struct FItemBaseSoftClassInfo> ItemBasesSoftClassInfo; // 0x408(0x10)
	/*struct TMap<struct FGameplayTag, struct TSoftClassPtr<UObject>>*/char SubViewSoftClassMap[0x50]; // 0x418(0x50)
	struct FVector WidgetOffset; // 0x468(0x0c)
	char pad_474[0x4]; // 0x474(0x04)
	struct TArray<float> EdgePadding; // 0x478(0x10)
	struct FVector2D ScreenOffset; // 0x488(0x08)
	struct TMap<struct FSoftObjectPath, uint64_t> LoadHandleMap; // 0x490(0x50)
	struct TMap<int32_t, struct FGameplayTag> AsyncLoadingMap; // 0x4e0(0x50)
	struct TArray<struct UDFMInteractorView_ItemBase*> AllItems; // 0x530(0x10)
	struct TMap<struct FGameplayTag, struct UDFMInteractorView_ItemBase*> ItemsMap; // 0x540(0x50)
	struct UCanvasPanel* RootCanvas; // 0x590(0x08)
	struct UCanvasPanel* Canvas; // 0x598(0x08)
	struct TMap<struct FGameplayTag, struct UDFMInteractorView_SubViewBase*> SubViewMap; // 0x5a0(0x50)
	char pad_5F0[0x8]; // 0x5f0(0x08)
	struct UDFMInteractorView_WhiteDot* WhiteDot0; // 0x5f8(0x08)
	struct UDFMInteractorView_WhiteDot* WhiteDot1; // 0x600(0x08)
	struct UDFMInteractorView_WhiteDot* WhiteDot2; // 0x608(0x08)
	struct TArray<struct UDFMInteractorView_WhiteDot*> WhiteDotWidgets; // 0x610(0x10)
	struct TArray<struct UDFMInteractorView_WhiteDot*> UsingWhiteDotWidgets; // 0x620(0x10)
	struct TMap<struct FInteractableProxy, struct UDFMInteractorView_WhiteDot*> MapInteractableProxy2WhiteDotWidget; // 0x630(0x50)
	struct UTextBlock* WhiteDotDistance_1; // 0x680(0x08)
	struct UTextBlock* WhiteDotDistance_2; // 0x688(0x08)
	struct UTextBlock* WhiteDotDistance_3; // 0x690(0x08)
	struct TArray<struct UTextBlock*> WhiteDotDistanceArray; // 0x698(0x10)
	bool bGMWhiteDotDistance; // 0x6a8(0x01)
	char pad_6A9[0x7]; // 0x6a9(0x07)
	struct TArray<struct FPotentialInteractorInfo> CurrentPotentialInteractors; // 0x6b0(0x10)
	struct UInteractorPanelBase* InteractorPanel; // 0x6c0(0x08)
	struct FGameplayTagContainer LootingTagContainer; // 0x6c8(0x20)
	struct FPotentialInteractorInfo RescueInteractorInfo; // 0x6e8(0x40)

	void UpdateScreenPositionByInteractableProxy(struct AGPPlayerController* Controller, struct UDFMInteractorView_WhiteDot* WhiteDotWidget, struct FInteractableProxy InInteractableProxy, bool bEdgeTracking); // Function DFMGameHud.DFMInteractorView.UpdateScreenPositionByInteractableProxy // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorView_InteractBase
// Size: 0x388 (Inherited: 0x388)
class UDFMInteractorView_InteractBase : public UBaseUIView {
public:


	void OnInteractKeyDown(int32_t Type); // Function DFMGameHud.DFMInteractorView_InteractBase.OnInteractKeyDown // (Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorView_ItemBaseSub
// Size: 0x378 (Inherited: 0x298)
class UDFMInteractorView_ItemBaseSub : public UUserWidget {
public:

	/*struct FMulticastInlineDelegate*/char OnOperatorBtnClick[0x10]; // 0x298(0x10)
	/*struct FMulticastInlineDelegate*/char OnDetailBtnClick[0x10]; // 0x2a8(0x10)
	struct UTextBlock* TitleText; // 0x2b8(0x08)
	struct UImage* ExImage; // 0x2c0(0x08)
	struct UImage* EnableImage; // 0x2c8(0x08)
	struct UImage* Quality; // 0x2d0(0x08)
	/*struct TSoftObjectPtr<UObject>*/char EnableSoftIcon[0x28]; // 0x2d8(0x28)
	/*struct TSoftObjectPtr<UObject>*/char UnableSoftIcon[0x28]; // 0x300(0x28)
	struct FInteractableInfo CurrInteractableInfo; // 0x328(0x30)
	struct AActor* CurrActor; // 0x358(0x08)
	struct UButton* ItemOperatorButton; // 0x360(0x08)
	struct UButton* ItemDetailButton; // 0x368(0x08)
	char pad_370[0x8]; // 0x370(0x08)

	void UpdateInteractableInfo(struct AActor* inActor, struct FInteractableInfo& InInfo, bool ShowBtn); // Function DFMGameHud.DFMInteractorView_ItemBaseSub.UpdateInteractableInfo // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorView_RescueFlag
// Size: 0x2e0 (Inherited: 0x298)
class UDFMInteractorView_RescueFlag : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct AGPCharacterBase* CHARACTER; // 0x2a0(0x08)
	float Distance; // 0x2a8(0x04)
	struct FVector2D Direction; // 0x2ac(0x08)
	bool MeterShowLeftSide; // 0x2b4(0x01)
	bool bOffScreen; // 0x2b5(0x01)
	char pad_2B6[0x2]; // 0x2b6(0x02)
	int32_t PlayerNum; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct UTextBlock* Text_PlayerNum; // 0x2c0(0x08)
	char pad_2C8[0x18]; // 0x2c8(0x18)

	void BP_Tick(float DeltaTime); // Function DFMGameHud.DFMInteractorView_RescueFlag.BP_Tick // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractor_CanvasPanel
// Size: 0x1a8 (Inherited: 0x198)
class UDFMInteractor_CanvasPanel : public UCanvasPanel {
public:

	struct FGameplayTag OperatorTag; // 0x198(0x08)
	char pad_1A0[0x8]; // 0x1a0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMInteractorView_WhiteDot
// Size: 0x358 (Inherited: 0x298)
class UDFMInteractorView_WhiteDot : public UUserWidget {
public:

	struct FInteractableProxy InteractableProxy; // 0x298(0x10)
	struct UDFMInteractorView* Parent; // 0x2a8(0x08)
	struct UCanvasPanel* ArrowRotation; // 0x2b0(0x08)
	bool bUpdateLocationThisFrame; // 0x2b8(0x01)
	enum class EWhiteDotAnimaStatus AnimaStatus; // 0x2b9(0x01)
	char pad_2BA[0x6]; // 0x2ba(0x06)
	struct TMap<struct FString, struct UWidgetAnimation*> AnimationMap; // 0x2c0(0x50)
	float FadeInSpeed; // 0x310(0x04)
	float FadeOutSpeed; // 0x314(0x04)
	struct UWidgetAnimation* AnimSmallToMedium; // 0x318(0x08)
	struct UWidgetAnimation* AnimMediumToSmall; // 0x320(0x08)
	struct UWidgetAnimation* AnimLoop; // 0x328(0x08)
	struct UWidgetAnimation* AnimaLootFailed; // 0x330(0x08)
	struct UWidgetAnimation* AnimaMediumToTiny; // 0x338(0x08)
	char pad_340[0x18]; // 0x340(0x18)

	void RecoveryMedium(); // Function DFMGameHud.DFMInteractorView_WhiteDot.RecoveryMedium // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMLongPressButton
// Size: 0x4e0 (Inherited: 0x4b0)
class UDFMLongPressButton : public UButton {
public:

	/*struct FMulticastInlineDelegate*/char OnButtonMouseMove[0x10]; // 0x4b0(0x10)
	/*struct FMulticastInlineDelegate*/char OnActiveReleased[0x10]; // 0x4c0(0x10)
	char pad_4D0[0x10]; // 0x4d0(0x10)

	void ActiveRelease(); // Function DFMGameHud.DFMLongPressButton.ActiveRelease // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMediaImage
// Size: 0x370 (Inherited: 0x2e0)
class UDFMMediaImage : public UImage {
public:

	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x2e8(0x08)
	struct UMediaSource* MediaSource; // 0x2f0(0x08)
	struct FName AudioEventName; // 0x2f8(0x08)
	struct UDFMUIAudioPlayer* AudioPlayer; // 0x300(0x08)
	char pad_308[0x68]; // 0x308(0x68)

	void PlayMedia(); // Function DFMGameHud.DFMMediaImage.PlayMedia // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMeleeWeaponSelectItemView
// Size: 0x2c8 (Inherited: 0x298)
class UDFMMeleeWeaponSelectItemView : public UUserWidget {
public:

	char WeaponIndex; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct UButton* MeleeItemBtn; // 0x2a0(0x08)
	struct UImage* MeleeItemImg; // 0x2a8(0x08)
	uint64_t WeaponGId; // 0x2b0(0x08)
	char pad_2B8[0x10]; // 0x2b8(0x10)

	void OnClickedEvent(); // Function DFMGameHud.DFMMeleeWeaponSelectItemView.OnClickedEvent // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMidKeyTipsView
// Size: 0x3a0 (Inherited: 0x388)
class UDFMMidKeyTipsView : public UBaseUIView {
public:

	float ShowTime; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct UUserWidget* WBP_ControllerKeyItem_NotifyTeammates; // 0x390(0x08)
	struct FTimerHandle Handle; // 0x398(0x08)

	void EndShow(); // Function DFMGameHud.DFMMidKeyTipsView.EndShow // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileArmdedForceItemView
// Size: 0x680 (Inherited: 0x5a8)
class UDFMMobileArmdedForceItemView : public ULuaUIHudBaseView {
public:

	struct FName TextName; // 0x5a8(0x08)
	bool InvalidateEveryTick; // 0x5b0(0x01)
	char pad_5B1[0x1f]; // 0x5b1(0x1f)
	struct UTextBlock* CDText; // 0x5d0(0x08)
	struct UImage* NumPanel; // 0x5d8(0x08)
	struct UTextBlock* NumText; // 0x5e0(0x08)
	struct UTextBlock* AmmoNumText; // 0x5e8(0x08)
	struct UImage* ProgressImage1; // 0x5f0(0x08)
	struct UImage* ProgressImage2; // 0x5f8(0x08)
	struct UImage* IconImage; // 0x600(0x08)
	struct UImage* NumBackImage; // 0x608(0x08)
	struct UImage* ImgCooldownProcess; // 0x610(0x08)
	struct UProgressBar* CooldownProcess; // 0x618(0x08)
	struct FName ProgressParameterName; // 0x620(0x08)
	int32_t iUsingType; // 0x628(0x04)
	int32_t bCharging; // 0x62c(0x04)
	int32_t bCoding; // 0x630(0x04)
	int32_t iArmType; // 0x634(0x04)
	int32_t bIsItem; // 0x638(0x04)
	int32_t EnumType; // 0x63c(0x04)
	int32_t iAmmoNum; // 0x640(0x04)
	int32_t iSlotNum; // 0x644(0x04)
	int32_t iMaxNum; // 0x648(0x04)
	int32_t iShowNum; // 0x64c(0x04)
	int32_t iPercentNg; // 0x650(0x04)
	char pad_654[0x4]; // 0x654(0x04)
	struct UWidget* KeyBox; // 0x658(0x08)
	struct TArray<enum class EDFMGamePlayMode> InVisibleMode; // 0x660(0x10)
	float timerRate; // 0x670(0x04)
	char pad_674[0xc]; // 0x674(0x0c)

	void SetUsingType(int32_t Type); // Function DFMGameHud.DFMMobileArmdedForceItemView.SetUsingType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileArmdedForceItemViewPC
// Size: 0x678 (Inherited: 0x5a8)
class UDFMMobileArmdedForceItemViewPC : public ULuaUIHudBaseView {
public:

	struct FName TextName; // 0x5a8(0x08)
	bool InvalidateEveryTick; // 0x5b0(0x01)
	char pad_5B1[0x27]; // 0x5b1(0x27)
	struct UTextBlock* CDText; // 0x5d8(0x08)
	struct UImage* NumPanel; // 0x5e0(0x08)
	struct UTextBlock* NumText; // 0x5e8(0x08)
	struct UTextBlock* MaxNumText; // 0x5f0(0x08)
	struct UImage* ProgressImage1; // 0x5f8(0x08)
	struct UImage* ProgressImage2; // 0x600(0x08)
	struct UImage* IconImage; // 0x608(0x08)
	struct UImage* NumBackImage; // 0x610(0x08)
	struct UImage* LineImage; // 0x618(0x08)
	struct FName ProgressParameterName; // 0x620(0x08)
	float ProgressParameterValueA; // 0x628(0x04)
	float ProgressParameterValueB; // 0x62c(0x04)
	struct UWidget* KeyBox; // 0x630(0x08)
	struct TArray<enum class EDFMGamePlayMode> InVisibleMode; // 0x638(0x10)
	int32_t iUsingType; // 0x648(0x04)
	int32_t bCharging; // 0x64c(0x04)
	int32_t bCoding; // 0x650(0x04)
	int32_t iArmType; // 0x654(0x04)
	int32_t bIsItem; // 0x658(0x04)
	int32_t EnumType; // 0x65c(0x04)
	int32_t iAmmoNum; // 0x660(0x04)
	int32_t iSlotNum; // 0x664(0x04)
	int32_t iMaxNum; // 0x668(0x04)
	int32_t iShowNum; // 0x66c(0x04)
	int32_t iPercentNg; // 0x670(0x04)
	char pad_674[0x4]; // 0x674(0x04)

	void SetUsingType(int32_t Type); // Function DFMGameHud.DFMMobileArmdedForceItemViewPC.SetUsingType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileChargeGunCrosshairView
// Size: 0x398 (Inherited: 0x388)
class UDFMMobileChargeGunCrosshairView : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)

	void OnSwitchZoomState(bool bFlag); // Function DFMGameHud.DFMMobileChargeGunCrosshairView.OnSwitchZoomState // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCircleUserWidget
// Size: 0x2a0 (Inherited: 0x298)
class UDFMMobileCircleUserWidget : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)

	bool CheckIfInCircle(struct FGeometry MyGeometry, struct FPointerEvent& InTouchEvent); // Function DFMGameHud.DFMMobileCircleUserWidget.CheckIfInCircle // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomLayoutAttachPanel
// Size: 0x5d0 (Inherited: 0x550)
class UDFMMobileCustomLayoutAttachPanel : public ULuaUIBaseView {
public:

	struct UDFMMobileCustomLayoutDraggableButton* CurAttachDragBtn; // 0x550(0x08)
	struct UButton* MoveUpBtn; // 0x558(0x08)
	struct UButton* MoveDownBtn; // 0x560(0x08)
	struct UButton* MoveLeftBtn; // 0x568(0x08)
	struct UButton* MoveRightBtn; // 0x570(0x08)
	struct UImage* ExtendBoxImg; // 0x578(0x08)
	struct UCanvasPanel* EditCanvasPanel; // 0x580(0x08)
	struct UTextBlock* BtnNameText; // 0x588(0x08)
	/*struct FMulticastInlineDelegate*/char OnLayoutChange[0x10]; // 0x590(0x10)
	bool bLeftFireShow; // 0x5a0(0x01)
	bool bRightFireShow; // 0x5a1(0x01)
	char pad_5A2[0x6]; // 0x5a2(0x06)
	/*struct FMulticastInlineDelegate*/char OnSelectDragBtn[0x10]; // 0x5a8(0x10)
	float ShowEditPanelMaxTime; // 0x5b8(0x04)
	float PressBtnTimeStamp; // 0x5bc(0x04)
	float OldRunAreaSlotY; // 0x5c0(0x04)
	struct FVector2D EditorAbsolutePos; // 0x5c4(0x08)
	char pad_5CC[0x4]; // 0x5cc(0x04)

	void SaveBtnSteerChange(); // Function DFMGameHud.DFMMobileCustomLayoutAttachPanel.SaveBtnSteerChange // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomLayoutBPLibrary
// Size: 0x30 (Inherited: 0x30)
class UDFMMobileCustomLayoutBPLibrary : public UObject {
public:


	void STATIC_ShareCustomLayoutInfo(struct UObject* WorldContextObject, struct FString CustomLayoutName); // Function DFMGameHud.DFMMobileCustomLayoutBPLibrary.ShareCustomLayoutInfo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomLayoutDragBtnAppearance
// Size: 0x2e8 (Inherited: 0x2e0)
class UDFMMobileCustomLayoutDragBtnAppearance : public UImage {
public:

	char pad_2E0[0x8]; // 0x2e0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomLayoutDragBtnExtendPanel
// Size: 0x1a0 (Inherited: 0x198)
class UDFMMobileCustomLayoutDragBtnExtendPanel : public UCanvasPanel {
public:

	char pad_198[0x8]; // 0x198(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomLayoutDraggableButton
// Size: 0x5e8 (Inherited: 0x4c0)
class UDFMMobileCustomLayoutDraggableButton : public UMobileDraggableButton {
public:

	struct TArray<struct UWidget*> WidgetsMouseDown; // 0x4c0(0x10)
	/*struct FMulticastInlineDelegate*/char OnMouseDraggableButtonDown[0x10]; // 0x4d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnMouseDraggableButtonUp[0x10]; // 0x4e0(0x10)
	/*struct FMulticastInlineDelegate*/char OnMouseDraggableButtonMoved[0x10]; // 0x4f0(0x10)
	/*struct FMulticastInlineDelegate*/char OnLayoutDraggableButtonDown[0x10]; // 0x500(0x10)
	/*struct FMulticastInlineDelegate*/char OnLayoutDraggableButtonUp[0x10]; // 0x510(0x10)
	/*struct FMulticastInlineDelegate*/char OnLayoutDraggableButtonMove[0x10]; // 0x520(0x10)
	/*struct FMulticastInlineDelegate*/char OnPositionChange[0x10]; // 0x530(0x10)
	/*struct FMulticastInlineDelegate*/char OnLayoutSteerChange[0x10]; // 0x540(0x10)
	/*struct FMulticastInlineDelegate*/char OnDraggableButtonScaleChange[0x10]; // 0x550(0x10)
	/*struct FMulticastInlineDelegate*/char OnFetchCustomLayoutAppearance[0x10]; // 0x560(0x10)
	bool bIsForbidable; // 0x570(0x01)
	bool bIsForbid; // 0x571(0x01)
	bool bIsSteer; // 0x572(0x01)
	bool bOwnSteer; // 0x573(0x01)
	bool bIsSizeScale; // 0x574(0x01)
	bool bInCustomPanel; // 0x575(0x01)
	bool bAutoLayout; // 0x576(0x01)
	bool bAssemble; // 0x577(0x01)
	bool LimitYMove; // 0x578(0x01)
	bool LimitXMove; // 0x579(0x01)
	bool LimitScale; // 0x57a(0x01)
	bool LimitRenderOpacity; // 0x57b(0x01)
	int32_t AnchorIndex; // 0x57c(0x04)
	float Scale; // 0x580(0x04)
	float LastFrameScale; // 0x584(0x04)
	struct FVector2D StandardSize; // 0x588(0x08)
	struct FText DragBtnName; // 0x590(0x18)
	struct FString TargetLayoutName; // 0x5a8(0x10)
	struct FString Key; // 0x5b8(0x10)
	float SprintAreaSize; // 0x5c8(0x04)
	struct FVector2D CachedPressOffset; // 0x5cc(0x08)
	enum class ESlateVisibility LastVisibility; // 0x5d4(0x01)
	char pad_5D5[0x3]; // 0x5d5(0x03)
	struct TWeakObjectPtr<struct UDFMMobileCustomLayoutAttachPanel> AttachPanel; // 0x5d8(0x08)
	struct FVector2D FrameMoveDelta; // 0x5e0(0x08)

	void SetSprintAreaSize(float RunSize); // Function DFMGameHud.DFMMobileCustomLayoutDraggableButton.SetSprintAreaSize // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomLayoutView
// Size: 0x590 (Inherited: 0x550)
class UDFMMobileCustomLayoutView : public ULuaUIBaseView {
public:

	bool bIsVehicleLayout; // 0x550(0x01)
	char pad_551[0x7]; // 0x551(0x07)
	struct UDFMMobileCustomLayoutDraggableButton* DefaultEditButton; // 0x558(0x08)
	struct UDFMMobileCustomLayoutDraggableButton* CurrentEditBtn; // 0x560(0x08)
	struct UDFMMobileCustomLayoutAttachPanel* AttachPanel; // 0x568(0x08)
	struct UDFMCustomLayoutStackDataCenter* StackMgr; // 0x570(0x08)
	struct TArray<struct UDFMMobileCustomLayoutDraggableButton*> AllDragBtns; // 0x578(0x10)
	enum class EFunctionBtnRotationMode FunctionBtnRotationMode; // 0x588(0x01)
	char pad_589[0x7]; // 0x589(0x07)

	void ShareCustomLayout(struct FString LayoutName); // Function DFMGameHud.DFMMobileCustomLayoutView.ShareCustomLayout // (Final|Native|Protected|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileCustomShapeButton
// Size: 0x4c0 (Inherited: 0x4b0)
class UDFMMobileCustomShapeButton : public UButton {
public:

	struct UTexture2D* AdvancedHitTexture; // 0x4b0(0x08)
	int32_t AdvancedHitAlpha; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)

	void SetAdvancedHitTexture(struct UTexture2D* InTexture); // Function DFMGameHud.DFMMobileCustomShapeButton.SetAdvancedHitTexture // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileEBGView
// Size: 0x3e8 (Inherited: 0x3b8)
class UDFMMobileEBGView : public UMobileGamePadView {
public:

	struct UTextBlock* Text_TeamMateInfo; // 0x3b8(0x08)
	struct UTextBlock* Text_CountDown; // 0x3c0(0x08)
	struct UTextBlock* Text_PlayerStart; // 0x3c8(0x08)
	struct UImage* Image_PlayerStart; // 0x3d0(0x08)
	char pad_3D8[0x10]; // 0x3d8(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMWeaponFireIconImage
// Size: 0x350 (Inherited: 0x2e0)
class UDFMWeaponFireIconImage : public UImage {
public:

	struct TArray<struct FFireIconInfo> FireIconConfigList; // 0x2e0(0x10)
	struct TMap<struct FName, struct UObject*> FireIconByItemId; // 0x2f0(0x50)
	char pad_340[0x10]; // 0x340(0x10)

	void SetWeapon(struct AWeaponBase* Weapon, struct AGPCharacterBase* WeaponOwner); // Function DFMGameHud.DFMWeaponFireIconImage.SetWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileForbidMoveCtrlWidget
// Size: 0x298 (Inherited: 0x298)
class UDFMMobileForbidMoveCtrlWidget : public UUserWidget {
public:


	void OnWidgetVisibilityChange(bool IsVisible); // Function DFMGameHud.DFMMobileForbidMoveCtrlWidget.OnWidgetVisibilityChange // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMAiDifficultyView
// Size: 0x990 (Inherited: 0x3b8)
class UDFMMobileGMAiDifficultyView : public UMobileGamePadView {
public:

	int32_t GlobalDifficulty; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct TArray<struct FName> AiNames; // 0x3c0(0x10)
	struct TArray<int32_t> AllDifficultyLevel; // 0x3d0(0x10)
	struct FAiDifficultyDebugData CurrAiDebugInfo; // 0x3e0(0x5b0)

	void RefreshAllInfo(); // Function DFMGameHud.DFMMobileGMAiDifficultyView.RefreshAllInfo // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMAttributeItem
// Size: 0x398 (Inherited: 0x388)
class UDFMMobileGMAttributeItem : public UBaseUIView {
public:

	struct URichTextBlock* NameText; // 0x388(0x08)
	struct URichTextBlock* ValueText; // 0x390(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMAttributeView
// Size: 0x418 (Inherited: 0x3b8)
class UDFMMobileGMAttributeView : public UMobileGamePadView {
public:

	struct UScrollBox* ScrollBox1; // 0x3b8(0x08)
	struct TMap<struct FString, struct UDFMMobileGMAttributeItem*> RichTextMap; // 0x3c0(0x50)
	char pad_410[0x8]; // 0x410(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMCharacterLogView
// Size: 0x3f8 (Inherited: 0x3b8)
class UDFMMobileGMCharacterLogView : public UMobileGamePadView {
public:

	char pad_3B8[0x8]; // 0x3b8(0x08)
	struct URichTextBlock* RichTextBlock_196; // 0x3c0(0x08)
	struct UCanvasPanel* CanvasPanel_Father; // 0x3c8(0x08)
	struct UCanvasPanel* CanvasPanel_DouDou; // 0x3d0(0x08)
	struct UTextBlock* Text_StandardPixel; // 0x3d8(0x08)
	int32_t DebugFontSize; // 0x3e0(0x04)
	char pad_3E4[0x4]; // 0x3e4(0x04)
	struct TArray<struct FGMMobileInputData> CurrentGMInputData; // 0x3e8(0x10)

	void UpdateDouDouInfo(struct FVector2D& TouchPoint, struct FVector2D& StandardPoint); // Function DFMGameHud.DFMMobileGMCharacterLogView.UpdateDouDouInfo // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMRotationConsoleView
// Size: 0x3b8 (Inherited: 0x3b8)
class UDFMMobileGMRotationConsoleView : public UMobileGamePadView {
public:


	struct FText ShowGyroDebugMsg(); // Function DFMGameHud.DFMMobileGMRotationConsoleView.ShowGyroDebugMsg // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMTeamInfoView
// Size: 0x3a8 (Inherited: 0x388)
class UDFMMobileGMTeamInfoView : public UBaseUIView {
public:

	struct UButton* CloseTeamDetailBtn; // 0x388(0x08)
	struct UScrollBox* TeamInfoScrollBox; // 0x390(0x08)
	struct UTextBlock* AiInfoText; // 0x398(0x08)
	bool bIsInited; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)

	void OnCloseTeamDetailBtnClicked(); // Function DFMGameHud.DFMMobileGMTeamInfoView.OnCloseTeamDetailBtnClicked // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileGMView
// Size: 0x408 (Inherited: 0x3b8)
class UDFMMobileGMView : public UMobileGamePadView {
public:

	char pad_3B8[0x28]; // 0x3b8(0x28)
	float TriggerAreaWidth; // 0x3e0(0x04)
	float TriggerAreaHeight; // 0x3e4(0x04)
	float TriggerCheckInterval; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	bool bShouldShowGMPanel; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct UComboBoxString* GiveWeaponCmd; // 0x3f8(0x08)
	struct UComboBoxString* GiveWeaponThrowableCmd; // 0x400(0x08)

	void ShowGMPanel(); // Function DFMGameHud.DFMMobileGMView.ShowGMPanel // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileHeavyMachineGunView
// Size: 0x3d8 (Inherited: 0x3b8)
class UDFMMobileHeavyMachineGunView : public UMobileGamePadView {
public:

	struct UButton* Button_Exit; // 0x3b8(0x08)
	struct UProgressBar* OverHeatProcessBar; // 0x3c0(0x08)
	struct UCanvasPanel* VehicleGunPanel; // 0x3c8(0x08)
	struct UCanvasPanel* OnLandGunPanel; // 0x3d0(0x08)

	void OnButtonExitClick(); // Function DFMGameHud.DFMMobileHeavyMachineGunView.OnButtonExitClick // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HelmetFaceMaskViewModel
// Size: 0x8c0 (Inherited: 0x3b8)
class UHelmetFaceMaskViewModel : public UMobileGamePadView {
public:

	struct UMaterialInstanceDynamic* HelmetMaskMatDy; // 0x3b8(0x08)
	char pad_3C0[0x18]; // 0x3c0(0x18)
	struct AGPCharacterBase* GPCharacter; // 0x3d8(0x08)
	struct TWeakObjectPtr<struct UCharacterEquipComponent> EquitComp; // 0x3e0(0x08)
	struct TWeakObjectPtr<struct UHelmetComponent> HelmetComp; // 0x3e8(0x08)
	struct TMap<struct FSoftObjectPath, struct UImage*> BorderImage; // 0x3f0(0x50)
	struct TMap<struct FSoftObjectPath, struct UImage*> SurfaceImage; // 0x440(0x50)
	struct TArray<struct UTexture2D*> DamageTextures; // 0x490(0x10)
	struct TMap<struct FSoftObjectPath, struct UTexture2D*> LoadedTextures; // 0x4a0(0x50)
	struct TMap<uint64_t, struct FLoadedCache> LoadedAssets; // 0x4f0(0x50)
	struct FSlateBrush Brush; // 0x540(0x90)
	struct UCanvasPanel* BgPanel; // 0x5d0(0x08)
	struct FHelmetFunctionRow HelmetFunctionRow; // 0x5d8(0x280)
	struct UGPAudioEventAsset* HelmetBreakAudioEventAsset; // 0x858(0x08)
	char pad_860[0x50]; // 0x860(0x50)
	struct UCurveFloat* DistanceCurve; // 0x8b0(0x08)
	char pad_8B8[0x8]; // 0x8b8(0x08)

	void UpdateHelmetMaskView_PC(uint64_t ItemID); // Function DFMGameHud.HelmetFaceMaskViewModel.UpdateHelmetMaskView_PC // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileItemPC
// Size: 0x398 (Inherited: 0x388)
class UDFMMobileItemPC : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)

	void OuterTick(); // Function DFMGameHud.DFMMobileItemPC.OuterTick // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileJoystickUserWidget
// Size: 0x5a0 (Inherited: 0x3b8)
class UDFMMobileJoystickUserWidget : public UMobileGamePadView {
public:

	char pad_3B8[0x8]; // 0x3b8(0x08)
	/*struct FMulticastInlineDelegate*/char OnJoystickTouchClicked[0x10]; // 0x3c0(0x10)
	/*struct FMulticastInlineDelegate*/char OnJoystickTouchPressed[0x10]; // 0x3d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnJoystickTouchReleased[0x10]; // 0x3e0(0x10)
	/*struct FMulticastInlineDelegate*/char OnJoystickTouchDoubleClicked[0x10]; // 0x3f0(0x10)
	/*struct FMulticastInlineDelegate*/char OnJoystickTouchMaxDraged[0x10]; // 0x400(0x10)
	/*struct FMulticastInlineDelegate*/char OnJoystickTouchNoMaxDraged[0x10]; // 0x410(0x10)
	struct UImage* JoystickImage; // 0x420(0x08)
	struct UImage* JoystickImageBG; // 0x428(0x08)
	struct UImage* JoystickImagePress; // 0x430(0x08)
	struct UImage* JoystickImageBGPress; // 0x438(0x08)
	struct UImage* JoystickImageBGRelease; // 0x440(0x08)
	float PressIntervalTime; // 0x448(0x04)
	float DoubleClickedIntervalTime; // 0x44c(0x04)
	bool bContinuePress; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	float TriggerRadiusMultiple; // 0x454(0x04)
	struct FSlateBrush JoystickBrush; // 0x458(0x90)
	struct FSlateBrush JoystickPressBrush; // 0x4e8(0x90)
	bool bMove; // 0x578(0x01)
	bool bPlayAnim; // 0x579(0x01)
	bool bUse; // 0x57a(0x01)
	char pad_57B[0x5]; // 0x57b(0x05)
	struct AGPPlayerController* CachePC; // 0x580(0x08)
	struct UMobilePlayerInput* CacheNZPCInput; // 0x588(0x08)
	char pad_590[0x10]; // 0x590(0x10)

	void OnTouchReleasedEvent(); // Function DFMGameHud.DFMMobileJoystickUserWidget.OnTouchReleasedEvent // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileMedkitButtonView
// Size: 0x490 (Inherited: 0x3b8)
class UDFMMobileMedkitButtonView : public UMobileGamePadView {
public:

	struct UWidgetSwitcher* WidgetSwitcher_1; // 0x3b8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_2; // 0x3c0(0x08)
	struct UTextBlock* CurNumText; // 0x3c8(0x08)
	struct UTextBlock* CurNameText; // 0x3d0(0x08)
	struct UUserWidget* H_Medkit_1002; // 0x3d8(0x08)
	struct UUserWidget* H_Medkit_1003; // 0x3e0(0x08)
	struct UUserWidget* H_Medkit_1004; // 0x3e8(0x08)
	struct UUserWidget* H_Medkit_1005; // 0x3f0(0x08)
	struct UUserWidget* H_Medkit_1006; // 0x3f8(0x08)
	struct UUserWidget* H_Medkit_1007; // 0x400(0x08)
	struct UCanvasPanel* ContainerPanel; // 0x408(0x08)
	struct TArray<struct UUserWidget*> Widgets; // 0x410(0x10)
	char pad_420[0x10]; // 0x420(0x10)
	struct TArray<struct UButtonClickProxy*> ClickProxys; // 0x430(0x10)
	struct TArray<struct UButton*> BtnUseItemList; // 0x440(0x10)
	struct TArray<struct UTextBlock*> NumUseItemList; // 0x450(0x10)
	struct TArray<struct UImage*> ImgUseItemList; // 0x460(0x10)
	struct TArray<struct AGPInventoryBase*> InventoryList; // 0x470(0x10)
	struct UInventoryItemBase* CurUseInventory; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)

	void RefreshView(); // Function DFMGameHud.DFMMobileMedkitButtonView.RefreshView // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileOpenSightButtonView
// Size: 0x3a0 (Inherited: 0x388)
class UDFMMobileOpenSightButtonView : public UBaseUIView {
public:

	struct UCheckbox* OpenSightBtn; // 0x388(0x08)
	struct UWidgetSwitcher* SightSwitch; // 0x390(0x08)
	char pad_398[0x8]; // 0x398(0x08)

	void OnSightCheck(bool bIsChecked); // Function DFMGameHud.DFMMobileOpenSightButtonView.OnSightCheck // (Final|Native|Private) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileQuitButtonView
// Size: 0x390 (Inherited: 0x388)
class UDFMMobileQuitButtonView : public UBaseUIView {
public:

	struct UButton* BtnQuit; // 0x388(0x08)

	void OnClickQuitGame(); // Function DFMGameHud.DFMMobileQuitButtonView.OnClickQuitGame // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileRotationButtonView
// Size: 0x4f0 (Inherited: 0x3b8)
class UDFMMobileRotationButtonView : public UMobileGamePadView {
public:

	char pad_3B8[0x8]; // 0x3b8(0x08)
	struct FLinearColor LowEnergyColor; // 0x3c0(0x10)
	int32_t LowAmmoAlertNum; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct UCanvasPanel* BagCanvas; // 0x3d8(0x08)
	struct UWidget* BagIcon_1; // 0x3e0(0x08)
	struct UImage* BagIcon_Selected; // 0x3e8(0x08)
	struct UWidget* BagLvl_2; // 0x3f0(0x08)
	struct UWidget* BagLvl_3; // 0x3f8(0x08)
	struct UWidget* BagLvl_4; // 0x400(0x08)
	struct UButton* BtnReload; // 0x408(0x08)
	struct UButton* BtnBag; // 0x410(0x08)
	struct UButton* BtnFire; // 0x418(0x08)
	struct UButton* HighLevelFireBtn; // 0x420(0x08)
	struct USlider* Slider8X; // 0x428(0x08)
	struct UTextBlock* TextScopeHigh; // 0x430(0x08)
	struct UTextBlock* TextScopeLow; // 0x438(0x08)
	struct UCanvasPanel* CanvasPanel_ReloadWindow; // 0x440(0x08)
	struct UMobileDraggableButton* DragBtnReload; // 0x448(0x08)
	struct UMobileDraggableButton* DragBtnBag; // 0x450(0x08)
	struct UMobileDraggableButton* DragBtnFire2; // 0x458(0x08)
	struct UMobileDraggableButton* DragBtnSlider8X; // 0x460(0x08)
	struct UProgressBar* BagProgressBar; // 0x468(0x08)
	struct UImage* BagProgressBarEx; // 0x470(0x08)
	struct UWidgetSwitcher* WeaponSwitcher; // 0x478(0x08)
	struct UCanvasPanel* CanvasLeftBottom; // 0x480(0x08)
	struct UCanvasPanel* CanvasAndroidSimulatorDisable; // 0x488(0x08)
	struct UCanvasPanel* CanvasBottom; // 0x490(0x08)
	struct UCanvasPanel* CanvasRight; // 0x498(0x08)
	struct UCanvasPanel* CanvasRightBottom; // 0x4a0(0x08)
	struct UImage* FireButtonBullet0; // 0x4a8(0x08)
	struct UWidgetSwitcher* ReloadSwitcher; // 0x4b0(0x08)
	struct UWidgetSwitcher* BagSwitcher; // 0x4b8(0x08)
	struct UProgressBar* EnergyPro; // 0x4c0(0x08)
	struct UImage* EnergyPro_Selected; // 0x4c8(0x08)
	char pad_4D0[0x10]; // 0x4d0(0x10)
	struct AWeaponBase* CurWeapon; // 0x4e0(0x08)
	char pad_4E8[0x8]; // 0x4e8(0x08)

	void OnTopLeftFireDown(); // Function DFMGameHud.DFMMobileRotationButtonView.OnTopLeftFireDown // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileRunAreaDraggableButton
// Size: 0x520 (Inherited: 0x4c0)
class UDFMMobileRunAreaDraggableButton : public UMobileDraggableButton {
public:

	/*struct FMulticastInlineDelegate*/char OnRunAreaSizeChange[0x10]; // 0x4c0(0x10)
	struct UImage* Arrow; // 0x4d0(0x08)
	struct UImage* ArrowSelected; // 0x4d8(0x08)
	struct UCanvasPanel* MoveLineImage; // 0x4e0(0x08)
	struct TArray<struct UWidget*> WidgetsMouseDown; // 0x4e8(0x10)
	struct TArray<struct UWidget*> WidgetsMouseUp; // 0x4f8(0x10)
	struct UDFMMobileCustomLayoutDraggableButton* JoystickMoveButton; // 0x508(0x08)
	char pad_510[0x10]; // 0x510(0x10)

	void UpdatePosition(float OldScale, float NewScale); // Function DFMGameHud.DFMMobileRunAreaDraggableButton.UpdatePosition // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileSkillItemPC
// Size: 0x508 (Inherited: 0x388)
class UDFMMobileSkillItemPC : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	int32_t currentSkilEntityID; // 0x390(0x04)
	int32_t currentSkil; // 0x394(0x04)
	int32_t currentSkilID; // 0x398(0x04)
	char pad_39C[0x4]; // 0x39c(0x04)
	struct FSkillUIInfo LastUIInfo; // 0x3a0(0x78)
	float ProgressParameterValueA; // 0x418(0x04)
	float ProgressParameterValueB; // 0x41c(0x04)
	struct FName ProgressParameterName; // 0x420(0x08)
	struct FText CountText; // 0x428(0x18)
	enum class ESkillUISlot UISlot; // 0x440(0x01)
	bool InvalidateEveryTick; // 0x441(0x01)
	char pad_442[0x6]; // 0x442(0x06)
	struct UImage* DisableIconImage; // 0x448(0x08)
	struct UImage* AbilityIconImage; // 0x450(0x08)
	struct UImage* CanUseImage; // 0x458(0x08)
	struct UTextBlock* CooldownText; // 0x460(0x08)
	struct UImage* CooldownProcess; // 0x468(0x08)
	struct UTextBlock* TipsText; // 0x470(0x08)
	struct UTextBlock* ShortNameText; // 0x478(0x08)
	struct UTextBlock* WeaponSlotNumText; // 0x480(0x08)
	struct UTextBlock* WeaponMaxSlotNumText; // 0x488(0x08)
	struct UImage* WeaponImageSlotNumText; // 0x490(0x08)
	struct UImage* BackImage; // 0x498(0x08)
	struct UImage* LineImage; // 0x4a0(0x08)
	struct UWidget* KeyBox; // 0x4a8(0x08)
	struct UUserWidget* WBP_ControllerButtonNotAvailable; // 0x4b0(0x08)
	struct UUserWidget* WBP_ControllerButtonSkillCar; // 0x4b8(0x08)
	char pad_4C0[0x10]; // 0x4c0(0x10)
	int32_t iAmmoNum; // 0x4d0(0x04)
	int32_t iSlotNum; // 0x4d4(0x04)
	int32_t iMaxNum; // 0x4d8(0x04)
	int32_t iShowNum; // 0x4dc(0x04)
	int32_t iPercentNg; // 0x4e0(0x04)
	int32_t iUsingType; // 0x4e4(0x04)
	int32_t bCharging; // 0x4e8(0x04)
	int32_t bCoding; // 0x4ec(0x04)
	int32_t iArmType; // 0x4f0(0x04)
	int32_t bIsItem; // 0x4f4(0x04)
	int32_t EnumType; // 0x4f8(0x04)
	int32_t bUIVisible; // 0x4fc(0x04)
	int32_t bOb; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)

	void SetUsingType(int32_t Type); // Function DFMGameHud.DFMMobileSkillItemPC.SetUsingType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileSkillItemWatch
// Size: 0x4e8 (Inherited: 0x388)
class UDFMMobileSkillItemWatch : public UBaseUIView {
public:

	int32_t currentSkil; // 0x388(0x04)
	int32_t currentSkilEntityID; // 0x38c(0x04)
	struct FSkillUIInfo LastUIInfo; // 0x390(0x78)
	int32_t bUIVisible; // 0x408(0x04)
	struct FName ProgressParameterName; // 0x40c(0x08)
	struct FName UseCDProgressParameterName; // 0x414(0x08)
	struct FVector2D UseCDProgressParameterValue; // 0x41c(0x08)
	bool InvalidateEveryTick; // 0x424(0x01)
	bool LastActivated; // 0x425(0x01)
	char pad_426[0x2]; // 0x426(0x02)
	struct UImage* AbilityIconImage; // 0x428(0x08)
	struct UImage* CanUseImage; // 0x430(0x08)
	struct UTextBlock* CooldownText; // 0x438(0x08)
	struct UDFRadialImage* CooldownProcess; // 0x440(0x08)
	struct UTextBlock* TipsText; // 0x448(0x08)
	struct UTextBlock* ShortNameText; // 0x450(0x08)
	struct UTextBlock* WeaponSlotNumText; // 0x458(0x08)
	struct UTextBlock* WeaponMaxSlotNumText; // 0x460(0x08)
	struct UImage* WeaponImageSlotNumText; // 0x468(0x08)
	struct UImage* BackImage; // 0x470(0x08)
	struct UImage* UseCDCooldownProcess; // 0x478(0x08)
	struct UProgressBar* CooldownProcessBar; // 0x480(0x08)
	enum class ESkillUISlot UISlot; // 0x488(0x01)
	char pad_489[0x3]; // 0x489(0x03)
	int32_t iUsingType; // 0x48c(0x04)
	int32_t bCharging; // 0x490(0x04)
	int32_t bCoding; // 0x494(0x04)
	int32_t iArmType; // 0x498(0x04)
	int32_t bIsItem; // 0x49c(0x04)
	int32_t iNumType; // 0x4a0(0x04)
	enum class ESkillNumType EnumType; // 0x4a4(0x01)
	char pad_4A5[0x3]; // 0x4a5(0x03)
	int32_t iAmmoNum; // 0x4a8(0x04)
	int32_t iSlotNum; // 0x4ac(0x04)
	int32_t iMaxNum; // 0x4b0(0x04)
	int32_t iShowNum; // 0x4b4(0x04)
	int32_t iPercentNg; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct UUserWidget* WBP_ControllerButtonNotAvailable; // 0x4c0(0x08)
	struct UUserWidget* WBP_ControllerButtonSkillCar; // 0x4c8(0x08)
	char pad_4D0[0x8]; // 0x4d0(0x08)
	float timerRate; // 0x4d8(0x04)
	char pad_4DC[0xc]; // 0x4dc(0x0c)

	void SetUsingType(int32_t Type); // Function DFMGameHud.DFMMobileSkillItemWatch.SetUsingType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.SonicInfoWidget
// Size: 0x298 (Inherited: 0x298)
class USonicInfoWidget : public UUserWidget {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileSprintAreaDragButton
// Size: 0x518 (Inherited: 0x4c0)
class UDFMMobileSprintAreaDragButton : public UMobileDraggableButton {
public:

	struct UCanvasPanel* MoveLineImage; // 0x4c0(0x08)
	/*struct FMulticastInlineDelegate*/char OnSprintAreaSizeChange[0x10]; // 0x4c8(0x10)
	struct TArray<struct UWidget*> WidgetsMouseDown; // 0x4d8(0x10)
	struct TArray<struct UWidget*> WidgetsMouseUp; // 0x4e8(0x10)
	struct UDFMMobileCustomLayoutDraggableButton* JoystickMoveButton; // 0x4f8(0x08)
	struct UDFMMobileRunAreaDraggableButton* JoystickMoveRunAreaButton; // 0x500(0x08)
	char pad_508[0x10]; // 0x508(0x10)

	void UpdatePosition(float OldScale, float NewScale); // Function DFMGameHud.DFMMobileSprintAreaDragButton.UpdatePosition // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileStaminaView
// Size: 0x310 (Inherited: 0x298)
class UDFMMobileStaminaView : public UUserWidget {
public:

	struct UWidgetSwitcher* NormalLowStaminaSwitcher; // 0x298(0x08)
	struct UImage* WhiteImage; // 0x2a0(0x08)
	struct UImage* GreenImage; // 0x2a8(0x08)
	struct UImage* YellowImage; // 0x2b0(0x08)
	struct UImage* RedImage; // 0x2b8(0x08)
	struct FName ProgressParameterName; // 0x2c0(0x08)
	float FInterpSpeed; // 0x2c8(0x04)
	bool SelfTickLogic; // 0x2cc(0x01)
	char pad_2CD[0x3]; // 0x2cd(0x03)
	struct UGPStaminaDataComponent* CurrentStaminaDataComponent; // 0x2d0(0x08)
	int32_t WhiteDelayFrame; // 0x2d8(0x04)
	char pad_2DC[0x34]; // 0x2dc(0x34)

	void TickLogic(float InDeltaTime); // Function DFMGameHud.DFMMobileStaminaView.TickLogic // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileSubtitleView
// Size: 0x390 (Inherited: 0x388)
class UDFMMobileSubtitleView : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)

	void ShowSubtitle(struct FText& SpeakerName, struct FText& SubtitleText); // Function DFMGameHud.DFMMobileSubtitleView.ShowSubtitle // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileSupportCrosshairView
// Size: 0x3a0 (Inherited: 0x388)
class UDFMMobileSupportCrosshairView : public UBaseUIView {
public:

	struct UImage* ImagePercent; // 0x388(0x08)
	float AnimTimeTemp; // 0x390(0x04)
	float animTime; // 0x394(0x04)
	bool bVisible; // 0x398(0x01)
	char pad_399[0x7]; // 0x399(0x07)

	void OnSupportSelfCureVibileSignature(bool Visible, float animTime); // Function DFMGameHud.DFMMobileSupportCrosshairView.OnSupportSelfCureVibileSignature // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileSwitchPotView
// Size: 0x3b8 (Inherited: 0x3b8)
class UDFMMobileSwitchPotView : public UMobileGamePadView {
public:


	void SwitchPot(); // Function DFMGameHud.DFMMobileSwitchPotView.SwitchPot // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileTalentSensitiveView
// Size: 0x448 (Inherited: 0x3b8)
class UDFMMobileTalentSensitiveView : public UMobileGamePadView {
public:

	struct UCanvasPanel* RootCanvas; // 0x3b8(0x08)
	struct UDFMInteractorView_RescueFlag* Enemy_1; // 0x3c0(0x08)
	struct UDFMInteractorView_RescueFlag* Enemy_2; // 0x3c8(0x08)
	struct UDFMInteractorView_RescueFlag* Enemy_3; // 0x3d0(0x08)
	char pad_3D8[0x4c]; // 0x3d8(0x4c)
	struct FVector2D TargetOffset; // 0x424(0x08)
	struct FVector DistanceOffset; // 0x42c(0x0c)
	struct TArray<struct UDFMInteractorView_RescueFlag*> AllEnemyFlag; // 0x438(0x10)

	void OnEnterSensitiveAlert(); // Function DFMGameHud.DFMMobileTalentSensitiveView.OnEnterSensitiveAlert // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileTalentSensitiveNerve
// Size: 0x2b0 (Inherited: 0x298)
class UDFMMobileTalentSensitiveNerve : public UUserWidget {
public:

	struct UImage* Image_84; // 0x298(0x08)
	struct UTextBlock* TextBlock_122; // 0x2a0(0x08)
	struct UTextBlock* TextBlock; // 0x2a8(0x08)

	void SetState(int32_t State); // Function DFMGameHud.DFMMobileTalentSensitiveNerve.SetState // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileTalentSensitiveTarget
// Size: 0x2a0 (Inherited: 0x298)
class UDFMMobileTalentSensitiveTarget : public UUserWidget {
public:

	struct UTextBlock* TextBlock_122; // 0x298(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileVehicleChangeSeatButton
// Size: 0x350 (Inherited: 0x298)
class UDFMMobileVehicleChangeSeatButton : public UUserWidget {
public:

	/*struct TSoftObjectPtr<UObject>*/char DriverSeatImage[0x28]; // 0x298(0x28)
	/*struct TSoftObjectPtr<UObject>*/char WeaponSeatImage[0x28]; // 0x2c0(0x28)
	/*struct TSoftObjectPtr<UObject>*/char CommonSeatImage[0x28]; // 0x2e8(0x28)
	struct UButton* SelectedButton; // 0x310(0x08)
	struct AGPCharacter* OwnerCharacter; // 0x318(0x08)
	struct ADFMVehicleBase* OwnerVehicle; // 0x320(0x08)
	struct TArray<struct UDFMMobileVehicleSeatButton*> SeatButtonArray; // 0x328(0x10)
	struct TArray<struct UWidget*> SeatBoxArray; // 0x338(0x10)
	char pad_348[0x8]; // 0x348(0x08)

	void UnInit(); // Function DFMGameHud.DFMMobileVehicleChangeSeatButton.UnInit // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileVehicleSeatButton
// Size: 0x2c0 (Inherited: 0x298)
class UDFMMobileVehicleSeatButton : public UUserWidget {
public:

	struct UButton* SeatBtn; // 0x298(0x08)
	struct UImage* IconImage; // 0x2a0(0x08)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	struct AGPCharacter* OwnerCharacter; // 0x2b0(0x08)
	struct UDFMMobileVehicleChangeSeatButton* ParentWidget; // 0x2b8(0x08)

	void UnInit(); // Function DFMGameHud.DFMMobileVehicleSeatButton.UnInit // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileVehicleSwitchWeaponButton
// Size: 0x318 (Inherited: 0x298)
class UDFMMobileVehicleSwitchWeaponButton : public UUserWidget {
public:

	struct TArray<struct FVehicleWeaponColorInfo> OverHeatColorInfos; // 0x298(0x10)
	struct UButton* SwitchWeaponButton; // 0x2a8(0x08)
	struct UWidget* WeaponInfoWidget; // 0x2b0(0x08)
	struct UDFMImage* WeaponTypeIcon; // 0x2b8(0x08)
	struct UDFMImage* WeaponIcon; // 0x2c0(0x08)
	struct UUserWidget* AmmoInfoWidget; // 0x2c8(0x08)
	struct UTextBlock* AmmoNumText; // 0x2d0(0x08)
	struct UProgressBar* OverHeatProgressBar; // 0x2d8(0x08)
	struct UDFRadialImage* AmmoProgressBar; // 0x2e0(0x08)
	struct FDFMVehicleSwitchWeaponButtonInitParamter InitParamter; // 0x2e8(0x20)
	char pad_308[0x10]; // 0x308(0x10)

	void OnTickAmmoInfo(); // Function DFMGameHud.DFMMobileVehicleSwitchWeaponButton.OnTickAmmoInfo // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileWeaponExpandableButton
// Size: 0x408 (Inherited: 0x3b8)
class UDFMMobileWeaponExpandableButton : public UMobileGamePadView {
public:

	char pad_3B8[0x8]; // 0x3b8(0x08)
	struct UButton* Button_1; // 0x3c0(0x08)
	enum class EExpandableButtonType ExpandableButtonType; // 0x3c8(0x01)
	char pad_3C9[0x3]; // 0x3c9(0x03)
	int32_t GestureVerticalBegin; // 0x3cc(0x04)
	int32_t GestureDownPositionVertical; // 0x3d0(0x04)
	int32_t GestureVerticalAiming; // 0x3d4(0x04)
	char pad_3D8[0x30]; // 0x3d8(0x30)

	void SetCurrentSelectedItemId(uint64_t ItemID); // Function DFMGameHud.DFMMobileWeaponExpandableButton.SetCurrentSelectedItemId // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileWeaponHUDView
// Size: 0x590 (Inherited: 0x3b8)
class UDFMMobileWeaponHUDView : public UMobileGamePadView {
public:

	struct FWeaponBarProxy FirstWeaponBar; // 0x3b8(0x48)
	struct FWeaponBarProxy SecondWeaponBar; // 0x400(0x48)
	struct FWeaponBarProxy MeleeWeaponBar; // 0x448(0x48)
	struct FWeaponBarProxy PistolWeaponBar; // 0x490(0x48)
	struct UWeaponHudController* WeaponHudController; // 0x4d8(0x08)
	enum class EAnimPlayConfig AnimPlayConfig; // 0x4e0(0x01)
	char pad_4E1[0x7]; // 0x4e1(0x07)
	struct TMap<struct FSoftObjectPath, struct UPaperSprite*> LoadedSprites; // 0x4e8(0x50)
	struct UButton* FireModeBtn_New; // 0x538(0x08)
	struct UTextBlock* FireModeText_New; // 0x540(0x08)
	bool bAllowRefreshModeInfo; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct UButton* BulletQualityBtn; // 0x550(0x08)
	struct UDFImage* AmmoQualityBg; // 0x558(0x08)
	struct UDFTextBlock* AmmoNameText; // 0x560(0x08)
	struct TArray<struct FLinearColor> AmmoLevel; // 0x568(0x10)
	char pad_578[0x18]; // 0x578(0x18)

	void UpdateCandidateWeaponList(); // Function DFMGameHud.DFMMobileWeaponHUDView.UpdateCandidateWeaponList // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileWeaponSwitchItemView
// Size: 0x3f0 (Inherited: 0x3b8)
class UDFMMobileWeaponSwitchItemView : public UMobileGamePadView {
public:

	char pad_3B8[0x8]; // 0x3b8(0x08)
	struct AWeaponBase* CachedWeapon; // 0x3c0(0x08)
	struct UImage* ItemPic; // 0x3c8(0x08)
	struct UButton* ClickBtn; // 0x3d0(0x08)
	struct UTextBlock* AmmoCount; // 0x3d8(0x08)
	struct UTextBlock* CarriedAmmoCount; // 0x3e0(0x08)
	struct AGPCharacter* GPCharacter; // 0x3e8(0x08)

	void K2_SwitchWeaponCanSwitchFlag(bool bCanSwitch); // Function DFMGameHud.DFMMobileWeaponSwitchItemView.K2_SwitchWeaponCanSwitchFlag // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.WeaponSwitchViewModel
// Size: 0x210 (Inherited: 0x30)
class UWeaponSwitchViewModel : public UObject {
public:

	struct AWeaponBase* CurActiveWeapon; // 0x30(0x08)
	struct AWeaponBase* FirstGun; // 0x38(0x08)
	struct AWeaponBase* FirstGunCache; // 0x40(0x08)
	struct AWeaponBase* SecondGun; // 0x48(0x08)
	struct AWeaponBase* CurAbilityItem; // 0x50(0x08)
	struct AWeaponBase* CurMeleeWeapon; // 0x58(0x08)
	struct AWeaponBase* CurThrowableWeapon; // 0x60(0x08)
	struct AWeaponBase* CurPVEWeapon; // 0x68(0x08)
	struct AWeaponBase* GunOccupiedByPVE; // 0x70(0x08)
	char pad_78[0x4]; // 0x78(0x04)
	int32_t ClipAmmoSize; // 0x7c(0x04)
	bool bCurWeaponEnableAmmoTip; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct AWeaponBase* PreActiveWeapon; // 0x88(0x08)
	struct AWeaponBase* PreMeleeWeapon; // 0x90(0x08)
	struct AWeaponBase* GunPreSpecialWeapon; // 0x98(0x08)
	int32_t AmmoCount; // 0xa0(0x04)
	int32_t CarriedAmmoCount; // 0xa4(0x04)
	int32_t AmmoCountSub; // 0xa8(0x04)
	int32_t CarriedAmmoCountSub; // 0xac(0x04)
	int32_t AmmoCountAbilityItem; // 0xb0(0x04)
	int32_t CarriedAmmoCountAbilityItem; // 0xb4(0x04)
	enum class ECurActiveWeaponType CurActiveWeaponType; // 0xb8(0x01)
	bool bPlayAmmoAddAnim; // 0xb9(0x01)
	bool bGunOrListChanged; // 0xba(0x01)
	bool bIsAllWeaponAmmoEmpty; // 0xbb(0x01)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct AGPCharacter* CurGPCharacter; // 0xc0(0x08)
	uint32_t FirstGunHash; // 0xc8(0x04)
	uint32_t SecondGunHash; // 0xcc(0x04)
	uint32_t CurMeleeWeaponHash; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct TArray<struct AWeaponBase*> WeaponList; // 0xd8(0x10)
	struct TArray<struct AWeaponBase*> GMWeaponList; // 0xe8(0x10)
	struct TArray<struct AWeaponBase*> PVEWeaponList; // 0xf8(0x10)
	enum class EGPWeaponFiringMode CurFireMode; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct TArray<enum class EGPWeaponFiringMode> SupportedFireModes; // 0x110(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateActiveWeaponChanged[0x10]; // 0x120(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateGunChanged[0x10]; // 0x130(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateMeleeWeaponChanged[0x10]; // 0x140(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateAmmoCountChanged[0x10]; // 0x150(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateFireModeChanged[0x10]; // 0x160(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateWeaponListChanged[0x10]; // 0x170(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateGMWeaponListChanged[0x10]; // 0x180(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateGunHashChanged[0x10]; // 0x190(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateMeleeWeaponHashChanged[0x10]; // 0x1a0(0x10)
	/*struct FMulticastInlineDelegate*/char OnDelegateActiveWeaponTypeChanged[0x10]; // 0x1b0(0x10)
	bool isSpectMode; // 0x1c0(0x01)
	char pad_1C1[0x3]; // 0x1c1(0x03)
	float DiscardTime; // 0x1c4(0x04)
	bool bSupportLaser; // 0x1c8(0x01)
	bool bSupportFlashLight; // 0x1c9(0x01)
	bool bSupportQuicklyAdapt; // 0x1ca(0x01)
	enum class EDFMGamePlayMode DFMGameMode; // 0x1cb(0x01)
	char pad_1CC[0x44]; // 0x1cc(0x44)

	void UpdateWeaponList(); // Function DFMGameHud.WeaponSwitchViewModel.UpdateWeaponList // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileWeaponThrowableView
// Size: 0x488 (Inherited: 0x3b8)
class UDFMMobileWeaponThrowableView : public UMobileGamePadView {
public:

	char pad_3B8[0x4]; // 0x3b8(0x04)
	struct TWeakObjectPtr<struct AWeaponBase> CacheActiveWeapon; // 0x3bc(0x08)
	struct TWeakObjectPtr<struct AWeaponBase> CacheLeftActiveWeapon; // 0x3c4(0x08)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct UDFMMobileWeaponThrowableWarningItemView* WarningItemView1P; // 0x3d0(0x08)
	struct TArray<struct UDFMSkillThreatMarkerItemView*> Markers; // 0x3d8(0x10)
	struct UMobileDraggableButton* CancelButtonWidget; // 0x3e8(0x08)
	struct UCanvasPanel* CanvasPanelLocalPlayer; // 0x3f0(0x08)
	struct UCanvasPanel* CanvasPanelWarning; // 0x3f8(0x08)
	struct TWeakObjectPtr<struct AGPCharacter> LocalCharacter; // 0x400(0x08)
	char pad_408[0x10]; // 0x408(0x10)
	struct TArray<struct FMarkerViewData> ViewDataArray; // 0x418(0x10)
	struct TMap<struct AActor*, struct UDFMSkillThreatMarkerItemView*> ActorBindMap; // 0x428(0x50)
	char pad_478[0x10]; // 0x478(0x10)

	void OnWorldThrowableWeaponProjectileExplode(struct AActor* ProjectileActor); // Function DFMGameHud.DFMMobileWeaponThrowableView.OnWorldThrowableWeaponProjectileExplode // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMobileWeaponThrowableWarningItemView
// Size: 0x480 (Inherited: 0x3b8)
class UDFMMobileWeaponThrowableWarningItemView : public UMobileGamePadView {
public:

	struct UTextBlock* ProcessTextWidget; // 0x3b8(0x08)
	struct UImage* ArrowWidget; // 0x3c0(0x08)
	struct UImage* ThrowIcon; // 0x3c8(0x08)
	struct FSlateColor WarningItemColor1P; // 0x3d0(0x28)
	struct FSlateColor WarningItemColor3P; // 0x3f8(0x28)
	float ExtraWarningDistance; // 0x420(0x04)
	bool IsTimeTips; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	struct TWeakObjectPtr<struct AActor> BindProjectile; // 0x428(0x08)
	char pad_430[0x10]; // 0x430(0x10)
	float WarningItemArrowAngleAddition; // 0x440(0x04)
	float WarningItemOffsetMin; // 0x444(0x04)
	float WarningItemOffsetMax; // 0x448(0x04)
	float ScaleRatio; // 0x44c(0x04)
	struct FMargin WarningTipsOffset; // 0x450(0x10)
	char pad_460[0x18]; // 0x460(0x18)
	float LastSeconds; // 0x478(0x04)
	char pad_47C[0x2]; // 0x47c(0x02)
	bool IsFullDamage; // 0x47e(0x01)
	char pad_47F[0x1]; // 0x47f(0x01)

	void OnThrowActive(); // Function DFMGameHud.DFMMobileWeaponThrowableWarningItemView.OnThrowActive // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMonitorFade
// Size: 0x388 (Inherited: 0x388)
class UDFMMonitorFade : public UBaseUIView {
public:


	void OnLoadComplete(); // Function DFMGameHud.DFMMonitorFade.OnLoadComplete // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMMovementTestView
// Size: 0x400 (Inherited: 0x3b8)
class UDFMMovementTestView : public UMobileGamePadView {
public:

	struct UComboBoxString* CharacterList; // 0x3b8(0x08)
	struct URichTextBlock* CharacterMovementInfo; // 0x3c0(0x08)
	bool isCreateFromHUD; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct AGPCharacter* CurrentTagedCharacter; // 0x3d0(0x08)
	char pad_3D8[0x8]; // 0x3d8(0x08)
	struct TArray<struct FString> DropDownListItem; // 0x3e0(0x10)
	struct TArray<struct AGPCharacter*> AllCharacterList; // 0x3f0(0x10)

	void SetDrawCurrentMovementDebugCharacterCapsureEnable(bool Value); // Function DFMGameHud.DFMMovementTestView.SetDrawCurrentMovementDebugCharacterCapsureEnable // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMNPCDialogView
// Size: 0x388 (Inherited: 0x388)
class UDFMNPCDialogView : public UBaseUIView {
public:


	void SelectBranch(enum class EDialogJumpType JumpType, int64_t JumpId, bool ContinueJump, struct FString Args); // Function DFMGameHud.DFMNPCDialogView.SelectBranch // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMOverLoadSkillView
// Size: 0x5d0 (Inherited: 0x5a8)
class UDFMOverLoadSkillView : public ULuaUIHudBaseView {
public:

	struct UDFImage* DFImage_1; // 0x5a8(0x08)
	struct UDFRadialImage* Image_Progress; // 0x5b0(0x08)
	struct UImage* Image_Ten; // 0x5b8(0x08)
	struct UImage* Image_One; // 0x5c0(0x08)
	struct TWeakObjectPtr<struct AGPCharacter> LocalPlayer; // 0x5c8(0x08)

	void OverLoadSetProcess(float Angle, int32_t Time); // Function DFMGameHud.DFMOverLoadSkillView.OverLoadSetProcess // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMPoolUserWidget
// Size: 0x298 (Inherited: 0x298)
class UDFMPoolUserWidget : public UUserWidget {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMPVEQuestPanelView
// Size: 0x388 (Inherited: 0x388)
class UDFMPVEQuestPanelView : public UBaseUIView {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMRescueMySelfItemView
// Size: 0x408 (Inherited: 0x388)
class UDFMRescueMySelfItemView : public UBaseUIView {
public:

	char pad_388[0x28]; // 0x388(0x28)
	struct UTextBlock* DistanceText; // 0x3b0(0x08)
	struct UTextBlock* PlayerNameText; // 0x3b8(0x08)
	struct UTextBlock* IsComingText; // 0x3c0(0x08)
	struct UTextBlock* TeamIndexText; // 0x3c8(0x08)
	struct UImage* PlayerBackIcon; // 0x3d0(0x08)
	struct UImage* PlayerArmForceIcon; // 0x3d8(0x08)
	struct UImage* DFImage; // 0x3e0(0x08)
	struct UWidgetAnimation* KnockDownltem_out; // 0x3e8(0x08)
	struct UWidgetAnimation* KnockDownltem_in; // 0x3f0(0x08)
	struct UWidgetAnimation* Anima_Respond; // 0x3f8(0x08)
	struct UWidgetAnimation* Anima_Respond_Out; // 0x400(0x08)

	void SetTeamIndexText(int32_t InTeamIndex); // Function DFMGameHud.DFMRescueMySelfItemView.SetTeamIndexText // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMRescueMySelfView
// Size: 0x480 (Inherited: 0x298)
class UDFMRescueMySelfView : public UUserWidget {
public:

	struct TMap<uint64_t, struct FNearMedicOrTeammateInfoObject> NearMedicOrTeammateInfoObjects; // 0x298(0x50)
	struct TMap<uint64_t, struct FNearMedicOrTeammateInfoObject> TheFourNearMedicOrTeammateInfoObjects; // 0x2e8(0x50)
	struct TArray<struct UDFMRescueMySelfItemView*> RescueMySelfItemViews; // 0x338(0x10)
	float SearchMedicMaxDistance; // 0x348(0x04)
	float SearchMedicDeltaTime; // 0x34c(0x04)
	bool FillTestData; // 0x350(0x01)
	enum class ECancelRescueMySelfType CurrentCancelRescueMySelfType; // 0x351(0x01)
	char pad_352[0x6]; // 0x352(0x06)
	struct FTimerHandle SearchMedicTimerHandle; // 0x358(0x08)
	struct FTimerHandle SOSSendTimerHandle; // 0x360(0x08)
	struct FTimerHandle PlayLoopAnimationTimerHandle; // 0x368(0x08)
	struct FTimerHandle OutAnimationEndTimerHandle; // 0x370(0x08)
	char pad_378[0x20]; // 0x378(0x20)
	struct ADFMCharacter* OwnerCharacter; // 0x398(0x08)
	int32_t CurrentImpendingDeathHealth; // 0x3a0(0x04)
	int32_t MaxImpendingDeathHealth; // 0x3a4(0x04)
	float CurrentImpendingDeathHealthPercent; // 0x3a8(0x04)
	float CurrentRescueTime; // 0x3ac(0x04)
	struct UClass* DFMRescueMySelfItemView; // 0x3b0(0x08)
	float SOS_CD; // 0x3b8(0x04)
	float GiveUpSelfCD; // 0x3bc(0x04)
	float SOS_ProgressBarRefreshInterval; // 0x3c0(0x04)
	int32_t SOS_Count; // 0x3c4(0x04)
	struct FString DistanceRichTextType; // 0x3c8(0x10)
	struct UDFProgressBar* DFProgressBar_1; // 0x3d8(0x08)
	struct UButton* DFButton; // 0x3e0(0x08)
	struct UTextBlock* ButtonText; // 0x3e8(0x08)
	struct URichTextBlock* DistanceRichText; // 0x3f0(0x08)
	struct UTextBlock* PlayerNameText; // 0x3f8(0x08)
	struct UTextBlock* RescueInfoText; // 0x400(0x08)
	struct UVerticalBox* KnockDownItemVerticalBox; // 0x408(0x08)
	struct UButton* SOS_Button; // 0x410(0x08)
	struct UHorizontalBox* NearestPlayInfoHorizontalBox; // 0x418(0x08)
	struct UImage* RescueListLine; // 0x420(0x08)
	struct UWidgetAnimation* WBP_TipsPro_KnockDown_in; // 0x428(0x08)
	struct UWidgetAnimation* WBP_TipsPro_KnockDown_loop; // 0x430(0x08)
	struct UWidgetAnimation* WBP_TipsPro_KnockDown_out; // 0x438(0x08)
	struct UWidgetAnimation* WBP_TipsPro_KnockDown_loop_in; // 0x440(0x08)
	struct UWidgetAnimation* Anima_Click; // 0x448(0x08)
	struct UWidgetAnimation* WBP_TipsPro_KnockDown_loop_out; // 0x450(0x08)
	struct UCanvasPanel* PCWaitingRescue; // 0x458(0x08)
	struct UCanvasPanel* PCGiveUpCountDown; // 0x460(0x08)
	struct UDFProgressBar* PCGiveUpProgressBar; // 0x468(0x08)
	char pad_470[0x10]; // 0x470(0x10)

	void UpdateImpendingProgressBar(); // Function DFMGameHud.DFMRescueMySelfView.UpdateImpendingProgressBar // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSafeHouseInteractorView
// Size: 0x6e0 (Inherited: 0x550)
class UDFMSafeHouseInteractorView : public ULuaUIBaseView {
public:

	struct UCanvasPanel* RootCanvas; // 0x550(0x08)
	struct UCanvasPanel* WhiteDot_1; // 0x558(0x08)
	struct UCanvasPanel* WhiteDot_2; // 0x560(0x08)
	struct UCanvasPanel* WhiteDot_3; // 0x568(0x08)
	struct UDFMInteractorView_InteractList* Interact_List; // 0x570(0x08)
	struct TArray<struct UDFMInteractorView_ItemBase*> AllItems; // 0x578(0x10)
	struct TArray<struct UCanvasPanel*> WhiteDots; // 0x588(0x10)
	float AllowMergeMaxDistSquare; // 0x598(0x04)
	char pad_59C[0x4]; // 0x59c(0x04)
	struct TMap<struct FGameplayTag, struct UClass*> ItemClassMap; // 0x5a0(0x50)
	struct TMap<struct FGameplayTag, struct UDFMInteractorView_ItemBase*> ItemsMap; // 0x5f0(0x50)
	struct TMap<struct FGameplayTag, struct UClass*> SubViewClassMap; // 0x640(0x50)
	struct TMap<struct FGameplayTag, struct UDFMInteractorView_SubViewBase*> SubViewMap; // 0x690(0x50)

	void OnUIEventFired(struct FDFMWidgetEvent& EvtParam); // Function DFMGameHud.DFMSafeHouseInteractorView.OnUIEventFired // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMScrollText
// Size: 0x3b8 (Inherited: 0x388)
class UDFMScrollText : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)
	struct UScrollBox* ScrollTextBox; // 0x398(0x08)
	struct UTextBlock* LastScrollText; // 0x3a0(0x08)
	struct UTextBlock* CurScrollText; // 0x3a8(0x08)
	float ScrollSpeed; // 0x3b0(0x04)
	int32_t ItemSize; // 0x3b4(0x04)

	void SetLastScrollText(struct FText& InLastScrollText); // Function DFMGameHud.DFMScrollText.SetLastScrollText // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSkillCommonTips
// Size: 0x3b8 (Inherited: 0x388)
class UDFMSkillCommonTips : public UBaseUIView {
public:

	struct FName MutexRegName; // 0x388(0x08)
	bool bGotMutex; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)
	struct UDFCommonHUDScreenMutex* HDEventTipsMutex; // 0x398(0x08)
	struct TArray<int32_t> CurrentPlayList; // 0x3a0(0x10)
	char pad_3B0[0x8]; // 0x3b0(0x08)

	void Show_BPApi(); // Function DFMGameHud.DFMSkillCommonTips.Show_BPApi // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSkillDetailView
// Size: 0x450 (Inherited: 0x388)
class UDFMSkillDetailView : public UBaseUIView {
public:

	struct UDFMSkillDetailViewItem* Ability; // 0x388(0x08)
	struct UDFMSkillDetailViewItem* AbilityPassive; // 0x390(0x08)
	struct UDFMSkillDetailViewItem* Prop1; // 0x398(0x08)
	struct UDFMSkillDetailViewItem* Prop2; // 0x3a0(0x08)
	struct TMap<int64_t, struct FSkillConfig> SkillConfigMap; // 0x3a8(0x50)
	struct TMap<int64_t, struct FHeroDataRow> SkillExpertMap; // 0x3f8(0x50)
	bool bCurrentShowing; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)

	void ShowSkillDetail(bool Up); // Function DFMGameHud.DFMSkillDetailView.ShowSkillDetail // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSkillDetailViewItem
// Size: 0x298 (Inherited: 0x298)
class UDFMSkillDetailViewItem : public UUserWidget {
public:


	struct FName GetRowNameFromSkillId(int64_t SkillId); // Function DFMGameHud.DFMSkillDetailViewItem.GetRowNameFromSkillId // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSkillDetailButton
// Size: 0x398 (Inherited: 0x388)
class UDFMSkillDetailButton : public UBaseUIView {
public:

	struct UUserWidget* WBP_CommonKeyIconBox_PressTalk; // 0x388(0x08)
	struct UTextBlock* DFTextBlock_PressTalk; // 0x390(0x08)

	void OnMicStateChange(int32_t ButtonType); // Function DFMGameHud.DFMSkillDetailButton.OnMicStateChange // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSkillProcessBarActionView
// Size: 0x3f0 (Inherited: 0x388)
class UDFMSkillProcessBarActionView : public UBaseUIView {
public:

	struct FText FirefightingActionName; // 0x388(0x18)
	struct FText ZoyaSwarmsActionName; // 0x3a0(0x18)
	struct TWeakObjectPtr<struct ACHARACTER> DFMChar; // 0x3b8(0x08)
	int32_t ActionSkillID; // 0x3c0(0x04)
	float TotalTime; // 0x3c4(0x04)
	float StopTime; // 0x3c8(0x04)
	bool bUpdateBar; // 0x3cc(0x01)
	bool bIsCountDown; // 0x3cd(0x01)
	char pad_3CE[0x2]; // 0x3ce(0x02)
	struct UDFMActionCommonProgressBar* WBP_TipsPro_Mini; // 0x3d0(0x08)
	struct UDFHDActionCommonProgressBar* WBP_TipsPro_Mini_HD; // 0x3d8(0x08)
	char pad_3E0[0x10]; // 0x3e0(0x10)

	void OnShowSkillProcessBarAction(bool Show, float Time, struct FName Name, int32_t SkillId, int32_t Type); // Function DFMGameHud.DFMSkillProcessBarActionView.OnShowSkillProcessBarAction // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSkillThreatMarkerItemView
// Size: 0x550 (Inherited: 0x3b8)
class UDFMSkillThreatMarkerItemView : public UMobileGamePadView {
public:

	struct UWidget* ArrowIcon; // 0x3b8(0x08)
	struct UImage* ThrowIcon; // 0x3c0(0x08)
	struct TWeakObjectPtr<struct AActor> BindActor; // 0x3c8(0x08)
	/*struct TScriptInterface<IGPSkillThreatMarkerInterface>*/char CachedMarker[0x10]; // 0x3d0(0x10)
	struct TWeakObjectPtr<struct AGPCharacter> LocalCharacter; // 0x3e0(0x08)
	char pad_3E8[0x4]; // 0x3e8(0x04)
	float WarningItemArrowAngleAddition; // 0x3ec(0x04)
	struct FVector2D BorderScale; // 0x3f0(0x08)
	float WarningItemOffsetMax; // 0x3f8(0x04)
	struct FMargin WarningTipsOffset; // 0x3fc(0x10)
	float BlockTraceIntervalPC; // 0x40c(0x04)
	float BlockTraceIntervalMobile; // 0x410(0x04)
	char pad_414[0xe4]; // 0x414(0xe4)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimMap; // 0x4f8(0x50)
	char pad_548[0x8]; // 0x548(0x08)

	bool TickConditionalUpdate(float DeltaTime, struct FVector CharacterLoc); // Function DFMGameHud.DFMSkillThreatMarkerItemView.TickConditionalUpdate // (Final|Native|Public|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSmokeWallAddedView
// Size: 0x2e0 (Inherited: 0x298)
class UDFMSmokeWallAddedView : public UUserWidget {
public:

	struct UImage* BackgroundImage; // 0x298(0x08)
	struct FName AnimName_AnimIn; // 0x2a0(0x08)
	struct FName AnimName_AnimOut; // 0x2a8(0x08)
	float OutAnimTime; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct UMaterialInstanceDynamic* DynamicMaterial; // 0x2b8(0x08)
	char pad_2C0[0x8]; // 0x2c0(0x08)
	struct FName RotationParamName; // 0x2c8(0x08)
	struct FName ShowMarginParamName; // 0x2d0(0x08)
	struct UUserWidget* ParentView; // 0x2d8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSnoicDirView
// Size: 0x3c0 (Inherited: 0x388)
class UDFMSnoicDirView : public UBaseUIView {
public:

	struct UImage* IconImage; // 0x388(0x08)
	struct FName ProgressParameterName; // 0x390(0x08)
	float fUpdateRate; // 0x398(0x04)
	char pad_39C[0xc]; // 0x39c(0x0c)
	struct TWeakObjectPtr<struct AActor> SonicActorPtr; // 0x3a8(0x08)
	struct FVector LastUpdatePos; // 0x3b0(0x0c)
	bool HasUpdate; // 0x3bc(0x01)
	char pad_3BD[0x3]; // 0x3bd(0x03)

	void UpdateSonicTarget(); // Function DFMGameHud.DFMSnoicDirView.UpdateSonicTarget // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMStingerMissleAimingMarkView
// Size: 0x3d0 (Inherited: 0x388)
class UDFMStingerMissleAimingMarkView : public UBaseUIView {
public:

	struct UTextBlock* DistanceTextBlock; // 0x388(0x08)
	struct UTextBlock* ReadyToFireTextBlock; // 0x390(0x08)
	struct FText DistanceText; // 0x398(0x18)
	struct FText LaserPointerReadyText; // 0x3b0(0x18)
	char pad_3C8[0x1]; // 0x3c8(0x01)
	bool bUseSoundStack; // 0x3c9(0x01)
	char pad_3CA[0x6]; // 0x3ca(0x06)

	void SetDis(int32_t Dis); // Function DFMGameHud.DFMStingerMissleAimingMarkView.SetDis // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMStingerMissleAimingView
// Size: 0x400 (Inherited: 0x388)
class UDFMStingerMissleAimingView : public UBaseUIView {
public:

	struct UDFMStingerMissleAimingMarkView* wgMark; // 0x388(0x08)
	struct UTextBlock* wgMarkTextBlock_2; // 0x390(0x08)
	struct UTextBlock* wgTextDistance; // 0x398(0x08)
	struct UTextBlock* wgTextName; // 0x3a0(0x08)
	struct UImage* wgProgress; // 0x3a8(0x08)
	struct TWeakObjectPtr<struct UWeaponFuncComponentStingerMissile> StingerMissile; // 0x3b0(0x08)
	char pad_3B8[0x4]; // 0x3b8(0x04)
	bool isShowing; // 0x3bc(0x01)
	char pad_3BD[0x3]; // 0x3bd(0x03)
	int32_t curStyle; // 0x3c0(0x04)
	enum class EStingerMissileLockingState CurState; // 0x3c4(0x01)
	char pad_3C5[0x7]; // 0x3c5(0x07)
	bool bHasLockingObject; // 0x3cc(0x01)
	char pad_3CD[0x3]; // 0x3cd(0x03)
	float lockProgressVal; // 0x3d0(0x04)
	float bLockProgressDirection; // 0x3d4(0x04)
	char pad_3D8[0x8]; // 0x3d8(0x08)
	bool showAmmoTips; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)
	struct FText DistanceText; // 0x3e8(0x18)

	void PlayLockingStateAudio(struct FStingMissileHudInfo& HudInfo); // Function DFMGameHud.DFMStingerMissleAimingView.PlayLockingStateAudio // (Final|Native|Public|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMSystemSettingHelper
// Size: 0x38 (Inherited: 0x38)
class UDFMSystemSettingHelper : public UEngineSubsystem {
public:


	void SprintTriggerSensitivityChangeBroadcast(); // Function DFMGameHud.DFMSystemSettingHelper.SprintTriggerSensitivityChangeBroadcast // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMTeamPlayerInfoView
// Size: 0x5a0 (Inherited: 0x388)
class UDFMTeamPlayerInfoView : public UBaseUIView {
public:

	char pad_388[0x2]; // 0x388(0x02)
	enum class EDFMGamePlayMode CurGamePlayMode; // 0x38a(0x01)
	char pad_38B[0x5]; // 0x38b(0x05)
	struct FTeamMemberInfo CoorTeamMemberInfo; // 0x390(0x40)
	char pad_3D0[0x1c]; // 0x3d0(0x1c)
	struct FMemberHealthInfo MemberHealthInfo; // 0x3ec(0x3c)
	char pad_428[0x28]; // 0x428(0x28)
	struct TMap<struct FName, struct FHeroDataInfo> HeroDataInfoMap; // 0x450(0x50)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	struct UDFBorder* RaidMVPBorder; // 0x4a8(0x08)
	struct UDFBorder* RaidRankBorder; // 0x4b0(0x08)
	struct UTextBlock* RankText; // 0x4b8(0x08)
	struct UCanvasPanel* PlayerStatusCanvas; // 0x4c0(0x08)
	struct UImage* StateMaskImage; // 0x4c8(0x08)
	struct UTextBlock* ReviveCountDownText; // 0x4d0(0x08)
	struct UDFImage* PlayerStatusProgressBarImage; // 0x4d8(0x08)
	struct UDFImage* PlayerStatusProgressBarImage_Bg; // 0x4e0(0x08)
	struct UImage* PlayerStatusIcon; // 0x4e8(0x08)
	struct UDFRadialImage* PlayerStatusRadialImage; // 0x4f0(0x08)
	struct UImage* BaseColorImage; // 0x4f8(0x08)
	struct UTextBlock* PlayerNumberText; // 0x500(0x08)
	struct UDFImage* ArmedForceIcon; // 0x508(0x08)
	struct UCanvasPanel* TalkingCanvas; // 0x510(0x08)
	struct UImage* TalkingImage; // 0x518(0x08)
	struct UDFRadialImage* TalkingProgressBar; // 0x520(0x08)
	struct UImage* PlayerPlayStatusIcon; // 0x528(0x08)
	struct UTextBlock* PlayerNameText; // 0x530(0x08)
	struct UDFRadialImage* HealthProgressBar; // 0x538(0x08)
	struct UDFImage* DFImage_Bg; // 0x540(0x08)
	struct UDFHorizontalBox* NameHorizontalBox; // 0x548(0x08)
	struct UCanvasPanel* DamageCanvas; // 0x550(0x08)
	struct UDFRadialImage* DamageProgressBar; // 0x558(0x08)
	struct UTextBlock* DamageText; // 0x560(0x08)
	struct UHorizontalBox* LiveRemainHBox; // 0x568(0x08)
	struct UCanvasPanel* RPGNumCanvas; // 0x570(0x08)
	struct UTextBlock* RPGNums; // 0x578(0x08)
	struct UImage* UltraImg; // 0x580(0x08)
	struct FLinearColor FireIconColor; // 0x588(0x10)
	float LowTickTime; // 0x598(0x04)
	char pad_59C[0x4]; // 0x59c(0x04)

	void UpdatePlayerInfo(int32_t InPlayerInnerIndex, bool InIsSelf, struct FTeamMemberInfo InTeamMemberInfo); // Function DFMGameHud.DFMTeamPlayerInfoView.UpdatePlayerInfo // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMTipsCommonButton
// Size: 0x350 (Inherited: 0x298)
class UDFMTipsCommonButton : public UUserWidget {
public:

	int32_t TipsColorType; // 0x298(0x04)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct FText TipsActionName; // 0x2a0(0x18)
	struct FSoftObjectPath TipsIconPath; // 0x2b8(0x18)
	enum class ESTipsCommonButtonAnimType TipsAnimType; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct UImage* Image_Icon_widget; // 0x2d8(0x08)
	struct UTextBlock* ActionName_widget; // 0x2e0(0x08)
	struct UImage* Image_PressedCircle_widget; // 0x2e8(0x08)
	struct UImage* Image_Background_widget; // 0x2f0(0x08)
	struct UImage* Image_CircleBackground_widget; // 0x2f8(0x08)
	struct UButton* OwnerButton; // 0x300(0x08)
	struct FLinearColor PressedColor; // 0x308(0x10)
	struct FLinearColor NormalColor; // 0x318(0x10)
	struct TArray<struct FLinearColor> BackgroundImageColors; // 0x328(0x10)
	struct TArray<struct FLinearColor> CircleBackgroundColors; // 0x338(0x10)
	int32_t BackgroundImageType; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)

	void SetTipsFullData(int32_t ColorType, struct FText ActionName, struct FSoftObjectPath IconPath, enum class ESTipsCommonButtonAnimType AnimType); // Function DFMGameHud.DFMTipsCommonButton.SetTipsFullData // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMTouchEventPanel
// Size: 0x310 (Inherited: 0x298)
class UDFMTouchEventPanel : public UUserWidget {
public:

	/*struct FMulticastInlineDelegate*/char TouchEvent_OnClicked[0x10]; // 0x298(0x10)
	/*struct FMulticastInlineDelegate*/char TouchEvent_OnFlick[0x10]; // 0x2a8(0x10)
	/*struct FMulticastInlineDelegate*/char TouchEvent_OnTouchMoved[0x10]; // 0x2b8(0x10)
	/*struct FMulticastInlineDelegate*/char TouchEvent_OnTouchStarted[0x10]; // 0x2c8(0x10)
	/*struct FMulticastInlineDelegate*/char TouchEvent_OnTouchEnded[0x10]; // 0x2d8(0x10)
	char pad_2E8[0x28]; // 0x2e8(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMUserWidgetObjectPool
// Size: 0x30 (Inherited: 0x30)
class UDFMUserWidgetObjectPool : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMWeakNetAppearLevelSubsystem
// Size: 0x430 (Inherited: 0x378)
class ADFMWeakNetAppearLevelSubsystem : public ALevelSubsystem {
public:

	struct UClass* LoadingViewClass; // 0x378(0x08)
	struct UDFMBaseUIView* WaitingView; // 0x380(0x08)
	int32_t WaitingViewZOrder; // 0x388(0x04)
	float DefaultShowTime; // 0x38c(0x04)
	struct TMap<enum class EWeakNetWorkWaitFunctionID, struct FTimerHandle> WaitingFunctionMap; // 0x390(0x50)
	struct TMap<enum class EWeakNetWorkWaitFunctionID, struct FTimerHandle> ShowingFunctionMap; // 0x3e0(0x50)

	void ShowWaitingView(enum class EWeakNetWorkWaitFunctionID FunctionId); // Function DFMGameHud.DFMWeakNetAppearLevelSubsystem.ShowWaitingView // (Final|Native|Private|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMWeaponOverHeatView
// Size: 0x388 (Inherited: 0x298)
class UDFMWeaponOverHeatView : public UUserWidget {
public:

	struct UImage* processBar; // 0x298(0x08)
	struct UImage* bgIcon; // 0x2a0(0x08)
	struct UMaterialInstanceDynamic* DynamicProcessMat; // 0x2a8(0x08)
	struct TMap<int32_t, struct FLinearColor> OverHeatMap; // 0x2b0(0x50)
	struct TMap<float, int32_t> OverHeatLevelMap; // 0x300(0x50)
	int32_t CoolDownLevel; // 0x350(0x04)
	float CoolDownOverHeat; // 0x354(0x04)
	char pad_358[0x8]; // 0x358(0x08)
	struct UDFRadialImage* ProcessTipsBarWidget; // 0x360(0x08)
	struct UUserWidget* ProcessTipWidget; // 0x368(0x08)
	struct UWidgetAnimation* CoolDownInAnim; // 0x370(0x08)
	struct UWidgetAnimation* CoolDownOutAnim; // 0x378(0x08)
	char pad_380[0x8]; // 0x380(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMWeldingGunView
// Size: 0x3c0 (Inherited: 0x388)
class UDFMWeldingGunView : public UBaseUIView {
public:

	float HideTargetHealthTime; // 0x388(0x04)
	float FireCheckTime; // 0x38c(0x04)
	/*struct TScriptInterface<IGPWeaponDataComponentOverHeatInterface>*/char OverHeatInterface[0x10]; // 0x390(0x10)
	struct AActor* TargetActor; // 0x3a0(0x08)
	bool ShowTargetHealth; // 0x3a8(0x01)
	bool bFiring; // 0x3a9(0x01)
	bool bOverHeat; // 0x3aa(0x01)
	bool bTargetEnemy; // 0x3ab(0x01)
	float OverHeatPercent; // 0x3ac(0x04)
	float TargetHealthPercent; // 0x3b0(0x04)
	bool bNeedHide; // 0x3b4(0x01)
	char pad_3B5[0xb]; // 0x3b5(0x0b)

	void UpdateUI(); // Function DFMGameHud.DFMWeldingGunView.UpdateUI // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFMWidgetUtil
// Size: 0x30 (Inherited: 0x30)
class UDFMWidgetUtil : public UObject {
public:


	void STATIC_Visible(struct UWidget* Widget); // Function DFMGameHud.DFMWidgetUtil.Visible // (Final|Native|Static|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFPakMachineView
// Size: 0x3a8 (Inherited: 0x388)
class UDFPakMachineView : public UBaseUIView {
public:

	struct UDFRadialImage* RadialImage; // 0x388(0x08)
	struct FName RadialImageName; // 0x390(0x08)
	struct UWidget* PanelWidget; // 0x398(0x08)
	struct FName PanelWidgetName; // 0x3a0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFPCMorseCodeView
// Size: 0x2d8 (Inherited: 0x298)
class UDFPCMorseCodeView : public UUserWidget {
public:

	struct UDFPCPwdInputView* PwdInputView; // 0x298(0x08)
	struct UTextBlock* AutoPercent; // 0x2a0(0x08)
	struct UProgressBar* AutoBar; // 0x2a8(0x08)
	char pad_2B0[0x10]; // 0x2b0(0x10)
	struct TArray<int32_t> CachedPwdArray; // 0x2c0(0x10)
	float AlphaOfNotPwdNum; // 0x2d0(0x04)
	char pad_2D4[0x4]; // 0x2d4(0x04)

	bool CheckIsPwdNum(int32_t InNum); // Function DFMGameHud.DFPCMorseCodeView.CheckIsPwdNum // (Final|Native|Protected|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFPCOperationFireMissileItemView
// Size: 0x2a0 (Inherited: 0x298)
class UDFPCOperationFireMissileItemView : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)

	void OnFireBtnClick(); // Function DFMGameHud.DFPCOperationFireMissileItemView.OnFireBtnClick // (Final|Native|Protected|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFPCOperationsView
// Size: 0x2e0 (Inherited: 0x298)
class UDFPCOperationsView : public UUserWidget {
public:

	struct UDFPCOperationDownloadView* DownloadView; // 0x298(0x08)
	struct FName DownloadViewName; // 0x2a0(0x08)
	struct UDFPCOperationOpenDoorView* OpenDoorView; // 0x2a8(0x08)
	struct FName OpenDoorViewName; // 0x2b0(0x08)
	struct UDFPCOperationFireMissileView* FireMissileView; // 0x2b8(0x08)
	struct FName FireMissileViewName; // 0x2c0(0x08)
	struct UDFPCOperationFireRocketView* FireRocketView; // 0x2c8(0x08)
	struct FName FireRocketViewName; // 0x2d0(0x08)
	struct AInteractor_HackPC* CachedPC; // 0x2d8(0x08)

	void BP_PlayShowNormalAni(); // Function DFMGameHud.DFPCOperationsView.BP_PlayShowNormalAni // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFPCPwdInputView
// Size: 0x300 (Inherited: 0x298)
class UDFPCPwdInputView : public UUserWidget {
public:

	struct TArray<int32_t> InputPwdArray; // 0x298(0x10)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	struct AInteractor_HackPC* CachedPC; // 0x2b0(0x08)
	struct TArray<int32_t> CachedPwdArray; // 0x2b8(0x10)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct UWidget* NumPanel; // 0x2d0(0x08)
	struct UWidget* LoadPanel; // 0x2d8(0x08)
	struct UProgressBar* LoadBar; // 0x2e0(0x08)
	float LoadDuration; // 0x2e8(0x04)
	char pad_2EC[0x8]; // 0x2ec(0x08)
	float ErrorDelayDuration; // 0x2f4(0x04)
	char pad_2F8[0x8]; // 0x2f8(0x08)

	void OnOKBtnClick(); // Function DFMGameHud.DFPCPwdInputView.OnOKBtnClick // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFScouterTipsView
// Size: 0x3b8 (Inherited: 0x388)
class UDFScouterTipsView : public UBaseUIView {
public:

	float ShowingDuration; // 0x388(0x04)
	float OutingAniAdditionalDuration; // 0x38c(0x04)
	char pad_390[0x10]; // 0x390(0x10)
	struct UDFCommonHUDScreenMutex* HDEventTipsMutex; // 0x3a0(0x08)
	struct FName MutexRegName; // 0x3a8(0x08)
	bool bGotMutex; // 0x3b0(0x01)
	char pad_3B1[0x7]; // 0x3b1(0x07)

	void SetScoutedNearestTips(); // Function DFMGameHud.DFScouterTipsView.SetScoutedNearestTips // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFScouterView
// Size: 0x3e8 (Inherited: 0x388)
class UDFScouterView : public UBaseUIView {
public:

	struct AInteractor_Scouter* CachedScouter; // 0x388(0x08)
	struct TArray<int32_t> ScouterStateArray; // 0x390(0x10)
	int32_t ScouterMaxNum; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct UTextBlock* BarPer; // 0x3a8(0x08)
	struct FName BarPerName; // 0x3b0(0x08)
	struct UProgressBar* Bar; // 0x3b8(0x08)
	struct FName BarName; // 0x3c0(0x08)
	char pad_3C8[0x4]; // 0x3c8(0x04)
	float BarDuration; // 0x3cc(0x04)
	char pad_3D0[0x15]; // 0x3d0(0x15)
	bool bUseGameHudStateChanged; // 0x3e5(0x01)
	char pad_3E6[0x2]; // 0x3e6(0x02)

	void StopScoutItemAni(int32_t Index); // Function DFMGameHud.DFScouterView.StopScoutItemAni // (Event|Protected|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFSimulate3DRetainerBox
// Size: 0x1b0 (Inherited: 0x1b0)
class UDFSimulate3DRetainerBox : public UDFRetainerBox {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFSimulate3DViewController
// Size: 0x98 (Inherited: 0x30)
class UDFSimulate3DViewController : public UObject {
public:

	float TanLimitX; // 0x30(0x04)
	float TanLimitY; // 0x34(0x04)
	float RetainerBoxSafeScale; // 0x38(0x04)
	float DistanceScaleMax; // 0x3c(0x04)
	float BaseDistance; // 0x40(0x04)
	bool bEnableLerp; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float LerpTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct URetainerBox* RetainerBox; // 0x50(0x08)
	struct UMaterialParameterCollection* MPCSimulate3D; // 0x58(0x08)
	struct UWidget* View3D; // 0x60(0x08)
	struct UDFBackgroundBlur* Blur3DWidget; // 0x68(0x08)
	char pad_70[0x8]; // 0x70(0x08)
	bool bPeriodFirstTick; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	struct FVector2D ViewportRenderSize; // 0x7c(0x08)
	struct FVector2D RealScrLoc; // 0x84(0x08)
	struct FVector2D CurScrLoc; // 0x8c(0x08)
	char pad_94[0x4]; // 0x94(0x04)

	void Tick3DView(float DeltaTime, struct FVector WorldLoc); // Function DFMGameHud.DFSimulate3DViewController.Tick3DView // (Final|Native|Public|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFUnlockingView
// Size: 0x5c8 (Inherited: 0x388)
class UDFUnlockingView : public UBaseUIView {
public:

	struct AInteractor_SingleItemContainer* CachedSafeBox; // 0x388(0x08)
	struct TArray<int32_t> CylinderWidthArray; // 0x390(0x10)
	struct TArray<int32_t> CylinderStateArray; // 0x3a0(0x10)
	char pad_3B0[0x4]; // 0x3b0(0x04)
	float MinCatchWidth; // 0x3b4(0x04)
	float MiddleCatchWidth; // 0x3b8(0x04)
	float MaxCatchWidth; // 0x3bc(0x04)
	float LeftFirstCylinderCenterPer; // 0x3c0(0x04)
	float CylinderCenterInterval; // 0x3c4(0x04)
	struct TArray<float> SliderPerArray; // 0x3c8(0x10)
	float SliderSpeed; // 0x3d8(0x04)
	char pad_3DC[0x8]; // 0x3dc(0x08)
	float AutoBarSpeed; // 0x3e4(0x04)
	char pad_3E8[0x10]; // 0x3e8(0x10)
	bool bCanTickAfterInAniEnd; // 0x3f8(0x01)
	char pad_3F9[0x1b]; // 0x3f9(0x1b)
	bool bUseGameHudStateChanged; // 0x414(0x01)
	bool bIsReadyClear; // 0x415(0x01)
	char pad_416[0x2]; // 0x416(0x02)
	struct UButton* CloseBtn; // 0x418(0x08)
	struct UDFSlider* Slider; // 0x420(0x08)
	struct FName SliderName; // 0x428(0x08)
	struct UDFProgressBar* AutoBar; // 0x430(0x08)
	struct FName AutoBarName; // 0x438(0x08)
	struct UTextBlock* AutoPercent; // 0x440(0x08)
	struct UDFHDKeyIconBoxTextWidget* ExitKeyIconBoxTextWidget; // 0x448(0x08)
	struct FName ExitKeyIconBoxTextWidgetName; // 0x450(0x08)
	struct UDFHDKeyIconBoxTextWidget* CatchKeyIconBoxTextWidget; // 0x458(0x08)
	struct FName CatchKeyIconBoxTextWidgetName; // 0x460(0x08)
	struct UCanvasPanel* DFCanvasPanel_SpringPlug; // 0x468(0x08)
	struct UCanvasPanel* DFCanvasPanel_LockToolPanel; // 0x470(0x08)
	struct UClass* SpringPlugTemplate; // 0x478(0x08)
	struct UClass* SequenceTemplate; // 0x480(0x08)
	struct UClass* SequenceBoxTemplate; // 0x488(0x08)
	struct TMap<int32_t, struct UDFUnlockingView_SpringPlug*> SpringPlugMap; // 0x490(0x50)
	struct TMap<int32_t, struct UDFUnlockingView_Sequence*> SequenceMap; // 0x4e0(0x50)
	struct TMap<int32_t, struct UDFUnlockingView_SequenceBox*> SequenceBoxMap; // 0x530(0x50)
	float RefreshCylinderStateDelay_SprintPlug; // 0x580(0x04)
	float RefreshCylinderStateDelay_Sequence; // 0x584(0x04)
	float RefreshCylinderStateDelay_SequenceBox; // 0x588(0x04)
	char pad_58C[0x4]; // 0x58c(0x04)
	struct FTimerHandle TimerHandle_RefreshStateDelay_SprintPlug; // 0x590(0x08)
	struct FTimerHandle TimerHandle_RefreshStateDelay_Sequence; // 0x598(0x08)
	struct FTimerHandle TimerHandle_RefreshStateDelay_SequenceBox; // 0x5a0(0x08)
	float CatchSucAniDelay_Sequence; // 0x5a8(0x04)
	float CatchSucAniDelay_SequenceBox; // 0x5ac(0x04)
	float OnPlayCatchAniEndDelay; // 0x5b0(0x04)
	float OnPlayCatchAniOnAutoDelay; // 0x5b4(0x04)
	struct FTimerHandle TimerHandle_OnPlayCatchAniEndDelay; // 0x5b8(0x08)
	struct FTimerHandle TimerHandle_OnPlayCatchAniOnAutoDelay; // 0x5c0(0x08)

	void OnSafeBoxUnlockMiniGameCylinderRandomed(struct AActor* InSafeBox); // Function DFMGameHud.DFUnlockingView.OnSafeBoxUnlockMiniGameCylinderRandomed // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFUnlockingView_SpringPlug
// Size: 0x2a0 (Inherited: 0x298)
class UDFUnlockingView_SpringPlug : public UUserWidget {
public:

	struct FTimerHandle TimerHandle_CatchSucAniDelay_Sequence; // 0x298(0x08)

	void BP_StopAnim(); // Function DFMGameHud.DFUnlockingView_SpringPlug.BP_StopAnim // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFUnlockingView_Sequence
// Size: 0x2a0 (Inherited: 0x298)
class UDFUnlockingView_Sequence : public UUserWidget {
public:

	struct FTimerHandle TimerHandle_CatchSucAniDelay_SequenceBox; // 0x298(0x08)

	void BP_StopAnim(); // Function DFMGameHud.DFUnlockingView_Sequence.BP_StopAnim // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFUnlockingView_SequenceBox
// Size: 0x298 (Inherited: 0x298)
class UDFUnlockingView_SequenceBox : public UUserWidget {
public:


	void BP_StopAnim(); // Function DFMGameHud.DFUnlockingView_SequenceBox.BP_StopAnim // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DFVehicleEmptyRootView
// Size: 0x5c8 (Inherited: 0x5a8)
class UDFVehicleEmptyRootView : public ULuaUIHudBaseView {
public:

	struct AGPCharacter* LocalCharacter; // 0x5a8(0x08)
	struct ADFMVehicleBase* OwnerVehicle; // 0x5b0(0x08)
	char pad_5B8[0x10]; // 0x5b8(0x10)

	void Refresh(); // Function DFMGameHud.DFVehicleEmptyRootView.Refresh // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DirectionBarHUDController
// Size: 0x188 (Inherited: 0xb0)
class UDirectionBarHUDController : public UBaseUIController {
public:

	struct UBorder* Border0; // 0xb0(0x08)
	struct UBorder* Border1; // 0xb8(0x08)
	struct UBorder* Border2; // 0xc0(0x08)
	struct UBorder* Border3; // 0xc8(0x08)
	struct UTextBlock* PointText0; // 0xd0(0x08)
	struct UTextBlock* PointText1; // 0xd8(0x08)
	struct UTextBlock* PointText2; // 0xe0(0x08)
	struct UTextBlock* PointText3; // 0xe8(0x08)
	struct UWidget* SafeWidget; // 0xf0(0x08)
	struct UImage* SafeImage; // 0xf8(0x08)
	struct UTextBlock* SafeTextBlock; // 0x100(0x08)
	struct UTextBlock* DistenceText; // 0x108(0x08)
	struct UImage* DirectionBar; // 0x110(0x08)
	struct UTextBlock* TextDirection; // 0x118(0x08)
	struct UMaterialInstanceDynamic* DirectionBarMaterial; // 0x120(0x08)
	struct UCanvasPanel* DirectionBarCanvasPanel; // 0x128(0x08)
	struct AGPPlayerController* PlayerOwner; // 0x130(0x08)
	/*struct TSet<struct APlayerExitBase*>*/char PlayerExits[0x50]; // 0x138(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.DoorIconViewController
// Size: 0x310 (Inherited: 0x2c8)
class UDoorIconViewController : public USelectableMapIconController {
public:

	char pad_2C8[0x48]; // 0x2c8(0x48)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.EdgeTrackingWidget
// Size: 0x2b0 (Inherited: 0x298)
class UEdgeTrackingWidget : public UUserWidget {
public:

	struct UImage* DFMImage_Angle; // 0x298(0x08)
	struct UImage* DFMImage_Circle; // 0x2a0(0x08)
	bool bIsBigMap; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.EnemyMarkerSettingDataTableManager
// Size: 0x48 (Inherited: 0x38)
class UEnemyMarkerSettingDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.EvacuteTimeWidget
// Size: 0x2d0 (Inherited: 0x298)
class UEvacuteTimeWidget : public UUserWidget {
public:

	struct UImage* DFMImage_BG; // 0x298(0x08)
	struct UTextBlock* DFTextBlock_Time; // 0x2a0(0x08)
	char pad_2A8[0x18]; // 0x2a8(0x18)
	int32_t ItemHovered_Position0; // 0x2c0(0x04)
	int32_t ItemHovered_Position1; // 0x2c4(0x04)
	int32_t ItemHovered_Position2; // 0x2c8(0x04)
	char pad_2CC[0x4]; // 0x2cc(0x04)

	void PlayEndDestroyed(); // Function DFMGameHud.EvacuteTimeWidget.PlayEndDestroyed // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitConsumeItemHudController
// Size: 0xd8 (Inherited: 0xb0)
class UExitConsumeItemHudController : public UBaseUIController {
public:

	char pad_B0[0x18]; // 0xb0(0x18)
	struct UTextBlock* Text; // 0xc8(0x08)
	struct UButton* BtnConsume; // 0xd0(0x08)

	void OnReqShow(uint64_t InItemID, uint32_t InCount); // Function DFMGameHud.ExitConsumeItemHudController.OnReqShow // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitEscapingHudController
// Size: 0xf0 (Inherited: 0xb0)
class UExitEscapingHudController : public UBaseUIController {
public:

	char pad_B0[0x8]; // 0xb0(0x08)
	struct UDFMCountDownHUDView* CountDownHUDView; // 0xb8(0x08)
	struct APlayerExitBase* PlayerExit; // 0xc0(0x08)
	bool CurInExitOrNotice; // 0xc8(0x01)
	char pad_C9[0xf]; // 0xc9(0x0f)
	struct UDFCommonHUDScreenMutex* HDEventTipsMutex; // 0xd8(0x08)
	struct FName MutexRegName; // 0xe0(0x08)
	bool bGotMutex; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)

	void UpdateView(); // Function DFMGameHud.ExitEscapingHudController.UpdateView // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitHudView
// Size: 0x3c8 (Inherited: 0x388)
class UExitHudView : public UBaseUIView {
public:

	struct UUserWidget* StruggleButtonWidget; // 0x388(0x08)
	struct UUserWidget* HelpButtonWidget; // 0x390(0x08)
	struct UUserWidget* EscapeButtonWidget; // 0x398(0x08)
	struct UUserWidget* StruggleBarWidget; // 0x3a0(0x08)
	struct UUserWidget* HelpingProgressBarWidget; // 0x3a8(0x08)
	struct UWidgetSwitcher* ExitTipsWidgetSwitcher; // 0x3b0(0x08)
	struct UTextBlock* ExitConditionText; // 0x3b8(0x08)
	struct UTextBlock* ExitTimeText; // 0x3c0(0x08)

	void OnStartEscapeButtonClicked(); // Function DFMGameHud.ExitHudView.OnStartEscapeButtonClicked // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitMediaVideoHUDView
// Size: 0x390 (Inherited: 0x388)
class UExitMediaVideoHUDView : public UBaseUIView {
public:

	struct UDFCommonMediaView* MediaImage; // 0x388(0x08)

	void PlayMedia(struct FString VideoName); // Function DFMGameHud.ExitMediaVideoHUDView.PlayMedia // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitPaymentHUDView
// Size: 0x390 (Inherited: 0x388)
class UExitPaymentHUDView : public UBaseUIView {
public:

	struct UDFRichTextBlock* RichTextBlock; // 0x388(0x08)

	float BP_FadeOut(); // Function DFMGameHud.ExitPaymentHUDView.BP_FadeOut // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitPaymentHUDController
// Size: 0xc8 (Inherited: 0xb0)
class UExitPaymentHUDController : public UBaseUIController {
public:

	struct UDFCommonHUDScreenMutex* HDEventTipsMutex; // 0xb0(0x08)
	struct FName MutexRegName; // 0xb8(0x08)
	bool bGotMutex; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)

	void OnSOLExitPaymentUpdate(struct APlayerExitBase* PlayerExit, bool bShow); // Function DFMGameHud.ExitPaymentHUDController.OnSOLExitPaymentUpdate // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ExitRestrictionTipHUDView
// Size: 0x3c0 (Inherited: 0x388)
class UExitRestrictionTipHUDView : public UBaseUIView {
public:

	struct UDFRichTextBlock* TipText; // 0x388(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_EvacuationRestrictions_in; // 0x390(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_EvacuationRestrictions_out; // 0x398(0x08)
	bool bIsPlayingInAnim; // 0x3a0(0x01)
	bool bIsPlayingOutAnim; // 0x3a1(0x01)
	char pad_3A2[0x6]; // 0x3a2(0x06)
	struct UDFCommonHUDScreenMutex* HDEventTipsMutex; // 0x3a8(0x08)
	struct FName MutexRegName; // 0x3b0(0x08)
	bool bGotMutex; // 0x3b8(0x01)
	char pad_3B9[0x7]; // 0x3b9(0x07)

	void UpdateTipText(); // Function DFMGameHud.ExitRestrictionTipHUDView.UpdateTipText // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.FindCampView
// Size: 0x3d0 (Inherited: 0x388)
class UFindCampView : public UBaseUIView {
public:

	struct UTextBlock* FirstTextBlock; // 0x388(0x08)
	struct UTextBlock* SecondTextBlock; // 0x390(0x08)
	struct UImage* ColorImage; // 0x398(0x08)
	struct UImage* Image; // 0x3a0(0x08)
	struct TArray<struct FSoftObjectPath> POIIconArr; // 0x3a8(0x10)
	struct UWidgetAnimation* In_Anim; // 0x3b8(0x08)
	struct UWidgetAnimation* Out_Anim; // 0x3c0(0x08)
	char pad_3C8[0x8]; // 0x3c8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.FlaggedFrameWidget
// Size: 0x2b0 (Inherited: 0x298)
class UFlaggedFrameWidget : public UUserWidget {
public:

	struct UImage* Image_FlaggedFrame; // 0x298(0x08)
	char pad_2A0[0x8]; // 0x2a0(0x08)
	float FadeOutTime; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)

	void OnFadeOutEnd(); // Function DFMGameHud.FlaggedFrameWidget.OnFadeOutEnd // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.FlashDroneScreenEffectHUD
// Size: 0x390 (Inherited: 0x388)
class UFlashDroneScreenEffectHUD : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)

	void StopScreenAnim(); // Function DFMGameHud.FlashDroneScreenEffectHUD.StopScreenAnim // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.FlashLightButtonHUDView
// Size: 0x3f8 (Inherited: 0x3b8)
class UFlashLightButtonHUDView : public UMobileGamePadView {
public:

	struct UButton* FlashLightBtn; // 0x3b8(0x08)
	struct UMobileDraggableButton* DraggableFlashLightBtn; // 0x3c0(0x08)
	struct UImage* FlashLightImage; // 0x3c8(0x08)
	struct FLinearColor FlashLightPressedColor; // 0x3d0(0x10)
	struct FLinearColor FlashLightNormalColor; // 0x3e0(0x10)
	char pad_3F0[0x8]; // 0x3f0(0x08)

	void OnFlashLightBtnClick(); // Function DFMGameHud.FlashLightButtonHUDView.OnFlashLightBtnClick // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.FrontEndLoadingManager
// Size: 0x98 (Inherited: 0x48)
class UFrontEndLoadingManager : public UDFMLoadingManager {
public:

	struct FMulticastSparseDelegate OnHUDLoadingFinished; // 0x48(0x01)
	struct FMulticastSparseDelegate OnBattlePrepare; // 0x49(0x01)
	char pad_4A[0x2]; // 0x4a(0x02)
	int32_t FullyLoadPercentage; // 0x4c(0x04)
	float MoviePlayerPercent; // 0x50(0x04)
	float MoviePlayerTime; // 0x54(0x04)
	char pad_58[0x38]; // 0x58(0x38)
	struct ULoadingView* DelayLoadingView; // 0x90(0x08)

	void UnregisterDelegate(struct FString MapName); // Function DFMGameHud.FrontEndLoadingManager.UnregisterDelegate // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.GameMarkerPanel
// Size: 0x810 (Inherited: 0x388)
class UGameMarkerPanel : public UBaseUIView {
public:

	struct UCanvasPanel* MarkerCanvas; // 0x388(0x08)
	struct TMap<uint32_t, struct FGameMarkerPool> MarkerUsingPool; // 0x390(0x50)
	struct TMap<uint32_t, struct FGameMarkerPool> MarkerNotUsePool; // 0x3e0(0x50)
	struct TMap<uint32_t, struct UClass*> MarkerWidgetsMap; // 0x430(0x50)
	struct TMap<enum class EFriendlyCharacterMarkerType, struct UClass*> FriendlyCharacterMarkerWidgetsMap; // 0x480(0x50)
	struct TMap<enum class EEnemyCharacterMarkerType, struct UClass*> EnemyCharacterMarkerWidgetsMap; // 0x4d0(0x50)
	struct TMap<enum class ESceneWeaponMarkerType, struct UClass*> SceneWeaponMarkerWidgetsMap; // 0x520(0x50)
	struct TMap<enum class EVehicleMarkerType, struct UClass*> VehicleMarkerWidgetsMap; // 0x570(0x50)
	struct TMap<enum class ETacticalEquipmentMarkerType, struct UClass*> TacticalEquipmentMarkerWidgetsMap; // 0x5c0(0x50)
	struct TMap<enum class EBattleFieldGameModeMarkerType, struct UClass*> BattleFieldGameModeMarkerWidgetsMap; // 0x610(0x50)
	struct TMap<enum class ESOLGameModeMarkerType, struct UClass*> SOLGameModeMarkerWidgetsMap; // 0x660(0x50)
	struct TMap<enum class EQuestMarkerMarkerType, struct UClass*> ContractMarkerWidgetsMap; // 0x6b0(0x50)
	struct TMap<enum class EMapMarkerType, struct UClass*> MapMarkerWidgetsMap; // 0x700(0x50)
	struct TMap<enum class EMarkingMarkerType, struct UClass*> MarkingMarkerWidgetsMap; // 0x750(0x50)
	struct TMap<enum class EInteractorMarkerType, struct UClass*> InterActorMarkerWidgetsMap; // 0x7a0(0x50)
	float HighFrequencyUpdateInterval; // 0x7f0(0x04)
	float MiddleFrequencyUpdateInterval; // 0x7f4(0x04)
	float LowFrequencyUpdateInterval; // 0x7f8(0x04)
	char pad_7FC[0x14]; // 0x7fc(0x14)

	void RemoveWidgetFromUsingPool(uint32_t markerType, int32_t Index); // Function DFMGameHud.GameMarkerPanel.RemoveWidgetFromUsingPool // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.GiantTowerItemView
// Size: 0x498 (Inherited: 0x388)
class UGiantTowerItemView : public UBaseUIView {
public:

	char pad_388[0x10]; // 0x388(0x10)
	struct FLinearColor SameTeamColor; // 0x398(0x10)
	struct FLinearColor SameCampColor; // 0x3a8(0x10)
	struct FLinearColor SelfColor; // 0x3b8(0x10)
	struct FLinearColor EnemyColor; // 0x3c8(0x10)
	struct FSoftObjectPath TowerWeaponDestroyState; // 0x3d8(0x18)
	struct TMap<enum class ETieWeaponState, struct FLinearColor> TowerWeaponStateColor; // 0x3f0(0x50)
	struct TMap<enum class ESceneWeaponType, struct FSoftObjectPath> WeaponIconMap; // 0x440(0x50)
	struct UDFMImage* TowerWeaponImage; // 0x490(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.GiantTowerSeatButton
// Size: 0x3b0 (Inherited: 0x388)
class UGiantTowerSeatButton : public UBaseUIView {
public:

	struct ADFFixedWeaponPawn* CacheSceneWeapon; // 0x388(0x08)
	struct ADFMTieBreaker* OwnerGiantTower; // 0x390(0x08)
	struct UButton* SeatBtn; // 0x398(0x08)
	struct UDFMImage* SeatBaseImage; // 0x3a0(0x08)
	struct UDFMImage* SeatIconImage; // 0x3a8(0x08)

	void OnSeatButtonClicked(); // Function DFMGameHud.GiantTowerSeatButton.OnSeatButtonClicked // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.GiantTowerSeatView
// Size: 0x580 (Inherited: 0x388)
class UGiantTowerSeatView : public UBaseUIView {
public:

	struct ADFMTieBreaker* OwnerGiantTower; // 0x388(0x08)
	struct TArray<struct FGiantTowerSeatViewInfo> OwnerGiantTowerWeapons; // 0x390(0x10)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct UButton* SeatPanelButton; // 0x3a8(0x08)
	struct UCanvasPanel* SeatPanel; // 0x3b0(0x08)
	struct TMap<enum class ESeatStateType, struct FLinearColor> SeatStateColorMap; // 0x3b8(0x50)
	struct TMap<enum class ESeatStateType, struct FLinearColor> SeatIconColorMap; // 0x408(0x50)
	struct TMap<enum class ESceneWeaponType, struct FSoftObjectPath> WeaponIconMap; // 0x458(0x50)
	struct TArray<struct FName> SeatIconArray; // 0x4a8(0x10)
	struct TMap<enum class ESeatStateType, struct UPaperSprite*> SeatStateIconMap; // 0x4b8(0x50)
	struct TArray<struct FName> SeatButtonArray; // 0x508(0x10)
	struct TMap<enum class ESeatStateType, struct FSoftObjectPath> SeatButtonStateIconMap; // 0x518(0x50)
	struct FSoftObjectPath DestroyIcon; // 0x568(0x18)

	void SetTowerWeaponSeatState(); // Function DFMGameHud.GiantTowerSeatView.SetTowerWeaponSeatState // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.GiantTowerView
// Size: 0x420 (Inherited: 0x388)
class UGiantTowerView : public UBaseUIView {
public:

	struct ADFMTieBreaker* GiantTower; // 0x388(0x08)
	struct UDFMTieBreakerHealthComponent* GiantTowerhHealthComponent; // 0x390(0x08)
	struct TArray<struct UGiantTowerItemView*> GiantTowerItemViews; // 0x398(0x10)
	char pad_3A8[0x8]; // 0x3a8(0x08)
	struct UProgressBar* TowerHealthProgressBar; // 0x3b0(0x08)
	struct UScrollGridBox* TowerWeaponScrollGridBox; // 0x3b8(0x08)
	struct UDFMImage* TowerBaseImage_2; // 0x3c0(0x08)
	struct UDFMImage* TowerBaseImage_3; // 0x3c8(0x08)
	struct UDFMImage* TowerBaseCircleImage; // 0x3d0(0x08)
	struct UCanvasPanel* TowerWeaponCanvasPanel; // 0x3d8(0x08)
	struct FLinearColor OwnerCampColor; // 0x3e0(0x10)
	struct FLinearColor EnemyCampColor; // 0x3f0(0x10)
	struct FLinearColor CirCleOwnerCampColor; // 0x400(0x10)
	struct FLinearColor CircleEnemyCampColor; // 0x410(0x10)

	void OnTowerWeaponStateChanged(struct AActor* InDFMTieBreaker); // Function DFMGameHud.GiantTowerView.OnTowerWeaponStateChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.GPMarkerBubbleBox
// Size: 0x2b8 (Inherited: 0x298)
class UGPMarkerBubbleBox : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct UDFImage* BubbleIconImage; // 0x2a0(0x08)
	struct UWidgetAnimation* BubbleBox_in; // 0x2a8(0x08)
	struct UWidgetAnimation* BubbleBox_loop; // 0x2b0(0x08)

	void BP_SetPveRpgNum(int32_t RpgNum); // Function DFMGameHud.GPMarkerBubbleBox.BP_SetPveRpgNum // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HDKeyIconBoxWidget
// Size: 0x5b8 (Inherited: 0x550)
class UHDKeyIconBoxWidget : public ULuaUIBaseView {
public:

	float KeyIconLeftPadding; // 0x550(0x04)
	float KeyIconHeight; // 0x554(0x04)
	struct FName DisplayInputActionName; // 0x558(0x08)
	struct FName ActionAxisName; // 0x560(0x08)
	float AxisScale; // 0x568(0x04)
	char pad_56C[0x4]; // 0x56c(0x04)
	struct TArray<struct FName> KeyNames; // 0x570(0x10)
	enum class EKeyIconType KeyIconType; // 0x580(0x01)
	bool bRemoveUnusedKeyIconsOnShow; // 0x581(0x01)
	bool bNeedHold; // 0x582(0x01)
	char pad_583[0x5]; // 0x583(0x05)
	/*struct FMulticastInlineDelegate*/char InitByKeyNamesDlg[0x10]; // 0x588(0x10)
	/*struct FMulticastInlineDelegate*/char InitByActionOrAxisNameDlg[0x10]; // 0x598(0x10)
	/*struct FMulticastInlineDelegate*/char InitByDisplayInputActionNameDlg[0x10]; // 0x5a8(0x10)

	void BP_UpdateProgressBar(float Prog); // Function DFMGameHud.HDKeyIconBoxWidget.BP_UpdateProgressBar // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HDStatusProgressBar
// Size: 0x2a0 (Inherited: 0x298)
class UHDStatusProgressBar : public UUserWidget {
public:

	struct UMaterialInstanceDynamic* ProgressBar_Fore_DynamicMI; // 0x298(0x08)

	void UpdateProgressDown(float ProgressDown); // Function DFMGameHud.HDStatusProgressBar.UpdateProgressDown // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ItemLabelIconProxyView
// Size: 0x30 (Inherited: 0x30)
class UItemLabelIconProxyView : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HealthDetailPartItemHUDView
// Size: 0x3d0 (Inherited: 0x388)
class UHealthDetailPartItemHUDView : public UBaseUIView {
public:

	struct UTextBlock* PartNameText; // 0x388(0x08)
	struct UTextBlock* BloodValue; // 0x390(0x08)
	struct UBuffItemHUDView* BuffItem1; // 0x398(0x08)
	struct UBuffItemHUDView* BuffItem2; // 0x3a0(0x08)
	struct UBuffItemHUDView* BuffItem3; // 0x3a8(0x08)
	struct UBuffItemHUDView* BuffItem4; // 0x3b0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x3b8(0x08)
	struct TArray<struct UBuffItemHUDView*> BuffItemArray; // 0x3c0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.BodyPartHealthHUDView
// Size: 0x3d0 (Inherited: 0x388)
class UBodyPartHealthHUDView : public UBaseUIView {
public:

	struct UTextBlock* PartNameText; // 0x388(0x08)
	struct UBuffItemHUDView* BuffItem1; // 0x390(0x08)
	struct UBuffItemHUDView* BuffItem2; // 0x398(0x08)
	struct UBuffItemHUDView* BuffItem3; // 0x3a0(0x08)
	struct UBuffItemHUDView* BuffItem4; // 0x3a8(0x08)
	struct UWidgetSwitcher* StateWidgetSwitcher; // 0x3b0(0x08)
	struct TArray<struct UBuffItemHUDView*> BuffItemArray; // 0x3b8(0x10)
	char pad_3C8[0x8]; // 0x3c8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HealthDetailPartItemWithBloodHUDView
// Size: 0x3e0 (Inherited: 0x388)
class UHealthDetailPartItemWithBloodHUDView : public UBaseUIView {
public:

	struct UProgressBar* HealthBloodBar; // 0x388(0x08)
	struct UTextBlock* PartNameText; // 0x390(0x08)
	struct UTextBlock* BloodValue; // 0x398(0x08)
	struct UBuffItemHUDView* BuffItem1; // 0x3a0(0x08)
	struct UBuffItemHUDView* BuffItem2; // 0x3a8(0x08)
	struct UBuffItemHUDView* BuffItem3; // 0x3b0(0x08)
	struct UBuffItemHUDView* BuffItem4; // 0x3b8(0x08)
	struct UWidgetSwitcher* BloodBarBGWidgetSwitcher; // 0x3c0(0x08)
	bool IsSelected; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct TArray<struct UBuffItemHUDView*> BuffItemArray; // 0x3d0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HeroCardLuaBaseWidget
// Size: 0x550 (Inherited: 0x550)
class UHeroCardLuaBaseWidget : public ULuaUIBaseView {
public:


	void SetCardInfoPlayerName(struct FText& InPlayerName); // Function DFMGameHud.HeroCardLuaBaseWidget.SetCardInfoPlayerName // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.HoldBreathIconView
// Size: 0x3b0 (Inherited: 0x388)
class UHoldBreathIconView : public UBaseUIView {
public:

	int32_t CacheProgressType; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct UWidgetAnimation* WBP_ControllerButtun_HoldBreath_Disable; // 0x390(0x08)
	struct UWidgetAnimation* WBP_ControllerButtun_HoldBreath_low; // 0x398(0x08)
	struct UWidgetAnimation* WBP_ControllerButtun_HoldBreath_PC_in; // 0x3a0(0x08)
	struct UWidgetAnimation* WBP_ControllerButtun_HoldBreath_PC_out; // 0x3a8(0x08)

	void SetType(int32_t Type); // Function DFMGameHud.HoldBreathIconView.SetType // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.ImportantTipsController
// Size: 0xc0 (Inherited: 0xb0)
class UImportantTipsController : public UBaseUIController {
public:

	char pad_B0[0x4]; // 0xb0(0x04)
	float ShowSeconds; // 0xb4(0x04)
	struct UTextBlock* TextTime; // 0xb8(0x08)

	void HideView(); // Function DFMGameHud.ImportantTipsController.HideView // (Final|Native|Protected) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InGameUpgradeTipsHUDView
// Size: 0x478 (Inherited: 0x388)
class UInGameUpgradeTipsHUDView : public UBaseUIView {
public:

	struct UTextBlock* Text_NumberTitle; // 0x388(0x08)
	struct UTextBlock* Text_Number; // 0x390(0x08)
	struct UTextBlock* Text_ContentTitle; // 0x398(0x08)
	struct UTextBlock* Text_Content; // 0x3a0(0x08)
	struct UUserWidget* WBP_Itemview_Image_widget; // 0x3a8(0x08)
	struct UDFMImage* ImageInItemView; // 0x3b0(0x08)
	struct TMap<enum class EUpgradeTipsType, float> TypesShowTime; // 0x3b8(0x50)
	struct TMap<enum class EUpgradeTipsType, struct FName> TypesShowAudio; // 0x408(0x50)
	struct UDFMInGameUpgradeComponent* InGameUpgradeComp; // 0x458(0x08)
	struct TArray<struct FUpgradeTipData> TipsQueue; // 0x460(0x10)
	bool bTipsShowing; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)

	void TEST_InGameUpgradeTipsShow(int32_t InUpgradeTipsType); // Function DFMGameHud.InGameUpgradeTipsHUDView.TEST_InGameUpgradeTipsShow // (Final|Exec|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InputMonitor
// Size: 0x50 (Inherited: 0x30)
class UInputMonitor : public UObject {
public:

	char pad_30[0x20]; // 0x30(0x20)

	void UnRegisterMouseButtonDown(); // Function DFMGameHud.InputMonitor.UnRegisterMouseButtonDown // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InstancedIconWidget
// Size: 0x508 (Inherited: 0x168)
class UInstancedIconWidget : public UWidget {
public:

	struct USlateVectorArtData* TrailMeshAsset; // 0x168(0x08)
	char pad_170[0x48]; // 0x170(0x48)
	struct FInstancedIconDataMgr IconDataMgr_UnderBase; // 0x1b8(0xd0)
	struct FInstancedIconDataMgr IconDataMgr_Base; // 0x288(0xd0)
	struct FInstancedIconDataMgr IconDataMgr_TeamMate; // 0x358(0xd0)
	struct FInstancedIconDataMgr IconDataMgr_LocalPlayer; // 0x428(0xd0)
	int32_t MaxIconCount_UnderBase; // 0x4f8(0x04)
	int32_t MaxIconCount_Base; // 0x4fc(0x04)
	int32_t MaxMateIconCount_TeamMate; // 0x500(0x04)
	int32_t MaxTeamMateIconCount_LocalPlayer; // 0x504(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InstancedSplineAreaWidget
// Size: 0x2b0 (Inherited: 0x168)
class UInstancedSplineAreaWidget : public UWidget {
public:

	struct USlateVectorArtData* LineMeshAsset; // 0x168(0x08)
	struct UMaterialInstanceDynamic* LineMaterial; // 0x170(0x08)
	int32_t MaxInstancedLineCount; // 0x178(0x04)
	char pad_17C[0x5]; // 0x17c(0x05)
	bool bDebug; // 0x181(0x01)
	char pad_182[0x2]; // 0x182(0x02)
	struct FVector2D DebugLoc; // 0x184(0x08)
	struct FLinearColor DebugColor; // 0x18c(0x10)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct FVector4 LineUVInfo; // 0x1a0(0x10)
	struct FVector4 AreaUVInfo; // 0x1b0(0x10)
	float RangeScale; // 0x1c0(0x04)
	float DebugRotate; // 0x1c4(0x04)
	char pad_1C8[0x70]; // 0x1c8(0x70)
	struct TArray<struct FMapInstancedSplineAreaData> InstancedSplineAreaDataArr; // 0x238(0x10)
	struct TMap<struct FName, int32_t> InstancedSplineAreaMap; // 0x248(0x50)
	struct TArray<int32_t> DormantInstancedSplineAreaIndexArr; // 0x298(0x10)
	char pad_2A8[0x8]; // 0x2a8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InteractorDeliverQuestExecutor
// Size: 0xf0 (Inherited: 0xd0)
class UInteractorDeliverQuestExecutor : public UInteractExecutor {
public:

	struct FText DeliverProgressBarName; // 0xd0(0x18)
	struct AActor* CurInteractor; // 0xe8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InteractorGotoAndDelayQuestExecutor
// Size: 0xd0 (Inherited: 0xd0)
class UInteractorGotoAndDelayQuestExecutor : public UInteractExecutor {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.InteractorMobileRollButton
// Size: 0x4e8 (Inherited: 0x4b0)
class UInteractorMobileRollButton : public UButton {
public:

	/*struct FDelegate*/char CalcCenterDelegate[0x10]; // 0x4b0(0x10)
	struct FVector2D CalcCenter; // 0x4c0(0x08)
	/*struct FMulticastInlineDelegate*/char offset[0x10]; // 0x4c8(0x10)
	char pad_4D8[0x10]; // 0x4d8(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.KillFeedBackNumView
// Size: 0x5b8 (Inherited: 0x5a8)
class UKillFeedBackNumView : public ULuaUIHudBaseView {
public:

	struct UWidgetAnimation* Anima_GlitchOut; // 0x5a8(0x08)
	struct UWidgetAnimation* Anima_LittleScore_Out; // 0x5b0(0x08)

	void OnKillFeedBackNumViewFadeOut(bool bIsLittleScore); // Function DFMGameHud.KillFeedBackNumView.OnKillFeedBackNumViewFadeOut // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.KillTipsHUDView
// Size: 0x470 (Inherited: 0x388)
class UKillTipsHUDView : public UBaseUIView {
public:

	struct UTextBlock* DamageText; // 0x388(0x08)
	struct UTextBlock* ArmorReduceDamage; // 0x390(0x08)
	struct UVerticalBox* DamageVerticalBox; // 0x398(0x08)
	struct UWidgetAnimation* DamageTextAnim; // 0x3a0(0x08)
	struct UKillTipsLoopListWidget* KillTipsLoopWidget; // 0x3a8(0x08)
	struct UKillTipWidgetView* NormalKillTipWidget; // 0x3b0(0x08)
	char pad_3B8[0xb8]; // 0x3b8(0xb8)

	void PlayAnim(enum class EKillTipWidgetType WidgetType); // Function DFMGameHud.KillTipsHUDView.PlayAnim // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.KillTipsLoopListWidget
// Size: 0x320 (Inherited: 0x298)
class UKillTipsLoopListWidget : public UUserWidget {
public:

	struct UClass* HeadShotWidgetClass; // 0x298(0x08)
	struct UClass* MultiKillWidgetClass; // 0x2a0(0x08)
	float DisplayTime; // 0x2a8(0x04)
	float MovingTime; // 0x2ac(0x04)
	float Timespan; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct UCurveFloat* MovingCurve; // 0x2b8(0x08)
	struct UCanvasPanel* Container; // 0x2c0(0x08)
	struct TArray<struct FKillTipsItemPosInfo> PositionMap; // 0x2c8(0x10)
	struct TArray<struct UKillTipsLoopListItemWidget*> UIItems; // 0x2d8(0x10)
	struct UKillTipsLoopListItemWidget* LastItem; // 0x2e8(0x08)
	char pad_2F0[0x10]; // 0x2f0(0x10)
	struct TArray<struct UKillTipsLoopListItemWidget*> RecycleItems; // 0x300(0x10)
	struct TArray<struct UKillTipsLoopListItemWidget*> TempRemoveItems; // 0x310(0x10)

	void PushNewTips(struct FKillTipsViewData TipData); // Function DFMGameHud.KillTipsLoopListWidget.PushNewTips // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.KillTipWidgetView
// Size: 0x2a0 (Inherited: 0x298)
class UKillTipWidgetView : public UUserWidget {
public:

	struct UTextBlock* NameText; // 0x298(0x08)

	void BPShow(); // Function DFMGameHud.KillTipWidgetView.BPShow // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.LowHealthScreenEffectHUD
// Size: 0x3d0 (Inherited: 0x388)
class ULowHealthScreenEffectHUD : public UBaseUIView {
public:

	char pad_388[0x8]; // 0x388(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x390(0x08)
	struct UWidget* UIMeshWidget_58; // 0x398(0x08)
	struct UWidget* UIMeshWidget; // 0x3a0(0x08)
	float DeductFadeTime; // 0x3a8(0x04)
	float AddFadeTime; // 0x3ac(0x04)
	struct AGPCharacter* GPCharacter; // 0x3b0(0x08)
	char pad_3B8[0x18]; // 0x3b8(0x18)

	void OnMatchOver(enum class EMatchOverReason& MatchOverReason); // Function DFMGameHud.LowHealthScreenEffectHUD.OnMatchOver // (Final|Native|Protected|HasOutParms) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.LowHealthScreenEffectController
// Size: 0x150 (Inherited: 0x148)
class ULowHealthScreenEffectController : public UScreenEffectControllerBase {
public:

	struct TWeakObjectPtr<struct UBaseUIView> CacheLowHealthScreenUI; // 0x148(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.LuaItemData
// Size: 0x38 (Inherited: 0x30)
class ULuaItemData : public UObject {
public:

	int32_t Idx; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.LuaHudHelperLibrary
// Size: 0x30 (Inherited: 0x30)
class ULuaHudHelperLibrary : public UObject {
public:


	void STATIC_SetPositionWithAlignment(struct UWidget* Widget, struct UWidget* AlignmentWidget, struct FVector2D AlignmentCoordinate); // Function DFMGameHud.LuaHudHelperLibrary.SetPositionWithAlignment // (Final|Native|Static|Public|HasDefaults) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MainBodyHUDView
// Size: 0x3b8 (Inherited: 0x388)
class UMainBodyHUDView : public UBaseUIView {
public:

	struct UUserWidget* HeadPart; // 0x388(0x08)
	struct UUserWidget* ThoraxPart; // 0x390(0x08)
	struct UUserWidget* LeftArmPart; // 0x398(0x08)
	struct UUserWidget* RightArmPart; // 0x3a0(0x08)
	struct UUserWidget* LeftLegPart; // 0x3a8(0x08)
	struct UUserWidget* RightLegPart; // 0x3b0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MapItemProgressWidget
// Size: 0x2b8 (Inherited: 0x298)
class UMapItemProgressWidget : public UUserWidget {
public:

	struct UImage* DFImage_Progress; // 0x298(0x08)
	struct UMaterialInstanceDynamic* MaterialInstanceDynamic; // 0x2a0(0x08)
	char pad_2A8[0x10]; // 0x2a8(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MapLocationNameViewController
// Size: 0x3e0 (Inherited: 0x290)
class UMapLocationNameViewController : public UMapIconViewController {
public:

	char pad_290[0x150]; // 0x290(0x150)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MapMarkerEngineerCarViewController
// Size: 0x2c0 (Inherited: 0x290)
class UMapMarkerEngineerCarViewController : public UMapIconViewController {
public:

	int32_t PlayerNum; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	uint64_t PlayerUin; // 0x298(0x08)
	bool bIsLocalPlayer; // 0x2a0(0x01)
	bool bOnVehicleOperate; // 0x2a1(0x01)
	char pad_2A2[0x6]; // 0x2a2(0x06)
	struct UMapItemHUDView* MapItemHUDView; // 0x2a8(0x08)
	struct AGPPlayerState* GPPlayerState; // 0x2b0(0x08)
	char pad_2B8[0x8]; // 0x2b8(0x08)

	void OnVehicleOperate(bool On, struct AActor* Actor, struct ACHARACTER* CHARACTER); // Function DFMGameHud.MapMarkerEngineerCarViewController.OnVehicleOperate // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MarkWindowHUDIconView_Decipher
// Size: 0x320 (Inherited: 0x298)
class UMarkWindowHUDIconView_Decipher : public UUserWidget {
public:

	struct UTextBlock* UpDistText; // 0x298(0x08)
	struct UTextBlock* DistText; // 0x2a0(0x08)
	struct UCanvasPanel* ArrowRotation; // 0x2a8(0x08)
	struct UImage* IconImage; // 0x2b0(0x08)
	float InitOffsetAngle; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct UImage* Image_Base; // 0x2c0(0x08)
	struct UImage* Image_Process; // 0x2c8(0x08)
	bool bJumpMarkerMngTest; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct AActor* TrackedActor; // 0x2d8(0x08)
	struct FVector2D AnchorCenterOffset; // 0x2e0(0x08)
	char pad_2E8[0x18]; // 0x2e8(0x18)
	struct UMapInfoSystem* MapInfoSystem; // 0x300(0x08)
	struct AGPMarkerManager* MarkerMng; // 0x308(0x08)
	struct TArray<struct AActor*> ShowMarkerDeciphers; // 0x310(0x10)

	void OnDecipherMarkerTypeChanged(struct AActor* MarkedActor, uint64_t ActorID, enum class EMarkerCoordinatedType markerType); // Function DFMGameHud.MarkWindowHUDIconView_Decipher.OnDecipherMarkerTypeChanged // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MarkWindowHUDView
// Size: 0x1270 (Inherited: 0x388)
class UMarkWindowHUDView : public UBaseUIView {
public:

	struct APlayerCameraManager* PlayerCamMgr; // 0x388(0x08)
	struct ADFMPlayerController* PlayerController; // 0x390(0x08)
	char pad_398[0x8]; // 0x398(0x08)
	struct UDFMBattleFieldSystem* GPBattleFieldSystem; // 0x3a0(0x08)
	struct ADFMMarkerManager* MarkerManager; // 0x3a8(0x08)
	int32_t PreCreateNum_Common; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct TArray<struct USOLScreenMarkerCommon*> PreCreatedCommonMarkIconList; // 0x3b8(0x10)
	int32_t PreCreateNum_QuestTrackIcon; // 0x3c8(0x04)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct TArray<struct UMarkWindowHUDIconView*> PreCreatedQuestMarkIconList; // 0x3d0(0x10)
	struct TArray<struct UMarkWindowHUDIconView*> PreCreatedContractMarkIconList; // 0x3e0(0x10)
	int32_t PreCreateNum_Contract; // 0x3f0(0x04)
	int32_t PreCreateNum_Decipher; // 0x3f4(0x04)
	struct TArray<struct UMarkWindowHUDIconView_Decipher*> PreCreatedDecipherMarkIconList; // 0x3f8(0x10)
	struct UCanvasPanel* MarkPanel; // 0x408(0x08)
	struct UCanvasPanel* MarkPanelLayer0; // 0x410(0x08)
	struct UCanvasPanel* MarkPanelLayer1; // 0x418(0x08)
	float SafeRatio; // 0x420(0x04)
	float MaxIconSize; // 0x424(0x04)
	bool bEnable3DAim; // 0x428(0x01)
	char pad_429[0x3]; // 0x429(0x03)
	float AimAngleThreshold; // 0x42c(0x04)
	struct FVector2D ScreenOffset; // 0x430(0x08)
	struct TArray<float> EdgePadding; // 0x438(0x10)
	struct UClass* SOLScreenMarkerCommonWidgetClass; // 0x448(0x08)
	struct UClass* QuestTrackIconWidget; // 0x450(0x08)
	struct UClass* ContractTrackIconWidget; // 0x458(0x08)
	char pad_460[0xa6c]; // 0x460(0xa6c)
	float LocalPlayerItemOpacity; // 0xecc(0x04)
	float TeammateItemOpacity; // 0xed0(0x04)
	float LocalCharAimingItemOpacity; // 0xed4(0x04)
	bool bEnableSmooth; // 0xed8(0x01)
	char pad_ED9[0x3]; // 0xed9(0x03)
	float SmoothAlpha; // 0xedc(0x04)
	struct TMap<struct UWidget*, struct FVector2D> IconItemSmoothScreenMap; // 0xee0(0x50)
	char pad_F30[0x60]; // 0xf30(0x60)
	struct TMap<struct FName, struct USOLScreenMarkerCommon*> SOLScreenMarkerCache; // 0xf90(0x50)
	struct TArray<struct USOLScreenMarkerCommon*> SOLScreenMarkerArr; // 0xfe0(0x10)
	char pad_FF0[0x50]; // 0xff0(0x50)
	struct TMap<struct FName, struct UMarkWindowHUDIconView*> QuestMarkWindowHUDMap; // 0x1040(0x50)
	struct TMap<struct FName, struct UUserWidget*> QuestScreenMarkerCache; // 0x1090(0x50)
	char pad_10E0[0x50]; // 0x10e0(0x50)
	struct TArray<struct UMarkWindowHUDIconView*> FreeQuestMarkIconList; // 0x1130(0x10)
	struct UClass* DecipherMarkerIconWidgetClass; // 0x1140(0x08)
	struct TMap<struct FName, struct UMarkWindowHUDIconView_Decipher*> DecipherMarkIconMap; // 0x1148(0x50)
	struct TArray<struct UMarkWindowHUDIconView_Decipher*> FreeDecipherMarkArr; // 0x1198(0x10)
	char pad_11A8[0x60]; // 0x11a8(0x60)
	bool bDebugDraw; // 0x1208(0x01)
	char pad_1209[0x5b]; // 0x1209(0x5b)
	bool bHideTeamMateSignWhenLocalMarked; // 0x1264(0x01)
	char pad_1265[0xb]; // 0x1265(0x0b)

	void UpdateAimMarkerToMarkerManeger(); // Function DFMGameHud.MarkWindowHUDView.UpdateAimMarkerToMarkerManeger // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MatchObserverMainItem
// Size: 0x2b0 (Inherited: 0x298)
class UMatchObserverMainItem : public UUserWidget {
public:

	struct UDFTextBlock* DFTextBlockNum; // 0x298(0x08)
	struct UDFTextBlock* DFTextBlockDesc; // 0x2a0(0x08)
	struct UDFImage* DFImageDelimiter; // 0x2a8(0x08)

	void UpdateItemInfo(struct FString Num, struct FString Desc); // Function DFMGameHud.MatchObserverMainItem.UpdateItemInfo // (Final|Native|Public|Const) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MatchObserverMainView
// Size: 0x4b0 (Inherited: 0x388)
class UMatchObserverMainView : public UBaseUIView {
public:

	struct UDFCanvasPanel* CurrentTeamStatPanel; // 0x388(0x08)
	struct UDFTextBlock* TxtTeamName; // 0x390(0x08)
	struct UDFTextBlock* TxtTeamKillNums; // 0x398(0x08)
	struct UDFTextBlock* TxtTeamInventoryValue; // 0x3a0(0x08)
	struct UDFImage* ImgCurrentTeamColor; // 0x3a8(0x08)
	struct UDFCanvasPanel* CurrentPlayerStatPanel; // 0x3b0(0x08)
	struct UDFTextBlock* TxtPlayerKillNums; // 0x3b8(0x08)
	struct UDFTextBlock* TxtPlayerInventoryValue; // 0x3c0(0x08)
	struct UMatchObserverMainItem* TeamRemainNumsItem; // 0x3c8(0x08)
	struct UMatchObserverMainItem* PlayerRemainNumsItem; // 0x3d0(0x08)
	struct UDFCanvasPanel* PendingSpectatorPlayerPanel; // 0x3d8(0x08)
	struct UDFTextBlock* TxtPendingSpectatorPlayerName; // 0x3e0(0x08)
	struct UHDKeyIconBoxWidget* WBP_CommonKeyIconBox_LeftMouse; // 0x3e8(0x08)
	struct UUserWidget* TeamListPanel; // 0x3f0(0x08)
	struct UDFVerticalBox* TeamList; // 0x3f8(0x08)
	struct FText TeamRemainNumsDesc; // 0x400(0x18)
	struct FText PlayerRemainNumsDesc; // 0x418(0x18)
	float TickInterval; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UClass* OBTeamItemClass; // 0x438(0x08)
	char pad_440[0x18]; // 0x440(0x18)
	struct TMap<int32_t, struct UObserverTeamInfoItemView*> OBTeamItem; // 0x458(0x50)
	float TimeSinceLastTick; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)

	void UpdateObservingCheckBox(); // Function DFMGameHud.MatchObserverMainView.UpdateObservingCheckBox // (Final|Native|Public|Const) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MiniManView
// Size: 0x530 (Inherited: 0x388)
class UMiniManView : public UBaseUIView {
public:

	struct USpineWidget* MiniMan; // 0x388(0x08)
	struct UGPAttributeSetHealth* AttributeSet; // 0x390(0x08)
	struct ADFMCharacter* DFMCharacter; // 0x398(0x08)
	struct UButton* ShowDetailBtn; // 0x3a0(0x08)
	struct UImage* SoundImg; // 0x3a8(0x08)
	struct TMap<enum class ESoundWaveSourceType, struct FSoundWaveInfo> SoundWaveInfoMap; // 0x3b0(0x50)
	float DeltaWaveValue; // 0x400(0x04)
	struct FLinearColor Color_1; // 0x404(0x10)
	struct FLinearColor Color_2; // 0x414(0x10)
	struct FLinearColor Color_3; // 0x424(0x10)
	struct FLinearColor Color_4; // 0x434(0x10)
	struct FLinearColor Color_5; // 0x444(0x10)
	struct FLinearColor Color_6; // 0x454(0x10)
	struct FLinearColor GlintColor; // 0x464(0x10)
	float MiniManTickingResetTime; // 0x474(0x04)
	float SpeedForColorChange; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct TMap<enum class ECharacterPart, struct FMinimanBodyPart> BodyParts; // 0x480(0x50)
	float TotalGlintTime; // 0x4d0(0x04)
	char pad_4D4[0x4c]; // 0x4d4(0x4c)
	struct FLinearColor CurrWaveColor; // 0x520(0x10)

	void UpdateBpCharacterPose(struct FString CharacterStateName); // Function DFMGameHud.MiniManView.UpdateBpCharacterPose // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MiniMapHUDView_Compasses
// Size: 0x2c0 (Inherited: 0x298)
class UMiniMapHUDView_Compasses : public UUserWidget {
public:

	struct UCanvasPanel* DFCanvasPanel_1; // 0x298(0x08)
	struct UTextBlock* DFTextBlock_North; // 0x2a0(0x08)
	struct UTextBlock* DFTextBlock_East; // 0x2a8(0x08)
	struct UTextBlock* DFTextBlock_South; // 0x2b0(0x08)
	struct UTextBlock* DFTextBlock_West; // 0x2b8(0x08)

	void BP_CompassesVisibleType(int32_t InType); // Function DFMGameHud.MiniMapHUDView_Compasses.BP_CompassesVisibleType // (Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MiniMapHUDView_Dangerous
// Size: 0x2b8 (Inherited: 0x298)
class UMiniMapHUDView_Dangerous : public UUserWidget {
public:

	char pad_298[0x10]; // 0x298(0x10)
	struct UDFRadialImage* DFRadialImage_1; // 0x2a8(0x08)
	struct UGPTweenFloat* PercentTween; // 0x2b0(0x08)

	void SetHide(); // Function DFMGameHud.MiniMapHUDView_Dangerous.SetHide // (Final|Native|Public) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameHud.MiniMapHUDView_MapTips
// Size: 0x310 (Inherited: 0x298)
class UMiniMapHUDView_MapTips : public UUserWidget {
public:

	char pad_298[0x8]; // 0x298(0x08)
	struct TMap<struct FString, struct UWidgetAnimation*> AnimationMap; // 0x2a0(0x50)
	struct UWidgetAnimation* AnimaIn; // 0x2f0(0x08)
	struct UWidgetAnimation* AnimaOut; // 0x2f8(0x08)
	float DefaultDisplayDuration; // 0x300(0x04)
	char pad_304[0xc]; // 0x304(0x0c)

