
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Class DFMGameplay.DFMAbilityThrowBlockingBaseActor
// Size: 0x388 (Inherited: 0x378)
class ADFMAbilityThrowBlockingBaseActor : public AActor {
public:

	char pad_378[0x10]; // 0x378(0x10)

	void SetIsBurning(); // Function DFMGameplay.DFMAbilityThrowBlockingBaseActor.SetIsBurning // (Native|Public) // @ game+0xbcc1a0
	void DoCustomDestroy(struct TArray<struct FOverlapResult>& Overlaps); // Function DFMGameplay.DFMAbilityThrowBlockingBaseActor.DoCustomDestroy // (Native|Public|HasOutParms) // @ game+0x62384b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.StingerMissileProjectileMovementComponent
// Size: 0x5f0 (Inherited: 0x5c0)
class UStingerMissileProjectileMovementComponent : public UGPWeaponProjectileMovementComponent {
public:

	char pad_5C0[0xd]; // 0x5c0(0x0d)
	bool bSimpleMove; // 0x5cd(0x01)
	bool bIsSimulated; // 0x5ce(0x01)
	char pad_5CF[0x1]; // 0x5cf(0x01)
	struct FStingerMissileMovementParam MovementParam; // 0x5d0(0x18)
	char pad_5E8[0x8]; // 0x5e8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ItemPreviewActor
// Size: 0x450 (Inherited: 0x378)
class AItemPreviewActor : public AActor {
public:

	float StepbackDistance; // 0x378(0x04)
	bool IgnoreCharacter; // 0x37c(0x01)
	char pad_37D[0x3]; // 0x37d(0x03)
	float PreviewLocInterpSpeed; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct TArray<struct UClass*> UnLocateObjectClass; // 0x388(0x10)
	char pad_398[0x38]; // 0x398(0x38)
	struct UPrimitiveComponent* PrimComp; // 0x3d0(0x08)
	struct USkeletalMeshComponent* CacheSkeMeshComp; // 0x3d8(0x08)
	struct UStaticMeshComponent* CacheStaticMeshComp; // 0x3e0(0x08)
	char pad_3E8[0x68]; // 0x3e8(0x68)

	void LocationValidChange(bool Valid); // Function DFMGameplay.ItemPreviewActor.LocationValidChange // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_GPAudioBase
// Size: 0x48 (Inherited: 0x40)
class UAnimNotify_GPAudioBase : public UAnimNotify {
public:

	enum class EGPAnimNotifyType AnimNotifyType; // 0x40(0x01)
	bool bOnlyAsMark; // 0x41(0x01)
	enum class EGPAudioBlueprintType AudioTypeOverride; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ActionScheduleComponent
// Size: 0x148 (Inherited: 0x100)
class UActionScheduleComponent : public UActorComponent {
public:

	struct AAIController* Controller; // 0x100(0x08)
	struct FActionScheduler ActionScheduler; // 0x108(0x40)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTask_ActionBase
// Size: 0x80 (Inherited: 0x78)
class UBTask_ActionBase : public UBTTaskNode {
public:

	struct UAction* Action; // 0x78(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AddAmbientLightFatorVolumeActor
// Size: 0x3d0 (Inherited: 0x378)
class AAddAmbientLightFatorVolumeActor : public AActor {
public:

	struct UBoxComponent* CollisionBox; // 0x378(0x08)
	struct FName AmbientLightGroupName; // 0x380(0x08)
	struct FName AmbientLightGroupNameHD; // 0x388(0x08)
	bool bUseAmbientLightParms; // 0x390(0x01)
	char pad_391[0x3]; // 0x391(0x03)
	struct FCharacterAmbientLightParms VolumeAddLightFator; // 0x394(0x1c)
	struct FCharacterAmbientLightParms VolumeAddLightFatorHD; // 0x3b0(0x1c)
	char pad_3CC[0x4]; // 0x3cc(0x04)

	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.AddAmbientLightFatorVolumeActor.OnEndOverlap // (Final|Native|Public) // @ game+0x61c1920
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AddAmbientLightFatorVolumeActor.OnBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x61c1610
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AdjutantNoticeActor
// Size: 0x440 (Inherited: 0x378)
class AAdjutantNoticeActor : public AActor {
public:

	struct FAdjutantInfo AdjutantInfo; // 0x378(0x28)
	struct FText AdjutantKilledTips; // 0x3a0(0x18)
	float AdjutantKilledTipsShowTime; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct FText AdjutantShowTips; // 0x3c0(0x18)
	float AdjutantShowTipsShowTime; // 0x3d8(0x04)
	float AdjutantShowRange; // 0x3dc(0x04)
	struct FName ShowAdjutantBornVO; // 0x3e0(0x08)
	struct FName KillAdjutantWithActivityVO; // 0x3e8(0x08)
	struct FName KillAdjutantWithoutActivityVO; // 0x3f0(0x08)
	float MaxCheckTime; // 0x3f8(0x04)
	float CheckFrequencyTime; // 0x3fc(0x04)
	struct TArray<struct FString> AdjutantActivityGoalIdStrArray; // 0x400(0x10)
	struct FString AdjutantAITargetName; // 0x410(0x10)
	struct FName AdjutantNameID; // 0x420(0x08)
	bool bLoadedAllControllerClassEnd; // 0x428(0x01)
	bool bSOLStartMatchInfoHUDShowEnd; // 0x429(0x01)
	char pad_42A[0x2]; // 0x42a(0x02)
	float StartCheckTime; // 0x42c(0x04)
	struct UAdjutantLocationViewController* AdjutantLocationViewController; // 0x430(0x08)
	struct UMapItemRangeViewController* RangeViewController; // 0x438(0x08)

	void ShowAdjutantMapInfo(); // Function DFMGameplay.AdjutantNoticeActor.ShowAdjutantMapInfo // (Final|Native|Private) // @ game+0x61c6330
	void SetNeedShowAdjutantInfo(); // Function DFMGameplay.AdjutantNoticeActor.SetNeedShowAdjutantInfo // (Final|Native|Public) // @ game+0x61c6310
	void ServerShowSubtitleSequence(struct AGPCharacter* CHARACTER, struct FName& SubtitleId); // Function DFMGameplay.AdjutantNoticeActor.ServerShowSubtitleSequence // (Final|Native|Private|HasOutParms|Const) // @ game+0x61c61c0
	void ServerShowAdjutantKilledTips(struct AGPCharacter* CHARACTER); // Function DFMGameplay.AdjutantNoticeActor.ServerShowAdjutantKilledTips // (Final|Native|Private|Const) // @ game+0x61c6140
	void OnRep_AdjutantInfo(); // Function DFMGameplay.AdjutantNoticeActor.OnRep_AdjutantInfo // (Final|Native|Private) // @ game+0x61c5f80
	void OnPlayerKilledServerNotify(struct FKillInfo& NewAddKillInfo, struct UGPModularWeaponDesc* Desc); // Function DFMGameplay.AdjutantNoticeActor.OnPlayerKilledServerNotify // (Final|Native|Private|HasOutParms) // @ game+0x61c5e80
	void OnLoadedAllControllerClass(); // Function DFMGameplay.AdjutantNoticeActor.OnLoadedAllControllerClass // (Final|Native|Private) // @ game+0x61c5e60
	struct ABaseHUD* GetHUD(); // Function DFMGameplay.AdjutantNoticeActor.GetHUD // (Final|Native|Private) // @ game+0x61c5c30
	void CheckStartMatchInfo(); // Function DFMGameplay.AdjutantNoticeActor.CheckStartMatchInfo // (Final|Native|Private) // @ game+0x61c58d0
	void CheckIfHasAdjutantActivity(); // Function DFMGameplay.AdjutantNoticeActor.CheckIfHasAdjutantActivity // (Final|Native|Private) // @ game+0x61c58b0
	bool CheckAdjutantActivityValid(struct AGPPlayerController* GPPlayerController); // Function DFMGameplay.AdjutantNoticeActor.CheckAdjutantActivityValid // (Final|Native|Private|Const) // @ game+0x61c5820
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AdjutantNoticeSpawner
// Size: 0x3b0 (Inherited: 0x378)
class AAdjutantNoticeSpawner : public AActor {
public:

	struct UClass* AdjutantNoticeActorToSpawn; // 0x378(0x08)
	struct TArray<struct FString> AdjutantActivityGoalIdStrArray; // 0x380(0x10)
	struct FString AdjutantAITargetName; // 0x390(0x10)
	struct FName AdjutantNameID; // 0x3a0(0x08)
	char pad_3A8[0x8]; // 0x3a8(0x08)

	struct AAdjutantNoticeActor* SpawnAdjutantNoticeActor(); // Function DFMGameplay.AdjutantNoticeSpawner.SpawnAdjutantNoticeActor // (Final|Native|Private|Const) // @ game+0x61c6350
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AerialVehicle
// Size: 0x430 (Inherited: 0x400)
class AAerialVehicle : public ADefaultPawn {
public:

	/*struct FMulticastInlineDelegate*/char OnDied[0x10]; // 0x400(0x10)
	struct UGPTeamComponent* TeamComp; // 0x410(0x08)
	struct UAerialVehicleHealthComponent* HealthComp; // 0x418(0x08)
	bool bIsAlive; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct USkeletalMeshComponent* Mesh; // 0x428(0x08)

	void OnDead(); // Function DFMGameplay.AerialVehicle.OnDead // (Native|Public) // @ game+0x128b6d0
	void BPOnDead(); // Function DFMGameplay.AerialVehicle.BPOnDead // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AerialVehicleHealthComponent
// Size: 0x160 (Inherited: 0x100)
class UAerialVehicleHealthComponent : public UActorComponent {
public:

	bool bIsDead; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float CurrentHealth; // 0x104(0x04)
	bool bIsInvincible; // 0x108(0x01)
	char pad_109[0x3]; // 0x109(0x03)
	float MaxHealth; // 0x10c(0x04)
	struct TMap<enum class EWeaponItemType, float> DamageScaling; // 0x110(0x50)

	void SetHP(float HP); // Function DFMGameplay.AerialVehicleHealthComponent.SetHP // (Final|Native|Public) // @ game+0x61c6290
	void OnRep_OnHealthChange(); // Function DFMGameplay.AerialVehicleHealthComponent.OnRep_OnHealthChange // (Final|Native|Protected) // @ game+0x61c5fa0
	bool IsDead(); // Function DFMGameplay.AerialVehicleHealthComponent.IsDead // (Final|Native|Public|Const) // @ game+0x35f6f20
	float GetHP(); // Function DFMGameplay.AerialVehicleHealthComponent.GetHP // (Final|Native|Public) // @ game+0x61c5c10
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AI3AnimMetaData
// Size: 0x48 (Inherited: 0x30)
class UAI3AnimMetaData : public UAnimMetaData {
public:

	bool bLoop; // 0x30(0x01)
	bool bStop; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
	struct TArray<struct FAnimPathMoveSegment> MoveSegments; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AICharacterAnimSnapshotManager
// Size: 0x90 (Inherited: 0x38)
class UAICharacterAnimSnapshotManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x58]; // 0x38(0x58)

	bool GetBoneTransform(struct FName ConfigName, enum class EGPCharacterPoseStateType Pose, enum class EGPCharacterFightStateType FightState, struct FName BoneName, struct FTransform& OutTransform); // Function DFMGameplay.AICharacterAnimSnapshotManager.GetBoneTransform // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x61c59e0
	enum class EGPCharacterPoseStateType STATIC_GetAICharacterSnapShotPoseType(struct ADFMAICharacter* InAICharacter); // Function DFMGameplay.AICharacterAnimSnapshotManager.GetAICharacterSnapShotPoseType // (Final|Native|Static|Public) // @ game+0x61c5930
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AICharacterSignificanceStrategyInterface
// Size: 0x30 (Inherited: 0x30)
class UAICharacterSignificanceStrategyInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AICoordinator
// Size: 0x580 (Inherited: 0x378)
class AAICoordinator : public ALevelSubsystem {
public:

	struct TMap<enum class ESkillType, float> SkillCoolTime; // 0x378(0x50)
	struct TMap<struct ADFMCharacter*, float> LastSkillTime; // 0x3c8(0x50)
	struct FAICoordinatorConfig CoordinatorConfig; // 0x418(0xe0)
	struct UClass* AIGroupClass; // 0x4f8(0x08)
	struct AAIJobManager* AIJobManager; // 0x500(0x08)
	struct TArray<struct UAISearchJob*> SearchJobs; // 0x508(0x10)
	struct TArray<struct UAIPatrolJob*> PatrolJobs; // 0x518(0x10)
	struct TArray<struct UAIDashJob*> DashJobs; // 0x528(0x10)
	struct TArray<struct UAIInvestigateJob*> InvestigateJobs; // 0x538(0x10)
	float ThreatBroadcastDistance; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct TArray<struct AAIPatrolArea*> PatrolAreas; // 0x550(0x10)
	struct UPvPBotPlayerMoniter* PlayerMonitor; // 0x560(0x08)
	struct UAIMapSearch* MapSearch; // 0x568(0x08)
	struct UGroupAISystem* GroupAISystem; // 0x570(0x08)
	struct UAIStyleSystem* AIStyleSystem; // 0x578(0x08)

	struct AAICoordinator* STATIC_Instance(struct UObject* WorldContextObj); // Function DFMGameplay.AICoordinator.Instance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61c5c60
	struct UGroupAISystem* GetGroupAISystem(); // Function DFMGameplay.AICoordinator.GetGroupAISystem // (Final|Native|Public|BlueprintCallable) // @ game+0x61c5be0
	struct UAIStyleSystem* GetAIStyleSystem(); // Function DFMGameplay.AICoordinator.GetAIStyleSystem // (Final|Native|Public|BlueprintCallable) // @ game+0x61c59b0
	bool CanBeAttackBySkill(struct ADFMCharacter* Player, enum class ESkillType SkillType); // Function DFMGameplay.AICoordinator.CanBeAttackBySkill // (Final|Native|Public|BlueprintCallable) // @ game+0x61c5760
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.PvPBotPlayerMoniter
// Size: 0x80 (Inherited: 0x30)
class UPvPBotPlayerMoniter : public UObject {
public:

	char pad_30[0x50]; // 0x30(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIMapSearch
// Size: 0x70 (Inherited: 0x30)
class UAIMapSearch : public UObject {
public:

	char pad_30[0x40]; // 0x30(0x40)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIDashJob
// Size: 0x70 (Inherited: 0x58)
class UAIDashJob : public UAIJob {
public:

	struct AActor* DashTarget; // 0x58(0x08)
	char pad_60[0x10]; // 0x60(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DashJobFilter
// Size: 0x30 (Inherited: 0x30)
class UDashJobFilter : public UJobFilterBase {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIDebugConfig
// Size: 0x48 (Inherited: 0x40)
class UAIDebugConfig : public UDeveloperSettings {
public:

	bool EnableDebugDrawAITrace; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIFlameDetectorActor
// Size: 0x430 (Inherited: 0x378)
class AAIFlameDetectorActor : public AActor {
public:

	float Speed; // 0x378(0x04)
	float SpeedDelay; // 0x37c(0x04)
	float SpreadDelay; // 0x380(0x04)
	float DelayStopTime; // 0x384(0x04)
	char pad_388[0x8]; // 0x388(0x08)
	struct FTransform TransOffset; // 0x390(0x30)
	char pad_3C0[0x4]; // 0x3c0(0x04)
	struct FVector TargetLocation; // 0x3c4(0x0c)
	char pad_3D0[0x18]; // 0x3d0(0x18)
	struct UFXResourceContainerComponent* FlameShortSeg; // 0x3e8(0x08)
	struct UFXResourceContainerComponent* FlameLongSeg; // 0x3f0(0x08)
	char pad_3F8[0x20]; // 0x3f8(0x20)
	struct UActorComponent* FlameCom; // 0x418(0x08)
	char pad_420[0x10]; // 0x420(0x10)

	void StopEffectInternal(); // Function DFMGameplay.AIFlameDetectorActor.StopEffectInternal // (Final|Native|Private) // @ game+0x61c63a0
	void StopEffect(); // Function DFMGameplay.AIFlameDetectorActor.StopEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x61c6380
	void PlayEffectInternal(); // Function DFMGameplay.AIFlameDetectorActor.PlayEffectInternal // (Final|Native|Private) // @ game+0x61c5fe0
	void PlayEffect(); // Function DFMGameplay.AIFlameDetectorActor.PlayEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x61c5fc0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIGroupDramaVoiceComponent
// Size: 0x238 (Inherited: 0x100)
class UAIGroupDramaVoiceComponent : public UActorComponent {
public:

	struct UDataTable* GroupDramaVoiceTable; // 0x100(0x08)
	struct UDFMSpeakComponent* SpeakComponent; // 0x108(0x08)
	char pad_110[0x128]; // 0x110(0x128)

	bool PlayGroupDramaVoice(struct FName RowName, struct FName Type); // Function DFMGameplay.AIGroupDramaVoiceComponent.PlayGroupDramaVoice // (Final|Native|Public|BlueprintCallable) // @ game+0x61c6000
	void OnCharacterDied(struct AGPCharacterBase* InCharacter, struct AController* Killer, struct UDamageType* DamageType); // Function DFMGameplay.AIGroupDramaVoiceComponent.OnCharacterDied // (Final|Native|Private) // @ game+0x61c5d60
	void OnCharacterDestroyed(struct AActor* SpawnedActor); // Function DFMGameplay.AIGroupDramaVoiceComponent.OnCharacterDestroyed // (Final|Native|Private) // @ game+0x61c5ce0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIGroupSpawnerBase
// Size: 0x390 (Inherited: 0x378)
class AAIGroupSpawnerBase : public AGPSpawnerBase {
public:

	/*struct FMulticastInlineDelegate*/char OnSpawnEnd[0x10]; // 0x378(0x10)
	bool bAlreadySpawned; // 0x388(0x01)
	char pad_389[0x7]; // 0x389(0x07)

	void StartSpawn(); // Function DFMGameplay.AIGroupSpawnerBase.StartSpawn // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	struct TArray<struct AAIGroup*> GetSpawnedGroupList(); // Function DFMGameplay.AIGroupSpawnerBase.GetSpawnedGroupList // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	struct TArray<struct APawn*> GetSpawnedActorList(); // Function DFMGameplay.AIGroupSpawnerBase.GetSpawnedActorList // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void FireSpawnEnd(); // Function DFMGameplay.AIGroupSpawnerBase.FireSpawnEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x61c58f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIGroupSpawnerInterface
// Size: 0x30 (Inherited: 0x30)
class UAIGroupSpawnerInterface : public UInterface {
public:


	bool StartSpawn(); // Function DFMGameplay.AIGroupSpawnerInterface.StartSpawn // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void OnSpawnEnd_Broadcast(); // Function DFMGameplay.AIGroupSpawnerInterface.OnSpawnEnd_Broadcast // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xbd3040
	void OnActorDied_Broadcast(); // Function DFMGameplay.AIGroupSpawnerInterface.OnActorDied_Broadcast // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x9281d0
	struct TArray<struct FSpawnedActorInfo> GetSpawnedActorList(); // Function DFMGameplay.AIGroupSpawnerInterface.GetSpawnedActorList // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	struct AActor* GetFirstSpawnedActor(); // Function DFMGameplay.AIGroupSpawnerInterface.GetFirstSpawnedActor // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	int32_t GetCurrentActorNum(); // Function DFMGameplay.AIGroupSpawnerInterface.GetCurrentActorNum // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIHelicopterSteeringComponent
// Size: 0x2b0 (Inherited: 0x100)
class UAIHelicopterSteeringComponent : public UActorComponent {
public:

	char pad_100[0xd]; // 0x100(0x0d)
	bool bCollisonAvoidance; // 0x10d(0x01)
	bool bEnableDebugDrawPath; // 0x10e(0x01)
	char pad_10F[0x1]; // 0x10f(0x01)
	float MaxSpeed; // 0x110(0x04)
	float MaxAcceleration; // 0x114(0x04)
	float MaxAngularSpeed; // 0x118(0x04)
	float MaxAngularAcceleration; // 0x11c(0x04)
	float CrashRotateRate; // 0x120(0x04)
	struct FakeOrientationConf FakeOrientationConf; // 0x124(0x18)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct FRepVelocityData RepVelocityData; // 0x140(0x60)
	bool bDrawDebug; // 0x1a0(0x01)
	char pad_1A1[0x17]; // 0x1a1(0x17)
	struct FRepSteeringData DefaultSteeringData; // 0x1b8(0x14)
	char pad_1CC[0x4]; // 0x1cc(0x04)
	struct APawn* PawnOwner; // 0x1d0(0x08)
	struct UMeshComponent* Mesh; // 0x1d8(0x08)
	struct UPawnKinematic* Kinematic; // 0x1e0(0x08)
	struct UCollisonAvoidance* CollisonAvoidance; // 0x1e8(0x08)
	struct UPropertySteering* PropertySteering; // 0x1f0(0x08)
	struct UBlendSteering* RootSteering; // 0x1f8(0x08)
	struct UPathFollowSteering* PathFollowSteering; // 0x200(0x08)
	struct UCrashSteering* CrashSteering; // 0x208(0x08)
	struct UPropertySteering* FacePropertySteering; // 0x210(0x08)
	char pad_218[0x90]; // 0x218(0x90)
	bool bCrashed; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)

	void ServerSetSteeringData(struct FRepSteeringData InData); // Function DFMGameplay.AIHelicopterSteeringComponent.ServerSetSteeringData // (Final|Native|Public|BlueprintCallable) // @ game+0x61cc680
	void ServerRevertSteeringData(); // Function DFMGameplay.AIHelicopterSteeringComponent.ServerRevertSteeringData // (Final|Native|Public|BlueprintCallable) // @ game+0x61cc660
	void ResetPathFollowSteering(); // Function DFMGameplay.AIHelicopterSteeringComponent.ResetPathFollowSteering // (Final|Native|Public|BlueprintCallable) // @ game+0x61cc640
	void OnRepVelocityData(); // Function DFMGameplay.AIHelicopterSteeringComponent.OnRepVelocityData // (Final|Native|Public) // @ game+0x61cc600
	void DebugDrawPath(struct TArray<struct FVector> Points); // Function DFMGameplay.AIHelicopterSteeringComponent.DebugDrawPath // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x61cb520
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIInteractorComponent
// Size: 0x5a0 (Inherited: 0x580)
class UAIInteractorComponent : public USphereComponent {
public:

	struct TArray<enum class ECampType> CampType; // 0x580(0x10)
	char pad_590[0x10]; // 0x590(0x10)

	void OnPawnOut(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.AIInteractorComponent.OnPawnOut // (Native|Public) // @ game+0x61cc4c0
	void OnPawnEnter(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AIInteractorComponent.OnPawnEnter // (Native|Public|HasOutParms) // @ game+0x61cc2c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AILabAIJobManagerComponent
// Size: 0x138 (Inherited: 0x100)
class UAILabAIJobManagerComponent : public UActorComponent {
public:

	struct AAILabPlayerAIController* Controller; // 0x100(0x08)
	char pad_108[0x20]; // 0x108(0x20)
	struct APOITriggerActor* CurrPOI; // 0x128(0x08)
	char pad_130[0x8]; // 0x130(0x08)

	struct FVector GetCurrMoveTargetPosition(); // Function DFMGameplay.AILabAIJobManagerComponent.GetCurrMoveTargetPosition // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x61cb870
	enum class EAILabJobType GetAIJobType(struct ADFMCharacter* Cha); // Function DFMGameplay.AILabAIJobManagerComponent.GetAIJobType // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb670
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AILabConfManager
// Size: 0x80 (Inherited: 0x30)
class UAILabConfManager : public UObject {
public:

	char pad_30[0x50]; // 0x30(0x50)

	struct UAILabConfManager* STATIC_GetSingleton(struct UObject* WorldContextObject); // Function DFMGameplay.AILabConfManager.GetSingleton // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61cbf00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AILabSpawnArea
// Size: 0x498 (Inherited: 0x378)
class AAILabSpawnArea : public AActor {
public:

	struct UBoxComponent* TrigArea; // 0x378(0x08)
	struct UBoxComponent* SpawnArea; // 0x380(0x08)
	bool IsBanArea; // 0x388(0x01)
	bool IsActive; // 0x389(0x01)
	bool UseSpawnArea; // 0x38a(0x01)
	char pad_38B[0x1]; // 0x38b(0x01)
	int32_t DeliverStyle; // 0x38c(0x04)
	int32_t MaxTrigNum; // 0x390(0x04)
	int32_t CourseId; // 0x394(0x04)
	float TrigTimeSecs; // 0x398(0x04)
	char pad_39C[0xfc]; // 0x39c(0xfc)

	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.AILabSpawnArea.OnEndOverlap // (Final|Native|Public) // @ game+0x61cc180
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AILabSpawnArea.OnBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x61cbf80
	void ForceCreateAILab(int32_t Num); // Function DFMGameplay.AILabSpawnArea.ForceCreateAILab // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb5f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AILabSpawner
// Size: 0x3f8 (Inherited: 0x378)
class AAILabSpawner : public AActor {
public:

	struct ADFMCharacter* SpawnCharacter; // 0x378(0x08)
	int32_t AILabUin; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct FString NickName; // 0x388(0x10)
	int32_t AILabCampId; // 0x398(0x04)
	int32_t AILabTeamId; // 0x39c(0x04)
	struct TMap<int64_t, int32_t> AILabEquips; // 0x3a0(0x50)
	float DelaySpawnSecs; // 0x3f0(0x04)
	float AILabCurrecy; // 0x3f4(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AILabSpawnRuleBase
// Size: 0x620 (Inherited: 0x378)
class AAILabSpawnRuleBase : public AActor {
public:

	struct TArray<struct FAILabDeliverModel> DeliverModels; // 0x378(0x10)
	struct TArray<struct FAILabFullMapModel> FullMapModels; // 0x388(0x10)
	char pad_398[0x1d0]; // 0x398(0x1d0)
	struct TArray<struct AAILabSpawnArea*> SpawnAreas; // 0x568(0x10)
	char pad_578[0xa8]; // 0x578(0xa8)

	float GetPlayerNearExitDist(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetPlayerNearExitDist // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbe60
	float GetPlayerLastHurtTime(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetPlayerLastHurtTime // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbdc0
	float GetPlayerLastFireTime(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetPlayerLastFireTime // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbd20
	float GetPlayerHpRate(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetPlayerHpRate // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbc80
	bool GetPlayerBloody(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetPlayerBloody // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbbf0
	float GetPlayerArmRate(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetPlayerArmRate // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbb50
	float GetModelNoDeliverAssets(float TimeSecs); // Function DFMGameplay.AILabSpawnRuleBase.GetModelNoDeliverAssets // (Final|Native|Public|BlueprintCallable) // @ game+0x61cbac0
	float GetModelExtDeliverInterval(float TimeSecs); // Function DFMGameplay.AILabSpawnRuleBase.GetModelExtDeliverInterval // (Final|Native|Public|BlueprintCallable) // @ game+0x61cba30
	float GetModelDeliverTime(float TimeSecs); // Function DFMGameplay.AILabSpawnRuleBase.GetModelDeliverTime // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb9a0
	float GetModelDeliverInterval(float TimeSecs); // Function DFMGameplay.AILabSpawnRuleBase.GetModelDeliverInterval // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb910
	int32_t GetModelAINum(); // Function DFMGameplay.AILabSpawnRuleBase.GetModelAINum // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb8e0
	float GetModelAIDiffcult(); // Function DFMGameplay.AILabSpawnRuleBase.GetModelAIDiffcult // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb8b0
	struct FAILabFullMapModel GetCurTeamDeliverModel(struct ADFMCharacter* CHARACTER, int32_t CourseId); // Function DFMGameplay.AILabSpawnRuleBase.GetCurTeamDeliverModel // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb7a0
	struct FAILabDeliverModel GetCurDeliverModel(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.GetCurDeliverModel // (Final|Native|Public|BlueprintCallable) // @ game+0x61cb700
	bool BP_IfDeliverAILabForTeam(struct ADFMCharacter* CHARACTER, int32_t CourseId); // Function DFMGameplay.AILabSpawnRuleBase.BP_IfDeliverAILabForTeam // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb450
	bool BP_IfDeliverAILabForPlayer(struct ADFMCharacter* CHARACTER, float LastMoveTime); // Function DFMGameplay.AILabSpawnRuleBase.BP_IfDeliverAILabForPlayer // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb380
	float BP_GetSpawnInterval(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetSpawnInterval // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb2e0
	int32_t BP_GetFinalAILabDiffcult(float Index); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetFinalAILabDiffcult // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb250
	int32_t BP_GetAILabNum(float DiffIndex); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabNum // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb1c0
	bool BP_GetAILabLastIdle(struct ADFMCharacter* CHARACTER, float LastIdleTime); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabLastIdle // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb0f0
	bool BP_GetAILabLastHurt(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabLastHurt // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cb050
	bool BP_GetAILabLastFire(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabLastFire // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cafb0
	float BP_GetAILabKillScore(struct ADFMCharacter* CHARACTER, int32_t KillNum); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabKillScore // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61caee0
	float BP_GetAILabHpScore(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabHpScore // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cae40
	float BP_GetAILabDiffcult(struct ADFMCharacter* CHARACTER, int32_t KillNum); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabDiffcult // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cad70
	float BP_GetAILabBloodyScore(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabBloodyScore // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cacd0
	float BP_GetAILabArmScore(struct ADFMCharacter* CHARACTER); // Function DFMGameplay.AILabSpawnRuleBase.BP_GetAILabArmScore // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61cac30
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIMovePath
// Size: 0x440 (Inherited: 0x378)
class AAIMovePath : public AActor {
public:

	char pad_378[0x11]; // 0x378(0x11)
	bool bProjectToNavmesh; // 0x389(0x01)
	bool bSplineReverse; // 0x38a(0x01)
	char pad_38B[0x5]; // 0x38b(0x05)
	struct USplineComponent* Spline; // 0x390(0x08)
	char pad_398[0x20]; // 0x398(0x20)
	struct TArray<struct FVector> WayPoints; // 0x3b8(0x10)
	struct TArray<struct UAIPathLootPoint*> LootPoints; // 0x3c8(0x10)
	int32_t RandomWeight; // 0x3d8(0x04)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct FString OwnerPlayerStartPoint; // 0x3e0(0x10)
	struct TMap<int32_t, struct UAIPathLootPoint*> WayPointContainsLootPoint; // 0x3f0(0x50)

	struct TArray<struct FVector> GetWayPoint(); // Function DFMGameplay.AIMovePath.GetWayPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x61d3300
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPathLootPoint
// Size: 0x580 (Inherited: 0x570)
class UAIPathLootPoint : public UArrowComponent {
public:

	struct TArray<struct AActor*> NearlyLootPoints; // 0x570(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIMovePathManager
// Size: 0x88 (Inherited: 0x38)
class UAIMovePathManager : public UWorldSubsystem {
public:

	struct TMap<struct FString, struct FAIMovePathList> RegisteredPathGroupMap; // 0x38(0x50)

	struct UAIMovePathManager* STATIC_GetAIMovePathManager(struct UObject* WorldContextObject); // Function DFMGameplay.AIMovePathManager.GetAIMovePathManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x61d1b20
	struct TArray<struct AAIMovePath*> STATIC_FindMovePathByUniqueKey(struct UObject* WorldContextObject, struct FString Key); // Function DFMGameplay.AIMovePathManager.FindMovePathByUniqueKey // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x61d1940
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIGuardPoint
// Size: 0x580 (Inherited: 0x570)
class UAIGuardPoint : public UArrowComponent {
public:

	float GuardTime; // 0x570(0x04)
	float CoolDown; // 0x574(0x04)
	struct AAIController* GuardAI; // 0x578(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPatrolPath
// Size: 0x418 (Inherited: 0x378)
class AAIPatrolPath : public AActor {
public:

	char pad_378[0x11]; // 0x378(0x11)
	bool bProjectToNavmesh; // 0x389(0x01)
	bool bSplineReverse; // 0x38a(0x01)
	char pad_38B[0x5]; // 0x38b(0x05)
	struct USplineComponent* Spline; // 0x390(0x08)
	struct UTextRenderComponent* PathText; // 0x398(0x08)
	bool bBiDirection; // 0x3a0(0x01)
	char pad_3A1[0x3]; // 0x3a1(0x03)
	int32_t Capacity; // 0x3a4(0x04)
	bool bFullFill; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)
	struct UClass* FormationPatternClass; // 0x3b0(0x08)
	struct TArray<struct FVector> WayPoints; // 0x3b8(0x10)
	bool bUseForPathFollower; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct TArray<struct AActor*> PathFollowWayPoints; // 0x3d0(0x10)
	struct TArray<struct UAIGuardPoint*> GuardPoints; // 0x3e0(0x10)
	char pad_3F0[0x28]; // 0x3f0(0x28)

	struct TArray<struct FVector> GetWayPoint(); // Function DFMGameplay.AIPatrolPath.GetWayPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x61d3340
	struct UClass* GetFormationPatternClass(); // Function DFMGameplay.AIPatrolPath.GetFormationPatternClass // (Final|Native|Public|BlueprintCallable) // @ game+0x61d2220
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPatrolArea
// Size: 0x3b0 (Inherited: 0x378)
class AAIPatrolArea : public AActor {
public:

	char pad_378[0x10]; // 0x378(0x10)
	struct AAISpawnChecker* AISpawnChecker; // 0x388(0x08)
	int32_t Camp; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct TArray<struct FPathGroup> PatrolPathGroup; // 0x398(0x10)
	bool bDrawDebug; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPatrolJob
// Size: 0xc0 (Inherited: 0x58)
class UAIPatrolJob : public UAIJob {
public:

	struct ARecastNavMesh* NavMesh; // 0x58(0x08)
	struct AAIPatrolArea* PatrolArea; // 0x60(0x08)
	struct TMap<struct TWeakObjectPtr<struct AAIController>, struct FPatrolAIState> AIControllers; // 0x68(0x50)
	char pad_B8[0x8]; // 0xb8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.NewPatrolJob
// Size: 0xe0 (Inherited: 0x58)
class UNewPatrolJob : public UAIJob {
public:

	struct ADramaArea* DramaArea; // 0x58(0x08)
	struct TMap<struct TWeakObjectPtr<struct AAIController>, struct FNewPatrolState> AIControllers; // 0x60(0x50)
	struct TArray<struct FVector> WayPoints; // 0xb0(0x10)
	int32_t MaxPatrolNum; // 0xc0(0x04)
	float CoolDownTime; // 0xc4(0x04)
	float PathWidth; // 0xc8(0x04)
	int32_t DramaAreaCD; // 0xcc(0x04)
	int32_t DramaAreaSearchRadius; // 0xd0(0x04)
	struct FName DramaAreaTag; // 0xd4(0x08)
	char pad_DC[0x4]; // 0xdc(0x04)

	bool GetDestinationWithRandom(struct AAIController* AIController, struct FVector CurDestLocation, struct FVector& Dest); // Function DFMGameplay.NewPatrolJob.GetDestinationWithRandom // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x61d20f0
	bool GetDestination(struct AAIController* AIController, struct FVector& Dest); // Function DFMGameplay.NewPatrolJob.GetDestination // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x61d2010
	struct ADramaArea* FindDramaAreaOrJoin(struct AAIController* AIController, struct ADramaArea* CurDramaArea); // Function DFMGameplay.NewPatrolJob.FindDramaAreaOrJoin // (Final|Native|Public|BlueprintCallable) // @ game+0x61d1880
	struct UNewPatrolJob* STATIC_CreatePatrolJobByKP(struct ADramaArea* Area, struct TArray<struct FVector>& Keypoints); // Function DFMGameplay.NewPatrolJob.CreatePatrolJobByKP // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x61d1770
	struct UNewPatrolJob* STATIC_CreatePatrolJob(struct ADramaArea* Area); // Function DFMGameplay.NewPatrolJob.CreatePatrolJob // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61d16f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.NewGuardJob
// Size: 0xd0 (Inherited: 0x58)
class UNewGuardJob : public UAIJob {
public:

	struct TArray<struct UGuardPoint*> GuardPoints; // 0x58(0x10)
	struct ADramaArea* DramaArea; // 0x68(0x08)
	struct TMap<struct TWeakObjectPtr<struct AAIController>, struct FNewGuardState> AIControllers; // 0x70(0x50)
	int32_t MaxGuardNum; // 0xc0(0x04)
	float CoolDownTime; // 0xc4(0x04)
	char pad_C8[0x8]; // 0xc8(0x08)

	struct UGuardPoint* GetNextGruardPoint(struct AAIController* Controller); // Function DFMGameplay.NewGuardJob.GetNextGruardPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x61d2d40
	struct UNewGuardJob* STATIC_CreateGuardJob(struct ADramaArea* Area); // Function DFMGameplay.NewGuardJob.CreateGuardJob // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61d1670
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPersetMovePathManager
// Size: 0x98 (Inherited: 0x38)
class UAIPersetMovePathManager : public UWorldSubsystem {
public:

	struct TMap<struct FString, struct TWeakObjectPtr<struct AAIPresetMovePathGroup>> RegisteredPathGroupMap; // 0x38(0x50)
	char pad_88[0x10]; // 0x88(0x10)

	struct UAIPersetMovePathManager* STATIC_GetAIPresetMovePathManager(struct UObject* WorldContextObject); // Function DFMGameplay.AIPersetMovePathManager.GetAIPresetMovePathManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x61d6990
	struct AAIPresetMovePathGroup* STATIC_FindPresetPathGroupByUniqueKey(struct UObject* WorldContextObject, struct FString Key); // Function DFMGameplay.AIPersetMovePathManager.FindPresetPathGroupByUniqueKey // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x61d6830
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPresetMovePathGroup
// Size: 0x398 (Inherited: 0x378)
class AAIPresetMovePathGroup : public AActor {
public:

	struct FString PathGroupName; // 0x378(0x10)
	struct TArray<struct AAIPresetMovePathPoint*> MovePathGroupList; // 0x388(0x10)

	struct AAIPresetMovePathPoint* GetRandomGroupPoint(); // Function DFMGameplay.AIPresetMovePathGroup.GetRandomGroupPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x61d6b30
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIPresetMovePathPoint
// Size: 0x380 (Inherited: 0x378)
class AAIPresetMovePathPoint : public AActor {
public:

	int32_t PathGroupId; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirDropActor
// Size: 0x550 (Inherited: 0x378)
class AAirDropActor : public AActor {
public:

	struct UAirDropMovementComponent* MovementComponent; // 0x378(0x08)
	struct USceneComponent* root; // 0x380(0x08)
	struct USceneComponent* AttachedJoint; // 0x388(0x08)
	struct FSoftObjectPath CompletedAnimPath1; // 0x390(0x18)
	struct FSoftObjectPath CompletedSkeletalMeshPath1; // 0x3a8(0x18)
	struct FSoftObjectPath CompletedAnimPath2; // 0x3c0(0x18)
	struct FSoftObjectPath CompletedSkeletalMeshPath2; // 0x3d8(0x18)
	struct FName DecelerateEffectID; // 0x3f0(0x08)
	struct FName StopFlyingEffectID; // 0x3f8(0x08)
	struct FName LandingEffectID; // 0x400(0x08)
	struct UGPAudioEventAsset* StartLoopDropAudioEvent; // 0x408(0x08)
	struct UGPAudioEventAsset* StopLoopDropAudioEvent; // 0x410(0x08)
	struct UGPAudioEventAsset* StartFallAudioEvent; // 0x418(0x08)
	struct UGPAudioEventAsset* LandingAudioEvent; // 0x420(0x08)
	struct UGPSkeletalMeshComponent* GPSkeletalMeshComponent1; // 0x428(0x08)
	struct UGPSkeletalMeshComponent* GPSkeletalMeshComponent2; // 0x430(0x08)
	struct UGPSkeletalMeshComponent* GPSkeletalJointMeshComponent; // 0x438(0x08)
	struct UStaticMeshComponent* RopeMeshComponent1; // 0x440(0x08)
	struct UStaticMeshComponent* RopeMeshComponent2; // 0x448(0x08)
	struct UStaticMeshComponent* RopeMeshComponent3; // 0x450(0x08)
	struct UStaticMeshComponent* RopeMeshComponent4; // 0x458(0x08)
	struct TArray<struct UStaticMeshComponent*> RopeComponents; // 0x460(0x10)
	char pad_470[0x10]; // 0x470(0x10)
	float RopeLength; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct AActor* AttachedActor; // 0x488(0x08)
	bool bIsFlying; // 0x490(0x01)
	char pad_491[0x3]; // 0x491(0x03)
	int32_t AirDropID; // 0x494(0x04)
	float SpawnHeight; // 0x498(0x04)
	char pad_49C[0x14]; // 0x49c(0x14)
	struct FTransform TargetTransform; // 0x4b0(0x30)
	char pad_4E0[0x8]; // 0x4e0(0x08)
	struct UAnimationAsset* CompletedAnim1; // 0x4e8(0x08)
	struct USkeletalMesh* CompletedMesh1; // 0x4f0(0x08)
	struct UAnimationAsset* CompletedAnim2; // 0x4f8(0x08)
	struct USkeletalMesh* CompletedMesh2; // 0x500(0x08)
	struct AActor* DecalActor; // 0x508(0x08)
	uint64_t OwnerUin; // 0x510(0x08)
	bool bLanding; // 0x518(0x01)
	char pad_519[0x7]; // 0x519(0x07)
	struct TArray<struct UFXResourceContainerComponent*> DecleareResourceArray; // 0x520(0x10)
	struct UFXResourceContainerComponent* StopFlyingEffect; // 0x530(0x08)
	char pad_538[0x18]; // 0x538(0x18)

	void ServerStopFly(); // Function DFMGameplay.AirDropActor.ServerStopFly // (Final|Native|Public|BlueprintCallable) // @ game+0x61d7620
	void ServerPlayTimeOver(); // Function DFMGameplay.AirDropActor.ServerPlayTimeOver // (Final|Native|Protected) // @ game+0x61d7600
	void ServerPlay(int64_t InOwnerUin, struct AActor* InAttachedActor, struct FTransform InTargetTransform, int32_t InAirDropID, float InSpawnHeight); // Function DFMGameplay.AirDropActor.ServerPlay // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x61d7430
	bool ServerCheckLanded(struct FVector DeltaMove); // Function DFMGameplay.AirDropActor.ServerCheckLanded // (Final|Native|Public|HasDefaults) // @ game+0x61d7390
	void OnRepIsFlying(); // Function DFMGameplay.AirDropActor.OnRepIsFlying // (Final|Native|Protected) // @ game+0x61d71b0
	void OnRepAirDropID(); // Function DFMGameplay.AirDropActor.OnRepAirDropID // (Final|Native|Protected) // @ game+0x17621d0
	void OnRep_bLanding(); // Function DFMGameplay.AirDropActor.OnRep_bLanding // (Final|Native|Protected) // @ game+0x61d7210
	void OnRep_AttachedActor(); // Function DFMGameplay.AirDropActor.OnRep_AttachedActor // (Final|Native|Protected) // @ game+0x61d71d0
	void DebugDrawCapsule(struct FVector Center, float HalfHeight, float radius, struct FColor Color); // Function DFMGameplay.AirDropActor.DebugDrawCapsule // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x61d66e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirDropDeadZoneVolumeActor
// Size: 0x388 (Inherited: 0x378)
class AAirDropDeadZoneVolumeActor : public AActor {
public:

	struct USphereComponent* CollisionSphere; // 0x378(0x08)
	bool OnlyKillAI; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)

	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AirDropDeadZoneVolumeActor.OnBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x61d6be0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirDropGeneratorGroup
// Size: 0x398 (Inherited: 0x378)
class AAirDropGeneratorGroup : public AActor {
public:

	int32_t GroupID; // 0x378(0x04)
	uint32_t TriggerProbability; // 0x37c(0x04)
	struct TArray<struct AAirDropGenerator*> AirDropGeneratorArr; // 0x380(0x10)
	bool bIsAutoTrigger; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)

	void ActiveGroup(); // Function DFMGameplay.AirDropGeneratorGroup.ActiveGroup // (Final|Native|Public|BlueprintCallable) // @ game+0x61d66c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirDropItemComponent
// Size: 0x150 (Inherited: 0x100)
class UAirDropItemComponent : public UActorComponent {
public:

	int32_t AirDropID; // 0x100(0x04)
	char pad_104[0xc]; // 0x104(0x0c)
	struct FTransform TargetTransform; // 0x110(0x30)
	bool bIsLanding; // 0x140(0x01)
	char pad_141[0x7]; // 0x141(0x07)
	struct UFXResourceContainerComponent* SmokeEffect; // 0x148(0x08)

	void OnRep_bIsLanding(); // Function DFMGameplay.AirDropItemComponent.OnRep_bIsLanding // (Final|Native|Public) // @ game+0x61d71f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirDropMovementComponent
// Size: 0x178 (Inherited: 0x140)
class UAirDropMovementComponent : public UMovementComponent {
public:

	char pad_140[0x4]; // 0x140(0x04)
	struct FAirDropMoveConfig MoveConfig; // 0x144(0x14)
	char pad_158[0x18]; // 0x158(0x18)
	struct AAirDropActor* AirDropActor; // 0x170(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirDropVehicleSubsystem
// Size: 0x528 (Inherited: 0x378)
class AAirDropVehicleSubsystem : public ALevelSubsystem {
public:

	struct UClass* VehicleAirDropTemplate; // 0x378(0x08)
	float MaxAirDropVehicleDistance; // 0x380(0x04)
	float AirDropRadius; // 0x384(0x04)
	int32_t UpLineTraceNum; // 0x388(0x04)
	float UpLineTraceHeight; // 0x38c(0x04)
	int32_t DownLineTraceNum; // 0x390(0x04)
	float DownLineTraceHeight; // 0x394(0x04)
	float SpawnAirDropHeight; // 0x398(0x04)
	float AirDropTime; // 0x39c(0x04)
	float AirDropDecelerateHeightPercentage; // 0x3a0(0x04)
	float VehicleFallingHeight; // 0x3a4(0x04)
	struct FSoftObjectPath SelectPosMaterialPath; // 0x3a8(0x18)
	struct FSoftObjectPath SelectPosMaterialErrorPath; // 0x3c0(0x18)
	struct FSoftObjectPath AirDropPointMaterialPath; // 0x3d8(0x18)
	struct TArray<struct FSoftObjectPath> AirDropMaterialPathArray; // 0x3f0(0x10)
	float EmptyVehicleDecreaseHPMinTime; // 0x400(0x04)
	float MinVehicleDecreaseHPDist; // 0x404(0x04)
	float EmptyVehicleDecreaseHPPercent; // 0x408(0x04)
	char pad_40C[0xc4]; // 0x40c(0xc4)
	struct TArray<struct FSectionAirDrop> AirDropVehicleArray1; // 0x4d0(0x10)
	struct TArray<struct FSectionAirDrop> AirDropVehicleArray2; // 0x4e0(0x10)
	char pad_4F0[0x8]; // 0x4f0(0x08)
	struct TArray<struct UObject*> AirDropMaterialCacheArray; // 0x4f8(0x10)
	struct TArray<struct AGPVehicleBase*> SpawnedVehicles; // 0x508(0x10)
	char pad_518[0x10]; // 0x518(0x10)

	void PreloadAirDropMaterials(); // Function DFMGameplay.AirDropVehicleSubsystem.PreloadAirDropMaterials // (Final|Native|Public|BlueprintCallable) // @ game+0x61d7370
	void OnVehicleDeadNtf(struct AGPVehicleBase* DFMVehicle); // Function DFMGameplay.AirDropVehicleSubsystem.OnVehicleDeadNtf // (Final|Native|Protected) // @ game+0x61d72f0
	void OnServerMatchEnded(enum class EMatchOverReason MatchOverReason, int64_t PlayerUin); // Function DFMGameplay.AirDropVehicleSubsystem.OnServerMatchEnded // (Final|Native|Public) // @ game+0x61d7230
	void OnPreloadAirDropMaterialsCompleted(struct TArray<struct FSoftObjectPath> AssetRefs); // Function DFMGameplay.AirDropVehicleSubsystem.OnPreloadAirDropMaterialsCompleted // (Final|Native|Protected|BlueprintCallable) // @ game+0x61d7020
	void LocalPlayerEnterAirDropState(int64_t VehicleId); // Function DFMGameplay.AirDropVehicleSubsystem.LocalPlayerEnterAirDropState // (Final|Native|Public|BlueprintCallable) // @ game+0x61d6b60
	struct AAirDropVehicleSubsystem* STATIC_GetAirDropVehicleSubsystem(struct UObject* ObjectContext); // Function DFMGameplay.AirDropVehicleSubsystem.GetAirDropVehicleSubsystem // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61d6a10
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirHitDetectorComponent
// Size: 0x5d0 (Inherited: 0x588)
class UAirHitDetectorComponent : public UCapsuleComponent {
public:

	/*struct FMulticastInlineDelegate*/char OnAirHit[0x10]; // 0x588(0x10)
	/*struct FMulticastInlineDelegate*/char OnConsecutiveFired[0x10]; // 0x598(0x10)
	struct TArray<int32_t> AirHitBuffId; // 0x5a8(0x10)
	int32_t ConsecutiveFiredCount; // 0x5b8(0x04)
	int32_t ConsecutiveAirHitCount; // 0x5bc(0x04)
	float LastAirHitTime; // 0x5c0(0x04)
	char pad_5C4[0xc]; // 0x5c4(0x0c)

	void OnDetectAirHit(struct APawn* SourcePawn, struct FHitResult& HitReslut); // Function DFMGameplay.AirHitDetectorComponent.OnDetectAirHit // (Final|Native|Public|HasOutParms) // @ game+0x61d6f00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AirHitManager
// Size: 0x90 (Inherited: 0x38)
class UAirHitManager : public UWorldSubsystem {
public:

	char pad_38[0x58]; // 0x38(0x58)

	void OnCharacterAirHit(struct APawn* SourcePawn, struct FHitResult& HitReslut); // Function DFMGameplay.AirHitManager.OnCharacterAirHit // (Final|Native|Public|HasOutParms) // @ game+0x61d6de0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISearchSpot
// Size: 0x50 (Inherited: 0x30)
class UAISearchSpot : public UObject {
public:

	char pad_30[0x18]; // 0x30(0x18)
	struct AAIController* AssignedController; // 0x48(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISearchJob
// Size: 0xa0 (Inherited: 0x58)
class UAISearchJob : public UAIJob {
public:

	struct AActor* SearchTarget; // 0x58(0x08)
	char pad_60[0x20]; // 0x60(0x20)
	struct TArray<struct UAISearchSpot*> SearchSpots; // 0x80(0x10)
	struct UEnvQuery* SearchEnvQuery; // 0x90(0x08)
	char pad_98[0x8]; // 0x98(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIInvestigateJob
// Size: 0x80 (Inherited: 0x58)
class UAIInvestigateJob : public UAIJob {
public:

	char pad_58[0x10]; // 0x58(0x10)
	struct AActor* InvestigateTarget; // 0x68(0x08)
	struct FVector InvestigateLocation; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.EnvQueryTest_SearchSpot
// Size: 0x218 (Inherited: 0x200)
class UEnvQueryTest_SearchSpot : public UEnvQueryTest {
public:

	struct UClass* QuerierContext; // 0x200(0x08)
	struct UClass* TesterContext; // 0x208(0x08)
	enum class EDrawDebugTrace DrawType; // 0x210(0x01)
	char pad_211[0x3]; // 0x211(0x03)
	float WidthMargin; // 0x214(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.EnvQueryContext_SearchLastLocation
// Size: 0x30 (Inherited: 0x30)
class UEnvQueryContext_SearchLastLocation : public UEnvQueryContext {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISense_HearingDFM
// Size: 0xf0 (Inherited: 0xf0)
class UAISense_HearingDFM : public UAISense_Hearing {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISense_HearingOnlyDetectPlayer
// Size: 0xf0 (Inherited: 0xf0)
class UAISense_HearingOnlyDetectPlayer : public UAISense_Hearing {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISpawnChecker
// Size: 0x540 (Inherited: 0x378)
class AAISpawnChecker : public AActor {
public:

	/*struct FMulticastInlineDelegate*/char OnSpawnEnd[0x10]; // 0x378(0x10)
	/*struct FMulticastInlineDelegate*/char OnRegionClear[0x10]; // 0x388(0x10)
	/*struct FMulticastInlineDelegate*/char OnCharacterDied[0x10]; // 0x398(0x10)
	/*struct FMulticastInlineDelegate*/char OnSpawnActorEventDispatcher[0x10]; // 0x3a8(0x10)
	/*struct FDelegate*/char DefaultSpawnEvent[0x10]; // 0x3b8(0x10)
	struct FString UniqueKey; // 0x3c8(0x10)
	struct TArray<struct AAISpawnPoint*> SpawnPoints; // 0x3d8(0x10)
	struct ADramaArea* OwnerDrama; // 0x3e8(0x08)
	struct FString OwnerLevelName; // 0x3f0(0x10)
	struct TArray<struct AAIGroup*> AIGroups; // 0x400(0x10)
	int32_t SpawnTryTimes; // 0x410(0x04)
	float SpawnTryNextTime; // 0x414(0x04)
	bool bAllowedReplenish; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float SpawnProbility; // 0x41c(0x04)
	bool bGoodLocationCheck; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct FAISpawnFactor SpawnFactorInfo; // 0x428(0x28)
	struct TArray<struct AActor*> NewSpawnedActors; // 0x450(0x10)
	struct TArray<struct FSpawnedActorInfo> SpawnedActorList; // 0x460(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> DeadActorList; // 0x470(0x10)
	int32_t TotalSpawnedActorCount; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct FSpawnerFlag FlagData; // 0x488(0x10)
	float ForcePauseTime; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct TArray<struct AActor*> ZoneActors; // 0x4a0(0x10)
	struct TArray<struct FAIZone> Zones; // 0x4b0(0x10)
	bool bForceSpawn; // 0x4c0(0x01)
	bool UseDefaultFactor; // 0x4c1(0x01)
	char pad_4C2[0x6]; // 0x4c2(0x06)
	struct FAISpawnFactor DefaultSpawnFactorInfo; // 0x4c8(0x28)
	struct TArray<struct FString> DefaultMovePathGroupList; // 0x4f0(0x10)
	char pad_500[0x5]; // 0x500(0x05)
	bool bSpawnAtDesignatedTransform; // 0x505(0x01)
	char pad_506[0xa]; // 0x506(0x0a)
	struct FTransform BirthTransform; // 0x510(0x30)

	void StopSpawn(); // Function DFMGameplay.AISpawnChecker.StopSpawn // (Final|Native|Public) // @ game+0x61dd070
	void StartSpawn(struct FAISpawnFactor factor); // Function DFMGameplay.AISpawnChecker.StartSpawn // (Final|Native|Public) // @ game+0x61dcac0
	struct ADFMCharacter* STATIC_SpawnTestAIUnitTest(struct UObject* WorldContextObject, struct UDataTable* DataTable, struct FName NpcName, struct FVector Location); // Function DFMGameplay.AISpawnChecker.SpawnTestAIUnitTest // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x61dc980
	void STATIC_SpawnTestAIAtDesignatedTransform(struct AActor* WorldContext, struct FVector Location, struct FName NpcName); // Function DFMGameplay.AISpawnChecker.SpawnTestAIAtDesignatedTransform // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x61dc880
	void STATIC_SpawnTestAIArgsEx(struct UObject* WorldContext, struct FName NpcName, struct FVector Location, struct FString extraArg); // Function DFMGameplay.AISpawnChecker.SpawnTestAIArgsEx // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x61dc6c0
	struct ADFMCharacter* STATIC_SpawnTestAIArgs(struct UObject* WorldContextObject, struct FName NpcName, struct FVector Location, struct FString extraArg, bool bIsWearingEquipment, bool TPToStart); // Function DFMGameplay.AISpawnChecker.SpawnTestAIArgs // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x61dc3d0
	struct TArray<struct AAIController*> STATIC_SpawnSimulateAIAtDesignatedTransform(struct ADFMCharacter* Player, struct FCharacterTemplateTable& npcTemplateRow, struct FSpawnBaseAIInfo AIInfo, struct FVector CentLocation); // Function DFMGameplay.AISpawnChecker.SpawnSimulateAIAtDesignatedTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x61dc120
	void SpawnAIWithDefaultFactor(); // Function DFMGameplay.AISpawnChecker.SpawnAIWithDefaultFactor // (Final|Native|Public|BlueprintCallable) // @ game+0x61dbef0
	struct AAIGroup* STATIC_SpawnAIAtDesignatedTransform(struct TArray<struct AAIController*>& AIControllerList, struct AActor* WorldContext, struct FTransform Transform, struct FAINpcSelector npcSelector, struct UDataTable* NpcTemplateTable, struct UDataTable* NpcGroupTable, bool bSpawnCheck, bool bSpawnGroup); // Function DFMGameplay.AISpawnChecker.SpawnAIAtDesignatedTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x61dbac0
	struct AAIGroup* STATIC_SpawnAIAtDesignatedPoint(struct TArray<struct AAIController*>& AIControllerList, struct AAISpawnPoint* SpawnPoint, struct FAINpcSelector npcSelector, struct UDataTable* NpcTemplateTable, struct UDataTable* NpcGroupTable, bool bSpawnCheck, bool bSpawnGroup); // Function DFMGameplay.AISpawnChecker.SpawnAIAtDesignatedPoint // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x61db740
	struct AAIGroup* STATIC_SpawnAerialVehicle(struct TArray<struct AAerialVehicleController*>& AerialVehicleControllerList, struct AAISpawnPoint* SpawnPoint, struct FAerialVehicleSelector AerialVehicleSelector); // Function DFMGameplay.AISpawnChecker.SpawnAerialVehicle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x61dbf10
	void SetSpawnTransfrom(bool bEnable, struct FTransform& Trans); // Function DFMGameplay.AISpawnChecker.SetSpawnTransfrom // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x61db620
	void SetPauseSpawnTime(float Duration); // Function DFMGameplay.AISpawnChecker.SetPauseSpawnTime // (Final|Native|Public|BlueprintCallable) // @ game+0x61db5a0
	void RemoveSpawnAvoidArea(struct UAISpawnNearbyPawnDetectorComponent* avoidArea); // Function DFMGameplay.AISpawnChecker.RemoveSpawnAvoidArea // (Final|Native|Public) // @ game+0x895130
	void OnSpawnedCharacterDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function DFMGameplay.AISpawnChecker.OnSpawnedCharacterDied // (Final|Native|Public|BlueprintCallable) // @ game+0x61db1f0
	void OnSpawnedActorDestroyed(struct AActor* SpawnedActor); // Function DFMGameplay.AISpawnChecker.OnSpawnedActorDestroyed // (Final|Native|Public|BlueprintCallable) // @ game+0x61db170
	struct TArray<struct ACHARACTER*> GetSpawnedCharacters(struct FName Tag); // Function DFMGameplay.AISpawnChecker.GetSpawnedCharacters // (Final|Native|Public|BlueprintCallable) // @ game+0x61dae80
	struct TArray<struct AAIController*> GetSpawnedCharacterAIControllers(struct FName Tag); // Function DFMGameplay.AISpawnChecker.GetSpawnedCharacterAIControllers // (Final|Native|Public|BlueprintCallable) // @ game+0x61dada0
	int32_t GetCurrentActorNum(); // Function DFMGameplay.AISpawnChecker.GetCurrentActorNum // (Final|Native|Public|BlueprintCallable) // @ game+0x61dad70
	void DestroyAllSpawnedActor(); // Function DFMGameplay.AISpawnChecker.DestroyAllSpawnedActor // (Final|Native|Public|BlueprintCallable) // @ game+0x61dacd0
	void DefaultOnSpawnEvent(struct AAISpawnChecker* Checker, struct AActor* SpawnedActor, int32_t SpawnIndex); // Function DFMGameplay.AISpawnChecker.DefaultOnSpawnEvent // (Final|Native|Public) // @ game+0x61dabd0
	void BPOnSpawn(struct AActor* SpawnedActor); // Function DFMGameplay.AISpawnChecker.BPOnSpawn // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xc37860
	void BPOnDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function DFMGameplay.AISpawnChecker.BPOnDied // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61daad0
	void BPOnDestroyed(struct AActor* SpawnedActor); // Function DFMGameplay.AISpawnChecker.BPOnDestroyed // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x61daa40
	void AIReset(); // Function DFMGameplay.AISpawnChecker.AIReset // (Final|Native|Public) // @ game+0x61da9a0
	void AddSpawnAvoidArea(struct UAISpawnNearbyPawnDetectorComponent* avoidArea); // Function DFMGameplay.AISpawnChecker.AddSpawnAvoidArea // (Final|Native|Public) // @ game+0x895130
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AsyncAISpawnAction
// Size: 0x58 (Inherited: 0x38)
class UAsyncAISpawnAction : public UBlueprintAsyncActionBase {
public:

	/*struct FMulticastInlineDelegate*/char OnSpawnActionEnd[0x10]; // 0x38(0x10)
	/*struct FMulticastInlineDelegate*/char OnActionRegionClear[0x10]; // 0x48(0x10)

	struct UAsyncAISpawnAction* STATIC_StartSpawnByFactorWithFunc(/*struct AAISpawnChecker* Checker, struct FAISpawnFactor factor, struct FDelegate& OnSpawnActor*/); // Function DFMGameplay.AsyncAISpawnAction.StartSpawnByFactorWithFunc // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x61dce40
	struct UAsyncAISpawnAction* STATIC_StartSpawnByFactor(struct AAISpawnChecker* Checker, struct FAISpawnFactor factor); // Function DFMGameplay.AsyncAISpawnAction.StartSpawnByFactor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61dcc60
	void OnEnd(struct AAISpawnChecker* Checker); // Function DFMGameplay.AsyncAISpawnAction.OnEnd // (Final|Native|Protected) // @ game+0x61db0f0
	void OnClear(struct AAISpawnChecker* Checker); // Function DFMGameplay.AsyncAISpawnAction.OnClear // (Final|Native|Protected) // @ game+0x61db070
	void OnActorEnd(struct AActor* A, enum class EEndPlayReason reason); // Function DFMGameplay.AsyncAISpawnAction.OnActorEnd // (Final|Native|Protected) // @ game+0x61dafb0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISpawnCheckerConfig
// Size: 0x80 (Inherited: 0x40)
class UAISpawnCheckerConfig : public UDeveloperSettings {
public:

	float AISpawnDistanceAvoidPlayer; // 0x40(0x04)
	float AISpawnDegreeAvoidPlayer; // 0x44(0x04)
	float AISpawnSightDistanceAvoidPlayer; // 0x48(0x04)
	bool AISpawnCheckEnableAnywhere; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	float AIDelaySpawnAfterPlayerReady; // 0x50(0x04)
	float AISpawnDistanceForAILab; // 0x54(0x04)
	bool DontAvoidPlayerInEditor; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct TArray<struct FAISpawnEnableInfo> AISpawnCheckEnableModes; // 0x60(0x10)
	struct TArray<struct FAISpawnDistanceTagConf> AISpawnTagConf; // 0x70(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AsyncTaskAISpawnCheck
// Size: 0x80 (Inherited: 0x38)
class UAsyncTaskAISpawnCheck : public UBlueprintAsyncActionBase {
public:

	/*struct FMulticastInlineDelegate*/char OnRealSpawn[0x10]; // 0x38(0x10)
	struct ADramaArea* DramaArea; // 0x48(0x08)
	char pad_50[0x30]; // 0x50(0x30)

	struct UAsyncTaskAISpawnCheck* STATIC_RegisterSpawnCheck(struct ADramaArea* Drama, float ForceDistance, bool DirectSpawn, float RetryDelay); // Function DFMGameplay.AsyncTaskAISpawnCheck.RegisterSpawnCheck // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61db440
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIDelaySpawnSystem
// Size: 0x88 (Inherited: 0x38)
class UAIDelaySpawnSystem : public UWorldSubsystem {
public:

	char pad_38[0x8]; // 0x38(0x08)
	struct TArray<struct UAsyncTaskAISpawnCheck*> DramaSpawnInfos; // 0x40(0x10)
	struct TArray<struct FQASpawnAIDrama> QADramas; // 0x50(0x10)
	struct TArray<struct ADramaArea*> NeedRespawnDramas; // 0x60(0x10)
	char pad_70[0x18]; // 0x70(0x18)

	void RespawnDramas(); // Function DFMGameplay.AIDelaySpawnSystem.RespawnDramas // (Final|Native|Public|BlueprintCallable) // @ game+0x61db580
	bool RegisterAISpawnDrama(struct UAsyncTaskAISpawnCheck* Checker); // Function DFMGameplay.AIDelaySpawnSystem.RegisterAISpawnDrama // (Final|Native|Public|BlueprintCallable) // @ game+0x61db3b0
	bool QARegisterAISpawnDrama(struct ADramaArea* Drama, bool UseBP); // Function DFMGameplay.AIDelaySpawnSystem.QARegisterAISpawnDrama // (Final|Native|Public|BlueprintCallable) // @ game+0x61db2f0
	struct UAIDelaySpawnSystem* STATIC_Get(struct UObject* WorldContextObject); // Function DFMGameplay.AIDelaySpawnSystem.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61dacf0
	void AddNeedRespawnDrama(struct ADramaArea* Drama); // Function DFMGameplay.AIDelaySpawnSystem.AddNeedRespawnDrama // (Final|Native|Public|BlueprintCallable) // @ game+0x61da9c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISpawnNearbyPawnDetectorComponent
// Size: 0x5c0 (Inherited: 0x590)
class UAISpawnNearbyPawnDetectorComponent : public UBoxComponent {
public:

	struct TArray<struct APawn*> PawnInCheckArea; // 0x590(0x10)
	char pad_5A0[0x8]; // 0x5a0(0x08)
	struct AAISpawnChecker* SpawnChecker; // 0x5a8(0x08)
	struct TArray<struct APawn*> PendingPawn; // 0x5b0(0x10)

	void RegisterChecker(struct AAISpawnChecker* Checker); // Function DFMGameplay.AISpawnNearbyPawnDetectorComponent.RegisterChecker // (Native|Public) // @ game+0x36c7f90
	void OnDetectedPawnOut(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.AISpawnNearbyPawnDetectorComponent.OnDetectedPawnOut // (Native|Public) // @ game+0x61e01b0
	void OnDetectedPawnEnter(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AISpawnNearbyPawnDetectorComponent.OnDetectedPawnEnter // (Native|Public|HasOutParms) // @ game+0x61dffb0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISpawnPoint
// Size: 0x398 (Inherited: 0x378)
class AAISpawnPoint : public AActor {
public:

	struct USphereComponent* PawnDetector; // 0x378(0x08)
	float SpawnPointRadius; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct AAISpawnChecker* SpawnChecker; // 0x388(0x08)
	int32_t MaxSpawnNum; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AISpeakContextManager
// Size: 0x58 (Inherited: 0x38)
class UAISpeakContextManager : public UWorldSubsystem {
public:

	char pad_38[0x20]; // 0x38(0x20)

	bool STATIC_UpdateContext(struct ACHARACTER* responsor, int32_t Handler, struct FAISpeakContext& newContext); // Function DFMGameplay.AISpeakContextManager.UpdateContext // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x61e0f80
	bool STATIC_ResponseContext(struct ACHARACTER* responsor, int32_t Handler, int32_t nextStatus); // Function DFMGameplay.AISpeakContextManager.ResponseContext // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61e0cd0
	int32_t STATIC_QueryContextByDistance(struct ACHARACTER* responsor, enum class EAISpeakContextType Type, float DistanceLimit); // Function DFMGameplay.AISpeakContextManager.QueryContextByDistance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61e0660
	bool STATIC_GetContext(struct ACHARACTER* responsor, int32_t Handler, struct FAISpeakContext& Result); // Function DFMGameplay.AISpeakContextManager.GetContext // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x61df970
	bool STATIC_DestroyContextDelay(struct ACHARACTER* responsor, int32_t Handler, float Timeout); // Function DFMGameplay.AISpeakContextManager.DestroyContextDelay // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61df500
	bool STATIC_DestroyContext(struct ACHARACTER* responsor, int32_t Handler); // Function DFMGameplay.AISpeakContextManager.DestroyContext // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61df440
	int32_t STATIC_CreateContext(struct ACHARACTER* creator, enum class EAISpeakContextType Type, float DistanceLimit, float Timeout, float CoolDown); // Function DFMGameplay.AISpeakContextManager.CreateContext // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61df2c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIStyleSystem
// Size: 0xa0 (Inherited: 0x30)
class UAIStyleSystem : public UObject {
public:

	struct TArray<struct FAIStyleSetting> AIStyleSetting; // 0x30(0x10)
	struct TArray<struct FGlobalAIStyleInfo> GlobalAIStyles; // 0x40(0x10)
	struct TMap<struct APrefecture*, struct FPrefectureAIStyleInfo> PrefectureAIStyleInfo; // 0x50(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIUnitTestManager
// Size: 0x490 (Inherited: 0x378)
class AAIUnitTestManager : public AActor {
public:

	char pad_378[0x88]; // 0x378(0x88)
	struct UDataTable* AIConfigTable; // 0x400(0x08)
	struct TArray<struct FName> KillEnemyAIConfigs; // 0x408(0x10)
	struct TArray<struct FAIUnitTestEquipPair> KillEnemyPlayerEquipConfigs; // 0x418(0x10)
	struct TArray<float> DistanceConfigs; // 0x428(0x10)
	int32_t KillEnemyTestRounds; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct TArray<struct FName> HearingAIConfigs; // 0x440(0x10)
	struct TArray<enum class EAIUnitTestPlayerState> HearingPlayerConfigs; // 0x450(0x10)
	float HearingStartDistance; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct TArray<struct FName> SightAIConfigs; // 0x468(0x10)
	struct TArray<float> SightPlayerAngleConfigs; // 0x478(0x10)
	float SightStartDistance; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)

	void ResetTestResult(); // Function DFMGameplay.AIUnitTestManager.ResetTestResult // (Final|Native|Public|BlueprintCallable) // @ game+0x61e0cb0
	void ReportSightTestResult(struct FName AiName, enum class EGPCharacterFightStateType FightState, float Angle, float Distance); // Function DFMGameplay.AIUnitTestManager.ReportSightTestResult // (Final|Native|Public|BlueprintCallable) // @ game+0x61e0b40
	void ReportKillEnemyTestResult(struct FName AiName, struct FString Equipment, float Distance, float KillTime, struct AActor* Killer, struct AActor* Target); // Function DFMGameplay.AIUnitTestManager.ReportKillEnemyTestResult // (Final|Native|Public|BlueprintCallable) // @ game+0x61e08f0
	void ReportHearingTestResult(struct FName AiName, enum class EAIUnitTestPlayerState PlayerState, float Distance); // Function DFMGameplay.AIUnitTestManager.ReportHearingTestResult // (Final|Native|Public|BlueprintCallable) // @ game+0x61e07f0
	void OnGlobalPreTakeDamage(struct FDamageResultInfo& DamageResult); // Function DFMGameplay.AIUnitTestManager.OnGlobalPreTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x61e02f0
	void FinishTest(bool TestDone); // Function DFMGameplay.AIUnitTestManager.FinishTest // (Final|Native|Public|BlueprintCallable) // @ game+0x61df6a0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIZoneBox
// Size: 0x5a0 (Inherited: 0x590)
class UAIZoneBox : public UBoxComponent {
public:

	char pad_590[0x10]; // 0x590(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.Prefecture
// Size: 0x668 (Inherited: 0x378)
class APrefecture : public AActor {
public:

	bool bOpenSquad; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	struct FName SquadTactic; // 0x37c(0x08)
	char pad_384[0x4]; // 0x384(0x04)
	struct USquadCommanderComponent* SquadCommanderComponent; // 0x388(0x08)
	struct FString AILayoutName; // 0x390(0x10)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct FString PrefectureName; // 0x3a8(0x10)
	bool bIsEnable; // 0x3b8(0x01)
	char pad_3B9[0x7]; // 0x3b9(0x07)
	/*struct TSet<struct TWeakObjectPtr<struct AActor>>*/char SpawnedActorList[0x50]; // 0x3c0(0x50)
	/*struct TSet<struct AGPAlarmTower*>*/char AlarmTowerList[0x50]; // 0x410(0x50)
	/*struct TSet<struct TWeakObjectPtr<struct AActor>>*/char DeadActorList[0x50]; // 0x460(0x50)
	/*struct TSet<struct UAIZoneBox*>*/char ZoneExtent[0x50]; // 0x4b0(0x50)
	float AttractionRatio; // 0x500(0x04)
	bool bForcedInPrefecture; // 0x504(0x01)
	char pad_505[0x3]; // 0x505(0x03)
	float AllAISpeakNextCoolDown; // 0x508(0x04)
	bool PrefectureStyleFirst; // 0x50c(0x01)
	char pad_50D[0x3]; // 0x50d(0x03)
	struct FAIStyleWeight PrefectureStyleRateConfig; // 0x510(0x10)
	struct TArray<struct FPrefectureStyleSetting> PrefectureStylesSetting; // 0x520(0x10)
	struct TMap<enum class EAIStyleType, int32_t> PrefectureInitStylesSetting; // 0x530(0x50)
	struct AReinforceSubstitution* ReplenishSubstitution; // 0x580(0x08)
	struct TArray<struct FPrefectureBoardcastThreatConfig> PrefectureBoardcastThreatSetting; // 0x588(0x10)
	float BoardcastThreatDist; // 0x598(0x04)
	char pad_59C[0x4]; // 0x59c(0x04)
	struct TArray<float> ReplenishTimeForAI; // 0x5a0(0x10)
	float SpawnWithoutHumanRange; // 0x5b0(0x04)
	float SpawnWithoutHumanRetryInterval; // 0x5b4(0x04)
	int32_t SpawnWithoutHumanMaxRetry; // 0x5b8(0x04)
	float ReplenishAIThreatDuration; // 0x5bc(0x04)
	float ReplenishAIThreatDistance; // 0x5c0(0x04)
	char pad_5C4[0x4]; // 0x5c4(0x04)
	struct TArray<enum class EAIThreatDetailName> ReplenishAIInterestThreat; // 0x5c8(0x10)
	enum class EPrefectureReplenishScheme ReplenishScheme; // 0x5d8(0x01)
	char MaxRelenishTimes; // 0x5d9(0x01)
	char pad_5DA[0x2]; // 0x5da(0x02)
	float RelenishInterval; // 0x5dc(0x04)
	/*struct TSet<struct AReinforceAgent*>*/char RelatedReinforceAgents[0x50]; // 0x5e0(0x50)
	int32_t CurrentReplenishNum; // 0x630(0x04)
	char pad_634[0x34]; // 0x634(0x34)

	void SetReplenishScheme(enum class EPrefectureReplenishScheme NewReplenishScheme); // Function DFMGameplay.Prefecture.SetReplenishScheme // (Final|Native|Public|BlueprintCallable) // @ game+0x61e0f00
	void SetPrefectureEnabled(bool IsEnable); // Function DFMGameplay.Prefecture.SetPrefectureEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x61e0e80
	void SetPrefectureAllAISpeakNextCoolDown(float cdMin, float cdMax); // Function DFMGameplay.Prefecture.SetPrefectureAllAISpeakNextCoolDown // (Final|Native|Public|BlueprintCallable) // @ game+0x61e0dc0
	void RequestStyle(); // Function DFMGameplay.Prefecture.RequestStyle // (Final|Native|Public) // @ game+0x61e0c90
	void ReplenishAI(); // Function DFMGameplay.Prefecture.ReplenishAI // (Final|Native|Public) // @ game+0x61e07d0
	void RegisterAlarmTower(struct AGPAlarmTower* AlarmTower); // Function DFMGameplay.Prefecture.RegisterAlarmTower // (Final|Native|Public|BlueprintCallable) // @ game+0x61e0750
	void OnSpawnedCharacterDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function DFMGameplay.Prefecture.OnSpawnedCharacterDied // (Final|Native|Public) // @ game+0x61e0560
	void OnSpawnedActorDestroyed(struct AActor* SpawnedActor); // Function DFMGameplay.Prefecture.OnSpawnedActorDestroyed // (Final|Native|Public) // @ game+0x61e04e0
	void OnReplenishAISpawned(struct TArray<struct ACHARACTER*> SpawnedAIs); // Function DFMGameplay.Prefecture.OnReplenishAISpawned // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x61e03c0
	void OnCharacterSpawn(struct AGPCharacterBase* CHARACTER); // Function DFMGameplay.Prefecture.OnCharacterSpawn // (Final|Native|Public) // @ game+0x61dff30
	bool IsInPrefecture(struct FVector& GoalLoc, struct FVector Extent); // Function DFMGameplay.Prefecture.IsInPrefecture // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x61dfe30
	struct TArray<struct AGPCharacterBase*> STATIC_GetTotalAIByPOI(struct UObject* WorldContextObject, struct FName Tag); // Function DFMGameplay.Prefecture.GetTotalAIByPOI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61dfcc0
	struct TArray<struct APrefecture*> STATIC_GetPrefecturesByTag(struct UObject* WorldContextObject, bool ContainsNotEnabledPrefecture, struct FName Tag); // Function DFMGameplay.Prefecture.GetPrefecturesByTag // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x61dfb20
	bool GetPrefectureEnabled(); // Function DFMGameplay.Prefecture.GetPrefectureEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x61dfb00
	float GetPrefectureAllAISpeakNextCoolDownTime(); // Function DFMGameplay.Prefecture.GetPrefectureAllAISpeakNextCoolDownTime // (Final|Native|Public|BlueprintCallable) // @ game+0x61dfae0
	int32_t GetLivingAINumInPrefecture(); // Function DFMGameplay.Prefecture.GetLivingAINumInPrefecture // (Final|Native|Public|BlueprintCallable) // @ game+0x61dfaa0
	bool GetForcedInPrefecture(); // Function DFMGameplay.Prefecture.GetForcedInPrefecture // (Final|Native|Public) // @ game+0x61dfa80
	float GetAttractionRatio(); // Function DFMGameplay.Prefecture.GetAttractionRatio // (Final|Native|Public|BlueprintCallable) // @ game+0x61df950
	struct TArray<struct AGPCharacterBase*> GetAllAIInPrefecture(); // Function DFMGameplay.Prefecture.GetAllAIInPrefecture // (Final|Native|Public|BlueprintCallable) // @ game+0x61df870
	void GetAlarmTowerList(); // Function DFMGameplay.Prefecture.GetAlarmTowerList // (Final|Native|Public|BlueprintCallable) // @ game+0x61df730
	struct FVector FindClosestPoint(struct FVector& Point); // Function DFMGameplay.Prefecture.FindClosestPoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x61df5f0
	void ChangeDrawPrefecture(); // Function DFMGameplay.Prefecture.ChangeDrawPrefecture // (Final|Native|Public|BlueprintCallable) // @ game+0x61df2a0
	void BPOnDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function DFMGameplay.Prefecture.BPOnDied // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void BPOnDestroyed(struct AActor* SpawnedActor); // Function DFMGameplay.Prefecture.BPOnDestroyed // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void BP_OnLevelSelectionChanged(); // Function DFMGameplay.Prefecture.BP_OnLevelSelectionChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x61df280
	bool AIRequestStyle(struct ADFMAIController* AIController, struct TArray<enum class EAIStyleType> AllowedStyles, enum class EAIStyleType& OutStyle); // Function DFMGameplay.Prefecture.AIRequestStyle // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x61df0d0
	bool AIRequestSpecifyStyle(struct ADFMAIController* AIController, enum class EAIStyleType Style); // Function DFMGameplay.Prefecture.AIRequestSpecifyStyle // (Final|Native|Public|BlueprintCallable) // @ game+0x61df010
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIAlertBroadcastVolume
// Size: 0x380 (Inherited: 0x380)
class AAIAlertBroadcastVolume : public ATriggerBox {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AmbientLightEditorPreviewActor
// Size: 0x398 (Inherited: 0x378)
class AAmbientLightEditorPreviewActor : public AActor {
public:

	struct FName AvatarName; // 0x378(0x08)
	struct UDataTable* AmbientLightGroupTable; // 0x380(0x08)
	struct UDataTable* CharacterAvatarTable; // 0x388(0x08)
	struct UDataTable* CharacterAvatarTable_HD; // 0x390(0x08)

	struct UObject* EditorSyncLoadMesh(struct FSoftObjectPath Path); // Function DFMGameplay.AmbientLightEditorPreviewActor.EditorSyncLoadMesh // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x61e6630
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AmbientLightVolumeActor
// Size: 0x388 (Inherited: 0x378)
class AAmbientLightVolumeActor : public AActor {
public:

	struct UBoxComponent* CollisionBox; // 0x378(0x08)
	struct ADFMCharacter* LocalCharacter; // 0x380(0x08)

	void OnLocalPlayerPawnCreated(); // Function DFMGameplay.AmbientLightVolumeActor.OnLocalPlayerPawnCreated // (Final|Native|Protected) // @ game+0x61e6ef0
	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.AmbientLightVolumeActor.OnEndOverlap // (Final|Native|Public) // @ game+0x61e6db0
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AmbientLightVolumeActor.OnBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x61e6bb0
	struct UBoxComponent* GetBoxFromBlueprint(); // Function DFMGameplay.AmbientLightVolumeActor.GetBoxFromBlueprint // (Native|Event|Public|BlueprintEvent) // @ game+0x61e6a30
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DeadbodyAmmoBoxDataManager
// Size: 0x48 (Inherited: 0x38)
class UDeadbodyAmmoBoxDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.PortableAmmoBoxManager
// Size: 0x48 (Inherited: 0x38)
class UPortableAmmoBoxManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AmmoUtil
// Size: 0x30 (Inherited: 0x30)
class UAmmoUtil : public UObject {
public:


	void STATIC_UpdateAmmoItems(struct TArray<struct FAmmoDataItem>& AmmoDataItems, int32_t CurAmmoNum); // Function DFMGameplay.AmmoUtil.UpdateAmmoItems // (Final|Native|Static|Public|HasOutParms) // @ game+0x61e7420
	void STATIC_UpdateAmmoContextOnDynamicAttribute(struct FModularWeaponDynamicAttrbuites& DynamicAttrbuites, uint64_t RootGid, int32_t CurAmmoNum); // Function DFMGameplay.AmmoUtil.UpdateAmmoContextOnDynamicAttribute // (Final|Native|Static|Public|HasOutParms) // @ game+0x61e7190
	void STATIC_UpdateAmmoContext(struct FAmmoContext& AmmoContext, int32_t CurAmmoNum); // Function DFMGameplay.AmmoUtil.UpdateAmmoContext // (Final|Native|Static|Public|HasOutParms) // @ game+0x61e7080
	void STATIC_PushAmmoToContext(struct FAmmoContext& AmmoContext, struct FAmmoDataItem& AmmoDataItem); // Function DFMGameplay.AmmoUtil.PushAmmoToContext // (Final|Native|Static|Public|HasOutParms) // @ game+0x61e6f50
	float STATIC_GetWeaponReloadTime(struct FWeaponDataAttribute& WeaponDataAttribute, int32_t CurrentAmmoCount, int32_t ItemAmmoNum); // Function DFMGameplay.AmmoUtil.GetWeaponReloadTime // (Final|Native|Static|Public|HasOutParms) // @ game+0x61e6a60
	void STATIC_FillReloadAmmoParams(struct UObject* WorldContextObj, uint64_t WeaponID, struct TArray<struct FInventoryItemInfo>& ItemInfos, struct TArray<struct FAmmoDataItem>& OutReloadParams, int32_t InMaxReloadCount, int32_t& OutFindAmmoNum, bool bPreviewOnly); // Function DFMGameplay.AmmoUtil.FillReloadAmmoParams // (Final|Native|Static|Public|HasOutParms) // @ game+0x61e6770
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_BreakableDebrisHitAudio
// Size: 0x70 (Inherited: 0x40)
class UAnimNotify_BreakableDebrisHitAudio : public UAnimNotify {
public:

	struct FName SocketName; // 0x40(0x08)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char LandAudio[0x28]; // 0x48(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.UAnimNotify_BreakableOnHitAudio
// Size: 0x48 (Inherited: 0x40)
class UUAnimNotify_BreakableOnHitAudio : public UAnimNotify {
public:

	struct FName SocketName; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_DFMPlayParticleEffect
// Size: 0xb0 (Inherited: 0xa0)
class UAnimNotify_DFMPlayParticleEffect : public UAnimNotify_GPPlayParticleEffect {
public:

	enum class EGPPlayParticleEffectTeamRole ParticleEffectTeamRole; // 0xa0(0x01)
	char pad_A1[0xf]; // 0xa1(0x0f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_FootstepEffect
// Size: 0xf8 (Inherited: 0x40)
class UAnimNotify_FootstepEffect : public UAnimNotify {
public:

	struct TMap<enum class ETerrainType, struct FName> EffectConfig; // 0x40(0x50)
	struct TMap<enum class ETerrainType, struct FName> EffectConfig_HD; // 0x90(0x50)
	struct FName SocketName; // 0xe0(0x08)
	int32_t Percentage; // 0xe8(0x04)
	int32_t Percentage_River; // 0xec(0x04)
	char pad_F0[0x8]; // 0xf0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_PlayParticleAtRandomSockect
// Size: 0x80 (Inherited: 0x40)
class UAnimNotify_PlayParticleAtRandomSockect : public UAnimNotify {
public:

	struct FString SockectPrefixion; // 0x40(0x10)
	int32_t SelectSocketNum; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	/*struct TSoftObjectPtr<UParticleSystem>*/char ParticleSystemPtr[0x28]; // 0x58(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_ShowSpecialWeapon
// Size: 0x90 (Inherited: 0x40)
class UAnimNotify_ShowSpecialWeapon : public UAnimNotify {
public:

	bool Show; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName AttachSocket; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct FTransform RelativeTransform; // 0x50(0x30)
	uint64_t WeaponID; // 0x80(0x08)
	struct UAnimationAsset* PlayAnim; // 0x88(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_SmallAction
// Size: 0x40 (Inherited: 0x40)
class UAnimNotify_SmallAction : public UAnimNotify {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_SpawnOneBullet
// Size: 0x58 (Inherited: 0x40)
class UAnimNotify_SpawnOneBullet : public UAnimNotify {
public:

	uint64_t BulletId; // 0x40(0x08)
	struct FVector FireBoneLocation; // 0x48(0x0c)
	int32_t SkillFireRoatationIdx; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotify_ThrowGrenade
// Size: 0x58 (Inherited: 0x40)
class UAnimNotify_ThrowGrenade : public UAnimNotify {
public:

	uint64_t GrenadeWeaponId; // 0x40(0x08)
	struct FVector FireBoneLocation; // 0x48(0x0c)
	int32_t SkillFireRotationIdx; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_AIForbidGunShooting
// Size: 0x38 (Inherited: 0x38)
class UAnimNotifyState_AIForbidGunShooting : public UAnimNotifyState {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_AITimedParticleEffect
// Size: 0x70 (Inherited: 0x68)
class UAnimNotifyState_AITimedParticleEffect : public UAnimNotifyState_TimedParticleEffect {
public:

	struct FName FXResourceName; // 0x68(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_AITurnInPlace
// Size: 0x48 (Inherited: 0x38)
class UAnimNotifyState_AITurnInPlace : public UAnimNotifyState {
public:

	struct UCurveFloat* AnimRotationPercentCurve; // 0x38(0x08)
	struct FName TurningInstanceName; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_AIUseOverrideAO
// Size: 0x48 (Inherited: 0x38)
class UAnimNotifyState_AIUseOverrideAO : public UAnimNotifyState {
public:

	struct FName AOAnimName; // 0x38(0x08)
	struct UAimOffsetBlendSpace* AOAnim; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_BreakableLoopAudio
// Size: 0x40 (Inherited: 0x38)
class UAnimNotifyState_BreakableLoopAudio : public UAnimNotifyState {
public:

	struct FName SocketName; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_FirebatDeathPerformance
// Size: 0x48 (Inherited: 0x38)
class UAnimNotifyState_FirebatDeathPerformance : public UAnimNotifyState {
public:

	struct FName HealthLockBuff; // 0x38(0x08)
	bool IsGod; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_LockYawOnTarget
// Size: 0x40 (Inherited: 0x38)
class UAnimNotifyState_LockYawOnTarget : public UAnimNotifyState {
public:

	float InterpSpeed; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AreaTriggerActor
// Size: 0x3a0 (Inherited: 0x378)
class AAreaTriggerActor : public AActor {
public:

	struct UBoxComponent* BoxComponent; // 0x378(0x08)
	struct FName AreaAmbientAudioRowName; // 0x380(0x08)
	struct UDataTable* AreaAmbientAudioDataTable; // 0x388(0x08)
	char pad_390[0x10]; // 0x390(0x10)

	void OnOverlapEndDoing(); // Function DFMGameplay.AreaTriggerActor.OnOverlapEndDoing // (Final|Native|Public|BlueprintCallable) // @ game+0x61e6f30
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.AreaTriggerActor.OnOverlapEnd // (Native|Public|BlueprintCallable) // @ game+0x36ceb50
	void OnOverlapBeginDoing(); // Function DFMGameplay.AreaTriggerActor.OnOverlapBeginDoing // (Final|Native|Public|BlueprintCallable) // @ game+0x61e6f10
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AreaTriggerActor.OnOverlapBegin // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x36ce950
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BodyArmorMgr
// Size: 0x48 (Inherited: 0x38)
class UBodyArmorMgr : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.HelmetFunctionMgr
// Size: 0x48 (Inherited: 0x38)
class UHelmetFunctionMgr : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ProtectBodyDefineMgr
// Size: 0x48 (Inherited: 0x38)
class UProtectBodyDefineMgr : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ArmorDurabilityFormulaMgr
// Size: 0x48 (Inherited: 0x38)
class UArmorDurabilityFormulaMgr : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ArmorGlobalConfig
// Size: 0x40 (Inherited: 0x40)
class UArmorGlobalConfig : public UDeveloperSettings {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ArmorDurabilityMgr
// Size: 0x98 (Inherited: 0x38)
class UArmorDurabilityMgr : public UWorldSubsystem {
public:

	struct TMap<uint64_t, struct FProcessDurabilityRecordCollection> ProcessDurabilityRecord; // 0x38(0x50)
	struct UArmorDurabilityHandler_Sol* ArmorDurabilityHandler_Sol; // 0x88(0x08)
	struct UArmorDurabilityHandler* ArmorDurabilityHandler_Default; // 0x90(0x08)

	struct UArmorDurabilityMgr* STATIC_Get(struct UObject* WorldContext); // Function DFMGameplay.ArmorDurabilityMgr.Get // (Final|Native|Static|Public) // @ game+0x61eb3d0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AvoidanceBoxComponent
// Size: 0x5c0 (Inherited: 0x590)
class UAvoidanceBoxComponent : public UBoxComponent {
public:

	enum class EAvoidanceBoxType AvoidanceBoxType; // 0x590(0x01)
	char pad_591[0x3]; // 0x591(0x03)
	float DuringTime; // 0x594(0x04)
	struct TArray<struct FName> AllowTags; // 0x598(0x10)
	struct TArray<struct FName> Tags; // 0x5a8(0x10)
	enum class EMovePlanAvoidanceStatus MovePlanStatus; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	float RestoreIdleTime; // 0x5bc(0x04)

	void OnStartMove(); // Function DFMGameplay.AvoidanceBoxComponent.OnStartMove // (Final|Native|Public) // @ game+0x61ebdd0
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.AvoidanceBoxComponent.OnOverlapBegin // (Final|Native|Private|HasOutParms) // @ game+0x61ebbd0
	void OnFinishMove(); // Function DFMGameplay.AvoidanceBoxComponent.OnFinishMove // (Final|Native|Public) // @ game+0x61ebbb0
	void MovePlan(struct AActor* OtherActor, struct UAvoidanceBoxComponent* OtherComp); // Function DFMGameplay.AvoidanceBoxComponent.MovePlan // (Final|Native|Private) // @ game+0x61eb770
	void ForceStopMove(); // Function DFMGameplay.AvoidanceBoxComponent.ForceStopMove // (Final|Native|Private) // @ game+0x61eb3b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BattleFieldBackgroundCharacterVoiceDataManager
// Size: 0x58 (Inherited: 0x38)
class UBattleFieldBackgroundCharacterVoiceDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)
	struct TArray<struct UGPAudioEventAsset*> AudioEventAssets; // 0x48(0x10)

	void OnVoiceDataLoadComplete(struct TArray<struct FSoftObjectPath> Assets); // Function DFMGameplay.BattleFieldBackgroundCharacterVoiceDataManager.OnVoiceDataLoadComplete // (Final|Native|Public) // @ game+0x61ebdf0
	void GetBackgroundCharacterVoiceRow(int32_t InMapID, struct FBattleFieldBackgroundCharacterVoiceRow& OutRow); // Function DFMGameplay.BattleFieldBackgroundCharacterVoiceDataManager.GetBackgroundCharacterVoiceRow // (Final|Native|Public|HasOutParms) // @ game+0x61eb490
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BattleFieldDeduceDataManager
// Size: 0x58 (Inherited: 0x38)
class UBattleFieldDeduceDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)
	struct TArray<struct UObject*> SequenceActors; // 0x48(0x10)

	void OnDeduceDataLoadComplete(struct TArray<struct FSoftObjectPath> Assets); // Function DFMGameplay.BattleFieldDeduceDataManager.OnDeduceDataLoadComplete // (Final|Native|Public) // @ game+0x61eba20
	void GetDeduceRow(int32_t InMapID, struct FBattleFieldDeduceRow& OutRow); // Function DFMGameplay.BattleFieldDeduceDataManager.GetDeduceRow // (Final|Native|Public|HasOutParms) // @ game+0x61eb600
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakthroughDataExtraManager
// Size: 0x168 (Inherited: 0x38)
class UBreakthroughDataExtraManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x130]; // 0x38(0x130)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ConquestDataExtraManager
// Size: 0x188 (Inherited: 0x38)
class UConquestDataExtraManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x150]; // 0x38(0x150)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BehaviorScoreExtraTableManager
// Size: 0xb0 (Inherited: 0x38)
class UBehaviorScoreExtraTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x78]; // 0x38(0x78)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BattleRouteNav
// Size: 0x210 (Inherited: 0x30)
class UBattleRouteNav : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct ABattleRoutePoint*> RoutePoints; // 0x40(0x10)
	char pad_50[0x130]; // 0x50(0x130)
	struct TMap<struct AActor*, struct FBattleRouteArrayList> SectorRoutePointMap; // 0x180(0x50)
	struct TArray<struct FSectorBattleRoutePointPair> PendingCalcSectorBoundArray; // 0x1d0(0x10)
	char pad_1E0[0x30]; // 0x1e0(0x30)

	void SecondTick(); // Function DFMGameplay.BattleRouteNav.SecondTick // (Final|Native|Public) // @ game+0x61f1960
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BattleRoutePoint
// Size: 0x410 (Inherited: 0x378)
class ABattleRoutePoint : public AActor {
public:

	bool DrawDoubleWayPath; // 0x378(0x01)
	enum class EBattleRoutePointType PointType; // 0x379(0x01)
	char pad_37A[0x6]; // 0x37a(0x06)
	struct TArray<struct FBattleRouteLink> NextPoints; // 0x380(0x10)
	/*struct TSoftObjectPtr<AActor>*/char BindSector[0x28]; // 0x390(0x28)
	float FlankWeight; // 0x3b8(0x04)
	int32_t SectorPriority; // 0x3bc(0x04)
	float StaticPathScale; // 0x3c0(0x04)
	float DynamicPathScale; // 0x3c4(0x04)
	float DynamicRandomDeviation; // 0x3c8(0x04)
	float LinkCostScale; // 0x3cc(0x04)
	float VaultCostScale; // 0x3d0(0x04)
	float EditorCreateLinkerDistance; // 0x3d4(0x04)
	float EditorCreateLinkerDegLimit; // 0x3d8(0x04)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct ULineBatchComponent* LineComp; // 0x3e0(0x08)
	struct ABattleRoutePoint* TestDestPoint; // 0x3e8(0x08)
	uint32_t TestSearchUin; // 0x3f0(0x04)
	uint32_t TestSearchCamp; // 0x3f4(0x04)
	bool TestOccupyPath; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	float TestPathConsume; // 0x3fc(0x04)
	char pad_400[0x10]; // 0x400(0x10)

	void OnLevelSelectionChanged(struct UObject* NewSelection); // Function DFMGameplay.BattleRoutePoint.OnLevelSelectionChanged // (Final|Native|Public) // @ game+0x61f0cb0
	void FixInnerLinkAfterLevelCopy(); // Function DFMGameplay.BattleRoutePoint.FixInnerLinkAfterLevelCopy // (Final|Native|Public) // @ game+0x61f0470
	void EditorTestReleaseAllOccupy(); // Function DFMGameplay.BattleRoutePoint.EditorTestReleaseAllOccupy // (Final|Native|Public) // @ game+0x61f0450
	void EditorTestFindDest(); // Function DFMGameplay.BattleRoutePoint.EditorTestFindDest // (Final|Native|Public) // @ game+0x61f0430
	void EditorTestCheckRouteVaild(); // Function DFMGameplay.BattleRoutePoint.EditorTestCheckRouteVaild // (Final|Native|Public) // @ game+0x61f0410
	void EditorRefresh(); // Function DFMGameplay.BattleRoutePoint.EditorRefresh // (Final|Native|Public) // @ game+0x61f03f0
	void EditorHideRoutePath(); // Function DFMGameplay.BattleRoutePoint.EditorHideRoutePath // (Final|Native|Public) // @ game+0x61f03d0
	void EditorFillBindSector(); // Function DFMGameplay.BattleRoutePoint.EditorFillBindSector // (Final|Native|Public) // @ game+0x61f03b0
	void EditorDrawRoutePathUpdateCost(); // Function DFMGameplay.BattleRoutePoint.EditorDrawRoutePathUpdateCost // (Final|Native|Public) // @ game+0x61f0390
	void EditorDrawRoutePathOnly(); // Function DFMGameplay.BattleRoutePoint.EditorDrawRoutePathOnly // (Final|Native|Public) // @ game+0x61f0370
	void EditorCreateLink(); // Function DFMGameplay.BattleRoutePoint.EditorCreateLink // (Final|Native|Public) // @ game+0x61f0350
	void AllAttachToNav(); // Function DFMGameplay.BattleRoutePoint.AllAttachToNav // (Final|Native|Public) // @ game+0x61f0210
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BlueprintPlunder
// Size: 0xd58 (Inherited: 0x378)
class ABlueprintPlunder : public AActor {
public:

	char pad_378[0x8]; // 0x378(0x08)
	struct FBlueprintPlunderInfo BlueprintWeaponInfo; // 0x380(0xb0)
	char pad_430[0x8]; // 0x430(0x08)
	bool bTriggerEvent; // 0x438(0x01)
	bool bDelayStart; // 0x439(0x01)
	char pad_43A[0x2]; // 0x43a(0x02)
	int32_t DelayStartTimeMin; // 0x43c(0x04)
	int32_t DelayStartTimeMax; // 0x440(0x04)
	struct FName TargetPoolIdName; // 0x444(0x08)
	struct FName TargetPoolIdName_Level2; // 0x44c(0x08)
	int32_t DefaultDecipherDuration; // 0x454(0x04)
	int32_t DefaultWaitingRecycleDuration; // 0x458(0x04)
	char pad_45C[0xc]; // 0x45c(0x0c)
	float EnemyDecipherDistanceRange; // 0x468(0x04)
	struct FBlueprintPlunderDangerDistanceConfig DangerDistanceConfig; // 0x46c(0x0c)
	struct FBlueprintPlunderUIConfig UIConfig; // 0x478(0x60)
	struct FBlueprintPlunderBannerTextConfig BannerTextConfig; // 0x4d8(0xe8)
	struct FBlueprintPlunderMainHudTextConfig MainHudTextConfig; // 0x5c0(0xd8)
	struct FBlueprintPlunderTipsBoxTextConfig TipsBoxTextConfig; // 0x698(0x78)
	struct FProgressBarConfig ProgressBarConfig; // 0x710(0x50)
	struct FUI2DAudioConfig UI2DAudioConfig; // 0x760(0x60)
	struct FInteract3DAudioConfig Interact3DAudioConfig; // 0x7c0(0x50)
	struct FVOConfig VOConfig; // 0x810(0x70)
	float PickUpVOTimeCD; // 0x880(0x04)
	float MapWorldRange; // 0x884(0x04)
	float DSUpdateLocRate; // 0x888(0x04)
	float MapRippleTrackRate; // 0x88c(0x04)
	bool bDrawLine; // 0x890(0x01)
	char pad_891[0x3]; // 0x891(0x03)
	float InDangerVOTimer; // 0x894(0x04)
	float FindGroundStartOffSetZ; // 0x898(0x04)
	float FindGroundEndOffSetZ; // 0x89c(0x04)
	float ScreenMarkerZOffSet_NoPickup; // 0x8a0(0x04)
	float ScreenMarkerZOffSet_Pickup; // 0x8a4(0x04)
	float DSReportLocRate; // 0x8a8(0x04)
	bool bCheckStartMatchInfo; // 0x8ac(0x01)
	char pad_8AD[0x2b]; // 0x8ad(0x2b)
	struct TArray<struct ABlueprintWeaponGenerator*> AllSpawners; // 0x8d8(0x10)
	struct TArray<struct ABlueprintWeaponGenerator*> RandomSpawners; // 0x8e8(0x10)
	char pad_8F8[0xc0]; // 0x8f8(0xc0)
	struct UWeaponBlueprintIconViewController* WeaponBlueprintIconViewController; // 0x9b8(0x08)
	struct TArray<struct UMapLineViewController*> MapLineViewControllerArr; // 0x9c0(0x10)
	char pad_9D0[0x38]; // 0x9d0(0x38)
	struct TArray<struct UGPAudioEventAsset*> MandelUIAudioArr; // 0xa08(0x10)
	char pad_A18[0x8]; // 0xa18(0x08)
	struct TMap<enum class EInteract3DAudioType, struct UGPAudioEventAsset*> Mandel3DAudioMap; // 0xa20(0x50)
	struct TArray<struct UGPAudioEventAsset*> Mandel3DAudioArr; // 0xa70(0x10)
	char pad_A80[0x68]; // 0xa80(0x68)
	struct AInteractor_DecipherDevice* ClientPutInDecipherDevice; // 0xae8(0x08)
	char pad_AF0[0x10]; // 0xaf0(0x10)
	float ShowEstimatedTime; // 0xb00(0x04)
	float ExistEstimatedTime; // 0xb04(0x04)
	float FlyEstimatedTime; // 0xb08(0x04)
	float ConfigRange; // 0xb0c(0x04)
	float ConfigStopTime; // 0xb10(0x04)
	float DirectEngageRange; // 0xb14(0x04)
	float StayingEngageRange; // 0xb18(0x04)
	float StayingEngageTime; // 0xb1c(0x04)
	float DamageEngageRange; // 0xb20(0x04)
	char pad_B24[0x174]; // 0xb24(0x174)
	struct TMap<struct ADFMCharacter*, float> PendingRangeCharacterMap; // 0xc98(0x50)
	char pad_CE8[0x10]; // 0xce8(0x10)
	struct TMap<struct ADFMCharacter*, float> PendingRangeCharacterMap_New; // 0xcf8(0x50)
	char pad_D48[0x8]; // 0xd48(0x08)
	float ClientNotCheckStartMatchTime; // 0xd50(0x04)
	char pad_D54[0x4]; // 0xd54(0x04)

	void SOLEventEstimatedTimeCreated(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameplay.BlueprintPlunder.SOLEventEstimatedTimeCreated // (Final|Native|Public) // @ game+0x61f1860
	void SOLEventBannerInit(bool bInit); // Function DFMGameplay.BlueprintPlunder.SOLEventBannerInit // (Final|Native|Public) // @ game+0x61f17d0
	void ServerWaitingRecycleEnd(); // Function DFMGameplay.BlueprintPlunder.ServerWaitingRecycleEnd // (Final|Native|Public) // @ game+0x61f19a0
	void ServerResetDecipherDeviceEnd(); // Function DFMGameplay.BlueprintPlunder.ServerResetDecipherDeviceEnd // (Final|Native|Public) // @ game+0x61f1980
	void RandomSpawnBlueprintWeapon(); // Function DFMGameplay.BlueprintPlunder.RandomSpawnBlueprintWeapon // (Final|Native|Public) // @ game+0x61f17b0
	void PlayerDangerVONextTick(); // Function DFMGameplay.BlueprintPlunder.PlayerDangerVONextTick // (Final|Native|Public) // @ game+0x61f1790
	void OnTakeDamage(struct FDamageResultInfo& DamageResult); // Function DFMGameplay.BlueprintPlunder.OnTakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x61f16c0
	void OnSOLTrainHighValueBoxEvacuate(struct AActor* TrainHighValueBox); // Function DFMGameplay.BlueprintPlunder.OnSOLTrainHighValueBoxEvacuate // (Final|Native|Public) // @ game+0x61f1400
	void OnSOLTimelineEventStateChange(struct TArray<enum class ESOLEventState>& EventStates); // Function DFMGameplay.BlueprintPlunder.OnSOLTimelineEventStateChange // (Final|Native|Public|HasOutParms) // @ game+0x61f1330
	void OnShowSOLEventBannerFlyIcon(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameplay.BlueprintPlunder.OnShowSOLEventBannerFlyIcon // (Final|Native|Public) // @ game+0x61f15c0
	void OnServerLocalPlayerIsAliveChanged(struct AController* InPlayer); // Function DFMGameplay.BlueprintPlunder.OnServerLocalPlayerIsAliveChanged // (Final|Native|Public) // @ game+0x61f1540
	void OnServerGameEnd(enum class EMatchOverReason MatchOverReason, int64_t PlayerUin); // Function DFMGameplay.BlueprintPlunder.OnServerGameEnd // (Final|Native|Public) // @ game+0x61f1480
	void OnRep_BlueprintPlunderInfo_Intro(); // Function DFMGameplay.BlueprintPlunder.OnRep_BlueprintPlunderInfo_Intro // (Final|Native|Public) // @ game+0x61f1310
	void OnRep_BlueprintPlunderInfo(); // Function DFMGameplay.BlueprintPlunder.OnRep_BlueprintPlunderInfo // (Final|Native|Public) // @ game+0x61f12f0
	void OnPlayerKilledServerNotify(struct FKillInfo& NewAddKillInfo, struct UGPModularWeaponDesc* WeaponDesc); // Function DFMGameplay.BlueprintPlunder.OnPlayerKilledServerNotify // (Final|Native|Public|HasOutParms) // @ game+0x61f11f0
	void OnPlayerEscape(struct ACHARACTER* CHARACTER, struct AController* Controller); // Function DFMGameplay.BlueprintPlunder.OnPlayerEscape // (Final|Native|Public) // @ game+0x61f1130
	void OnMandelUIAudioLoadedComplete(struct TArray<struct FSoftObjectPath> EventAssetsToLoad); // Function DFMGameplay.BlueprintPlunder.OnMandelUIAudioLoadedComplete // (Final|Native|Public) // @ game+0x61f0fa0
	void OnMandel3DAudioLoadedComplete(struct TArray<struct FSoftObjectPath> EventAssetsToLoad, struct TArray<enum class EInteract3DAudioType> AudioTypes); // Function DFMGameplay.BlueprintPlunder.OnMandel3DAudioLoadedComplete // (Final|Native|Public) // @ game+0x61f0d50
	void OnLoadedAllControllerClass(); // Function DFMGameplay.BlueprintPlunder.OnLoadedAllControllerClass // (Final|Native|Public) // @ game+0x61f0d30
	void OnClientPlayerEnterOrLeftExitPoint(struct APlayerExitBase* ExitPoint, bool ExitOrNotice, bool bEnterOrLeft); // Function DFMGameplay.BlueprintPlunder.OnClientPlayerEnterOrLeftExitPoint // (Final|Native|Public) // @ game+0x61f0ad0
	void OnClientPlayerEnteredExitPoint(struct APlayerExitBase* ExitPoint, bool ExitOrNotice); // Function DFMGameplay.BlueprintPlunder.OnClientPlayerEnteredExitPoint // (Final|Native|Public) // @ game+0x61f0be0
	void OnBlueprintPlunderRefreshGenerator(int32_t SpawnerID); // Function DFMGameplay.BlueprintPlunder.OnBlueprintPlunderRefreshGenerator // (Final|Native|Public) // @ game+0x61f0a50
	void OnBlueprintPlunderDisableDelay(); // Function DFMGameplay.BlueprintPlunder.OnBlueprintPlunderDisableDelay // (Final|Native|Public) // @ game+0x61f0a30
	void OBClientBroadcastPlunderInfo(); // Function DFMGameplay.BlueprintPlunder.OBClientBroadcastPlunderInfo // (Final|Native|Public) // @ game+0x61f0a10
	void NotCheckStartMatchHandle(); // Function DFMGameplay.BlueprintPlunder.NotCheckStartMatchHandle // (Final|Native|Public) // @ game+0x61f09f0
	void MultiCastLoseMandelBrick(int32_t TeamId); // Function DFMGameplay.BlueprintPlunder.MultiCastLoseMandelBrick // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0xbcc460
	void LocalPlayerEnterBattleDecipherDevice(struct AInteractor_DecipherDevice* DecipherDevice, bool bEnter); // Function DFMGameplay.BlueprintPlunder.LocalPlayerEnterBattleDecipherDevice // (Final|Native|Public) // @ game+0x61f0920
	void HudLoaded_SOLEventBanner(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameplay.BlueprintPlunder.HudLoaded_SOLEventBanner // (Final|Native|Public) // @ game+0x61f0820
	void HudLoaded_LeftProgressTipsHudView(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameplay.BlueprintPlunder.HudLoaded_LeftProgressTipsHudView // (Final|Native|Public) // @ game+0x61f0720
	void HudLoaded_EventProgress(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameplay.BlueprintPlunder.HudLoaded_EventProgress // (Final|Native|Public) // @ game+0x61f0620
	void HudLoaded_CenterEventHintView(struct FString FunctionName, struct UBaseUIView* View); // Function DFMGameplay.BlueprintPlunder.HudLoaded_CenterEventHintView // (Final|Native|Public) // @ game+0x61f0520
	int32_t GetDecipherRemainCountDownTime(); // Function DFMGameplay.BlueprintPlunder.GetDecipherRemainCountDownTime // (Final|Native|Public|BlueprintCallable) // @ game+0x61f04f0
	float GetDecipherAndRecycleProgress(); // Function DFMGameplay.BlueprintPlunder.GetDecipherAndRecycleProgress // (Final|Native|Public) // @ game+0x61f04c0
	int32_t GetCurrentCountDownTime(); // Function DFMGameplay.BlueprintPlunder.GetCurrentCountDownTime // (Final|Native|Public) // @ game+0x61f0490
	void DSUpdateBlueprintWeaponLocation(); // Function DFMGameplay.BlueprintPlunder.DSUpdateBlueprintWeaponLocation // (Final|Native|Public) // @ game+0x61f0310
	void DSReportLoc(); // Function DFMGameplay.BlueprintPlunder.DSReportLoc // (Final|Native|Public) // @ game+0x61f02f0
	void DelayPlayMandelLp(); // Function DFMGameplay.BlueprintPlunder.DelayPlayMandelLp // (Final|Native|Public) // @ game+0x61f0330
	void ClientShowEstimatedTimeHud_Inner2Copy(); // Function DFMGameplay.BlueprintPlunder.ClientShowEstimatedTimeHud_Inner2Copy // (Final|Native|Public) // @ game+0x61f02b0
	void ClientShowEstimatedTimeHud_Inner(); // Function DFMGameplay.BlueprintPlunder.ClientShowEstimatedTimeHud_Inner // (Final|Native|Public) // @ game+0x61f02d0
	void ClientEnemyUpdateScreenMarkersInner(); // Function DFMGameplay.BlueprintPlunder.ClientEnemyUpdateScreenMarkersInner // (Final|Native|Public) // @ game+0x61f0290
	void ClientCreateMapIcons(); // Function DFMGameplay.BlueprintPlunder.ClientCreateMapIcons // (Final|Native|Public) // @ game+0x61f0270
	void CheckMandelBrickOccur(); // Function DFMGameplay.BlueprintPlunder.CheckMandelBrickOccur // (Final|Native|Public) // @ game+0x61f0250
	void BroadcastPlunderInfoUpdate(); // Function DFMGameplay.BlueprintPlunder.BroadcastPlunderInfoUpdate // (Final|Native|Public) // @ game+0x61f0230
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BlueprintWeaponGenerator
// Size: 0x3a8 (Inherited: 0x378)
class ABlueprintWeaponGenerator : public AActor {
public:

	uint32_t SpawnerID; // 0x378(0x04)
	uint32_t SpawnWeight; // 0x37c(0x04)
	struct AInteractor_DecipherDevice* SpawnerPoint; // 0x380(0x08)
	struct TArray<struct AInteractor_DecipherDevice*> DecipherDeviceArr; // 0x388(0x10)
	struct FName CallAITag; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BossLocationActor
// Size: 0x388 (Inherited: 0x378)
class ABossLocationActor : public AActor {
public:

	struct FName BossNameID; // 0x378(0x08)
	float BigMapBossWorldRange; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BoxCollisionCollectionActor
// Size: 0x398 (Inherited: 0x378)
class ABoxCollisionCollectionActor : public AActor {
public:

	struct TArray<struct UBoxComponent*> BoxComponents; // 0x378(0x10)
	struct FString CollectionName; // 0x388(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableAnimInstance
// Size: 0xa00 (Inherited: 0x280)
class UBreakableAnimInstance : public UAnimInstance {
public:

	struct FBreakableAnimAnimProxy AnimProxy; // 0x280(0x780)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableDeveloperSetting
// Size: 0x58 (Inherited: 0x40)
class UBreakableDeveloperSetting : public UDeveloperSettings {
public:

	bool bReplaceWarningMatForInvalidBP; // 0x40(0x01)
	bool bAllowInvalidBPUseInLevel; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct TArray<struct FString> InValidBPAllowWhiteLevelPaths; // 0x48(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableEnvDetectorComponent
// Size: 0x118 (Inherited: 0x100)
class UBreakableEnvDetectorComponent : public UActorComponent {
public:

	char bDetectKickDoorEvent : 1; // 0x100(0x01)
	char pad_100_1 : 7; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float KickDoorDetectionDistance; // 0x104(0x04)
	float KickDoorResponseTime; // 0x108(0x04)
	char bDetectAirHit : 1; // 0x10c(0x01)
	char pad_10C_1 : 7; // 0x10c(0x01)
	char pad_10D[0x3]; // 0x10d(0x03)
	float AirHitDetectionDistance; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)

	void OnDetecteAirHit(struct APawn* SourcePawn, struct FHitResult& HitReslut); // Function DFMGameplay.BreakableEnvDetectorComponent.OnDetecteAirHit // (Final|Native|Protected|HasOutParms) // @ game+0x61f56c0
	void NotifyBreak(); // Function DFMGameplay.BreakableEnvDetectorComponent.NotifyBreak // (Final|Native|Protected) // @ game+0x61f51d0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableFoliage
// Size: 0x758 (Inherited: 0x378)
class ABreakableFoliage : public AActor {
public:

	char pad_378[0x20]; // 0x378(0x20)
	bool bIsGlobal; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	float DamageInterestRadius; // 0x39c(0x04)
	struct UPhysXSerialComponent* PhysxProxyComp; // 0x3a0(0x08)
	struct UBreakableFoliageHealthComponent* TreeHealthComp; // 0x3a8(0x08)
	struct UBreakableFoliageHealthComponent* GrassHealthComp; // 0x3b0(0x08)
	struct TMap<struct FString, struct UClass*> MeshName2BreakableBP; // 0x3b8(0x50)
	char pad_408[0x50]; // 0x408(0x50)
	struct FFoliageRadialDamageArray RadialDamageArray; // 0x458(0x120)
	struct FFoliagePointDamageArray PointDamageArray; // 0x578(0x120)
	struct FName AssetName; // 0x698(0x08)
	char pad_6A0[0xb8]; // 0x6a0(0xb8)

	void SpawnFoliagePerformanceBpAsync(struct FString MeshName, struct FTransform& Transform); // Function DFMGameplay.BreakableFoliage.SpawnFoliagePerformanceBpAsync // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x61f5f60
	void OnTakeRadialDamage(struct FVector HitPosition, float HitRadius, float DamageVal); // Function DFMGameplay.BreakableFoliage.OnTakeRadialDamage // (Final|Native|Public|HasDefaults) // @ game+0x61f5bd0
	void OnTakePointDamage(int32_t UniqueId, float DamageVal); // Function DFMGameplay.BreakableFoliage.OnTakePointDamage // (Final|Native|Public) // @ game+0x61f5b10
	void OnServerPostRadialDamage(struct FDamageSourceInfo& DamageSource, struct TArray<struct FDamageResultInfo>& DamageResults); // Function DFMGameplay.BreakableFoliage.OnServerPostRadialDamage // (Final|Native|Public|HasOutParms) // @ game+0x61f5820
	void OnDestructRigid(struct UBreakableFoliageHealthComponent* Comp, int32_t UnitIndex); // Function DFMGameplay.BreakableFoliage.OnDestructRigid // (Final|Native|Public) // @ game+0x61f5600
	void OnDestructEnd(struct AActor* From, struct FString MeshName, struct TArray<int32_t> InsIndices, struct TArray<struct FTransform> Scatters); // Function DFMGameplay.BreakableFoliage.OnDestructEnd // (Final|Native|Public) // @ game+0x61f5320
	void OnDestructCover(struct UBreakableFoliageHealthComponent* Comp, struct FVector Position, float radius); // Function DFMGameplay.BreakableFoliage.OnDestructCover // (Final|Native|Public|HasDefaults) // @ game+0x61f5210
	void MultiPlayTreeDestructibleEffect(struct FString MeshName, struct FTransform WorldTrans); // Function DFMGameplay.BreakableFoliage.MultiPlayTreeDestructibleEffect // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x61f5080
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesFoliageWorldSubsystem
// Size: 0xd8 (Inherited: 0x38)
class UDesFoliageWorldSubsystem : public UWorldSubsystem {
public:

	struct TMap<struct FName, struct ABreakableFoliage*> BreakableFoliages; // 0x38(0x50)
	struct TMap<struct FName, struct UPhysXSerialComponent*> PhysXSerialComps; // 0x88(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableFoliageHealthComponent
// Size: 0x128 (Inherited: 0x100)
class UBreakableFoliageHealthComponent : public UActorComponent {
public:

	struct TArray<struct FPlantUnitHeathInfo> UnitHPs; // 0x100(0x10)
	float MaxHP; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	/*struct FMulticastInlineDelegate*/char OnPlantUnitDamaged[0x10]; // 0x118(0x10)

	float GetHPPercent(int32_t UnitID); // Function DFMGameplay.BreakableFoliageHealthComponent.GetHPPercent // (Final|Native|Public|BlueprintCallable) // @ game+0x61f4bb0
	float GetHealth(int32_t UnitID); // Function DFMGameplay.BreakableFoliageHealthComponent.GetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x61f4c70
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableHealthComponent
// Size: 0x150 (Inherited: 0x100)
class UBreakableHealthComponent : public UActorComponent {
public:

	struct FBreakableDamageInfo DamageInfo; // 0x100(0x20)
	float MaxHP; // 0x120(0x04)
	bool WillNotDie; // 0x124(0x01)
	char pad_125[0x3]; // 0x125(0x03)
	float RespawnHP; // 0x128(0x04)
	char pad_12C[0x4]; // 0x12c(0x04)
	/*struct FMulticastInlineDelegate*/char OnHealthChanged[0x10]; // 0x130(0x10)
	/*struct FMulticastInlineDelegate*/char OnBreakableEndChanged[0x10]; // 0x140(0x10)

	void SetHP(float HP); // Function DFMGameplay.BreakableHealthComponent.SetHP // (Final|Native|Public|BlueprintCallable) // @ game+0x61f5ec0
	void OnRep_DamageInfoChanged(); // Function DFMGameplay.BreakableHealthComponent.OnRep_DamageInfoChanged // (Final|Native|Protected) // @ game+0x61f5800
	float GetHPRate(); // Function DFMGameplay.BreakableHealthComponent.GetHPRate // (Final|Native|Public|BlueprintCallable) // @ game+0x61f4c40
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableHealthLossComponent
// Size: 0x1b0 (Inherited: 0x100)
class UBreakableHealthLossComponent : public UActorComponent {
public:

	float LossHealthThreshold; // 0x100(0x04)
	float LossHealthRatePerSecond; // 0x104(0x04)
	struct FName ParticleFName; // 0x108(0x08)
	bool isParticleFollowHitPosition; // 0x110(0x01)
	char pad_111[0xf]; // 0x111(0x0f)
	struct FTransform FollowHitPositionOffsetTransform; // 0x120(0x30)
	struct FTransform NormalOffsetTransform; // 0x150(0x30)
	bool isFollowActorRotationPitch; // 0x180(0x01)
	bool isFollowActorRotationYaw; // 0x181(0x01)
	bool isFollowActorRotationRoll; // 0x182(0x01)
	char pad_183[0x5]; // 0x183(0x05)
	struct ABreakableItem* BreakableItem; // 0x188(0x08)
	char pad_190[0x10]; // 0x190(0x10)
	struct UFXResourceContainerComponent* PSComponent; // 0x1a0(0x08)
	char pad_1A8[0x8]; // 0x1a8(0x08)

	void GetHitDoing(float& HealthAfterHit, struct FDamageResultInfo& DamageResult); // Function DFMGameplay.BreakableHealthLossComponent.GetHitDoing // (Final|Native|Protected|HasOutParms) // @ game+0x61f4d00
	void ExplosionDoing(); // Function DFMGameplay.BreakableHealthLossComponent.ExplosionDoing // (Final|Native|Protected) // @ game+0x61f4b70
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableItemsReplication
// Size: 0x468 (Inherited: 0x378)
class ABreakableItemsReplication : public AActor {
public:

	char pad_378[0x50]; // 0x378(0x50)
	struct TMap<struct FName, bool> ItemBreakStateMap; // 0x3c8(0x50)
	char pad_418[0x50]; // 0x418(0x50)

	void OnRep_ItemBreakStateChange(); // Function DFMGameplay.BreakableItemsReplication.OnRep_ItemBreakStateChange // (Final|Native|Protected) // @ game+0x61f9070
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakablePawn
// Size: 0x5b8 (Inherited: 0x3d8)
class ABreakablePawn : public APawn {
public:

	char pad_3D8[0x38]; // 0x3d8(0x38)
	bool bIgnoreDamageOnPrematch; // 0x410(0x01)
	enum class EBreakableMeshDisappearMode MeshDisappearMode; // 0x411(0x01)
	char pad_412[0x6]; // 0x412(0x06)
	struct TArray<struct FName> DisappearMeshNameList; // 0x418(0x10)
	float ActorLifeTime; // 0x428(0x04)
	enum class EBreakableDebrisLoadMode DebrisLoadMode; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
	/*struct TSoftObjectPtr<UStaticMesh>*/char BreakableDebrisStaticMesh[0x28]; // 0x430(0x28)
	struct FName DebrisStaticMeshCompName; // 0x458(0x08)
	bool bIsChangeToDebrisAtAnimationEnd; // 0x460(0x01)
	bool bIsIgnoreRootComponentCollision; // 0x461(0x01)
	enum class EBreakableTriggerMode TriggerMode; // 0x462(0x01)
	char pad_463[0x5]; // 0x463(0x05)
	struct TArray<struct FBreakableCollisionFilterInfo> CollisionFilterInfoArray; // 0x468(0x10)
	struct TArray<struct FBreakableDamageFilterInfo> DamageFilterInfoArray; // 0x478(0x10)
	struct TArray<struct FBreakableDamageFilterInfo> DamageRejectFilterInfoArray; // 0x488(0x10)
	struct TArray<struct FBreakableTriggerPairInfo> TriggerInfoArray; // 0x498(0x10)
	struct FName DefaultNavAreaBoxName; // 0x4a8(0x08)
	bool bIsIgnoreManagerControl; // 0x4b0(0x01)
	bool bIsHiddenInteractor; // 0x4b1(0x01)
	bool bServerControl; // 0x4b2(0x01)
	char pad_4B3[0x5]; // 0x4b3(0x05)
	/*struct FMulticastInlineDelegate*/char OnStateChange[0x10]; // 0x4b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayDestructionAnimation[0x10]; // 0x4c8(0x10)
	struct UGeneralSignificanceComponent* Significance; // 0x4d8(0x08)
	struct UBoxComponent* BoxComponent; // 0x4e0(0x08)
	struct UBreakableHealthComponent* HealthComponent; // 0x4e8(0x08)
	/*struct UGPDestructibleComponent**/char DestructibleComponent[0x8]; // 0x4f0(0x08)
	struct TArray<struct UBoxComponent*> NavAreaComponentList; // 0x4f8(0x10)
	struct TArray<struct UBreakableHealthComponent*> HealthComponentList; // 0x508(0x10)
	/*struct TArray<struct UGPDestructibleComponent*>*/char DestructibleComponentList[0x10]; // 0x518(0x10)
	struct TArray<struct UBoxComponent*> BoxComponentList; // 0x528(0x10)
	struct TArray<struct UActorComponent*> OriginPrimitiveCompnentList; // 0x538(0x10)
	struct TArray<struct UGPSkeletalMeshComponent*> SkeletalMeshsFromBlueprint; // 0x548(0x10)
	char pad_558[0x29]; // 0x558(0x29)
	bool bHasBreaked; // 0x581(0x01)
	char pad_582[0x16]; // 0x582(0x16)
	struct UStaticMeshComponent* GlassMeshComp_Mobile; // 0x598(0x08)
	struct UStaticMeshComponent* InGlassMeshComp_HD; // 0x5a0(0x08)
	struct UStaticMeshComponent* OutGlassMeshComp_HD; // 0x5a8(0x08)
	bool bIsGlass; // 0x5b0(0x01)
	bool bNeedOpenVisibilityCollision; // 0x5b1(0x01)
	char pad_5B2[0x6]; // 0x5b2(0x06)

	void SetTickEnable(bool bEnabled); // Function DFMGameplay.BreakablePawn.SetTickEnable // (Final|Native|Public|BlueprintCallable) // @ game+0x61f98c0
	void SetSkeletalMeshInManagerControl(struct UGPSkeletalMeshComponent* SkeletalMeshComponent, bool IsPlayAnim, bool IsPlayPhysic); // Function DFMGameplay.BreakablePawn.SetSkeletalMeshInManagerControl // (Final|Native|Public|BlueprintCallable) // @ game+0x61f97b0
	void SetPawnState(enum class EPawnState NewState); // Function DFMGameplay.BreakablePawn.SetPawnState // (Final|Native|Public|BlueprintCallable) // @ game+0x61f9730
	void SetIsDestructibleEnd(bool IsEnd); // Function DFMGameplay.BreakablePawn.SetIsDestructibleEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x61f96a0
	bool SetHP(float HP); // Function DFMGameplay.BreakablePawn.SetHP // (Final|Native|Public) // @ game+0x61f9610
	void ServerSuicide(struct AActor* AttackerActor, struct FHitResult HitInfo); // Function DFMGameplay.BreakablePawn.ServerSuicide // (Final|Native|Public|BlueprintCallable) // @ game+0x61f93b0
	void Reset(); // Function DFMGameplay.BreakablePawn.Reset // (Final|Native|Public|BlueprintCallable) // @ game+0x21b34a0
	void PlayBreakAndClearHealthAll(); // Function DFMGameplay.BreakablePawn.PlayBreakAndClearHealthAll // (Final|Native|Public|BlueprintCallable) // @ game+0x61f9090
	void OnRep_HasBreaked(bool Pre); // Function DFMGameplay.BreakablePawn.OnRep_HasBreaked // (Final|Native|Private) // @ game+0x61f8fe0
	void OnDestructionComponentPlayEffectEnd(/*struct UGPDestructibleComponent* DestructibleComponent, struct UGPSkeletalMeshComponent* SkeletalMeshComponent*/); // Function DFMGameplay.BreakablePawn.OnDestructionComponentPlayEffectEnd // (Final|Native|Private) // @ game+0x61f8ee0
	void OnDestructionComponentPlayEffectBegin(/*struct UGPDestructibleComponent* DestructibleComponent, struct UGPSkeletalMeshComponent* SkeletalMeshComponent*/); // Function DFMGameplay.BreakablePawn.OnDestructionComponentPlayEffectBegin // (Final|Native|Private) // @ game+0x61f8e20
	void OnDestructionComponentPhysicsSimulation(/*struct UGPDestructibleComponent* DestructibleComponent, struct UGPSkeletalMeshComponent* SkeletalMeshComponent*/); // Function DFMGameplay.BreakablePawn.OnDestructionComponentPhysicsSimulation // (Final|Native|Private) // @ game+0x61f8d60
	void OnCollisionLogic(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor); // Function DFMGameplay.BreakablePawn.OnCollisionLogic // (Final|Native|Private) // @ game+0x61f8ca0
	void OnCollisionHitted(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function DFMGameplay.BreakablePawn.OnCollisionHitted // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x61f8ad0
	void OnCollisionBeginOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.BreakablePawn.OnCollisionBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x61f88d0
	void OnBreakablePlayDestructionAnimation__DelegateSignature(struct USkeletalMeshComponent* SkeletalMeshComp); // DelegateFunction DFMGameplay.BreakablePawn.OnBreakablePlayDestructionAnimation__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x7ed88c0
	void OnBreakablePawnStateChange__DelegateSignature(struct ABreakablePawn* BreakablePawnObj, enum class EPawnState NewState); // DelegateFunction DFMGameplay.BreakablePawn.OnBreakablePawnStateChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x7ed88c0
	void OnBeginPreLoadFinishComplete(struct TArray<struct FSoftObjectPath> Path); // Function DFMGameplay.BreakablePawn.OnBeginPreLoadFinishComplete // (Final|Native|Private) // @ game+0x61f8740
	enum class EPawnState GetPawnState(); // Function DFMGameplay.BreakablePawn.GetPawnState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x61f7ef0
	float GetHP(); // Function DFMGameplay.BreakablePawn.GetHP // (Final|Native|Public) // @ game+0x61f7ec0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakablePawnManager
// Size: 0x3a0 (Inherited: 0x378)
class ABreakablePawnManager : public AActor {
public:

	char pad_378[0x28]; // 0x378(0x28)

	void SetIsSimulatePhysics(/*bool IsSimulate, struct UGPDestructibleComponent* DestructComp, struct UGPSkeletalMeshComponent* InSkeletalMeshComp*/); // Function DFMGameplay.BreakablePawnManager.SetIsSimulatePhysics // (Final|Native|Public) // @ game+0x61fe7a0
	void SetIsPlayAnimation(/*bool IsPlaying, struct UGPDestructibleComponent* DestructComp, struct UGPSkeletalMeshComponent* InSkeletalMeshComp*/); // Function DFMGameplay.BreakablePawnManager.SetIsPlayAnimation // (Final|Native|Public) // @ game+0x61fe6a0
	void SetConfig(int32_t InMaxBreakActorCount, int32_t InMaxBreakingBoneCount, int32_t InMaxPhysicsSimualteCount); // Function DFMGameplay.BreakablePawnManager.SetConfig // (Final|Native|Public) // @ game+0x61fe5a0
	void RemoveBreakablePawn(struct ABreakablePawn* BreakablePawn); // Function DFMGameplay.BreakablePawnManager.RemoveBreakablePawn // (Final|Native|Public) // @ game+0x61fe520
	struct ABreakablePawnManager* STATIC_GetInstIfExist(); // Function DFMGameplay.BreakablePawnManager.GetInstIfExist // (Final|Native|Static|Public) // @ game+0x61fdf40
	struct ABreakablePawnManager* STATIC_GetInst(struct UWorld* World); // Function DFMGameplay.BreakablePawnManager.GetInst // (Final|Native|Static|Public) // @ game+0x61fdec0
	void EndPlay(enum class EEndPlayReason EndPlayReason); // Function DFMGameplay.BreakablePawnManager.EndPlay // (Native|Public) // @ game+0x61fde40
	bool CanPlayMorePhysics(/*struct UGPDestructibleComponent* DestructComp, struct UGPSkeletalMeshComponent* InSkeletalMeshComp*/); // Function DFMGameplay.BreakablePawnManager.CanPlayMorePhysics // (Final|Native|Public) // @ game+0x61fdbf0
	void BeginPlay(); // Function DFMGameplay.BreakablePawnManager.BeginPlay // (Native|Public) // @ game+0x9212d0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakablePhysics
// Size: 0x7a8 (Inherited: 0x30)
class UBreakablePhysics : public UObject {
public:

	struct FBreakablePhysicsData PhysicsConfig; // 0x30(0x750)
	char pad_780[0x28]; // 0x780(0x28)

	void OnHitEffect(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function DFMGameplay.BreakablePhysics.OnHitEffect // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x61fe160
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableSkeletalMeshLODTimer
// Size: 0x48 (Inherited: 0x30)
class UBreakableSkeletalMeshLODTimer : public UObject {
public:

	char pad_30[0x18]; // 0x30(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BreakableSpawnPickupComponent
// Size: 0x260 (Inherited: 0x240)
class UBreakableSpawnPickupComponent : public USceneComponent {
public:

	int64_t PointID; // 0x240(0x08)
	struct TArray<struct UClass*> PickupAttachComponents; // 0x248(0x10)
	char pad_258[0x8]; // 0x258(0x08)

	void SpawnPickup(struct ABreakablePawn* BreakablePawnObj, enum class EPawnState NewState); // Function DFMGameplay.BreakableSpawnPickupComponent.SpawnPickup // (Final|Native|Protected) // @ game+0x61fe960
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTDecorator_RandomCooldown
// Size: 0x78 (Inherited: 0x70)
class UBTDecorator_RandomCooldown : public UBTDecorator {
public:

	float MinCoolDownTime; // 0x70(0x04)
	float MaxCoolDownTime; // 0x74(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTDecorator_RandomTimeLimit
// Size: 0x78 (Inherited: 0x70)
class UBTDecorator_RandomTimeLimit : public UBTDecorator {
public:

	float MinTimeLimit; // 0x70(0x04)
	float MaxTimeLimit; // 0x74(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTask_DFMMoveTo
// Size: 0xb8 (Inherited: 0xa0)
class UBTTask_DFMMoveTo : public UBTTask_BlackboardBase {
public:

	float AcceptableRadius; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UClass* FilterClass; // 0xa8(0x08)
	float ObservedBlackboardValueTolerance; // 0xb0(0x04)
	char bObserveBlackboardValue : 1; // 0xb4(0x01)
	char bAllowStrafe : 1; // 0xb4(0x01)
	char bAllowPartialPath : 1; // 0xb4(0x01)
	char bTrackMovingGoal : 1; // 0xb4(0x01)
	char bProjectGoalLocation : 1; // 0xb4(0x01)
	char bReachTestIncludesAgentRadius : 1; // 0xb4(0x01)
	char bReachTestIncludesGoalRadius : 1; // 0xb4(0x01)
	char bStopOnOverlap : 1; // 0xb4(0x01)
	char bStopOnOverlapNeedsUpdate : 1; // 0xb5(0x01)
	char pad_B5_1 : 7; // 0xb5(0x01)
	char pad_B6[0x2]; // 0xb6(0x02)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTask_DroneFollow
// Size: 0x88 (Inherited: 0x78)
class UBTTask_DroneFollow : public UBTTaskNode {
public:

	float AcceptableRadius; // 0x78(0x04)
	int32_t Unit; // 0x7c(0x04)
	bool VisualizeRawPath; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTask_DynamicRunEQS
// Size: 0x100 (Inherited: 0xa0)
class UBTTask_DynamicRunEQS : public UBTTask_BlackboardBase {
public:

	struct FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xa0(0x48)
	int32_t EQSResultRange; // 0xe8(0x04)
	bool bAllowFailed; // 0xec(0x01)
	char pad_ED[0x13]; // 0xed(0x13)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTask_HealOverTime
// Size: 0x90 (Inherited: 0x80)
class UBTTask_HealOverTime : public UGPBTTaskBase {
public:

	char pad_80[0x10]; // 0x80(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTask_RunDynamicTemplateBehavior
// Size: 0x130 (Inherited: 0x90)
class UBTTask_RunDynamicTemplateBehavior : public UBTTask_RunBehaviorDynamic {
public:

	struct TMap<struct FString, struct UBTNode*> BhtNodeMap; // 0x90(0x50)
	struct TMap<struct FString, struct UBehaviorTree*> DupTrees; // 0xe0(0x50)

	bool SetBtNodeValueUint8(struct FString TargetNodeName, struct FString FieldName, char Val); // Function DFMGameplay.BTTask_RunDynamicTemplateBehavior.SetBtNodeValueUint8 // (Final|Native|Public|BlueprintCallable) // @ game+0x6203d20
	bool SetBtNodeValueInt(struct FString TargetNodeName, struct FString FieldName, int32_t Val); // Function DFMGameplay.BTTask_RunDynamicTemplateBehavior.SetBtNodeValueInt // (Final|Native|Public|BlueprintCallable) // @ game+0x6203b00
	bool SetBtNodeValueFloat(struct FString TargetNodeName, struct FString FieldName, float Val); // Function DFMGameplay.BTTask_RunDynamicTemplateBehavior.SetBtNodeValueFloat // (Final|Native|Public|BlueprintCallable) // @ game+0x62038e0
	bool SetBtNodeValueBool(struct FString TargetNodeName, struct FString FieldName, bool Val); // Function DFMGameplay.BTTask_RunDynamicTemplateBehavior.SetBtNodeValueBool // (Final|Native|Public|BlueprintCallable) // @ game+0x62036c0
	struct FName SelectTemplateName(struct UBehaviorTreeComponent* OwnerComp, struct AAIController* AIController); // Function DFMGameplay.BTTask_RunDynamicTemplateBehavior.SelectTemplateName // (Native|Event|Public|BlueprintEvent) // @ game+0x62035f0
	void OnNewTempBhtSwitched(struct AAIController* AIController); // Function DFMGameplay.BTTask_RunDynamicTemplateBehavior.OnNewTempBhtSwitched // (Native|Event|Public|BlueprintEvent) // @ game+0xcb2910
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTQ_SmartShoot
// Size: 0xb8 (Inherited: 0x80)
class UBTTQ_SmartShoot : public UGPBTTaskBase {
public:

	enum class EShootType ShootType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	int32_t BurstShootCount; // 0x84(0x04)
	int32_t BurstShootCountRange; // 0x88(0x04)
	float ContinuousShootTime; // 0x8c(0x04)
	float ContinuousShootRange; // 0x90(0x04)
	bool bIsAiming; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float DelayShootTime; // 0x98(0x04)
	bool bShootAfterAimReachedTarget; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float AimMaxTime; // 0xa0(0x04)
	float AimAcceptAngle; // 0xa4(0x04)
	bool bTakeBullet; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	float OverrideHitRate; // 0xac(0x04)
	float FireVaildYawDiff; // 0xb0(0x04)
	float OutOffProneForbidFireTime; // 0xb4(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BTTQ_UseSkill
// Size: 0x80 (Inherited: 0x80)
class UBTTQ_UseSkill : public UGPBTTaskBase {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BuffActions
// Size: 0x30 (Inherited: 0x30)
class UBuffActions : public UObject {
public:


	void STATIC_HandleBuffActionTrigger(struct UDFMCharacterBuffEntityBase* InBuffEntity, enum class EBuffActionTriggerType TriggerType); // Function DFMGameplay.BuffActions.HandleBuffActionTrigger // (Final|Native|Static|Public) // @ game+0x6203220
	void STATIC_CureSOLHealthBody(struct UDFMCharacterBuffEntityBase* InBuffEntity, int32_t Num); // Function DFMGameplay.BuffActions.CureSOLHealthBody // (Final|Native|Static|Public) // @ game+0x6203170
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMBuffBaseClassTableManager
// Size: 0x90 (Inherited: 0x38)
class UDFMBuffBaseClassTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)
	struct TMap<uint32_t, struct UClass*> BuffEntityClassCache; // 0x40(0x50)

	void OnLoadBuffEntityClassFinish(struct TArray<struct FSoftObjectPath> Paths); // Function DFMGameplay.DFMBuffBaseClassTableManager.OnLoadBuffEntityClassFinish // (Final|Native|Public) // @ game+0x62032d0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMBuffMonitorConfigTableManager
// Size: 0x50 (Inherited: 0x38)
class UDFMBuffMonitorConfigTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)
	struct TArray<struct UClass*> BuffMonitorClassCache; // 0x40(0x10)

	void OnLoadClassFinish(struct TArray<struct FSoftObjectPath> Paths); // Function DFMGameplay.DFMBuffMonitorConfigTableManager.OnLoadClassFinish // (Final|Native|Public) // @ game+0x6203460
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.BuffSubSystem
// Size: 0x38 (Inherited: 0x38)
class UBuffSubSystem : public UWorldSubsystem {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.C202FlashDroneLightBase
// Size: 0x3a8 (Inherited: 0x378)
class AC202FlashDroneLightBase : public AActor {
public:

	struct TArray<struct FFlashDroneLightCurveConfig> FlashDroneLightCurveConfig; // 0x378(0x10)
	struct TArray<struct FFlashDroneLightSpotLightCurveConfig> FlashDroneLightSpotLightCurveConfig; // 0x388(0x10)
	char pad_398[0x10]; // 0x398(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CCTVInterface
// Size: 0x30 (Inherited: 0x30)
class UCCTVInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ChangeableContainer
// Size: 0x3a0 (Inherited: 0x378)
class AChangeableContainer : public AActor {
public:

	struct AActor* PreviewActor; // 0x378(0x08)
	struct AActor* CacheSpawnActor; // 0x380(0x08)
	char pad_388[0x8]; // 0x388(0x08)
	struct UBoxComponent* NavMeshComponent; // 0x390(0x08)
	enum class EChangeableContainerType CurType; // 0x398(0x01)
	char pad_399[0x7]; // 0x399(0x07)

	void GenerateCorrespondingActorByEventId(struct TArray<uint64_t>& BattlefieldEventId, uint64_t Timestamp); // Function DFMGameplay.ChangeableContainer.GenerateCorrespondingActorByEventId // (Final|Native|Public|HasOutParms) // @ game+0x62077b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CharacterFashionComponent_20V20
// Size: 0x128 (Inherited: 0x100)
class UCharacterFashionComponent_20V20 : public UActorComponent {
public:

	int32_t CurCamp; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct TArray<struct FCampFashionInfo> FashionInfos; // 0x108(0x10)
	struct FName FashionConfigName; // 0x118(0x08)
	struct AGPPlayerState* GPPlayerState; // 0x120(0x08)

	void OnUpdateTeamInfo(uint64_t Camp); // Function DFMGameplay.CharacterFashionComponent_20V20.OnUpdateTeamInfo // (Native|Public) // @ game+0xbd8ba0
	void OnRep_FashionConfigName(); // Function DFMGameplay.CharacterFashionComponent_20V20.OnRep_FashionConfigName // (Final|Native|Public) // @ game+0x6207f20
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CharacterHeroResourceDataSingleton
// Size: 0x270 (Inherited: 0x30)
class UCharacterHeroResourceDataSingleton : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct TMap<struct FName, struct UGPAudioEventAsset*> AudioLoadingResourceMap; // 0x40(0x50)
	struct TMap<struct FName, struct UObject*> LoadedResourceMap; // 0x90(0x50)
	struct TMap<uint64_t, struct FCharacterResourceDataNameMap> CharacterResourceNameMap; // 0xe0(0x50)
	struct TMap<uint64_t, struct FCharacterHeroResourceDataMap> CharacterHeroAudioResourceMap; // 0x130(0x50)
	struct TMap<uint64_t, struct FCharacterHeroResourceDataMap> CharacterHeroFXResourceMap; // 0x180(0x50)
	struct TMap<uint64_t, struct FCharacterHeroResourceAnimDataMap> CharacterHeroAnimResourceMap; // 0x1d0(0x50)
	struct TMap<uint64_t, struct FCharacterHeroResourceAttachMeshDataMap> CharacterHeroAttachMeshResourceMap; // 0x220(0x50)

	void PreloadAudio(struct AGPCharacter* AvatarCharacter, struct FName AudioName); // Function DFMGameplay.CharacterHeroResourceDataSingleton.PreloadAudio // (Final|Native|Public|BlueprintCallable) // @ game+0x62133b0
	void PreloadAllAudio(struct FName AudioName); // Function DFMGameplay.CharacterHeroResourceDataSingleton.PreloadAllAudio // (Final|Native|Public|BlueprintCallable) // @ game+0x6213330
	struct FGPAudioFuturePlayingID PlayLocationAudio(struct AGPCharacter* AvatarCharacter, struct FName AudioName, struct FVector Location, struct AActor* SourceActor); // Function DFMGameplay.CharacterHeroResourceDataSingleton.PlayLocationAudio // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x62131b0
	struct UFXResourceContainerComponent* PlayEffect(struct AGPCharacter* AvatarCharacter, struct FName EffectId, struct FTransform& PlayTransform, struct AActor* CreatorOwner, bool bUseObjectPool, struct USceneComponent* Socket, bool bIsHighFrequency, enum class EFXResourceCompPriority Priority, bool bEnableInstanceLimit); // Function DFMGameplay.CharacterHeroResourceDataSingleton.PlayEffect // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x6212ec0
	struct FGPAudioFuturePlayingID PlayActorAudio(struct AGPCharacter* AvatarCharacter, struct FName AudioName, struct AActor* TargetActor); // Function DFMGameplay.CharacterHeroResourceDataSingleton.PlayActorAudio // (Final|Native|Public|BlueprintCallable) // @ game+0x6212db0
	void OnLoadedPreload(struct FSoftObjectPath& SoftObjectPath); // Function DFMGameplay.CharacterHeroResourceDataSingleton.OnLoadedPreload // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x6212bb0
	struct FName GetResourcePathByName(struct FName Key, struct FName AvatarID); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetResourcePathByName // (Final|Native|Public|BlueprintCallable) // @ game+0x62129a0
	struct FName GetLocalResourcePath(struct FName Key); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetLocalResourcePath // (Final|Native|Public|BlueprintCallable) // @ game+0x6212910
	struct FName GetLocalAudioResourcePath(struct FName Key); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetLocalAudioResourcePath // (Final|Native|Public|BlueprintCallable) // @ game+0x6212880
	struct UCharacterHeroResourceDataSingleton* STATIC_GetInstance(struct UObject* WorldContextObject); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetInstance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x62127d0
	bool GetCharacterResourceData(struct FAbilityPlayMontageResources& ResourceData, struct FName Key, struct AGPCharacter* GPCharacter, enum class EChracterPoseType Pose, bool IsSlidingTackle, enum class EWeaponItemType WeaponType); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetCharacterResourceData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x62125b0
	struct FName GetAvatarSourceNameBySkillId(int32_t SkillId, struct AGPCharacter* GPCharacter); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetAvatarSourceNameBySkillId // (Final|Native|Public|BlueprintCallable) // @ game+0x62124e0
	struct FName GetAvatarResourcePath(struct FName Key, struct AGPCharacter* GPCharacter); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetAvatarResourcePath // (Final|Native|Public|BlueprintCallable) // @ game+0x6212410
	struct FName GetAvatarAudioResourcePath(struct FName Key, struct AGPCharacter* GPCharacter); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetAvatarAudioResourcePath // (Final|Native|Public|BlueprintCallable) // @ game+0x6212340
	bool GetAvatarAttachMeshResourcePath(/*struct FName Key, struct AGPCharacter* GPCharacter, struct TSoftObjectPtr<USkeletalMesh>& MeshPath, struct TSoftObjectPtr<USkeletalMesh>& MeshPath3P, struct TSoftObjectPtr<UAnimSequenceBase>& AnimSeq*/); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetAvatarAttachMeshResourcePath // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6212080
	bool GetAvatarAttachMeshResourceInfo(struct FName Key, struct AGPCharacter* GPCharacter, struct FCharacterHeroResourceAttachMeshData& MeshInfo); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetAvatarAttachMeshResourceInfo // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6211f30
	struct FName GetAudioResourcePathByName(struct FName Key, struct FName AvatarID); // Function DFMGameplay.CharacterHeroResourceDataSingleton.GetAudioResourcePathByName // (Final|Native|Public|BlueprintCallable) // @ game+0x6211e60
	uint64_t AsyncLoadResource(struct FSoftObjectPath& SoftObjectPath); // Function DFMGameplay.CharacterHeroResourceDataSingleton.AsyncLoadResource // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x6211d40
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CharacterSequenceAssemblyComponent
// Size: 0x198 (Inherited: 0x130)
class UCharacterSequenceAssemblyComponent : public UGPSequenceMannequinAssemblyComponent {
public:

	struct TArray<struct FName> FPPSceneComponents; // 0x130(0x10)
	struct FName FacialAnimationMeshComponent; // 0x140(0x08)
	char pad_148[0x50]; // 0x148(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CharacterSignificanceComponent
// Size: 0x1e8 (Inherited: 0x178)
class UCharacterSignificanceComponent : public USignificanceBase {
public:

	char pad_178[0x70]; // 0x178(0x70)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIStaggerConfigDataAsset
// Size: 0x70 (Inherited: 0x38)
class UDFMAIStaggerConfigDataAsset : public UDataAsset {
public:

	struct FName DktdRlxStaggerConfigName; // 0x38(0x08)
	struct FName DktdAltStaggerConfigName; // 0x40(0x08)
	struct FName HdsnRlxStaggerConfigName; // 0x48(0x08)
	struct FName HdsnAltStaggerConfigName; // 0x50(0x08)
	struct FName SprintStaggerConfigName; // 0x58(0x08)
	struct FName DefaultStaggerConfigName; // 0x60(0x08)
	struct UDataTable* StaggerMotionConfigTable; // 0x68(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CharacterStaggerComponent
// Size: 0x1b8 (Inherited: 0x100)
class UCharacterStaggerComponent : public UActorComponent {
public:

	struct TArray<struct FWeaponStaggerSequence> StaggerSequences; // 0x100(0x10)
	char pad_110[0x4]; // 0x110(0x04)
	struct TWeakObjectPtr<struct ADFMCharacter> LastCauser; // 0x114(0x08)
	float LeisureStaggerHurtThreshold; // 0x11c(0x04)
	float AlertStaggerHurtThreshold; // 0x120(0x04)
	float FightStaggerHurtThreshold; // 0x124(0x04)
	float StaggerCooldown; // 0x128(0x04)
	float StaggerInMoveThreshold; // 0x12c(0x04)
	char pad_130[0x50]; // 0x130(0x50)
	float StaggerTriggerProbability; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
	struct UStaggerAction* StaggerAction; // 0x188(0x08)
	char pad_190[0x4]; // 0x190(0x04)
	struct FName StaggerFxName; // 0x194(0x08)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct UDFMAIStaggerConfigDataAsset* AIStaggerConfigData; // 0x1a0(0x08)
	char pad_1A8[0x10]; // 0x1a8(0x10)

	void SetStaggerable(bool Value); // Function DFMGameplay.CharacterStaggerComponent.SetStaggerable // (Final|Native|Public|BlueprintCallable) // @ game+0x6213780
	void SetDamageScale(float Value); // Function DFMGameplay.CharacterStaggerComponent.SetDamageScale // (Final|Native|Public|BlueprintCallable) // @ game+0x6213700
	struct UAnimMontage* RequestStagger(struct FName& StaggerMotionConfigName, bool bOverrideCurStagger, float TargetYawWorld, enum class ECharacterPart HitPart, enum class EWeaponStaggerType WeaponType); // Function DFMGameplay.CharacterStaggerComponent.RequestStagger // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6213470
	void OnServerTakeDamage(struct FDamageResultInfo& DamageResult, enum class ECharacterPart& HitPart); // Function DFMGameplay.CharacterStaggerComponent.OnServerTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x6212c90
	bool IsStaggering(enum class ECharacterStaggerType StaggerType); // Function DFMGameplay.CharacterStaggerComponent.IsStaggering // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6212b20
	bool IsStaggerable(); // Function DFMGameplay.CharacterStaggerComponent.IsStaggerable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6212af0
	enum class EWeaponStaggerType STATIC_GetWeaponDamageType(struct ADFMWeapon* Weapon); // Function DFMGameplay.CharacterStaggerComponent.GetWeaponDamageType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x6212a70
	float GetLastStaggerTimeTillNow(); // Function DFMGameplay.CharacterStaggerComponent.GetLastStaggerTimeTillNow // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6212850
	float GetDamageScale(); // Function DFMGameplay.CharacterStaggerComponent.GetDamageScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x62127a0
	void ClearStaggerCooldown(); // Function DFMGameplay.CharacterStaggerComponent.ClearStaggerCooldown // (Final|Native|Public|BlueprintCallable) // @ game+0x6211e40
	void ClearDamageSum(); // Function DFMGameplay.CharacterStaggerComponent.ClearDamageSum // (Final|Native|Public|BlueprintCallable) // @ game+0x6211e20
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIDifficultyEquipTable
// Size: 0x98 (Inherited: 0x38)
class UAIDifficultyEquipTable : public UDataTableSystemManagerBase {
public:

	char pad_38[0x60]; // 0x38(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CharacterTemplate
// Size: 0x30 (Inherited: 0x30)
class UCharacterTemplate : public UInterface {
public:


	void ResetToCharacterTemplate(struct FCharacterTemplateTable& templateRow); // Function DFMGameplay.CharacterTemplate.ResetToCharacterTemplate // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x6213630
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.SerilizedBaseAIInfo
// Size: 0x40 (Inherited: 0x30)
class USerilizedBaseAIInfo : public UObject {
public:

	struct TArray<struct FPreloadBaseAIInfoInLevels> PreloadBaseAIInfoInLevelsArray; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CollisionAvoidanceAgentInterface
// Size: 0x30 (Inherited: 0x30)
class UCollisionAvoidanceAgentInterface : public UInterface {
public:


	void SetCollisionAvoidanceVelocity(struct FVector Vel); // Function DFMGameplay.CollisionAvoidanceAgentInterface.SetCollisionAvoidanceVelocity // (Native|Public|HasDefaults) // @ game+0x6218db0
	struct FVector GetCollisionAvoidanceAgentVelocity(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentVelocity // (Native|Public|HasDefaults) // @ game+0x10366b0
	float GetCollisionAvoidanceAgentTimeHorizon(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentTimeHorizon // (Native|Public) // @ game+0x174ef30
	float GetCollisionAvoidanceAgentRadius(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentRadius // (Native|Public) // @ game+0x1758d80
	float GetCollisionAvoidanceAgentNeighborDist(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentNeighborDist // (Native|Public) // @ game+0x62188c0
	float GetCollisionAvoidanceAgentMaxSpeed(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentMaxSpeed // (Native|Public) // @ game+0x6218890
	struct FVector GetCollisionAvoidanceAgentLocation(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentLocation // (Native|Public|HasDefaults) // @ game+0x6218850
	float GetCollisionAvoidanceAgentHeight(); // Function DFMGameplay.CollisionAvoidanceAgentInterface.GetCollisionAvoidanceAgentHeight // (Native|Public) // @ game+0x1767090
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.PawnCollisonAvoidanceAgent
// Size: 0x40 (Inherited: 0x30)
class UPawnCollisonAvoidanceAgent : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct APawn* Pawn; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ORCAAvoidance
// Size: 0x100 (Inherited: 0x38)
class UORCAAvoidance : public UWorldSubsystem {
public:

	char pad_38[0xa8]; // 0x38(0xa8)
	struct TArray<struct UPawnCollisonAvoidanceAgent*> PlayerAgents; // 0xe0(0x10)
	char pad_F0[0x10]; // 0xf0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ContainerSpawnPoint
// Size: 0x428 (Inherited: 0x378)
class AContainerSpawnPoint : public AActor {
public:

	char pad_378[0x10]; // 0x378(0x10)
	struct AInteractorBase* PreviewActor; // 0x388(0x08)
	uint32_t boxId; // 0x390(0x04)
	uint32_t BoxLevel; // 0x394(0x04)
	enum class ELootLimitType LootLimit; // 0x398(0x01)
	char pad_399[0x7]; // 0x399(0x07)
	uint64_t EventIDForSpawn; // 0x3a0(0x08)
	struct FHighValueBoxInfo HighValueBoxInfo; // 0x3a8(0x60)
	bool bSpawnerOnlyOnLevel2; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct UBoxComponent* NavMeshComponent; // 0x410(0x08)
	bool bUpdateNavMesh; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UClass* InteractorClass; // 0x420(0x08)

	void OnSolTimelineEventIdChange(struct TArray<uint64_t>& SOLEventIdArray); // Function DFMGameplay.ContainerSpawnPoint.OnSolTimelineEventIdChange // (Final|Native|Public|HasOutParms) // @ game+0x6218910
	struct FString GetUniqueName(); // Function DFMGameplay.ContainerSpawnPoint.GetUniqueName // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct FString GetSmallAreaCustomName(); // Function DFMGameplay.ContainerSpawnPoint.GetSmallAreaCustomName // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct UClass* GetPreviewActorClass(); // Function DFMGameplay.ContainerSpawnPoint.GetPreviewActorClass // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct FString GetOpenBoxTypeName(); // Function DFMGameplay.ContainerSpawnPoint.GetOpenBoxTypeName // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct FString GetMapName(); // Function DFMGameplay.ContainerSpawnPoint.GetMapName // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct FString GetBigAreaName(); // Function DFMGameplay.ContainerSpawnPoint.GetBigAreaName // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BP_OnCreate(struct AInteractorBase* Interactor); // Function DFMGameplay.ContainerSpawnPoint.BP_OnCreate // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CountDownVolumeActor
// Size: 0x3e0 (Inherited: 0x378)
class ACountDownVolumeActor : public AActor {
public:

	enum class ECountDownPriority CountdownType; // 0x378(0x01)
	bool UseBox; // 0x379(0x01)
	bool IsServer; // 0x37a(0x01)
	bool LeaveResetCountDown; // 0x37b(0x01)
	float CountDownTime; // 0x37c(0x04)
	struct FText CountDownTitle; // 0x380(0x18)
	struct UShapeComponent* CollisionComponent; // 0x398(0x08)
	struct TArray<struct FSoftObjectPath> AlarmStartAudioPaths; // 0x3a0(0x10)
	struct TArray<struct FSoftObjectPath> AlarmStopAudioPaths; // 0x3b0(0x10)
	bool bIsEnable; // 0x3c0(0x01)
	char pad_3C1[0x1f]; // 0x3c1(0x1f)

	void ServerSetVolumeEnable(bool bEnable); // Function DFMGameplay.CountDownVolumeActor.ServerSetVolumeEnable // (Final|Native|Public|BlueprintCallable) // @ game+0x6218d20
	void OnVolumeEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DFMGameplay.CountDownVolumeActor.OnVolumeEndOverlap // (Final|Native|Public) // @ game+0x6218be0
	void OnVolumeBeginOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.CountDownVolumeActor.OnVolumeBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x62189e0
	void OnRep_SetVolumeEnable(); // Function DFMGameplay.CountDownVolumeActor.OnRep_SetVolumeEnable // (Final|Native|Protected) // @ game+0x62188f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CrashableDrone
// Size: 0x460 (Inherited: 0x378)
class ACrashableDrone : public AActor {
public:

	char pad_378[0x18]; // 0x378(0x18)
	float CruiseSpeed; // 0x390(0x04)
	float Range; // 0x394(0x04)
	int64_t ExplodeAttackerValueId; // 0x398(0x08)
	struct TArray<struct UClass*> DamageEffect; // 0x3a0(0x10)
	float AABulletIntervalMax; // 0x3b0(0x04)
	float AABulletIntervalMin; // 0x3b4(0x04)
	float AABulletAngle; // 0x3b8(0x04)
	float DropRollValuePerSecond; // 0x3bc(0x04)
	struct FVector BounceVelocity; // 0x3c0(0x0c)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct UGPSkeletalMeshComponent* SkeletalMeshComponent; // 0x3d0(0x08)
	struct UProjectileMovementComponent* ProjectileMovementComponent; // 0x3d8(0x08)
	struct USkeletalMesh* NormalDrone; // 0x3e0(0x08)
	struct USkeletalMesh* CrashedDrone; // 0x3e8(0x08)
	struct UClass* DroneContainer; // 0x3f0(0x08)
	struct FVector DestLocation; // 0x3f8(0x0c)
	struct FVector CruiseVelocity; // 0x404(0x0c)
	struct FVector ProjectileVelocity; // 0x410(0x0c)
	enum class ECrashableDroneState DroneState; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	float DamageToleranceTime; // 0x420(0x04)
	char pad_424[0x14]; // 0x424(0x14)
	struct ASOLTimeLineEventActor* EventActor; // 0x438(0x08)
	struct AActor* DroneContainerActor; // 0x440(0x08)
	struct ADroneFlightPathSpline* FlightPath; // 0x448(0x08)
	float CruiseTime; // 0x450(0x04)
	char pad_454[0xc]; // 0x454(0x0c)

	struct AActor* SpawnDroneContainer(); // Function DFMGameplay.CrashableDrone.SpawnDroneContainer // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void SpawnAntiAircraftBullet(); // Function DFMGameplay.CrashableDrone.SpawnAntiAircraftBullet // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void SetDestinationAndFlightPath(struct FVector Dest, struct ADroneFlightPathSpline* Spline); // Function DFMGameplay.CrashableDrone.SetDestinationAndFlightPath // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x621e630
	void RegisterDroneInteract(struct ASOLTimeLineEventActor* TLActor); // Function DFMGameplay.CrashableDrone.RegisterDroneInteract // (Final|Native|Public|BlueprintCallable) // @ game+0x621e510
	void OnRep_DroneState(); // Function DFMGameplay.CrashableDrone.OnRep_DroneState // (Final|Native|Public) // @ game+0x621e1e0
	void OnLootSearchDone(struct AInventoryPickup_Container* OpenBox); // Function DFMGameplay.CrashableDrone.OnLootSearchDone // (Final|Native|Public) // @ game+0x621dcc0
	void IntoLanded(); // Function DFMGameplay.CrashableDrone.IntoLanded // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void IntoDamaged(); // Function DFMGameplay.CrashableDrone.IntoDamaged // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void IntoCrashed(); // Function DFMGameplay.CrashableDrone.IntoCrashed // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.CustomizeNavLinker
// Size: 0x388 (Inherited: 0x378)
class ACustomizeNavLinker : public AActor {
public:

	enum class ENavLinkType LinkType; // 0x378(0x01)
	bool IsTwoWay; // 0x379(0x01)
	char pad_37A[0x6]; // 0x37a(0x06)
	struct ULineBatchComponent* LineComp; // 0x380(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DamageValidateRule_CheckCharacterPose
// Size: 0x78 (Inherited: 0x60)
class UDamageValidateRule_CheckCharacterPose : public UDamageValidationRuleBase {
public:

	bool bValidateAIHeadAbortOnlyLog; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct TArray<enum class ECharacterSnatshotBasePose> IgnoreValidatePose; // 0x68(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DataStatisticsBaseComponent
// Size: 0x1d0 (Inherited: 0x100)
class UDataStatisticsBaseComponent : public UActorComponent {
public:

	char pad_100[0x8]; // 0x100(0x08)
	struct TArray<struct ADFMCharacter*> PlayerList; // 0x108(0x10)
	struct TArray<struct FDamageInfos> DamageData; // 0x118(0x10)
	float TeamDamageValue; // 0x128(0x04)
	char pad_12C[0xa4]; // 0x12c(0xa4)

	void SetDamageInfo(struct FDamageInfo& DamageInfo); // Function DFMGameplay.DataStatisticsBaseComponent.SetDamageInfo // (Final|Native|Protected|HasOutParms) // @ game+0x621e590
	void OnDamageTake(struct FDamageResultInfo& DamageResult); // Function DFMGameplay.DataStatisticsBaseComponent.OnDamageTake // (Native|Public|HasOutParms) // @ game+0x621dbf0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DeadbodyAmmoBox
// Size: 0x480 (Inherited: 0x378)
class ADeadbodyAmmoBox : public AActor {
public:

	char pad_378[0x10]; // 0x378(0x10)
	struct FDeadbodyAmmoBoxConfig Config; // 0x388(0x50)
	struct FText Tips; // 0x3d8(0x18)
	float DistanceShowUITips; // 0x3f0(0x04)
	uint32_t IncreaseAmmoBuffID; // 0x3f4(0x04)
	uint32_t ExtraBuffID; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct UAmmoBoxComponent* AmmoBoxComp; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x408(0x08)
	int32_t TeamId; // 0x410(0x04)
	struct TWeakObjectPtr<struct AGPCharacterBase> Killer; // 0x414(0x08)
	struct TWeakObjectPtr<struct AGPCharacterBase> OwnerChar; // 0x41c(0x08)
	char pad_424[0x54]; // 0x424(0x54)
	enum class ETacticalEquipmentMarkerType TacticalEquipmentMarker; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)

	void OnSimulateEnd(); // Function DFMGameplay.DeadbodyAmmoBox.OnSimulateEnd // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xbd2900
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.DeadbodyAmmoBox.OnOverlapBegin // (Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x621dd40
	struct FVector GetInitVelocity(); // Function DFMGameplay.DeadbodyAmmoBox.GetInitVelocity // (Native|Event|Protected|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x621d8b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DeadbodyAmmoBoxSubsystem
// Size: 0x48 (Inherited: 0x38)
class UDeadbodyAmmoBoxSubsystem : public UWorldSubsystem {
public:

	struct TArray<struct ADeadbodyAmmoBox*> AmmoBoxArr; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DeadBodyAmmoComponent
// Size: 0x170 (Inherited: 0x100)
class UDeadBodyAmmoComponent : public UActorComponent {
public:

	enum class EWeaponAddAmmoType AddAmmoType; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float AddAmmoValue; // 0x104(0x04)
	float TriggerDistance; // 0x108(0x04)
	char MaxTriggerTimes; // 0x10c(0x01)
	char pad_10D[0x3]; // 0x10d(0x03)
	float TipsDuration; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct UActorComponent* CreatedComp; // 0x118(0x08)
	char pad_120[0x50]; // 0x120(0x50)

	void OnOverlapedCharacter(struct AActor* OtherActor); // Function DFMGameplay.DeadBodyAmmoComponent.OnOverlapedCharacter // (Final|Native|Protected|BlueprintCallable) // @ game+0x621e140
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.DeadBodyAmmoComponent.OnOverlapBegin // (Final|Native|Protected|HasOutParms) // @ game+0x621df40
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DeadBodyDrug
// Size: 0x390 (Inherited: 0x378)
class ADeadBodyDrug : public AActor {
public:

	struct TArray<uint64_t> GivenCharacters; // 0x378(0x10)
	int32_t UseTimes; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)

	void OnRep_GivenCharacters(); // Function DFMGameplay.DeadBodyDrug.OnRep_GivenCharacters // (Final|Native|Protected) // @ game+0x621e200
	void OnCliendDestroy(); // Function DFMGameplay.DeadBodyDrug.OnCliendDestroy // (Event|Protected|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DeadZoneVolumeActor
// Size: 0x388 (Inherited: 0x378)
class ADeadZoneVolumeActor : public AActor {
public:

	struct USphereComponent* CollisionSphere; // 0x378(0x08)
	bool OnlyKillAI; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)

	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DFMGameplay.DeadZoneVolumeActor.OnBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x621d9f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DebugLogGenerator
// Size: 0x40 (Inherited: 0x38)
class UDebugLogGenerator : public UGameInstanceSubsystem {
public:

	char pad_38[0x8]; // 0x38(0x08)

	struct UDebugLogGenerator* STATIC_Get(struct UWorld* WorldContextObject); // Function DFMGameplay.DebugLogGenerator.Get // (Final|Native|Static|Public) // @ game+0x621d830
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DebugTextActor
// Size: 0x388 (Inherited: 0x378)
class ADebugTextActor : public AActor {
public:

	struct UTextRenderComponent* TextRender; // 0x378(0x08)
	struct UBillboardComponent* SpriteComponent; // 0x380(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesBatchSetting
// Size: 0x58 (Inherited: 0x30)
class UDesBatchSetting : public UObject {
public:

	/*struct TSoftObjectPtr<UDataTable>*/char DesBatchPrimitiveHLODParentDataTablePtr[0x28]; // 0x30(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesBatchRuntimeComponent
// Size: 0x148 (Inherited: 0x100)
class UDesBatchRuntimeComponent : public UActorComponent {
public:

	/*struct TSoftObjectPtr<UDataTable>*/char DesBatchPrimitiveHLODParentDataTablePtr[0x28]; // 0x100(0x28)
	struct UDesPrimitiveHLODDataAsset* DesBatchPrimitiveHLODParentDataAsset; // 0x128(0x08)
	struct TArray<float> HLODDrawDistances; // 0x130(0x10)
	char pad_140[0x8]; // 0x140(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesBatchSubsystem
// Size: 0x2d0 (Inherited: 0x38)
class UDesBatchSubsystem : public UWorldSubsystem {
public:

	struct TArray<struct UDFMDesStaticMeshComponent*> RegisteredDSMCs; // 0x38(0x10)
	char pad_48[0x190]; // 0x48(0x190)
	struct AActor* LevelBatchActor; // 0x1d8(0x08)
	struct TMap<struct FString, struct AActor*> LevelBatchActors; // 0x1e0(0x50)
	char pad_230[0xa0]; // 0x230(0xa0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesCraterMeshComponent
// Size: 0x800 (Inherited: 0x7f0)
class UDesCraterMeshComponent : public UStaticMeshComponent {
public:

	char pad_7F0[0x10]; // 0x7f0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesTerrainAreaComponent
// Size: 0x2a0 (Inherited: 0x240)
class UDesTerrainAreaComponent : public USceneComponent {
public:

	bool bIsGlobalArea; // 0x240(0x01)
	char pad_241[0x3]; // 0x241(0x03)
	struct FName SectorID; // 0x244(0x08)
	struct FVector BoxExtent; // 0x24c(0x0c)
	float SphereRadius; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	/*struct TSoftObjectPtr<UDesTerrainLevelArea>*/char LevelAreaDataPtr[0x28]; // 0x260(0x28)
	struct UDesTerrainLevelArea* RuntimeAreaData; // 0x288(0x08)
	char pad_290[0x10]; // 0x290(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesTerrainRuntimeComponent
// Size: 0x168 (Inherited: 0x100)
class UDesTerrainRuntimeComponent : public UActorComponent {
public:

	struct TMap<int32_t, struct ADesTerrainCraterActor*> ExistedCraters; // 0x100(0x50)
	struct TArray<struct UDesCraterMeshComponent*> ClientOnlyCraters; // 0x150(0x10)
	char pad_160[0x8]; // 0x160(0x08)

	void MultiTryCreateCraterMesh(struct FName SectorID, struct FVector InRelativeLocation, int32_t CraterID); // Function DFMGameplay.DesTerrainRuntimeComponent.MultiTryCreateCraterMesh // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x621d8f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesTerrainGameplayComponent
// Size: 0x220 (Inherited: 0x100)
class UDesTerrainGameplayComponent : public UActorComponent {
public:

	char pad_100[0xa8]; // 0x100(0xa8)
	/*struct UDestructibleItemDamagePrest**/char CraterDamagePreset[0x8]; // 0x1a8(0x08)
	struct UDesTerrainRuntimeComponent* CraterRuntimeComp; // 0x1b0(0x08)
	struct UDesCraterSubsystem* DesCraterSubsystem; // 0x1b8(0x08)
	struct TArray<struct FDesTerrainCraterRepInfo> ClientCraterArray; // 0x1c0(0x10)
	char pad_1D0[0x50]; // 0x1d0(0x50)

	void OnServerPostRadialDamage(struct FDamageSourceInfo& DamageSource, struct TArray<struct FDamageResultInfo>& DamageResults); // Function DFMGameplay.DesTerrainGameplayComponent.OnServerPostRadialDamage // (Final|Native|Public|HasOutParms) // @ game+0x621e220
	void OnRep_ClientCraterArray(); // Function DFMGameplay.DesTerrainGameplayComponent.OnRep_ClientCraterArray // (Final|Native|Private) // @ game+0x621e1c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesTerrainRuntimeActor
// Size: 0x3d8 (Inherited: 0x378)
class ADesTerrainRuntimeActor : public AActor {
public:

	struct UDesTerrainRuntimeComponent* RuntimeComp; // 0x378(0x08)
	struct UDesTerrainGameplayComponent* GameplayComp; // 0x380(0x08)
	struct TMap<int32_t, struct ADesTerrainCraterActor*> ExistedCraters; // 0x388(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesTerrainCraterActor
// Size: 0x380 (Inherited: 0x378)
class ADesTerrainCraterActor : public AActor {
public:

	struct UStaticMeshComponent* CraterMeshComp; // 0x378(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesCraterSubsystem
// Size: 0x148 (Inherited: 0x38)
class UDesCraterSubsystem : public UWorldSubsystem {
public:

	struct TMap<int32_t, struct FDesCraterRuntimeConfig> RepColidCraterConfig; // 0x38(0x50)
	struct TMap<int32_t, struct FDesCraterRuntimeConfig> ClientCraterConfig; // 0x88(0x50)
	struct TMap<struct FName, struct UDesTerrainAreaComponent*> RuntimeAreas; // 0xd8(0x50)
	char pad_128[0x10]; // 0x128(0x10)
	struct UDesTerrainRuntimeComponent* RuntimeComp; // 0x138(0x08)
	char pad_140[0x8]; // 0x140(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructionCraterConfigManager
// Size: 0x40 (Inherited: 0x38)
class UDestructionCraterConfigManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesAllPartEdgeAsset
// Size: 0x48 (Inherited: 0x38)
class UDesAllPartEdgeAsset : public UDataAsset {
public:

	struct TArray<struct FDesPartEdgeData> Parts; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesEdgeModelComponent
// Size: 0x240 (Inherited: 0x240)
class UDesEdgeModelComponent : public USceneComponent {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesEdgeModelDataManager
// Size: 0x48 (Inherited: 0x38)
class UDesEdgeModelDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesEdgeDecalDataManager
// Size: 0x40 (Inherited: 0x38)
class UDesEdgeDecalDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesInstancedStaticMeshComponent
// Size: 0x9f0 (Inherited: 0x9a8)
class UDesInstancedStaticMeshComponent : public UInstancedStaticMeshComponent {
public:

	char pad_9A8[0x18]; // 0x9a8(0x18)
	/*struct TArray<struct TSoftObjectPtr<ABreakableItemBase>>*/char TargetActors[0x10]; // 0x9c0(0x10)
	struct TArray<struct FName> TargetActorCompNames; // 0x9d0(0x10)
	char pad_9E0[0x10]; // 0x9e0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesEdgeModelMeshComponent
// Size: 0x9d0 (Inherited: 0x9a8)
class UDesEdgeModelMeshComponent : public UInstancedStaticMeshComponent {
public:

	int32_t EdgeModelType; // 0x9a8(0x04)
	char pad_9AC[0x24]; // 0x9ac(0x24)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructibleAudioDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDestructibleAudioDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructibleFoliageDataManager
// Size: 0x40 (Inherited: 0x38)
class UDestructibleFoliageDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructibleFXDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDestructibleFXDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructibleItemDamagePrest
// Size: 0x88 (Inherited: 0x38)
class UDestructibleItemDamagePrest : public UDataAsset {
public:

	/*struct TMap<struct FName, struct FDestructibleItemDamageModification>*/char ModificationArray[0x50]; // 0x38(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructibleItemPhxPreset
// Size: 0x798 (Inherited: 0x38)
class UDestructibleItemPhxPreset : public UDataAsset {
public:

	struct FBreakableRigidPhysicsData RigidPhysicsData; // 0x38(0x10)
	struct FBreakablePhysicsData PhysicsData; // 0x48(0x750)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesPrimitiveHLODDataAsset
// Size: 0x48 (Inherited: 0x38)
class UDesPrimitiveHLODDataAsset : public UDataAsset {
public:

	struct TArray<struct FDesPrimitiveHLODPair> Pairs; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DesSkeletalMeshComponentPool
// Size: 0x88 (Inherited: 0x30)
class UDesSkeletalMeshComponentPool : public UObject {
public:

	struct TMap<struct USkeletalMesh*, struct FDSMCPool> WorldDSCPools; // 0x30(0x50)
	char pad_80[0x8]; // 0x80(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DestructionAnimPoolDataManager
// Size: 0x40 (Inherited: 0x38)
class UDestructionAnimPoolDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFCommercializationComponent
// Size: 0x478 (Inherited: 0x478)
class UDFCommercializationComponent : public UGPCommercializationComponent {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFElevatorMovementComponent
// Size: 0x140 (Inherited: 0x140)
class UDFElevatorMovementComponent : public UMovementComponent {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFFlameComponent
// Size: 0x430 (Inherited: 0x100)
class UDFFlameComponent : public UActorComponent {
public:

	char pad_100[0x18]; // 0x100(0x18)
	struct UFXResourceContainerComponent* FlameLoopFX; // 0x118(0x08)
	struct AActor* Owner; // 0x120(0x08)
	struct USceneComponent* Socket; // 0x128(0x08)
	struct FName SocketName; // 0x130(0x08)
	char pad_138[0x8]; // 0x138(0x08)
	struct FTransform Trans; // 0x140(0x30)
	bool bFiring; // 0x170(0x01)
	char pad_171[0x3]; // 0x171(0x03)
	float CurrentBurnScaleRange; // 0x174(0x04)
	float FireMaxDistance; // 0x178(0x04)
	float FireFXDistance; // 0x17c(0x04)
	struct FName FloorBurnFXName; // 0x180(0x08)
	struct FName FlameLoopFXResourceID; // 0x188(0x08)
	struct FTransform LoopFXTransform; // 0x190(0x30)
	struct UCurveFloat* LoopFadein; // 0x1c0(0x08)
	char pad_1C8[0x10]; // 0x1c8(0x10)
	struct UCurveFloat* LoopFadeout; // 0x1d8(0x08)
	char pad_1E0[0x8]; // 0x1e0(0x08)
	struct UCurveFloat* LoopMaxDistance; // 0x1e8(0x08)
	char pad_1F0[0x8]; // 0x1f0(0x08)
	struct UCurveFloat* LoopFXScale; // 0x1f8(0x08)
	struct UGPAudioEventAsset* FireAudio; // 0x200(0x08)
	struct UGPAudioEventAsset* FireLoopAudio; // 0x208(0x08)
	struct UGPAudioEventAsset* StopFireAudio; // 0x210(0x08)
	float DamageCheckDelta; // 0x218(0x04)
	char FlameBuffTriggerTimes; // 0x21c(0x01)
	char pad_21D[0x3]; // 0x21d(0x03)
	float FlameRadius; // 0x220(0x04)
	float FirePointFlameRadius; // 0x224(0x04)
	float OffsetRate; // 0x228(0x04)
	int32_t MaxFlameStopGrowRaycastCount; // 0x22c(0x04)
	int32_t FlameBuffId; // 0x230(0x04)
	int32_t PainBuffId; // 0x234(0x04)
	int32_t TagBuffId; // 0x238(0x04)
	int32_t DamageId; // 0x23c(0x04)
	uint32_t BurnVolumeCDBuff; // 0x240(0x04)
	enum class ECharacterPart PainPart; // 0x244(0x01)
	char pad_245[0x3]; // 0x245(0x03)
	struct FName Burn1PFx; // 0x248(0x08)
	int32_t MaxNum; // 0x250(0x04)
	float FlameVolumeGap; // 0x254(0x04)
	float FlameVolumeGap_Mobile; // 0x258(0x04)
	float FlameVolumeRadius; // 0x25c(0x04)
	float FlameVolumeRadius_Mobile; // 0x260(0x04)
	struct FName BurnDecalId; // 0x264(0x08)
	struct FVector BurnScale; // 0x26c(0x0c)
	struct FVector BurnDecalOffset; // 0x278(0x0c)
	float BurnVolumeDur; // 0x284(0x04)
	float BurnVolumeInterval; // 0x288(0x04)
	float DropFireHeight; // 0x28c(0x04)
	float DropFireHeight_Mobile; // 0x290(0x04)
	struct FFloatRange FloorFireRange; // 0x294(0x10)
	struct FName ScreenPostFXName; // 0x2a4(0x08)
	char pad_2AC[0x184]; // 0x2ac(0x184)

	void TryProcessFlameBurnDamage(struct AActor* Cha, struct FHitResult Hit); // Function DFMGameplay.DFFlameComponent.TryProcessFlameBurnDamage // (Final|Native|Protected|BlueprintCallable) // @ game+0x6222a30
	void ServerStopFlame(); // Function DFMGameplay.DFFlameComponent.ServerStopFlame // (Final|Native|Public|BlueprintCallable) // @ game+0x6222990
	void ServerStartFlame(struct AActor* InOwner, struct USceneComponent* InSocket, struct FName InSocketName, struct FTransform InTrans); // Function DFMGameplay.DFFlameComponent.ServerStartFlame // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x62227f0
	void OnRep_bFiring(); // Function DFMGameplay.DFFlameComponent.OnRep_bFiring // (Final|Native|Protected) // @ game+0x62227d0
	void BroadcastMsg_StopBurnVolume(int32_t Key); // Function DFMGameplay.DFFlameComponent.BroadcastMsg_StopBurnVolume // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x35f1870
	void BroadcastMsg_PlayBurnVolume(int32_t Key, struct FVector Location, struct FVector Normal); // Function DFMGameplay.DFFlameComponent.BroadcastMsg_PlayBurnVolume // (Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults) // @ game+0x62224a0
	void BroadcastMsg_PlayBurnDecal(struct FHitResult Hit, float ScaleRange); // Function DFMGameplay.DFFlameComponent.BroadcastMsg_PlayBurnDecal // (Net|Native|Event|NetMulticast|Protected) // @ game+0x6222340
	void BroadcastMsg_Debug(struct FHitResult Hit, float ScaleRange); // Function DFMGameplay.DFFlameComponent.BroadcastMsg_Debug // (Net|Native|Event|NetMulticast|Protected) // @ game+0x62221e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDDisplayInputActionHandler
// Size: 0x210 (Inherited: 0x30)
class UDFHDDisplayInputActionHandler : public UObject {
public:

	char pad_30[0x1e0]; // 0x30(0x1e0)

	struct FString GetStringFromActionBindings(); // Function DFMGameplay.DFHDDisplayInputActionHandler.GetStringFromActionBindings // (Final|Native|Public) // @ game+0x6229d70
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDDisplayInputActionManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDDisplayInputActionManager : public UGameInstanceSubsystem {
public:

	struct UDFHDDisplayInputActionHandler* ActionHandler; // 0x38(0x08)

	void OnInputGateChanged(bool bBlocked); // Function DFMGameplay.DFHDDisplayInputActionManager.OnInputGateChanged // (Final|Native|Public) // @ game+0x622a550
	struct UDFHDDisplayInputActionManager* STATIC_Get(struct UObject* WorldContext); // Function DFMGameplay.DFHDDisplayInputActionManager.Get // (Final|Native|Static|Public) // @ game+0x62281e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDInputSettings
// Size: 0x90 (Inherited: 0x30)
class UDFHDInputSettings : public UObject {
public:

	struct TArray<struct FInputActionKeyMapping> DisplayActionMappings; // 0x30(0x10)
	struct TMap<struct FName, struct FText> ActionDisplayNames; // 0x40(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDKeyIconDataTableManager
// Size: 0x48 (Inherited: 0x38)
class UDFHDKeyIconDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	int32_t STATIC_GetRowKeyInfoAxisKeyDir(struct FKeyMappingsDataTableRow InRow); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetRowKeyInfoAxisKeyDir // (Final|Native|Static|Public) // @ game+0x6229820
	int32_t STATIC_GetRowKeyInfo_SecondAxisKeyDir(struct FKeyMappingsDataTableRow InRow); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetRowKeyInfo_SecondAxisKeyDir // (Final|Native|Static|Public) // @ game+0x6229950
	struct FText STATIC_GetNameByKeyName(struct FName KeyName); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetNameByKeyName // (Final|Native|Static|Public) // @ game+0x62294d0
	struct FText STATIC_GetNameByFKey(struct FKey Key); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetNameByFKey // (Final|Native|Static|Public) // @ game+0x6229390
	struct FSoftObjectPath STATIC_GetKeyIconPathByKeyName(struct FName KeyName, int32_t dir, enum class EKeyIconType KeyIconType); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetKeyIconPathByKeyName // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x6229280
	struct FSoftObjectPath STATIC_GetKeyIconPathByFKey(struct FKey Key, int32_t dir, enum class EKeyIconType KeyIconType); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetKeyIconPathByFKey // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x6229100
	struct FSoftObjectPath STATIC_GetKeyIconPath(struct FKeyIconDataTableRow Row, enum class EKeyIconType KeyIconType); // Function DFMGameplay.DFHDKeyIconDataTableManager.GetKeyIconPath // (Final|Native|Static|Public|HasDefaults) // @ game+0x6228e00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDKeyMappingsDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDKeyMappingsDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDKeyMappingsGMDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDKeyMappingsGMDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDKeyMappingsGamepadDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDKeyMappingsGamepadDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDKeyMappingsBHDDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDKeyMappingsBHDDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDKeyMappingsBHDGMDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDKeyMappingsBHDGMDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDMouseCursorManager
// Size: 0x140 (Inherited: 0x38)
class UDFHDMouseCursorManager : public UGameInstanceSubsystem {
public:

	struct APlayerController* PlayerController; // 0x38(0x08)
	bool bIsAppHasFocus; // 0x40(0x01)
	bool bEnableTickCenterizeInvisibleMouse; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	int32_t NumOfRequireDisableMouseShowHide; // 0x44(0x04)
	struct FIntPoint TickGetCursorPosition; // 0x48(0x08)
	struct FVector2D ViewportSize; // 0x50(0x08)
	struct FVector2D ViewportCenter; // 0x58(0x08)
	float TickCenterizeMouseCursorCount; // 0x60(0x04)
	float TickCenterizeMouseCursorInterval; // 0x64(0x04)
	float CenterizeMouseCursorTriggerLimit; // 0x68(0x04)
	struct FVector2D CenterizeMouseCursorTriggerSize; // 0x6c(0x08)
	char pad_74[0x4]; // 0x74(0x04)
	struct TArray<struct FMouseInteractHUDDataTableRow> MouseInteractHUDTable; // 0x78(0x10)
	struct TArray<struct FMouseInteractHUDDataTableRow> MouseInteractSafeHouseUITable; // 0x88(0x10)
	struct TMap<struct FString, int32_t> MouseInteractHUDShowMap; // 0x98(0x50)
	struct TMap<struct FString, int32_t> MouseInteractSafeHouseUIShowMap; // 0xe8(0x50)
	struct UGameFlowDelegates* GameFlowDelegates; // 0x138(0x08)

	struct APlayerController* UpdateCachedPlayerController(); // Function DFMGameplay.DFHDMouseCursorManager.UpdateCachedPlayerController // (Final|Native|Private) // @ game+0x622e8a0
	void TickCenterizeMouseCursor(float DeltaTime); // Function DFMGameplay.DFHDMouseCursorManager.TickCenterizeMouseCursor // (Final|Native|Public) // @ game+0x622e820
	void SetMouseCursorShowHide(bool bEnable); // Function DFMGameplay.DFHDMouseCursorManager.SetMouseCursorShowHide // (Final|Native|Public|BlueprintCallable) // @ game+0x622e790
	void SetIsAppHasFocus(bool bHasFocus); // Function DFMGameplay.DFHDMouseCursorManager.SetIsAppHasFocus // (Final|Native|Private) // @ game+0x622e700
	void SetCenterizeInvisibleMouseCursor(bool bEnable); // Function DFMGameplay.DFHDMouseCursorManager.SetCenterizeInvisibleMouseCursor // (Final|Native|Public|BlueprintCallable) // @ game+0x622e670
	void OnEnterGameFlow(enum class EGameFlowStageType GameFlowStageType); // Function DFMGameplay.DFHDMouseCursorManager.OnEnterGameFlow // (Final|Native|Private) // @ game+0x622e170
	struct UDFHDMouseCursorManager* STATIC_Get(struct UObject* GameInstanceContext); // Function DFMGameplay.DFHDMouseCursorManager.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x622d860
	bool CheckCachedPlayerController(); // Function DFMGameplay.DFHDMouseCursorManager.CheckCachedPlayerController // (Final|Native|Private) // @ game+0x622d6c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDMouseInteractHUDDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDMouseInteractHUDDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDMouseInteractSafeHouseUIDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDFHDMouseInteractSafeHouseUIDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFHDPlayerInput
// Size: 0x6b8 (Inherited: 0x670)
class UDFHDPlayerInput : public UHDPlayerInput {
public:

	char pad_670[0x10]; // 0x670(0x10)
	float DefaultHFOV; // 0x680(0x04)
	float DefaultVFOV; // 0x684(0x04)
	float MDV; // 0x688(0x04)
	float VehicleMDV; // 0x68c(0x04)
	float DefaultVMDRadians; // 0x690(0x04)
	float DefaultVehicleMDVRadians; // 0x694(0x04)
	float MinMDV; // 0x698(0x04)
	float AdjustRate; // 0x69c(0x04)
	bool bUsingGamepadJustNow; // 0x6a0(0x01)
	char pad_6A1[0x7]; // 0x6a1(0x07)
	struct TArray<struct FKey> PressingKeys; // 0x6a8(0x10)

	float VehicleSensitivityRealTimeRatio(); // Function DFMGameplay.DFHDPlayerInput.VehicleSensitivityRealTimeRatio // (Final|Native|Public) // @ game+0x622e8d0
	float SensitivityRealTime(); // Function DFMGameplay.DFHDPlayerInput.SensitivityRealTime // (Final|Native|Public) // @ game+0x622e4f0
	float SensitivityHip(); // Function DFMGameplay.DFHDPlayerInput.SensitivityHip // (Final|Native|Public) // @ game+0x622e4c0
	float SensitivityByWeapon(); // Function DFMGameplay.DFHDPlayerInput.SensitivityByWeapon // (Final|Native|Public) // @ game+0x622e490
	void RefreshSensitivity(); // Function DFMGameplay.DFHDPlayerInput.RefreshSensitivity // (Final|Native|Public) // @ game+0x622e470
	bool IsUsingGamepad(); // Function DFMGameplay.DFHDPlayerInput.IsUsingGamepad // (Final|Native|Public) // @ game+0x622e120
	bool IsPlayerFPP(); // Function DFMGameplay.DFHDPlayerInput.IsPlayerFPP // (Final|Native|Public) // @ game+0x622dfa0
	bool IsKeyPressing(struct FKey InKey); // Function DFMGameplay.DFHDPlayerInput.IsKeyPressing // (Final|Native|Public) // @ game+0x622deb0
	void InitVehicleDefaultSensitivity(); // Function DFMGameplay.DFHDPlayerInput.InitVehicleDefaultSensitivity // (Final|Native|Public) // @ game+0x622dba0
	void InitDefaultSensitivity(); // Function DFMGameplay.DFHDPlayerInput.InitDefaultSensitivity // (Final|Native|Public) // @ game+0x622db80
	float HDistToVDist(float HDist); // Function DFMGameplay.DFHDPlayerInput.HDistToVDist // (Final|Native|Public) // @ game+0x622daf0
	float GetCurWeaponZoomRate(); // Function DFMGameplay.DFHDPlayerInput.GetCurWeaponZoomRate // (Final|Native|Public) // @ game+0x622dac0
	void FetchDefaultFOV(); // Function DFMGameplay.DFHDPlayerInput.FetchDefaultFOV // (Final|Native|Public) // @ game+0x622d840
	float CalcMDRadiansWithZoomRate(float BaseVFOV, float InMDV, float ZoomRate); // Function DFMGameplay.DFHDPlayerInput.CalcMDRadiansWithZoomRate // (Final|Native|Public) // @ game+0x622d5b0
	float CalcMDRadians(float FOV, float MD); // Function DFMGameplay.DFHDPlayerInput.CalcMDRadians // (Final|Native|Public) // @ game+0x622d4e0
	float CalcDist(float FOV); // Function DFMGameplay.DFHDPlayerInput.CalcDist // (Final|Native|Public) // @ game+0x622d450
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFInteractableInterface
// Size: 0x30 (Inherited: 0x30)
class UDFInteractableInterface : public UInterface {
public:


	struct FGameplayTagContainer GetAllActiveTags(struct ACHARACTER* InOperatorCharacter, struct AActor* InInteractableCompOwner, struct UDFInteractableComponentBase* InInteractableComp); // Function DFMGameplay.DFInteractableInterface.GetAllActiveTags // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x6231990
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAbilityLockerComponent
// Size: 0x170 (Inherited: 0x100)
class UDFMAbilityLockerComponent : public UActorComponent {
public:

	/*struct TScriptInterface<IStingerMissileTakerInterface>*/char CurLockingObject[0x10]; // 0x100(0x10)
	char pad_110[0x10]; // 0x110(0x10)
	struct TMap<struct UObject*, struct UGPLaserPointerMarkItem*> Items; // 0x120(0x50)

	void SetFPPLockingState(enum class EStingerMissileLockingState LockingState); // Function DFMGameplay.DFMAbilityLockerComponent.SetFPPLockingState // (Final|Native|Public) // @ game+0x6233610
	void SetFPPLockingObject(/*struct TScriptInterface<IStingerMissileTakerInterface> LockingObject*/); // Function DFMGameplay.DFMAbilityLockerComponent.SetFPPLockingObject // (Final|Native|Public) // @ game+0x6233570
	void RemoveVisableCounter(bool bIsVehicleWeapon); // Function DFMGameplay.DFMAbilityLockerComponent.RemoveVisableCounter // (Final|Native|Public) // @ game+0x6232cb0
	void RefreshState(); // Function DFMGameplay.DFMAbilityLockerComponent.RefreshState // (Final|Native|Public) // @ game+0x88f4d0
	void RefreshEffectState(/*struct TScriptInterface<IStingerMissileTakerInterface> LockingObject, bool bUseFPPState*/); // Function DFMGameplay.DFMAbilityLockerComponent.RefreshEffectState // (Final|Native|Public) // @ game+0x6232bd0
	void PoolItem(/*struct TScriptInterface<IStingerMissileTakerInterface> LockingObject*/); // Function DFMGameplay.DFMAbilityLockerComponent.PoolItem // (Final|Native|Public) // @ game+0x62329e0
	void MulticastTargetLockingStateInfo(struct AActor* Taker, int32_t CampId, enum class EStingerMissileLockingState ServerLockingState); // Function DFMGameplay.DFMAbilityLockerComponent.MulticastTargetLockingStateInfo // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x62321a0
	void MulticastTargetLockingParamInfo(struct AActor* Taker, int32_t CampId, float IncreaseSpeed, float DecreaseSpeed, float PersistentTime); // Function DFMGameplay.DFMAbilityLockerComponent.MulticastTargetLockingParamInfo // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x6232020
	void AddVisableCounter(bool bIsVehicleWeapon); // Function DFMGameplay.DFMAbilityLockerComponent.AddVisableCounter // (Final|Native|Public) // @ game+0x6230d60
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAbilityLockerGroup
// Size: 0x88 (Inherited: 0x30)
class UDFMAbilityLockerGroup : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct TMap<struct UObject*, struct FCommonLockerInfo> LockerInfos; // 0x38(0x50)

	void OnUnregisterActor(struct AActor* NewActor); // Function DFMGameplay.DFMAbilityLockerGroup.OnUnregisterActor // (Final|Native|Private) // @ game+0x6232960
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAbilityPathTracingComponent
// Size: 0x4e0 (Inherited: 0x100)
class UDFMAbilityPathTracingComponent : public UActorComponent {
public:

	struct UClass* PathActorClass; // 0x100(0x08)
	int32_t MaxTargetCnt; // 0x108(0x04)
	float MaxScanDistance; // 0x10c(0x04)
	float MarkEnenmyTime; // 0x110(0x04)
	float PathTracingTotalTime; // 0x114(0x04)
	float PathTracingTotalTime_BF; // 0x118(0x04)
	float ScanFaceAngle; // 0x11c(0x04)
	float PathNodeSelectDelta; // 0x120(0x04)
	float RefreshCurPathsInterval; // 0x124(0x04)
	int32_t ReScanCnt; // 0x128(0x04)
	float RefreshWarningInterval; // 0x12c(0x04)
	uint32_t BeScanBuffID; // 0x130(0x04)
	uint32_t BeTracingBuffID; // 0x134(0x04)
	struct FName TracingEnemyHudName; // 0x138(0x08)
	struct FString PostProcessEffectName; // 0x140(0x10)
	struct FName MobileEffectName; // 0x150(0x08)
	struct FString PostProcessEffectParameterName; // 0x158(0x10)
	bool bTracingAI; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	float WarningDis_2; // 0x16c(0x04)
	float WarningDis_3; // 0x170(0x04)
	float TracingLineZ; // 0x174(0x04)
	float StartLocDis; // 0x178(0x04)
	struct FVector2D ScreenStartLocDif; // 0x17c(0x08)
	float ResetFlashDronePathTime; // 0x184(0x04)
	char pad_188[0x4]; // 0x188(0x04)
	struct FName ScanEnemyAudioName; // 0x18c(0x08)
	struct FName StartScanAudioName; // 0x194(0x08)
	struct FName TracingLineAudioName; // 0x19c(0x08)
	float MaxSelectPathDis; // 0x1a4(0x04)
	struct FName FindEnenmyVO; // 0x1a8(0x08)
	struct FName FindHeavyArmorEnenmyVO; // 0x1b0(0x08)
	struct FName CatSnakeScreenEffectName; // 0x1b8(0x08)
	struct FVector StartScanPos; // 0x1c0(0x0c)
	int32_t TracingEnemyFlag; // 0x1cc(0x04)
	int32_t BeTracingLevel; // 0x1d0(0x04)
	bool bMarkOnMap; // 0x1d4(0x01)
	char pad_1D5[0x3]; // 0x1d5(0x03)
	struct TArray<struct FAbilityTracingPathData> TracingPaths; // 0x1d8(0x10)
	struct TArray<struct FAbilityTracingPathData> KnifeTracingPaths; // 0x1e8(0x10)
	struct TArray<struct AGPPreviewLineActor*> PathLineMeshs; // 0x1f8(0x10)
	/*struct TSet<int32_t>*/char TracingCharSet[0x50]; // 0x208(0x50)
	float PathTracingStartTime; // 0x258(0x04)
	float Curtime; // 0x25c(0x04)
	float NextScanTime; // 0x260(0x04)
	int32_t CurScanCnt; // 0x264(0x04)
	int32_t MaxScanCnt; // 0x268(0x04)
	bool bIsRefreshPaths; // 0x26c(0x01)
	bool bStartTick; // 0x26d(0x01)
	char pad_26E[0x2]; // 0x26e(0x02)
	float ScanRadius; // 0x270(0x04)
	int32_t CurPathCnt; // 0x274(0x04)
	int32_t CurPathIndex; // 0x278(0x04)
	int32_t CurFlashDronePathIndex; // 0x27c(0x04)
	int32_t ClientCurFlashDronePathIndex; // 0x280(0x04)
	float LastSetFlashDronePathTime; // 0x284(0x04)
	float ChooseFlashDronePathTime; // 0x288(0x04)
	bool bForceKnifeTracing; // 0x28c(0x01)
	char pad_28D[0x3]; // 0x28d(0x03)
	struct FVector LastHitPos; // 0x290(0x0c)
	bool bActiveProceeEffect; // 0x29c(0x01)
	bool bClientPreprocessPath; // 0x29d(0x01)
	char pad_29E[0x2]; // 0x29e(0x02)
	float NextRefreshWarningTime; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct TArray<struct ADFMCharacter*> TracingTargets; // 0x2a8(0x10)
	/*struct TSet<int32_t>*/char TracingTargetSet[0x50]; // 0x2b8(0x50)
	struct TArray<struct FAbilityClientDrawPathData> ClientDrawPaths; // 0x308(0x10)
	struct TMap<int32_t, int32_t> BeTracingLevelMap; // 0x318(0x50)
	/*struct TSet<int32_t>*/char ScanCharSet[0x50]; // 0x368(0x50)
	struct TArray<int32_t> CurScanItemUinList; // 0x3b8(0x10)
	/*struct TSet<int32_t>*/char FirstTracingTargetSet[0x50]; // 0x3c8(0x50)
	bool bHasTracingTarget; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float LastStartTracingTime; // 0x41c(0x04)
	struct TArray<struct AActor*> Ignores; // 0x420(0x10)
	bool bLstShowed; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	int32_t TeamOrCampID; // 0x434(0x04)
	struct UFXResourceContainerComponent* MobileFXComp; // 0x438(0x08)
	int32_t MobileFXCompHandle; // 0x440(0x04)
	int32_t ClientScanCnt; // 0x444(0x04)
	struct TArray<struct AActor*> ClimbLadderList; // 0x448(0x10)
	struct TArray<struct FPathTracingClimbLadderData> ClimbLadderDataList; // 0x458(0x10)
	struct TMap<int32_t, struct FPathTracingClimbLadderData> ClimbLadderMap; // 0x468(0x50)
	struct TArray<struct FPathTracingEdge> Edges; // 0x4b8(0x10)
	struct TArray<struct FPathTracingVertex> Vertices; // 0x4c8(0x10)
	float ClientSkillEndTime; // 0x4d8(0x04)
	char pad_4DC[0x4]; // 0x4dc(0x04)

	void UpdateSneakHUDState(); // Function DFMGameplay.DFMAbilityPathTracingComponent.UpdateSneakHUDState // (Final|Native|Protected) // @ game+0x6233c10
	void UpdateClientPostProcessEffect(); // Function DFMGameplay.DFMAbilityPathTracingComponent.UpdateClientPostProcessEffect // (Final|Native|Private) // @ game+0x6233bf0
	void UpdateBeTracingLevel(bool IsAdd, int32_t SourceUin, float Dis); // Function DFMGameplay.DFMAbilityPathTracingComponent.UpdateBeTracingLevel // (Final|Native|Private) // @ game+0x6233af0
	void UpdataTotalTracingTime(bool HasTracingTarget); // Function DFMGameplay.DFMAbilityPathTracingComponent.UpdataTotalTracingTime // (Final|Native|Private) // @ game+0x6233a60
	bool TryTrackingTarget(struct ADFMCharacter* OwnerChar, struct ADFMCharacter* TargetChar, struct FVector& PathStartPos, struct FAbilityTracingPathData& PathData); // Function DFMGameplay.DFMAbilityPathTracingComponent.TryTrackingTarget // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x6233890
	void TryInitPathMeshInstance(); // Function DFMGameplay.DFMAbilityPathTracingComponent.TryInitPathMeshInstance // (Final|Native|Private) // @ game+0x6233870
	void TrackingTargetTeammates(struct ADFMCharacter* TargetChar); // Function DFMGameplay.DFMAbilityPathTracingComponent.TrackingTargetTeammates // (Final|Native|Public) // @ game+0x62337f0
	void SyncOutLineItemLocationsToTeamMates(); // Function DFMGameplay.DFMAbilityPathTracingComponent.SyncOutLineItemLocationsToTeamMates // (Final|Native|Public) // @ game+0x62337d0
	void SyncDetectorLocationsToTeamMates(); // Function DFMGameplay.DFMAbilityPathTracingComponent.SyncDetectorLocationsToTeamMates // (Final|Native|Public) // @ game+0x62337b0
	void StopPathTracing(); // Function DFMGameplay.DFMAbilityPathTracingComponent.StopPathTracing // (Final|Native|Public) // @ game+0x6233790
	void StartPathTracing(float SkillTotalTime); // Function DFMGameplay.DFMAbilityPathTracingComponent.StartPathTracing // (Final|Native|Public) // @ game+0x6233710
	void SetFlashDronePathIndex(int32_t Index); // Function DFMGameplay.DFMAbilityPathTracingComponent.SetFlashDronePathIndex // (Final|Native|Public) // @ game+0x6233690
	void ServerStartScan(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerStartScan // (Final|Native|Public) // @ game+0x6233550
	void ServerSetFlashDronePathIndex(int32_t Index); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerSetFlashDronePathIndex // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3677b90
	void ServerRefreshWarning(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerRefreshWarning // (Final|Native|Public) // @ game+0x6233530
	void ServerRefreshPaths(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerRefreshPaths // (Final|Native|Public) // @ game+0x6233510
	void ServerPrepareForShortPath(struct FAbilityTracingPathData& PathData, bool bIsBlocked); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerPrepareForShortPath // (Final|Native|Public|HasOutParms) // @ game+0x62333c0
	float ServerGetEdgeLength(struct FPathTracingVertex& StartVertex, struct FPathTracingVertex& EndVertex); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerGetEdgeLength // (Final|Native|Public|HasOutParms) // @ game+0x6233280
	bool ServerFindShortestPath(int32_t StartVertexIndex, int32_t EndVertexIndex, struct TArray<struct FVector>& Path); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerFindShortestPath // (Final|Native|Public|HasOutParms) // @ game+0x6233130
	bool ServerFindNavMeshPath(struct FVector StartPos, struct FVector EndPos, float& Length, struct TArray<struct FVector>& ResPath); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerFindNavMeshPath // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x6232f60
	void ServerFindClimbLadder(struct FVector StartPos, float ScanDis); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerFindClimbLadder // (Final|Native|Public|HasDefaults) // @ game+0x6232e90
	void ServerAddTracingBuff(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerAddTracingBuff // (Final|Native|Public) // @ game+0x6232e70
	void ServerAddFlashBuff(uint32_t FlashBuffID, struct AActor* SourceChar); // Function DFMGameplay.DFMAbilityPathTracingComponent.ServerAddFlashBuff // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x6232da0
	void ResetFlashDronePathIndex(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ResetFlashDronePathIndex // (Final|Native|Public) // @ game+0x6232d80
	void Rep_UpdateTracingEnemyFlag(); // Function DFMGameplay.DFMAbilityPathTracingComponent.Rep_UpdateTracingEnemyFlag // (Final|Native|Protected) // @ game+0x6232d60
	void Rep_UpdateBeTracingLevel(); // Function DFMGameplay.DFMAbilityPathTracingComponent.Rep_UpdateBeTracingLevel // (Final|Native|Protected) // @ game+0x6232d40
	bool PrintShortPath(int32_t StartVertexIndex, int32_t EndVertexIndex, struct TArray<struct FVector>& Path); // Function DFMGameplay.DFMAbilityPathTracingComponent.PrintShortPath // (Final|Native|Public|HasOutParms) // @ game+0x6232a80
	void OnCharacterOBStateChanged(bool bIsStartOB); // Function DFMGameplay.DFMAbilityPathTracingComponent.OnCharacterOBStateChanged // (Final|Native|Protected) // @ game+0x62328d0
	void OnAsyncPathTracingCallBack(int32_t PathIndex, int32_t DrawStartIndex, struct FVector PathStartPos); // Function DFMGameplay.DFMAbilityPathTracingComponent.OnAsyncPathTracingCallBack // (Final|Native|Private|HasDefaults) // @ game+0x62327c0
	void OBClientStopTracing(); // Function DFMGameplay.DFMAbilityPathTracingComponent.OBClientStopTracing // (Final|Native|Public) // @ game+0x62327a0
	void OBClientDrawPath(struct TArray<struct FAbilityTracingPathData>& ServerTracingPaths, struct TArray<struct FAbilityTracingPathData>& ServerKnifeTracingPaths, float SkillStartTime, bool bIsRefreshPath); // Function DFMGameplay.DFMAbilityPathTracingComponent.OBClientDrawPath // (Final|Native|Public|HasOutParms) // @ game+0x6232530
	void NotifyOBClientStopTracing(); // Function DFMGameplay.DFMAbilityPathTracingComponent.NotifyOBClientStopTracing // (Final|Native|Public) // @ game+0x6232510
	void NotifyOBClientDrawPath(struct TArray<struct FAbilityTracingPathData>& ServerTracingPaths, struct TArray<struct FAbilityTracingPathData>& ServerKnifeTracingPaths, float SkillStartTime, bool bIsRefreshPath); // Function DFMGameplay.DFMAbilityPathTracingComponent.NotifyOBClientDrawPath // (Final|Native|Public|HasOutParms) // @ game+0x62322a0
	void LocalPlayerSilentMoveStateChanged(bool IsSilentMove); // Function DFMGameplay.DFMAbilityPathTracingComponent.LocalPlayerSilentMoveStateChanged // (Final|Native|Protected) // @ game+0x3662de0
	void LocalPlayerBasePoseStatusChanged(); // Function DFMGameplay.DFMAbilityPathTracingComponent.LocalPlayerBasePoseStatusChanged // (Final|Native|Protected) // @ game+0x6232000
	bool IsOnwerEnemyWithCharacter(struct AGPCharacterBase* Charecter); // Function DFMGameplay.DFMAbilityPathTracingComponent.IsOnwerEnemyWithCharacter // (Final|Native|Public) // @ game+0x6231f70
	float GetShortestDistancePointToLineSegment(struct FVector& Point, struct FVector& LineStart, struct FVector& LineEnd); // Function DFMGameplay.DFMAbilityPathTracingComponent.GetShortestDistancePointToLineSegment // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x6231e30
	float GetShortestDistanceBetweenLines(struct FVector& Line1Start, struct FVector& Line1End, struct FVector& Line2Start, struct FVector& Line2End); // Function DFMGameplay.DFMAbilityPathTracingComponent.GetShortestDistanceBetweenLines // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x6231c90
	bool GetPathByIndex(int32_t PathIndex, struct FAbilityTracingPathData& Result); // Function DFMGameplay.DFMAbilityPathTracingComponent.GetPathByIndex // (Final|Native|Public|HasOutParms) // @ game+0x6231b40
	int32_t GetFlashDronePathIndex(); // Function DFMGameplay.DFMAbilityPathTracingComponent.GetFlashDronePathIndex // (Final|Native|Public) // @ game+0x6231b20
	struct FVector FindNearestPointOnPath(struct FVector& PointA, struct TArray<struct FVector>& PathPoints, struct TArray<float>& PathLengths, int32_t& NextIndex); // Function DFMGameplay.DFMAbilityPathTracingComponent.FindNearestPointOnPath // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x6231770
	void ClientTryChoosePath(float DeltaTime); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientTryChoosePath // (Final|Native|Public) // @ game+0x62316d0
	void ClientTryChooseFlashDronePath(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientTryChooseFlashDronePath // (Final|Native|Public) // @ game+0x62316b0
	void ClientStopTracing(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientStopTracing // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x35e4a10
	void ClientPreprocessPaths(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientPreprocessPaths // (Final|Native|Public) // @ game+0x6231690
	bool ClientPreprocessPath(struct FAbilityTracingPathData& Path); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientPreprocessPath // (Final|Native|Public|HasOutParms) // @ game+0x6231580
	int32_t ClientGetViewPointPathIndex(struct FVector& ViewPoint); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientGetViewPointPathIndex // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x62314e0
	struct FVector ClientGetScreenPointWorldLocation(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientGetScreenPointWorldLocation // (Final|Native|Public|HasDefaults) // @ game+0x62314a0
	struct FVector2D ClientGetScreenPointStartLocation(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientGetScreenPointStartLocation // (Final|Native|Public|HasDefaults) // @ game+0x6231460
	struct FVector ClientGetLineStartLocation(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientGetLineStartLocation // (Final|Native|Public|HasDefaults) // @ game+0x6231420
	void ClientDrawPathTracing(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientDrawPathTracing // (Final|Native|Public) // @ game+0x6231400
	void ClientDrawPath(struct TArray<struct FAbilityTracingPathData> ServerTracingPaths, struct TArray<struct FAbilityTracingPathData> ServerKnifeTracingPaths, float SkillStartTime, bool bIsRefreshPath); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientDrawPath // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x62311c0
	void ClientConfirmFlashDronePathIndex(int32_t Index); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientConfirmFlashDronePathIndex // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x36404f0
	void ClientCalculatePath(bool bAttachToSurface); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientCalculatePath // (Final|Native|Public) // @ game+0x6231130
	void ClientCalculateFlashLevel(struct AActor* FlashDrone, float FaceAngle, float NearDis, float FarDis, uint32_t FlashBuffID_Back, uint32_t FlashBuffID_Near, uint32_t FlashBuffID_Mid, uint32_t FlashBuffID_Far); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientCalculateFlashLevel // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x6230f00
	struct FVector ClientAttachToSurface(struct FVector& pos); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClientAttachToSurface // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x6230e50
	void ClearAllPath(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClearAllPath // (Final|Native|Private) // @ game+0x6230e30
	void ClearAllAsyncTrace(); // Function DFMGameplay.DFMAbilityPathTracingComponent.ClearAllAsyncTrace // (Final|Native|Private) // @ game+0x6230e10
	void CaculatePath(); // Function DFMGameplay.DFMAbilityPathTracingComponent.CaculatePath // (Final|Native|Private) // @ game+0x6230df0
	void ActiveClientPostProcessEffect(bool Active); // Function DFMGameplay.DFMAbilityPathTracingComponent.ActiveClientPostProcessEffect // (Final|Native|Private) // @ game+0x6230cd0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAbilitySystemGlobals
// Size: 0x298 (Inherited: 0x298)
class UDFMAbilitySystemGlobals : public UGPAbilitySystemGlobals {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMActionWithCastTime
// Size: 0x88 (Inherited: 0x30)
class UDFMActionWithCastTime : public UObject {
public:

	char pad_30[0x48]; // 0x30(0x48)
	struct ADFMCharacter* OwnerCharacter; // 0x78(0x08)
	char pad_80[0x8]; // 0x80(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAI3AnimInstance
// Size: 0xa20 (Inherited: 0x290)
class UDFMAI3AnimInstance : public UGPAnimInstanceBase {
public:

	struct FDFMAI3AnimInstanceProxy LocalProxy; // 0x290(0x790)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIAnalysisComponent
// Size: 0x3c8 (Inherited: 0x100)
class UAIAnalysisComponent : public UActorComponent {
public:

	char pad_100[0x2c8]; // 0x100(0x2c8)

	void TlogFightFlow(enum class EAIAnalysisFightState State, struct FString reason, struct ADFMCharacter* mainTarget); // Function DFMGameplay.AIAnalysisComponent.TlogFightFlow // (Final|Native|Public|BlueprintCallable) // @ game+0x6239a80
	void OnMatchEnd(enum class EMatchOverReason MatchOverReason, int64_t PlayerUin); // Function DFMGameplay.AIAnalysisComponent.OnMatchEnd // (Final|Native|Public) // @ game+0x6239090
	void OnLeaveFight(struct FVector SelfLocation, struct FVector enemyLocation, struct ADFMCharacter* Enemy); // Function DFMGameplay.AIAnalysisComponent.OnLeaveFight // (Final|Native|Public|HasDefaults) // @ game+0x6238f60
	void OnIntoFight(struct FVector SelfLocation, struct FVector enemyLocation, struct ADFMCharacter* Enemy); // Function DFMGameplay.AIAnalysisComponent.OnIntoFight // (Final|Native|Public|HasDefaults) // @ game+0x6238e30
	void CollectThreatNum(struct FVector PlayerLocation, struct FVector AILocation); // Function DFMGameplay.AIAnalysisComponent.CollectThreatNum // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x62383d0
	void CollectThreatData(enum class EAIThreatFlagName Flag); // Function DFMGameplay.AIAnalysisComponent.CollectThreatData // (Final|Native|Public|BlueprintCallable) // @ game+0x6238350
	void CollectFightData(bool isOut, struct FVector Location, struct FVector PlayerLocation, struct ADFMCharacter* mainTarget); // Function DFMGameplay.AIAnalysisComponent.CollectFightData // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x62381d0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIBaseMarkerItem
// Size: 0x580 (Inherited: 0x580)
class UDFMAIBaseMarkerItem : public UGPAIBaseMarkerItem {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAICharacterScoringComponent
// Size: 0x1b8 (Inherited: 0x100)
class UDFMAICharacterScoringComponent : public UActorComponent {
public:

	struct FScoreRange KillEnemyScore; // 0x100(0x08)
	struct FScoreRange PickupItemScore; // 0x108(0x08)
	struct FScoreRange MakeDamageScore; // 0x110(0x08)
	struct FScoreRange RecoverHealthScore; // 0x118(0x08)
	struct FScoreRange GetDamageScore; // 0x120(0x08)
	struct FScoreRange TickingScore; // 0x128(0x08)
	struct FScoreRange ScoreBound; // 0x130(0x08)
	float TickingDelay; // 0x138(0x04)
	bool EnableDebugLog; // 0x13c(0x01)
	char pad_13D[0x3]; // 0x13d(0x03)
	float SumupScore; // 0x140(0x04)
	float LastEvalSeconds; // 0x144(0x04)
	char pad_148[0x70]; // 0x148(0x70)

	void OnPlayerMakeDamage(struct FDamageResultInfo& DamageResult); // Function DFMGameplay.DFMAICharacterScoringComponent.OnPlayerMakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x623ee00
	void OnPickupItem(struct FItemMoveCmd& MoveCmd); // Function DFMGameplay.DFMAICharacterScoringComponent.OnPickupItem // (Final|Native|Public|HasOutParms) // @ game+0x623ed50
	void OnKillPlayer(struct FKillInfo& KillInfo); // Function DFMGameplay.DFMAICharacterScoringComponent.OnKillPlayer // (Final|Native|Public|HasOutParms) // @ game+0x623eb70
	void OnHealthPointChange(float ChangeValue); // Function DFMGameplay.DFMAICharacterScoringComponent.OnHealthPointChange // (Final|Native|Public) // @ game+0x623e9c0
	void OnAttributeArmorChangeEvent(struct AActor* Owner, float CurrentValue, float MaxValue); // Function DFMGameplay.DFMAICharacterScoringComponent.OnAttributeArmorChangeEvent // (Final|Native|Public) // @ game+0x623e5e0
	float GetScore(); // Function DFMGameplay.DFMAICharacterScoringComponent.GetScore // (Final|Native|Public|BlueprintCallable) // @ game+0x623d800
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIConfigItemComponent
// Size: 0x110 (Inherited: 0x100)
class UDFMAIConfigItemComponent : public UActorComponent {
public:

	struct TArray<struct FPointDropItem> ConfigItems; // 0x100(0x10)

	void AddConfigItemsToInventory(struct ADFMCharacter* Owner, bool Remove); // Function DFMGameplay.DFMAIConfigItemComponent.AddConfigItemsToInventory // (Final|Native|Public|BlueprintCallable) // @ game+0x623c360
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AssassinateSettings
// Size: 0x48 (Inherited: 0x40)
class UAssassinateSettings : public UDeveloperSettings {
public:

	float AssassinateAlertRange; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAICoverManager
// Size: 0xc30 (Inherited: 0x378)
class ADFMAICoverManager : public AActor {
public:

	float CoverEntryDirectSearchRadius; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct UDFMCoverManagerRenderComponent* CoverRenderComponent; // 0x380(0x08)
	char pad_388[0x88]; // 0x388(0x88)
	float CoverOutDistance; // 0x410(0x04)
	float CoverToWallDistance; // 0x414(0x04)
	char bAlignDirectionToWall : 1; // 0x418(0x01)
	char pad_418_1 : 7; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float EdgeCheckZOffset; // 0x41c(0x04)
	float StandExposeZOffset; // 0x420(0x04)
	float CoverPeekUpZOffset; // 0x424(0x04)
	float EdgeCheckExtent; // 0x428(0x04)
	float EdgeCheckInterval; // 0x42c(0x04)
	float StandHideCheckZOffset; // 0x430(0x04)
	float BlockCheckDistance; // 0x434(0x04)
	float PeekBlockCheckDistance; // 0x438(0x04)
	float GroundSlantLimit; // 0x43c(0x04)
	float CoverInterval; // 0x440(0x04)
	float MinCoverLength; // 0x444(0x04)
	char bDrawCover : 1; // 0x448(0x01)
	char bDrawWalls : 1; // 0x448(0x01)
	char bDrawEdgeCheckPoints : 1; // 0x448(0x01)
	char bDrawAsForeground : 1; // 0x448(0x01)
	char bDrawSimpleCover : 1; // 0x448(0x01)
	char pad_448_5 : 3; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	float DebugDrawCullingDistance; // 0x44c(0x04)
	bool bDebugFilterCover; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	struct FVector DebugFilterBoxExtent; // 0x454(0x0c)
	float DebugDirectionAngle; // 0x460(0x04)
	char pad_464[0xc]; // 0x464(0x0c)
	struct FDFMCoverAnimLocationProfile LeftCrouchProfile; // 0x470(0x170)
	struct FDFMCoverAnimLocationProfile MidCrouchProfile; // 0x5e0(0x170)
	struct FDFMCoverAnimLocationProfile RightCrouchProfile; // 0x750(0x170)
	struct FDFMCoverAnimLocationProfile LeftStandProfile; // 0x8c0(0x170)
	struct FDFMCoverAnimLocationProfile RightStandProfile; // 0xa30(0x170)
	struct TArray<struct FVector> WallPoints; // 0xba0(0x10)
	bool bFirstInited; // 0xbb0(0x01)
	char pad_BB1[0x57]; // 0xbb1(0x57)
	uint64_t CoverInfoVersion; // 0xc08(0x08)
	struct TArray<struct FDFMCoverInfo> CoverInfos; // 0xc10(0x10)
	struct URCVWaypointManager* DynamicCoverManager; // 0xc20(0x08)
	char pad_C28[0x8]; // 0xc28(0x08)

	bool SetupCoverContextToAIController(struct ADFMAIController* AIController, struct FSOLEqsCoverPointInfo coverPoint, bool bTryToStand); // Function DFMGameplay.DFMAICoverManager.SetupCoverContextToAIController // (Final|Native|Public|BlueprintCallable) // @ game+0x6244dc0
	void ReleaseCoverContext(struct FDFMCoverContext& CoverContextIn); // Function DFMGameplay.DFMAICoverManager.ReleaseCoverContext // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6244b10
	void OnUpdateCoverInfo(); // Function DFMGameplay.DFMAICoverManager.OnUpdateCoverInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x6244930
	bool OccupyCurrentCover(struct ADFMAIController* AIController); // Function DFMGameplay.DFMAICoverManager.OccupyCurrentCover // (Final|Native|Public|BlueprintCallable) // @ game+0x6244750
	struct TArray<struct FDFMCoverContext> GetNearbyLeftCover_Debug(struct FVector Location, struct FVector BoxExtent); // Function DFMGameplay.DFMAICoverManager.GetNearbyLeftCover_Debug // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6243ea0
	struct TArray<struct FDFMCoverContext> GetNearByCover(struct FVector Center, float Extent, bool bIgnoreCoverOccupied, enum class ESOLCoverDirQuery dir, enum class ESOLCoverHeightQuery Height); // Function DFMGameplay.DFMAICoverManager.GetNearByCover // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6243ca0
	struct ADFMAICoverManager* STATIC_GetInstance(struct UObject* WorldContext); // Function DFMGameplay.DFMAICoverManager.GetInstance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x6243b00
	struct FDFMCoverContext GetDirectTransCover(struct ADFMAIController* AIController); // Function DFMGameplay.DFMAICoverManager.GetDirectTransCover // (Final|Native|Public|BlueprintCallable) // @ game+0x6243600
	bool DebugSetupNearbyCover(struct ADFMAIController* AICtrler, struct FVector BoxExtent, bool bIsLeftCover, bool bIsRightCover, bool bIsHighCover); // Function DFMGameplay.DFMAICoverManager.DebugSetupNearbyCover // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6242c50
	void BuildCover(); // Function DFMGameplay.DFMAICoverManager.BuildCover // (Final|Native|Public|BlueprintCallable) // @ game+0x6242ae0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAICoverModifier
// Size: 0x390 (Inherited: 0x378)
class ADFMAICoverModifier : public AActor {
public:

	struct UBoxComponent* RootBox; // 0x378(0x08)
	struct TArray<struct UBoxComponent*> Boxes; // 0x380(0x10)

	void OnSelectionChanged(struct UObject* NewSelection); // Function DFMGameplay.DFMAICoverModifier.OnSelectionChanged // (Final|Native|Public) // @ game+0x62448b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAICustomLinkReachDelegates
// Size: 0x88 (Inherited: 0x38)
class UDFMAICustomLinkReachDelegates : public UWorldSubsystem {
public:

	char pad_38[0x50]; // 0x38(0x50)

	struct UDFMAICustomLinkReachDelegates* STATIC_Get(struct UObject* WorldContext); // Function DFMGameplay.DFMAICustomLinkReachDelegates.Get // (Final|Native|Static|Public) // @ game+0x6242ee0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDebugPanelV2
// Size: 0x468 (Inherited: 0x3c8)
class UDFMAIDebugPanelV2 : public UAIDebugPanelV2 {
public:

	struct TWeakObjectPtr<struct UMotionActionComponent> MotionActionComponent; // 0x3c8(0x08)
	struct TWeakObjectPtr<struct UDFMAICharacterMovementComponent> MovementComponent; // 0x3d0(0x08)
	struct TWeakObjectPtr<struct ADFMAICharacter> AICharacter; // 0x3d8(0x08)
	struct UDataTable* AITemplateDataTable; // 0x3e0(0x08)
	struct ULineBatchComponent* DebugDrawer; // 0x3e8(0x08)
	struct ULineBatchComponent* CoverDebugDrawer; // 0x3f0(0x08)
	struct TWeakObjectPtr<struct ADramaArea> DebugDrama; // 0x3f8(0x08)
	struct UGridPanel* MotionPlanContentPanel; // 0x400(0x08)
	struct UCheckbox* ChkBoxDrawSkeleton; // 0x408(0x08)
	struct TWeakObjectPtr<struct UGPAIAnimProxyComponent> AnimProxyComponent; // 0x410(0x08)
	struct TWeakObjectPtr<struct UGPRagDollPhysicsComponent> RagdollComponent; // 0x418(0x08)
	struct UClass* AIUTDramaClass; // 0x420(0x08)
	struct USlider* SliderSpecZOffset; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
	bool bVisualizeFocus; // 0x438(0x01)
	bool bDrawPath; // 0x439(0x01)
	bool bVisualizeVelocity; // 0x43a(0x01)
	bool bDrawSkeleton; // 0x43b(0x01)
	bool bDrawRotation; // 0x43c(0x01)
	bool bDrawFootLock; // 0x43d(0x01)
	char pad_43E[0x2a]; // 0x43e(0x2a)

	void SliderSpecSpringArmLen_OnValueChanged(float Value); // Function DFMGameplay.DFMAIDebugPanelV2.SliderSpecSpringArmLen_OnValueChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x6244f70
	void STATIC_ShowAIDebugPanelV2(struct UObject* WorldContext); // Function DFMGameplay.DFMAIDebugPanelV2.ShowAIDebugPanelV2 // (Final|Native|Static|Protected|BlueprintCallable) // @ game+0x6244f00
	bool IsLocalPlayerSpectating(); // Function DFMGameplay.DFMAIDebugPanelV2.IsLocalPlayerSpectating // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6244720
	float GetSpecSpringArmLength(); // Function DFMGameplay.DFMAIDebugPanelV2.GetSpecSpringArmLength // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6244390
	struct TArray<struct AActor*> GetSortedAIUTs(); // Function DFMGameplay.DFMAIDebugPanelV2.GetSortedAIUTs // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6244310
	struct FText GetRagdollPhysicsWeightText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetRagdollPhysicsWeightText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6244090
	struct FText GetPainText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetPainText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243ff0
	struct FText GetMotionPlanText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetMotionPlanText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243c00
	struct FText GetGunIKText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetGunIKText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x62439d0
	struct FText GetFootIKText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetFootIKText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243930
	struct FText GetFocusText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetFocusText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243890
	struct FText GetCurrWeaponName(); // Function DFMGameplay.DFMAIDebugPanelV2.GetCurrWeaponName // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243560
	struct FText GetCurrStateText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetCurrStateText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x62434c0
	struct FText GetCurAnimText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetCurAnimText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243420
	struct FText GetCurAnimDetailText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetCurAnimDetailText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6243380
	struct TArray<struct FName> GetAITemplateNames(); // Function DFMGameplay.DFMAIDebugPanelV2.GetAITemplateNames // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6242fa0
	struct FText GetAimText(); // Function DFMGameplay.DFMAIDebugPanelV2.GetAimText // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x62430b0
	void FlushCoverDebugDraw(); // Function DFMGameplay.DFMAIDebugPanelV2.FlushCoverDebugDraw // (Final|Native|Protected|BlueprintCallable) // @ game+0x6242ec0
	void DebugDrawCover(struct FGMCoverDrawInfo cover, float LifeTime); // Function DFMGameplay.DFMAIDebugPanelV2.DebugDrawCover // (Final|Native|Protected|BlueprintCallable) // @ game+0x6242b60
	void ClosePanel(); // Function DFMGameplay.DFMAIDebugPanelV2.ClosePanel // (Final|Native|Protected|BlueprintCallable) // @ game+0x6242b40
	void ChooseNewTarget(); // Function DFMGameplay.DFMAIDebugPanelV2.ChooseNewTarget // (Final|Native|Protected|BlueprintCallable) // @ game+0x6242b20
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_CheckMultiAIDramaCurrentIdx
// Size: 0x78 (Inherited: 0x70)
class UDFMAIDecorator_CheckMultiAIDramaCurrentIdx : public UBTDecorator {
public:

	int32_t DecoratorIndex; // 0x70(0x04)
	bool RetryWhenFailed; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_HasItem
// Size: 0xb0 (Inherited: 0x70)
class UDFMAIDecorator_HasItem : public UBTDecorator {
public:

	struct FAIStringValue ItemIDBBKey; // 0x70(0x38)
	int32_t RequireNum; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_HasMotionTags
// Size: 0x98 (Inherited: 0x70)
class UDFMAIDecorator_HasMotionTags : public UBTDecorator {
public:

	struct FGameplayTagContainer Tags; // 0x70(0x20)
	bool bMatchAllTags; // 0x90(0x01)
	bool bMatchParentTag; // 0x91(0x01)
	char pad_92[0x6]; // 0x92(0x06)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_IsDramaActing
// Size: 0x80 (Inherited: 0x70)
class UDFMAIDecorator_IsDramaActing : public UBTDecorator {
public:

	enum class EAIDramaPriority DramaPriority; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct ADramaArea* LastestDrama; // 0x78(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_IsInStagger
// Size: 0x78 (Inherited: 0x70)
class UDFMAIDecorator_IsInStagger : public UBTDecorator {
public:

	enum class ECharacterStaggerType StaggerType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_MarkAsInstantTask
// Size: 0x70 (Inherited: 0x70)
class UDFMAIDecorator_MarkAsInstantTask : public UBTDecorator {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_SelectChildPriorityNode
// Size: 0x80 (Inherited: 0x70)
class UDFMAIDecorator_SelectChildPriorityNode : public UBTDecorator {
public:

	struct FString NodeBranchName; // 0x70(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_WeaponHasAmmo
// Size: 0x78 (Inherited: 0x70)
class UDFMAIDecorator_WeaponHasAmmo : public UBTDecorator {
public:

	int32_t AmmoCount; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIDecorator_WeaponIsReload
// Size: 0x78 (Inherited: 0x70)
class UDFMAIDecorator_WeaponIsReload : public UBTDecorator {
public:

	bool CheckShooting; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIEnvironmentInteractComponent
// Size: 0x170 (Inherited: 0x100)
class UDFMAIEnvironmentInteractComponent : public UActorComponent {
public:

	struct FName DebugTurretMontageName; // 0x100(0x08)
	struct FName DebugTurretGunMontageName; // 0x108(0x08)
	/*struct FMulticastInlineDelegate*/char OnInteractionStart[0x10]; // 0x110(0x10)
	/*struct FMulticastInlineDelegate*/char OnInteractionEnd[0x10]; // 0x120(0x10)
	struct ADFScenceWeaponPawn* CurrentSceneWeaponPawn; // 0x130(0x08)
	char pad_138[0x10]; // 0x138(0x10)
	struct FAIInteractInfo_AssembleThreeAnim RepInfo_AssembleThreeAnim; // 0x148(0x20)
	struct UDFMAIInteractActionBase* CurrentInteractAction; // 0x168(0x08)

	void StartInteraction_SceneWeapon(struct ADFScenceWeaponPawn* SceneWeapon, bool bSmoothCorrection); // Function DFMGameplay.DFMAIEnvironmentInteractComponent.StartInteraction_SceneWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x6248910
	void PlayDebugTurret(); // Function DFMGameplay.DFMAIEnvironmentInteractComponent.PlayDebugTurret // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x1e36270
	void OnRep_AssembleThreeAnim(); // Function DFMGameplay.DFMAIEnvironmentInteractComponent.OnRep_AssembleThreeAnim // (Final|Native|Protected) // @ game+0x6248520
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIEquipmentComponent
// Size: 0x5a0 (Inherited: 0x100)
class UDFMAIEquipmentComponent : public UActorComponent {
public:

	struct FAICharacterDifficulty DifficultyConf; // 0x100(0x488)
	char pad_588[0x18]; // 0x588(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIFightTargetManagementComponent
// Size: 0x180 (Inherited: 0x100)
class UDFMAIFightTargetManagementComponent : public UActorComponent {
public:

	struct TArray<struct FAIFightTargetInfo> FightTargetList; // 0x100(0x10)
	struct ADFMAIController* OwnerController; // 0x110(0x08)
	bool PrintDebugLog; // 0x118(0x01)
	char pad_119[0x3]; // 0x119(0x03)
	float ThreatLevelKeepDelay; // 0x11c(0x04)
	float RandomFightScore; // 0x120(0x04)
	float AITargetDamageScoreScaler; // 0x124(0x04)
	float AITargetVisualScoreScaler; // 0x128(0x04)
	float PlayerTargetDamageScoreScaler; // 0x12c(0x04)
	float PlayerTargetVisualScoreScaler; // 0x130(0x04)
	float AITargetVehicleHurtScaler; // 0x134(0x04)
	float PlayerTargetVehicleHurtScaler; // 0x138(0x04)
	float RandomDistanceThreshold; // 0x13c(0x04)
	float RandomOffsetThreshold; // 0x140(0x04)
	float RandomRadiusThreshold; // 0x144(0x04)
	float RandomAngleThreshold; // 0x148(0x04)
	float MinLeaveFightTime; // 0x14c(0x04)
	float MainTargetKeepDelay; // 0x150(0x04)
	float DispersionFactor; // 0x154(0x04)
	char pad_158[0x28]; // 0x158(0x28)

	void SetCharacterForceExtraScore(struct ADFMCharacter* CHARACTER, float extraScore); // Function DFMGameplay.DFMAIFightTargetManagementComponent.SetCharacterForceExtraScore // (Final|Native|Public|BlueprintCallable) // @ game+0x62487d0
	void SetCharacterBasicScore(struct ADFMCharacter* CHARACTER, float bacisScore); // Function DFMGameplay.DFMAIFightTargetManagementComponent.SetCharacterBasicScore // (Final|Native|Public|BlueprintCallable) // @ game+0x6248710
	enum class EAIThreatLevel GetTargetThreatLevel(struct ADFMCharacter* TargetCharacter); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetTargetThreatLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x6248490
	struct ADFMCharacter* GetTargetByThreatLevel(enum class EAIThreatLevel ThreatLevel); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetTargetByThreatLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x6248400
	struct ADFMCharacter* GetCurrentMainTargetWithRandomOffset(); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetCurrentMainTargetWithRandomOffset // (Final|Native|Public|BlueprintCallable) // @ game+0x62480a0
	struct ADFMCharacter* GetCurrentMainTargetWithDist(float Dist, bool bInside); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetCurrentMainTargetWithDist // (Final|Native|Public|BlueprintCallable) // @ game+0x6247fd0
	bool GetCurrentMainTargetInfo_Custom(struct FAIFightTargetInfo& Info, float dealyTime_sight); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetCurrentMainTargetInfo_Custom // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6247eb0
	bool GetCurrentMainTargetInfo(struct FAIFightTargetInfo& Info); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetCurrentMainTargetInfo // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6247dd0
	struct ADFMCharacter* GetCurrentMainTarget(); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetCurrentMainTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x6247da0
	struct ADFMCharacter* GetAssinedTarget(); // Function DFMGameplay.DFMAIFightTargetManagementComponent.GetAssinedTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x6247900
	void ForceUpdateTargets(); // Function DFMGameplay.DFMAIFightTargetManagementComponent.ForceUpdateTargets // (Final|Native|Public|BlueprintCallable) // @ game+0x62476e0
	void STATIC_BatchUpdateAIFightTargets(struct TArray<struct ADFMAIController*>& AIList, struct TArray<struct ADFMCharacter*>& charList, float LockLocation, bool bFightOnly); // Function DFMGameplay.DFMAIFightTargetManagementComponent.BatchUpdateAIFightTargets // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x6247100
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIFightTargetManager
// Size: 0x140 (Inherited: 0x38)
class UDFMAIFightTargetManager : public UWorldSubsystem {
public:

	char pad_38[0x50]; // 0x38(0x50)
	/*struct TSoftObjectPtr<UCurveFloat>*/char RelevanceDistCurvePath[0x28]; // 0x88(0x28)
	/*struct TSoftObjectPtr<UCurveFloat>*/char RelevanceCosAngleCurvePath[0x28]; // 0xb0(0x28)
	struct TMap<struct ADFMCharacter*, struct FCharacterArray> MainTargetMap; // 0xd8(0x50)
	struct UCurveFloat* RelevanceDistCurve; // 0x128(0x08)
	struct UCurveFloat* RelevanceCosAngleCurve; // 0x130(0x08)
	char pad_138[0x8]; // 0x138(0x08)

	struct UDFMAIFightTargetManager* STATIC_Get(struct UObject* WorldContextObject); // Function DFMGameplay.DFMAIFightTargetManager.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x6247700
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIFirebatConfig
// Size: 0x38 (Inherited: 0x30)
class UAIFirebatConfig : public UObject {
public:

	bool bUseSweepTrace; // 0x30(0x01)
	bool bDebug; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIFlameThrowerComponent
// Size: 0x510 (Inherited: 0x100)
class UDFMAIFlameThrowerComponent : public UActorComponent {
public:

	char pad_100[0x20]; // 0x100(0x20)
	struct TArray<struct FTransform> SweepBoneTranOffsets; // 0x120(0x10)
	char pad_130[0x30]; // 0x130(0x30)
	struct FVector Normal; // 0x160(0x0c)
	bool bSweep; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	float ShootYaw; // 0x170(0x04)
	float CurrentBurnScaleRange; // 0x174(0x04)
	bool IsInFire; // 0x178(0x01)
	bool bUseSweepTrace; // 0x179(0x01)
	char pad_17A[0x2]; // 0x17a(0x02)
	struct FVector LastTraceEndPoint; // 0x17c(0x0c)
	struct UClass* DataConfig; // 0x188(0x08)
	struct FVector BoxHalfSize; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct TArray<struct AAIFlameDetectorActor*> DetectorActors; // 0x1a0(0x10)
	int32_t DetectorActorNum; // 0x1b0(0x04)
	struct FFloatRange DetectorFireRange; // 0x1b4(0x10)
	float FireMaxDistance; // 0x1c4(0x04)
	float FireStartSegDist; // 0x1c8(0x04)
	float FireEndSegDist; // 0x1cc(0x04)
	struct FName FloorBurnFXName; // 0x1d0(0x08)
	struct FName FlameLoopFXResourceID; // 0x1d8(0x08)
	struct FTransform LoopFXTransform; // 0x1e0(0x30)
	struct UCurveFloat* LoopFadein; // 0x210(0x08)
	char pad_218[0x10]; // 0x218(0x10)
	struct UCurveFloat* LoopFadeout; // 0x228(0x08)
	char pad_230[0x8]; // 0x230(0x08)
	struct UCurveFloat* LoopMaxDistance; // 0x238(0x08)
	char pad_240[0x8]; // 0x240(0x08)
	struct UCurveFloat* LoopFXScale; // 0x248(0x08)
	struct UClass* DetectorActorClass; // 0x250(0x08)
	float FlameLongFXDist; // 0x258(0x04)
	float FlameShortFXDist; // 0x25c(0x04)
	float FlameFXSwitchDist; // 0x260(0x04)
	float FlameMidGapIndex; // 0x264(0x04)
	float FlameTailFxDelay; // 0x268(0x04)
	float FlameTailFadeoutSpeed; // 0x26c(0x04)
	struct FName TailFXAlphaName; // 0x270(0x08)
	float FlameStartDelta; // 0x278(0x04)
	float FlameFadeOutDelta; // 0x27c(0x04)
	struct UGPAudioEventAsset* FireAudio; // 0x280(0x08)
	struct UGPAudioEventAsset* FireLoopAudio; // 0x288(0x08)
	struct UGPAudioEventAsset* StopFireAudio; // 0x290(0x08)
	float DamageCheckDelta; // 0x298(0x04)
	char FlameBuffTriggerTimes; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
	float FlameRadius; // 0x2a0(0x04)
	int32_t FlameBuffId; // 0x2a4(0x04)
	int32_t PainBuffId; // 0x2a8(0x04)
	int32_t TagBuffId; // 0x2ac(0x04)
	int32_t DamageId; // 0x2b0(0x04)
	uint32_t BurnVolumeCDBuff; // 0x2b4(0x04)
	enum class ECharacterPart PainPart; // 0x2b8(0x01)
	char pad_2B9[0x3]; // 0x2b9(0x03)
	struct FName Burn1PFx; // 0x2bc(0x08)
	int32_t MaxNum; // 0x2c4(0x04)
	float FlameVolumeGap; // 0x2c8(0x04)
	float FlameVolumeGap_Mobile; // 0x2cc(0x04)
	float FlameVolumeRadius; // 0x2d0(0x04)
	float FlameVolumeRadius_Mobile; // 0x2d4(0x04)
	struct FName BurnDecalId; // 0x2d8(0x08)
	struct FVector BurnScale; // 0x2e0(0x0c)
	struct FVector BurnDecalOffset; // 0x2ec(0x0c)
	float BurnVolumeDur; // 0x2f8(0x04)
	float BurnVolumeInterval; // 0x2fc(0x04)
	float DropFireHeight; // 0x300(0x04)
	float DropFireHeight_Mobile; // 0x304(0x04)
	struct FFloatRange FloorFireRange; // 0x308(0x10)
	struct FName ScreenPostFXName; // 0x318(0x08)
	struct ADFMAICharacter* Owner; // 0x320(0x08)
	struct TArray<struct TWeakObjectPtr<struct AActor>> FloorBurnVolumes; // 0x328(0x10)
	struct UFXResourceContainerComponent* FlameTailSeg; // 0x338(0x08)
	struct UFXResourceContainerComponent* FlameLoopFX; // 0x340(0x08)
	struct UParticleSystemComponent* FlameLoopFX_Client; // 0x348(0x08)
	char pad_350[0x8]; // 0x350(0x08)
	struct UShapeComponent* FirePosComp; // 0x358(0x08)
	struct USkeletalMeshComponent* FireThrowerMesh; // 0x360(0x08)
	struct USkeletalMeshComponent* OilTankMesh; // 0x368(0x08)
	char pad_370[0x1a0]; // 0x370(0x1a0)

	void TryProcessFlameBurnDamage(struct AActor* Cha, struct FHitResult Hit); // Function DFMGameplay.DFMAIFlameThrowerComponent.TryProcessFlameBurnDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x6248a90
	void ThrowerStartFire(bool Start); // Function DFMGameplay.DFMAIFlameThrowerComponent.ThrowerStartFire // (Final|Native|Public|BlueprintCallable) // @ game+0x6248a00
	void STATIC_RemoveFirebatBurnBuff(struct ADFMCharacter* Cha); // Function DFMGameplay.DFMAIFlameThrowerComponent.RemoveFirebatBurnBuff // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x62486a0
	void PrintDebugStr(struct FString str); // Function DFMGameplay.DFMAIFlameThrowerComponent.PrintDebugStr // (Final|Native|Private|BlueprintCallable) // @ game+0x6248580
	void PlayBurnScreenEffect(struct ADFMCharacter* Cha, struct FName Name); // Function DFMGameplay.DFMAIFlameThrowerComponent.PlayBurnScreenEffect // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x35dfd20
	void OnRep_IsInFire(); // Function DFMGameplay.DFMAIFlameThrowerComponent.OnRep_IsInFire // (Final|Native|Public) // @ game+0x6248560
	void OnRep_CurrentBurnScaleRange(); // Function DFMGameplay.DFMAIFlameThrowerComponent.OnRep_CurrentBurnScaleRange // (Final|Native|Public) // @ game+0x88f4d0
	bool FlameBlock(); // Function DFMGameplay.DFMAIFlameThrowerComponent.FlameBlock // (Final|Native|Public|BlueprintCallable) // @ game+0x62476b0
	void BroadcastMsg_StopBurnVolume(int32_t Key); // Function DFMGameplay.DFMAIFlameThrowerComponent.BroadcastMsg_StopBurnVolume // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x367b100
	void BroadcastMsg_PlayBurnVolume(int32_t Key, struct FVector Location, struct FVector Normal); // Function DFMGameplay.DFMAIFlameThrowerComponent.BroadcastMsg_PlayBurnVolume // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x6247430
	void BroadcastMsg_PlayBurnDecal(struct FHitResult Hit, float ScaleRange); // Function DFMGameplay.DFMAIFlameThrowerComponent.BroadcastMsg_PlayBurnDecal // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x62472d0
	void BroadcastMsg_Debug(struct FHitResult Hit, float ScaleRange); // Function DFMGameplay.DFMAIFlameThrowerComponent.BroadcastMsg_Debug // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x6222340
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIGroupScenesComponent
// Size: 0x138 (Inherited: 0x100)
class UAIGroupScenesComponent : public UActorComponent {
public:

	bool bIsOpen; // 0x100(0x01)
	char pad_101[0x7]; // 0x101(0x07)
	struct TArray<char> ScenesTypeOfList; // 0x108(0x10)
	struct TArray<struct AAIScenesActor*> HistoryScene; // 0x118(0x10)
	char pad_128[0x10]; // 0x128(0x10)

	void ScenesActorUseTimeout(struct AAIScenesActor* scenesActor); // Function DFMGameplay.AIGroupScenesComponent.ScenesActorUseTimeout // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct TArray<struct AAIScenesActor*> GetScenesActorsForDistance(bool& bTooOften, struct TArray<struct FScenesFailureReasons>& ScenesFailureReasons, float radius); // Function DFMGameplay.AIGroupScenesComponent.GetScenesActorsForDistance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6248230
	struct TArray<struct AAIPatrolPath*> GetPatrolArrayScenesActors(float radius); // Function DFMGameplay.AIGroupScenesComponent.GetPatrolArrayScenesActors // (Final|Native|Public|BlueprintCallable) // @ game+0x6248100
	struct AAIScenesActor* GetCurrentScene(); // Function DFMGameplay.AIGroupScenesComponent.GetCurrentScene // (Final|Native|Public|BlueprintCallable) // @ game+0x62480d0
	struct TArray<struct AAIScenesActor*> GetCategoryScenesActors(bool& bTooOften, char ScenesActorType, struct TArray<struct FScenesFailureReasons>& ScenesFailureReasons, float radius); // Function DFMGameplay.AIGroupScenesComponent.GetCategoryScenesActors // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6247bb0
	struct TArray<struct AAIScenesActor*> GetCategoryArrayScenesActors(bool& bTooOften, struct TArray<char> ScenesActorTypeList, struct TArray<struct FScenesFailureReasons>& ScenesFailureReasons, float radius); // Function DFMGameplay.AIGroupScenesComponent.GetCategoryArrayScenesActors // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6247930
	struct TArray<struct AAIScenesActor*> GetALLScenesActors(bool& bTooOften, struct TArray<struct FScenesFailureReasons>& ScenesFailureReasons); // Function DFMGameplay.AIGroupScenesComponent.GetALLScenesActors // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6247780
	bool CreateWayPoints(struct AAIScenesActor* SceneActor, struct TArray<struct FVector>& WayPoints); // Function DFMGameplay.AIGroupScenesComponent.CreateWayPoints // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6247560
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ScenesSpawnPoint
// Size: 0x5a0 (Inherited: 0x580)
class UScenesSpawnPoint : public USphereComponent {
public:

	float SpawnPointRadius; // 0x580(0x04)
	int32_t PercentageValue; // 0x584(0x04)
	int32_t MaxSpawnNum; // 0x588(0x04)
	char pad_58C[0x14]; // 0x58c(0x14)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIGroupThreatComponent
// Size: 0x200 (Inherited: 0x100)
class UAIGroupThreatComponent : public UActorComponent {
public:

	struct TMap<struct TWeakObjectPtr<struct ACHARACTER>, struct FAIGroupThreatRecord> ThreatDetailRecordMap; // 0x100(0x50)
	struct TArray<struct FAIGroupThreatResult> TargetList; // 0x150(0x10)
	struct TArray<struct FAIGroupThreatResult> VisibleList; // 0x160(0x10)
	float WaitTimeForRecoverGroup; // 0x170(0x04)
	char pad_174[0xc]; // 0x174(0x0c)
	struct ACHARACTER* LastVisibleTarget; // 0x180(0x08)
	char pad_188[0x8]; // 0x188(0x08)
	struct TMap<struct TWeakObjectPtr<struct ACHARACTER>, float> LastPlayerRemoveTime; // 0x190(0x50)
	float OrdinaryCoverTime; // 0x1e0(0x04)
	float SpecialDeathCoverageTime; // 0x1e4(0x04)
	float RemoveNotUpdatedTime; // 0x1e8(0x04)
	char pad_1EC[0x4]; // 0x1ec(0x04)
	/*struct FMulticastInlineDelegate*/char PlayerDeathNotification[0x10]; // 0x1f0(0x10)

	bool SetTargetExtraData(struct ACHARACTER* CHARACTER, struct FAIGroupThreatExtraData& Result); // Function DFMGameplay.AIGroupThreatComponent.SetTargetExtraData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624cc10
	void OnPlayerDied(struct AGPCharacterBase* Player, struct AController* Killer, struct UDamageType* DamageType); // Function DFMGameplay.AIGroupThreatComponent.OnPlayerDied // (Final|Native|Public) // @ game+0x624c1f0
	bool IsCharacterThreatExist(struct ACHARACTER* CHARACTER); // Function DFMGameplay.AIGroupThreatComponent.IsCharacterThreatExist // (Final|Native|Public|BlueprintCallable) // @ game+0x624bfc0
	bool IsCharacterThreatDetailExist(struct ACHARACTER* CHARACTER, enum class EAIThreatDetailName detail); // Function DFMGameplay.AIGroupThreatComponent.IsCharacterThreatDetailExist // (Final|Native|Public|BlueprintCallable) // @ game+0x624bf00
	int32_t GetVisibleThreatTargetList(struct TArray<struct FAIGroupThreatResult>& Result); // Function DFMGameplay.AIGroupThreatComponent.GetVisibleThreatTargetList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624be20
	int32_t GetThreatTargetList(struct TArray<struct FAIGroupThreatResult>& Result); // Function DFMGameplay.AIGroupThreatComponent.GetThreatTargetList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624bd40
	int32_t GetThreatTargetLength(); // Function DFMGameplay.AIGroupThreatComponent.GetThreatTargetLength // (Final|Native|Public|BlueprintCallable) // @ game+0x624bd10
	struct ACHARACTER* GetThreatTargetLastVisible(float& Time); // Function DFMGameplay.AIGroupThreatComponent.GetThreatTargetLastVisible // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624bc60
	bool GetTargetExtraData(struct ACHARACTER* CHARACTER, struct FAIGroupThreatExtraData& Result); // Function DFMGameplay.AIGroupThreatComponent.GetTargetExtraData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624bb90
	struct FGroupThreatCharacterQueryDetail GetRecordByNameOrder(enum class EAIThreatDetailName Name, bool includeDeadCharacter); // Function DFMGameplay.AIGroupThreatComponent.GetRecordByNameOrder // (Final|Native|Public|BlueprintCallable) // @ game+0x624bab0
	struct FGroupThreatCharacterQueryDetail GetNameOrder(bool includeDeadCharacter); // Function DFMGameplay.AIGroupThreatComponent.GetNameOrder // (Final|Native|Public|BlueprintCallable) // @ game+0x624ba00
	bool GetLocationToSearchForThreatSource(struct TArray<enum class EAIThreatDetailName> detailNames, float Distance, struct TArray<struct FAIGroupThreatSource>& Players); // Function DFMGameplay.AIGroupThreatComponent.GetLocationToSearchForThreatSource // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624b820
	int32_t GetArrayNoFilter(struct TArray<struct ACHARACTER*>& Result, bool includeDeadCharacter); // Function DFMGameplay.AIGroupThreatComponent.GetArrayNoFilter // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624b700
	int32_t GetArrayByName(enum class EAIThreatDetailName Name, struct TArray<struct ACHARACTER*>& Result, bool includeDeadCharacter); // Function DFMGameplay.AIGroupThreatComponent.GetArrayByName // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x624b5a0
	bool ClearTargetThreat(struct ACHARACTER* Player); // Function DFMGameplay.AIGroupThreatComponent.ClearTargetThreat // (Final|Native|Public|BlueprintCallable) // @ game+0x624b230
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIHeavyMachineGunComponent
// Size: 0x298 (Inherited: 0x100)
class UDFMAIHeavyMachineGunComponent : public UActorComponent {
public:

	char pad_100[0x18]; // 0x100(0x18)
	struct FVector WeaponScale; // 0x118(0x0c)
	struct FVector WeaponOffset; // 0x124(0x0c)
	bool HideRealWeapon; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FRotator HelmetRotation; // 0x134(0x0c)
	struct FVector HelmetOffSet; // 0x140(0x0c)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UCurveFloat* DropCur; // 0x150(0x08)
	struct UCurveFloat* DropRotCur; // 0x158(0x08)
	struct USplineComponent* DropSpline; // 0x160(0x08)
	float TotalDropMoveTime; // 0x168(0x04)
	float HelmetHp; // 0x16c(0x04)
	struct FHitAudioConfig HelmetBreakAudioConf; // 0x170(0xa0)
	float HelmetBreakGodSecs; // 0x210(0x04)
	int32_t HitEffectAfterDropHelmet; // 0x214(0x04)
	struct UPhysicsAsset* HelmetPhysicsAsset; // 0x218(0x08)
	struct UPhysicsAsset* CacheOriginalPhysicsAsset; // 0x220(0x08)
	struct FName HitArmFxName; // 0x228(0x08)
	struct FString StaggerName; // 0x230(0x10)
	bool IsInFire; // 0x240(0x01)
	char pad_241[0x7]; // 0x241(0x07)
	struct AWeaponBase* RealWeapon; // 0x248(0x08)
	struct USkeletalMeshComponent* FakeWeapon; // 0x250(0x08)
	struct USkeletalMeshComponent* HELMET; // 0x258(0x08)
	struct FName AttachSocketName; // 0x260(0x08)
	struct ADFMAICharacter* Owner; // 0x268(0x08)
	char pad_270[0x28]; // 0x270(0x28)

	void StopFire(); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.StopFire // (Net|Native|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x3624900
	void StartDropHelmet(bool PlayAudio, struct FVector hitDir, int64_t PlayerUin); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.StartDropHelmet // (Net|Native|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x624cd60
	void SetUpMachineGun(struct USkeletalMeshComponent* ChainMain); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.SetUpMachineGun // (Final|Native|Public|BlueprintCallable) // @ game+0x624cce0
	void PlayFx(struct FName Name, struct FTransform Transform); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.PlayFx // (Net|Native|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x624c540
	void OpenFire(bool Fire, float PlayAnimVec); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.OpenFire // (Final|Native|Public|BlueprintCallable) // @ game+0x624c480
	void OnPreTakeDamage(struct FDamageResultInfo& DamageResult); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.OnPreTakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x624c2f0
	void OnMasterTakeDamage(struct FDamageResultInfo& DamageResult, enum class ECharacterPart& HitPart); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.OnMasterTakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x624c0d0
	void Fire(bool PlayPreFireAnim); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.Fire // (Net|Native|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x35c8e40
	void CharacterPlayFx(struct FName& Name, struct FTransform& Transform); // Function DFMGameplay.DFMAIHeavyMachineGunComponent.CharacterPlayFx // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x624b100
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIHelicopterSpawnComponent
// Size: 0x340 (Inherited: 0x100)
class UDFMAIHelicopterSpawnComponent : public UActorComponent {
public:

	struct ADFMAICharacter* OwnerCharacter; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)
	struct FAIHelicopterSpawnParam AIHelicopterSpawnParma; // 0x110(0x70)
	char pad_180[0x70]; // 0x180(0x70)
	struct FAITransportHelicopterRepParam AITransportHelicopterRepParam; // 0x1f0(0x90)
	char pad_280[0xb0]; // 0x280(0xb0)
	struct AGPVehicleBase* OwnerVehicle; // 0x330(0x08)
	char pad_338[0x8]; // 0x338(0x08)

	void SetKeyPosition(struct FVector KeyPos); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.SetKeyPosition // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x624cb80
	void SetAIHelicopterState(enum class EAIHelicopterSpawnState InState); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.SetAIHelicopterState // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x624cb00
	void SetAIHelicopterParam(struct FAIHelicopterSpawnParam InParam); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.SetAIHelicopterParam // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x624c9c0
	void ServerSetTransportParam(struct FAITransportHelicopterRepParam Param); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.ServerSetTransportParam // (Final|Native|Public|BlueprintCallable) // @ game+0x624c880
	void ServerSetAnimIndex(enum class EAITransportPoseType PoseType, struct UAnimMontage* Montage, bool bHasRootMotion, struct FTransform MotionWarpingTarget); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.ServerSetAnimIndex // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x624c6d0
	void OnVehicleDead(struct AGPVehicleBase* DFMVehicle); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.OnVehicleDead // (Final|Native|Protected) // @ game+0x624c400
	void OnRep_TransportParam(); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.OnRep_TransportParam // (Final|Native|Private) // @ game+0x624c3e0
	void OnRep_Param(); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.OnRep_Param // (Final|Native|Private) // @ game+0x624c3c0
	bool STATIC_IsMontageHasRootMotion(struct UAnimMontage* Montage); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.IsMontageHasRootMotion // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x624c050
	float STATIC_GetAnimNotifyTriggerTime(struct UAnimSequenceBase* Anim, int32_t Index); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.GetAnimNotifyTriggerTime // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x624b4e0
	void DrawDebug(struct FVector PosT, struct FColor Color, float LifeTime); // Function DFMGameplay.DFMAIHelicopterSpawnComponent.DrawDebug // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults|BlueprintCallable) // @ game+0x624b2c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AnimNotifyState_AIMotionWarping
// Size: 0x38 (Inherited: 0x38)
class UAnimNotifyState_AIMotionWarping : public UAnimNotifyState {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAILabDebugInfo
// Size: 0x388 (Inherited: 0x378)
class ADFMAILabDebugInfo : public AActor {
public:

	struct UWidgetComponent* DebugPanel; // 0x378(0x08)
	struct UTextBlock* DebugStr; // 0x380(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAILabInputLeftFireLogic
// Size: 0x78 (Inherited: 0x78)
class UDFMAILabInputLeftFireLogic : public UGPInputLeftFireLogic {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAILabStatisComponent
// Size: 0x1f8 (Inherited: 0x100)
class UDFMAILabStatisComponent : public UActorComponent {
public:

	char pad_100[0xf8]; // 0x100(0xf8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAINameManager
// Size: 0x88 (Inherited: 0x38)
class UDFMAINameManager : public UWorldSubsystem {
public:

	char pad_38[0x50]; // 0x38(0x50)

	void STATIC_GetRankIconByName(struct UObject* WorldContext, struct FString Name); // Function DFMGameplay.DFMAINameManager.GetRankIconByName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x62512b0
	struct FSoftObjectPath STATIC_GetHalfBodyImageByAINameText(struct FText& AINameText); // Function DFMGameplay.DFMAINameManager.GetHalfBodyImageByAINameText // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x6250dd0
	struct UDFMAINameManager* STATIC_Get(struct UObject* WorldContextObject); // Function DFMGameplay.DFMAINameManager.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x6250990
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIOilTankComponent
// Size: 0x198 (Inherited: 0x100)
class UDFMAIOilTankComponent : public UActorComponent {
public:

	char pad_100[0x18]; // 0x100(0x18)
	float OilTankHealthPoint; // 0x118(0x04)
	float OilTankLeakThreshold; // 0x11c(0x04)
	struct FFloatRange OilExplodeRange; // 0x120(0x10)
	struct FVector OilExplodePos; // 0x130(0x0c)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct USkeletalMeshComponent* OilTank; // 0x140(0x08)
	bool bHasTriggeredExplode; // 0x148(0x01)
	char pad_149[0x3]; // 0x149(0x03)
	struct FName OilTankLeakFlameFXResourceId; // 0x14c(0x08)
	struct FName OilTankExplodeFXResourceId; // 0x154(0x08)
	char pad_15C[0x4]; // 0x15c(0x04)
	uint64_t OilTankExplodeAttakerId; // 0x160(0x08)
	uint64_t KillSelfDamageId; // 0x168(0x08)
	struct FName OilTankThresholdStaggerName; // 0x170(0x08)
	int8_t OilTankLeakFlameLimit; // 0x178(0x01)
	char pad_179[0x7]; // 0x179(0x07)
	struct UClass* DamageGE; // 0x180(0x08)
	struct FName OilTankPerformanceAnimName; // 0x188(0x08)
	bool bDebug; // 0x190(0x01)
	char pad_191[0x7]; // 0x191(0x07)

	void PlayOilTankFx(int32_t Type, struct FTransform Transform); // Function DFMGameplay.DFMAIOilTankComponent.PlayOilTankFx // (Net|Native|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x6252120
	bool HitOilTankCheck(struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo& DamageResult, struct UPrimitiveComponent* OilTankMeshComp); // Function DFMGameplay.DFMAIOilTankComponent.HitOilTankCheck // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x62519a0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIPlayerPathFollowingComponent
// Size: 0x570 (Inherited: 0x2a8)
class UDFMAIPlayerPathFollowingComponent : public UPathFollowingComponent {
public:

	char pad_2A8[0x10]; // 0x2a8(0x10)
	bool bIsOpenStuckDetection; // 0x2b8(0x01)
	char pad_2B9[0x3]; // 0x2b9(0x03)
	float MoveAcceleration; // 0x2bc(0x04)
	float MoveVelScaleAngleMore60; // 0x2c0(0x04)
	float MoveVelScaleAngleMore90; // 0x2c4(0x04)
	float MoveVelScaleAngleMore120; // 0x2c8(0x04)
	float MoveFocalPointDistance; // 0x2cc(0x04)
	float VaultConfigAccpetAngle; // 0x2d0(0x04)
	float VaultConfigTryTimeLimit; // 0x2d4(0x04)
	int32_t VaultConfigTryVaultCount; // 0x2d8(0x04)
	int32_t VaultConfigTryJumpCount; // 0x2dc(0x04)
	bool VaultThanReachCurrentTarget; // 0x2e0(0x01)
	char pad_2E1[0x3]; // 0x2e1(0x03)
	float ClimbLadderTryTimeLimit; // 0x2e4(0x04)
	float ClimbLadderDownwardHeight; // 0x2e8(0x04)
	float ClimbLadderTimeLimit; // 0x2ec(0x04)
	bool FallThanReachCurrentTarget; // 0x2f0(0x01)
	char pad_2F1[0x3]; // 0x2f1(0x03)
	float OpenParachuteFromFloor; // 0x2f4(0x04)
	float OpenParachuteTime; // 0x2f8(0x04)
	int32_t SegmentMoveFarawayFailCount; // 0x2fc(0x04)
	float SegmentExceptionReachAccept; // 0x300(0x04)
	char pad_304[0xf4]; // 0x304(0xf4)
	float TickPathCheckInterval; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct ADFMAIPlayerController* Controller; // 0x400(0x08)
	struct ARecastNavMesh* RecastNavMesh; // 0x408(0x08)
	char pad_410[0x8]; // 0x410(0x08)
	bool bIsStuck; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float StuckSeconds; // 0x41c(0x04)
	struct AWorldQuerySubsystem* WQSystem; // 0x420(0x08)
	char pad_428[0x148]; // 0x428(0x148)

	bool IsUsingNavLink(); // Function DFMGameplay.DFMAIPlayerPathFollowingComponent.IsUsingNavLink // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6255a60
	int32_t GetVaultTryTimes(); // Function DFMGameplay.DFMAIPlayerPathFollowingComponent.GetVaultTryTimes // (Final|Native|Public|BlueprintCallable) // @ game+0x62558b0
	struct TArray<struct FVector> GetStuckBypassPoints(); // Function DFMGameplay.DFMAIPlayerPathFollowingComponent.GetStuckBypassPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x6255830
	struct FVector GetCurrentFootLocation(); // Function DFMGameplay.DFMAIPlayerPathFollowingComponent.GetCurrentFootLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x6255770
	void ClearPathStuckFlag(); // Function DFMGameplay.DFMAIPlayerPathFollowingComponent.ClearPathStuckFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x6255580
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIRCVDataComponent
// Size: 0x630 (Inherited: 0x100)
class UDFMAIRCVDataComponent : public UActorComponent {
public:

	bool bHasWeaponSystem; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	struct FName GunMeshComponentName; // 0x104(0x08)
	struct FName GunMeshSocketName; // 0x10c(0x08)
	struct FName BaseMeshSocketName; // 0x114(0x08)
	struct FName GunMeshBoneName; // 0x11c(0x08)
	struct FName RocketMeshBoneName; // 0x124(0x08)
	struct FName DefaultGunSocketName; // 0x12c(0x08)
	struct FName DefaultRocketSocketName; // 0x134(0x08)
	struct FName SuicideCarDoorSocketName; // 0x13c(0x08)
	struct FName SuicideCarSplineComponentName; // 0x144(0x08)
	struct FName CameraBoneName; // 0x14c(0x08)
	struct FName VehicleMeshComponentName; // 0x154(0x08)
	char pad_15C[0x4]; // 0x15c(0x04)
	struct TArray<struct FName> WheelSocketNames; // 0x160(0x10)
	struct TArray<struct FName> WheelSocketExtraNames; // 0x170(0x10)
	float WheelSize; // 0x180(0x04)
	float WheelSpringLength; // 0x184(0x04)
	float UpVectorRotateSpeed; // 0x188(0x04)
	float RandomDitherAngle; // 0x18c(0x04)
	float MaxSnapAngle; // 0x190(0x04)
	float RandomDitherFreq; // 0x194(0x04)
	float RandomDitherAcc; // 0x198(0x04)
	bool bXAxisForward; // 0x19c(0x01)
	bool bDebugDrawWheelRaycast; // 0x19d(0x01)
	char pad_19E[0x2]; // 0x19e(0x02)
	float ProjectionSpeed; // 0x1a0(0x04)
	float ProjectDamping; // 0x1a4(0x04)
	uint64_t LeftMainWeaponID; // 0x1a8(0x08)
	uint64_t RightMainWeaponID; // 0x1b0(0x08)
	float YawRotateSpeed; // 0x1b8(0x04)
	float RocketGoalPitch; // 0x1bc(0x04)
	float RocketRotateSpeed; // 0x1c0(0x04)
	float GunMaxYawOffset; // 0x1c4(0x04)
	float CarDoorMaxPitch; // 0x1c8(0x04)
	float CarDoorRotateSpeed; // 0x1cc(0x04)
	float CamereRotateDuration; // 0x1d0(0x04)
	float CameraRotateSpeed; // 0x1d4(0x04)
	uint64_t MissileSignalBulletID; // 0x1d8(0x08)
	float MissileLocOffset; // 0x1e0(0x04)
	struct FName EffectName; // 0x1e4(0x08)
	struct FName EffectAttachComponentName; // 0x1ec(0x08)
	struct FName EffectAttachSocketName; // 0x1f4(0x08)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	/*struct TMap<enum class ERCVAISoundFxType, struct TSoftObjectPtr<UGPAudioEventAsset>>*/char SoundMap[0x50]; // 0x200(0x50)
	float StopMovingCheckInterval; // 0x250(0x04)
	bool bEnableAudioDebug; // 0x254(0x01)
	bool bExploded; // 0x255(0x01)
	char pad_256[0x2]; // 0x256(0x02)
	/*struct FMulticastInlineDelegate*/char BlueprintOnEffectUpdate[0x10]; // 0x258(0x10)
	struct USkeletalMeshComponent* GunMesh; // 0x268(0x08)
	struct USkeletalMeshComponent* VehicleMesh; // 0x270(0x08)
	struct UFXResourceContainerComponent* LightFXContainer; // 0x278(0x08)
	struct USplineComponent* SplineComponent; // 0x280(0x08)
	struct FVector CameraFocusLocation; // 0x288(0x0c)
	char pad_294[0x4]; // 0x294(0x04)
	struct AActor* CameraFocusTarget; // 0x298(0x08)
	struct UMotionActionComponent* MotionAction; // 0x2a0(0x08)
	struct TArray<struct UDFDynamicCoverComponent*> DynamicCovers; // 0x2a8(0x10)
	struct TArray<struct UBoxComponent*> CollisionBoxes; // 0x2b8(0x10)
	struct TArray<struct FMissileTarget> MissileTargets; // 0x2c8(0x10)
	struct AActor* LastFocusTarget; // 0x2d8(0x08)
	bool bMissilePreparing; // 0x2e0(0x01)
	bool bSuicideCarPreparing; // 0x2e1(0x01)
	char pad_2E2[0x2]; // 0x2e2(0x02)
	float CrazyRotationSpeed; // 0x2e4(0x04)
	struct AActor* FollowingSplineParent; // 0x2e8(0x08)
	char pad_2F0[0x340]; // 0x2f0(0x340)

	void UpdateNavObstacle(bool EnableObstacle); // Function DFMGameplay.DFMAIRCVDataComponent.UpdateNavObstacle // (Final|Native|Public|BlueprintCallable) // @ game+0x62563e0
	void UpdateDynamicCover(bool EnableCover); // Function DFMGameplay.DFMAIRCVDataComponent.UpdateDynamicCover // (Final|Native|Public|BlueprintCallable) // @ game+0x6256350
	bool SuicideCarSpawnInit(struct AActor* RCVParent); // Function DFMGameplay.DFMAIRCVDataComponent.SuicideCarSpawnInit // (Final|Native|Public|BlueprintCallable) // @ game+0x62562c0
	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function DFMGameplay.DFMAIRCVDataComponent.SetVectorParameter // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x62561f0
	void SetHomingTarget(struct AActor* Target); // Function DFMGameplay.DFMAIRCVDataComponent.SetHomingTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x6256170
	void SetHomingLocation(struct AActor* Target, struct FVector Location); // Function DFMGameplay.DFMAIRCVDataComponent.SetHomingLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x62560a0
	void SetFloatParameter(struct FName ParameterName, float Param); // Function DFMGameplay.DFMAIRCVDataComponent.SetFloatParameter // (Final|Native|Public|BlueprintCallable) // @ game+0x6255fe0
	void SetCrazyRotationSpeed(float Speed); // Function DFMGameplay.DFMAIRCVDataComponent.SetCrazyRotationSpeed // (Final|Native|Public|BlueprintCallable) // @ game+0x6255f60
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function DFMGameplay.DFMAIRCVDataComponent.SetColorParameter // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6255e90
	void PrepareSuicideCar(); // Function DFMGameplay.DFMAIRCVDataComponent.PrepareSuicideCar // (Final|Native|Public|BlueprintCallable) // @ game+0x6255e70
	void PlaySoundFx(enum class ERCVAISoundFxType Type); // Function DFMGameplay.DFMAIRCVDataComponent.PlaySoundFx // (Final|Native|Public|BlueprintCallable) // @ game+0x6255df0
	void OnRep_SuicideCarPrepare(); // Function DFMGameplay.DFMAIRCVDataComponent.OnRep_SuicideCarPrepare // (Final|Native|Public) // @ game+0x6255d50
	void OnRep_FollowingParent(); // Function DFMGameplay.DFMAIRCVDataComponent.OnRep_FollowingParent // (Final|Native|Public) // @ game+0x6255d10
	void OnRep_CrazyRotation(); // Function DFMGameplay.DFMAIRCVDataComponent.OnRep_CrazyRotation // (Final|Native|Public) // @ game+0x6255cf0
	bool LaunchMissile(struct AActor* Commander, int32_t TargetCount, int32_t MaxMissilePerTarget, int32_t MaxMissileCount, float Delay, float Interval); // Function DFMGameplay.DFMAIRCVDataComponent.LaunchMissile // (Final|Native|Public|BlueprintCallable) // @ game+0x6255a80
	bool IsCrazyRotationEnable(); // Function DFMGameplay.DFMAIRCVDataComponent.IsCrazyRotationEnable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6255a30
	bool IsAnyCoverOccupied(); // Function DFMGameplay.DFMAIRCVDataComponent.IsAnyCoverOccupied // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x6255a00
	struct FTransform GetBoneTransform(struct FName Socket); // Function DFMGameplay.DFMAIRCVDataComponent.GetBoneTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x62556b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIRCVExplosionComponent
// Size: 0x140 (Inherited: 0x100)
class UDFMAIRCVExplosionComponent : public UActorComponent {
public:

	/*struct FMulticastInlineDelegate*/char BlueprintOnExplode[0x10]; // 0x100(0x10)
	uint64_t HitFxId; // 0x110(0x08)
	uint64_t AttakerId; // 0x118(0x08)
	struct TArray<struct UFXResourceContainerComponent*> ImpactFXComps; // 0x120(0x10)
	struct TArray<int32_t> ImpactFXCompHandles; // 0x130(0x10)

	void ExplodeImpl(); // Function DFMGameplay.DFMAIRCVExplosionComponent.ExplodeImpl // (Final|Native|Private) // @ game+0x62555a0
	void Explode(float DelaySeconds); // Function DFMGameplay.DFMAIRCVExplosionComponent.Explode // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x3673190
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.RCVAIAnimInstance
// Size: 0xae0 (Inherited: 0x290)
class URCVAIAnimInstance : public UGPAnimInstanceBase {
public:

	struct FRCVAIAnimInstanceProxy LocalProxy; // 0x290(0x820)
	struct UDFMAIRCVDataComponent* RCVDataComponent; // 0xab0(0x08)
	struct TArray<struct FRCVAIWheelIK> WheelIKSetup; // 0xab8(0x10)
	float RotateMaxAngle; // 0xac8(0x04)
	float WheelRotateSpeed; // 0xacc(0x04)
	float RotateWithoutMoving; // 0xad0(0x04)
	float RotateWithMoving; // 0xad4(0x04)
	char pad_AD8[0x8]; // 0xad8(0x08)

	void GetWheelIKLookAt(int32_t Index, struct FVector& LookAt, struct FVector& Target); // Function DFMGameplay.RCVAIAnimInstance.GetWheelIKLookAt // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x62558e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.RCVAIWeaponFuncComponentFiring
// Size: 0x1f0 (Inherited: 0x1f0)
class URCVAIWeaponFuncComponentFiring : public UWeaponFuncComponentFiring {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIRCVWeaponFireSocket
// Size: 0x98 (Inherited: 0x98)
class UDFMAIRCVWeaponFireSocket : public UWeaponFireSocket {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIScenesActor
// Size: 0x420 (Inherited: 0x378)
class AAIScenesActor : public AActor {
public:

	struct FString UniqueKey; // 0x378(0x10)
	char ScenesType; // 0x388(0x01)
	bool bIsOpen; // 0x389(0x01)
	char pad_38A[0x6]; // 0x38a(0x06)
	struct TArray<struct UAIScenesInteractiveComponent*> ScenesInteractiveActors; // 0x390(0x10)
	struct TArray<struct AAIGroup*> Groups; // 0x3a0(0x10)
	char pad_3B0[0x50]; // 0x3b0(0x50)
	float Timeout; // 0x400(0x04)
	float CoolDown; // 0x404(0x04)
	struct TArray<struct FPreScene> PreScenes; // 0x408(0x10)
	int32_t MaxGroupNum; // 0x418(0x04)
	float EndTheDistanceOfGroupMovement; // 0x41c(0x04)

	bool UseScencesActor(struct AAIGroup* Group, struct TArray<struct FVector>& WayPoints); // Function DFMGameplay.AIScenesActor.UseScencesActor // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x625ae70
	bool StartSceneTiming(struct AAIGroup* Group); // Function DFMGameplay.AIScenesActor.StartSceneTiming // (Final|Native|Public|BlueprintCallable) // @ game+0x625ab50
	bool IsUse(); // Function DFMGameplay.AIScenesActor.IsUse // (Final|Native|Public|BlueprintCallable) // @ game+0x625a7a0
	struct UScenesSpawnPoint* GetRandomSpawnPoint(); // Function DFMGameplay.AIScenesActor.GetRandomSpawnPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x625a770
	struct TArray<struct FVector> GetInterActiveLocation(); // Function DFMGameplay.AIScenesActor.GetInterActiveLocation // (Final|Native|Public|BlueprintCallable) // @ game+0x625a560
	struct TArray<struct FInteractiveInfo> GetInteractiveActorList(); // Function DFMGameplay.AIScenesActor.GetInteractiveActorList // (Final|Native|Public|BlueprintCallable) // @ game+0x625a5e0
	bool FinishScencesActor(struct AAIGroup* Group); // Function DFMGameplay.AIScenesActor.FinishScencesActor // (Final|Native|Public|BlueprintCallable) // @ game+0x625a3c0
	bool DeleteInteractiveActor(struct UAIScenesInteractiveComponent* InteractiveComp); // Function DFMGameplay.AIScenesActor.DeleteInteractiveActor // (Final|Native|Public|BlueprintCallable) // @ game+0x625a290
	void DeleteGroup(struct AAIGroup* Group); // Function DFMGameplay.AIScenesActor.DeleteGroup // (Final|Native|Public|BlueprintCallable) // @ game+0x625a210
	void ClearInteractiveActor(); // Function DFMGameplay.AIScenesActor.ClearInteractiveActor // (Final|Native|Public|BlueprintCallable) // @ game+0x625a170
	bool AddInteractiveActor(struct UAIScenesInteractiveComponent* InteractiveComp); // Function DFMGameplay.AIScenesActor.AddInteractiveActor // (Final|Native|Public|BlueprintCallable) // @ game+0x625a0e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.AIScenesInteractiveComponent
// Size: 0x670 (Inherited: 0x570)
class UAIScenesInteractiveComponent : public UArrowComponent {
public:

	struct AAIScenesActor* OwnerInteractor_BelongSceneActor; // 0x570(0x08)
	bool bIsOpen; // 0x578(0x01)
	char pad_579[0x7]; // 0x579(0x07)
	struct TMap<char, struct UScenesAnimates*> TagCorrespondingAnimation; // 0x580(0x50)
	enum class EPreInteractionWalkingMode PreInteractionWalkingMode; // 0x5d0(0x01)
	char pad_5D1[0x57]; // 0x5d1(0x57)
	float Timeout; // 0x628(0x04)
	float CoolDown; // 0x62c(0x04)
	int32_t MaxAINum; // 0x630(0x04)
	char pad_634[0x4]; // 0x634(0x04)
	struct TArray<struct AAIController*> Controllers; // 0x638(0x10)
	char pad_648[0x28]; // 0x648(0x28)

	bool UseInteractiveActor(struct AAIController* AIController); // Function DFMGameplay.AIScenesInteractiveComponent.UseInteractiveActor // (Native|Public|BlueprintCallable) // @ game+0x625add0
	bool STATIC_ToFindThePath(struct AActor* Actor, struct FVector StartLocation, struct FVector EndLocation, struct TArray<struct FVector>& WayPoints, bool IsVehiclePath); // Function DFMGameplay.AIScenesInteractiveComponent.ToFindThePath // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x625abe0
	bool StartInteractiveTiming(struct AAIController* AIController); // Function DFMGameplay.AIScenesInteractiveComponent.StartInteractiveTiming // (Final|Native|Public|BlueprintCallable) // @ game+0x625aac0
	void OnLevelSelectionChanged(struct FVector SceneActorLocation); // Function DFMGameplay.AIScenesInteractiveComponent.OnLevelSelectionChanged // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x625a880
	int32_t IsUse(); // Function DFMGameplay.AIScenesInteractiveComponent.IsUse // (Native|Public|BlueprintCallable) // @ game+0x625a7d0
	bool FinishInteractiveActor(struct AAIController* AIController); // Function DFMGameplay.AIScenesInteractiveComponent.FinishInteractiveActor // (Native|Public|BlueprintCallable) // @ game+0x625a320
	void DeleteController(struct AAIController* AIController); // Function DFMGameplay.AIScenesInteractiveComponent.DeleteController // (Final|Native|Public|BlueprintCallable) // @ game+0x625a190
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.ScenesAnimates
// Size: 0x40 (Inherited: 0x30)
class UScenesAnimates : public UObject {
public:

	struct TArray<struct FScenesAnimate> AnimateList; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_AIFight
// Size: 0x148 (Inherited: 0x78)
class UDFMAIService_AIFight : public UBTService {
public:

	struct FBlackboardKeySelector MainTargetBBKey; // 0x78(0x28)
	struct FBlackboardKeySelector MainTargetLastSeenLocationBBKey; // 0xa0(0x28)
	struct FBlackboardKeySelector SituationBBKey; // 0xc8(0x28)
	struct FBlackboardKeySelector MainTargetDistance; // 0xf0(0x28)
	struct FBlackboardKeySelector BestFightDistance; // 0x118(0x28)
	char pad_140[0x8]; // 0x140(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_AIJob
// Size: 0x88 (Inherited: 0x78)
class UDFMAIService_AIJob : public UBTService {
public:

	struct TArray<struct FJobBBKey> JobBBKeys; // 0x78(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_AIJobKeeper
// Size: 0x80 (Inherited: 0x78)
class UDFMAIService_AIJobKeeper : public UBTService {
public:

	struct UAIJob* Job; // 0x78(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_AISpeed
// Size: 0x98 (Inherited: 0x78)
class UDFMAIService_AISpeed : public UBTService {
public:

	char pad_78[0x8]; // 0x78(0x08)
	struct ADFMAIController* AIController; // 0x80(0x08)
	struct ADFMCharacter* CHARACTER; // 0x88(0x08)
	struct UDFMCharacterMovementComponent* MovementComponent; // 0x90(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_FaceTo
// Size: 0xd0 (Inherited: 0x78)
class UDFMAIService_FaceTo : public UBTService {
public:

	enum class EFaceToLocationType FaceToLocationType; // 0x78(0x01)
	enum class EFaceToTurnType FaceToTurnType; // 0x79(0x01)
	char pad_7A[0x2]; // 0x7a(0x02)
	float MinTurnAngle; // 0x7c(0x04)
	struct FBlackboardKeySelector TargetBBkey; // 0x80(0x28)
	struct AActor* TargetActor; // 0xa8(0x08)
	struct UTurnAction* TurnAction; // 0xb0(0x08)
	struct AActor* SaveFocusActor; // 0xb8(0x08)
	char pad_C0[0x10]; // 0xc0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_ForceRotateTo
// Size: 0xa8 (Inherited: 0x78)
class UDFMAIService_ForceRotateTo : public UBTService {
public:

	struct FBlackboardKeySelector TargetBBkey; // 0x78(0x28)
	float InterpSpeed; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_MonitorInCover
// Size: 0x78 (Inherited: 0x78)
class UDFMAIService_MonitorInCover : public UBTService {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_PvPFight
// Size: 0x120 (Inherited: 0x78)
class UDFMAIService_PvPFight : public UBTService {
public:

	struct FBlackboardKeySelector MainTargetBBKey; // 0x78(0x28)
	struct FBlackboardKeySelector MainTargetLastSeenLocationBBKey; // 0xa0(0x28)
	struct FBlackboardKeySelector SituationBBKey; // 0xc8(0x28)
	struct FBlackboardKeySelector MainTargetMissTime; // 0xf0(0x28)
	char pad_118[0x8]; // 0x118(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_SelectChildPriorityModifier
// Size: 0xf8 (Inherited: 0x78)
class UDFMAIService_SelectChildPriorityModifier : public UBTService {
public:

	struct FBlackboardKeySelector PriorityNameListBBKey; // 0x78(0x28)
	float BranchWaitExecTimeout; // 0xa0(0x04)
	char pad_A4[0x14]; // 0xa4(0x14)
	struct UBehaviorTree* CurrentTreeAsset; // 0xb8(0x08)
	char pad_C0[0x38]; // 0xc0(0x38)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_SelectFightTarget
// Size: 0xa0 (Inherited: 0x78)
class UDFMAIService_SelectFightTarget : public UBTService {
public:

	struct FBlackboardKeySelector MainTargetBBKey; // 0x78(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_SpeedRate
// Size: 0x88 (Inherited: 0x78)
class UDFMAIService_SpeedRate : public UBTService {
public:

	struct FFloatRange LoopSpeedAlphaRange; // 0x78(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAIService_WithMotionPlanFilter
// Size: 0xf0 (Inherited: 0x78)
class UDFMAIService_WithMotionPlanFilter : public UBTService {
public:

	struct FGameplayTagContainer UnlockTags; // 0x78(0x20)
	struct FGameplayTagContainer PreferTags; // 0x98(0x20)
	struct TArray<struct FPreferTagConfig> ExtPreferTags; // 0xb8(0x10)
	struct FGameplayTagContainer AvoidTags; // 0xc8(0x20)
	bool ClearPersistedPerferTag; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAISpeakManager
// Size: 0x40 (Inherited: 0x38)
class UDFMAISpeakManager : public UWorldSubsystem {
public:

	char pad_38[0x8]; // 0x38(0x08)

	void STATIC_SetAllAISpeakGlobalNextCoolDown(struct UObject* WorldContextObject, float cdMin, float cdMax); // Function DFMGameplay.DFMAISpeakManager.SetAllAISpeakGlobalNextCoolDown // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x625a9d0
	void STATIC_SetAISpeakDebugEnable(struct UObject* WorldContextObject, bool Enable); // Function DFMGameplay.DFMAISpeakManager.SetAISpeakDebugEnable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x625a910
	float STATIC_GetAllAISpeakGlobalNextCoolDownTime(struct UObject* WorldContextObject); // Function DFMGameplay.DFMAISpeakManager.GetAllAISpeakGlobalNextCoolDownTime // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x625a4d0
	struct UDFMAISpeakManager* STATIC_Get(struct UObject* WorldContextObject); // Function DFMGameplay.DFMAISpeakManager.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x625a450
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_ApplyDash
// Size: 0xa8 (Inherited: 0x80)
class UDFMAITask_ApplyDash : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector TargetActorBBKey; // 0x80(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_AttributeDetectorBase
// Size: 0x100 (Inherited: 0x80)
class UDFMAITask_AttributeDetectorBase : public UGPBTTaskBase {
public:

	struct FGPGameplayAttribute AttribtueToDetect; // 0x80(0x38)
	enum class EAttributeChangeOp OperationType; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct FGPGameplayAttribute MaxAttributeRelated; // 0xc0(0x38)
	float ThresHold; // 0xf8(0x04)
	bool OnlyResetTriggerWhileOpFailed; // 0xfc(0x01)
	char pad_FD[0x3]; // 0xfd(0x03)

	void OnDetectorTriggerBlueprint(struct AAIController* AIController); // Function DFMGameplay.DFMAITask_AttributeDetectorBase.OnDetectorTriggerBlueprint // (Native|Event|Public|BlueprintEvent) // @ game+0x22b87e0
	void OnDetectorTrigger(struct AController* OwnerComp); // Function DFMGameplay.DFMAITask_AttributeDetectorBase.OnDetectorTrigger // (Final|Native|Public) // @ game+0x625a800
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_ChangeLocomotionType
// Size: 0x80 (Inherited: 0x78)
class UDFMAITask_ChangeLocomotionType : public UBTTaskNode {
public:

	enum class EGPAICharaLocomotionType TargetLocomotionType; // 0x78(0x01)
	enum class EGPAIMotionType TargetMotionType; // 0x79(0x01)
	bool bClearPreferTags; // 0x7a(0x01)
	char pad_7B[0x5]; // 0x7b(0x05)

	void BP_PreExecuteTask(struct ADFMAICharacter* AIChara, struct ADFMAIController* AICtrler); // Function DFMGameplay.DFMAITask_ChangeLocomotionType.BP_PreExecuteTask // (Event|Protected|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_PlaySpecialAnimBP
// Size: 0xa0 (Inherited: 0x78)
class UDFMAITask_PlaySpecialAnimBP : public UBTTaskNode {
public:

	struct FName MontageToPlay; // 0x78(0x08)
	struct FGameplayTagContainer EndState; // 0x80(0x20)

	void BP_PreExecuteTask(struct ADFMAICharacter* AIChara, struct ADFMAIController* AICtrler, float TimeElapsed, enum class EBTNodeResult Progress); // Function DFMGameplay.DFMAITask_PlaySpecialAnimBP.BP_PreExecuteTask // (Event|Protected|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_CopyBBKeyValue
// Size: 0xd0 (Inherited: 0x80)
class UDFMAITask_CopyBBKeyValue : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector DstBBKey; // 0x80(0x28)
	struct FBlackboardKeySelector SrcBBKey; // 0xa8(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_DespawnSelf
// Size: 0x78 (Inherited: 0x78)
class UDFMAITask_DespawnSelf : public UBTTaskNode {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_DramaBehavior
// Size: 0x80 (Inherited: 0x80)
class UDFMAITask_DramaBehavior : public UGPBTTaskBase {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_DramaMontage
// Size: 0x90 (Inherited: 0x80)
class UDFMAITask_DramaMontage : public UBTTask_Wait {
public:

	struct FName DramaMontageKey; // 0x80(0x08)
	float WaitTimeScaler; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_FindAroundCircleWall
// Size: 0x160 (Inherited: 0x80)
class UDFMAITask_FindAroundCircleWall : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector TestLocationBBKey; // 0x80(0x28)
	struct FBlackboardKeySelector ShootLocationBBKey; // 0xa8(0x28)
	struct FBlackboardKeySelector TargetLocationBBKey; // 0xd0(0x28)
	struct FBlackboardKeySelector CornerLocBBKey; // 0xf8(0x28)
	struct FBlackboardKeySelector CornerFocusLocBBKey; // 0x120(0x28)
	float MaxAroundRadius; // 0x148(0x04)
	float MinAroundRadius; // 0x14c(0x04)
	bool bForcedInPrefecture; // 0x150(0x01)
	bool bPeekOpt; // 0x151(0x01)
	char pad_152[0x2]; // 0x152(0x02)
	float PeekDist; // 0x154(0x04)
	int32_t TargetNum; // 0x158(0x04)
	char pad_15C[0x4]; // 0x15c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_FirebatShoot
// Size: 0x80 (Inherited: 0x78)
class UDFMAITask_FirebatShoot : public UBTTaskNode {
public:

	float ShootingTime; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_FocusToLocation
// Size: 0xb0 (Inherited: 0x80)
class UDFMAITask_FocusToLocation : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector TargetKey; // 0x80(0x28)
	bool bFocusTarget; // 0xa8(0x01)
	bool bCharacterMovementUseControllerRotation; // 0xa9(0x01)
	char pad_AA[0x6]; // 0xaa(0x06)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.FollowPathKeyPoint
// Size: 0x40 (Inherited: 0x30)
class UFollowPathKeyPoint : public UObject {
public:

	struct TArray<struct FVector> Points; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_FollowPath
// Size: 0xb0 (Inherited: 0x78)
class UDFMAITask_FollowPath : public UBTTaskNode {
public:

	char pad_78_0 : 1; // 0x78(0x01)
	char bStopOnOverlap : 1; // 0x78(0x01)
	char bObserveBlackboardValue : 1; // 0x78(0x01)
	char pad_78_3 : 5; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FBlackboardKeySelector TargetLocationBBKey; // 0x80(0x28)
	float AcceptableRadius; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_FormationMove
// Size: 0xf8 (Inherited: 0x80)
class UDFMAITask_FormationMove : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector FormationBBKey; // 0x80(0x28)
	struct AFormation* Formation; // 0xa8(0x08)
	struct ADFMAIController* Controller; // 0xb0(0x08)
	struct ARecastNavMesh* NavMesh; // 0xb8(0x08)
	float ForcePathFindInterval; // 0xc0(0x04)
	char pad_C4[0x34]; // 0xc4(0x34)

	struct UScenesAnimates* GetScenesAnimates(struct UDataTable* DataTable, struct FName RowName); // Function DFMGameplay.DFMAITask_FormationMove.GetScenesAnimates // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_GetAIJob
// Size: 0x90 (Inherited: 0x80)
class UDFMAITask_GetAIJob : public UGPBTTaskBase {
public:

	enum class EAIJobType JobType; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct UClass* JobFilterClass; // 0x88(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_GetBestCoverEntry
// Size: 0x128 (Inherited: 0x80)
class UDFMAITask_GetBestCoverEntry : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector TargetLocationBBKey; // 0x80(0x28)
	struct FBlackboardKeySelector TargetYawBBKey; // 0xa8(0x28)
	struct FBlackboardKeySelector ResultLocationBBKey; // 0xd0(0x28)
	struct FBlackboardKeySelector ResultDirectionVecBBKey; // 0xf8(0x28)
	float LocationOffsetDistance; // 0x120(0x04)
	float YawOffsetDegree; // 0x124(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_GetPatrolSpot
// Size: 0xa8 (Inherited: 0x80)
class UDFMAITask_GetPatrolSpot : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector SpotLocationBBKey; // 0x80(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_GetSearchSpot
// Size: 0xa8 (Inherited: 0x80)
class UDFMAITask_GetSearchSpot : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector SpotLocationBBKey; // 0x80(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_HeavyMachineGunShoot
// Size: 0xf0 (Inherited: 0x78)
class UDFMAITask_HeavyMachineGunShoot : public UBTTaskNode {
public:

	float ShootingTime; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FBlackboardKeySelector ShootTargetBBKey; // 0x80(0x28)
	float DamageAngel; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct FBlackboardKeySelector MainTragetBBKey; // 0xb0(0x28)
	char pad_D8[0x18]; // 0xd8(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_InteractDoor
// Size: 0xa8 (Inherited: 0x80)
class UDFMAITask_InteractDoor : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector DoorBBKey; // 0x80(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_LookRound
// Size: 0x98 (Inherited: 0x80)
class UDFMAITask_LookRound : public UGPBTTaskBase {
public:

	float LookPointOffset; // 0x80(0x04)
	float LookPointRadius; // 0x84(0x04)
	float RandRate; // 0x88(0x04)
	char pad_8C[0xc]; // 0x8c(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_Guard
// Size: 0x98 (Inherited: 0x80)
class UDFMAITask_Guard : public UGPBTTaskBase {
public:

	char pad_80[0x18]; // 0x80(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_NewGuard
// Size: 0x150 (Inherited: 0x80)
class UDFMAITask_NewGuard : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector GuardPointBBkey; // 0x80(0x28)
	struct FBlackboardKeySelector GuardFocusPoint; // 0xa8(0x28)
	float MinCDTime; // 0xd0(0x04)
	float MaxCDTime; // 0xd4(0x04)
	struct FBlackboardKeySelector IsSpawnDrama; // 0xd8(0x28)
	struct FBlackboardKeySelector SpawnDramaLocationBBkey; // 0x100(0x28)
	char pad_128[0x18]; // 0x128(0x18)
	struct UAnimMontage* CurrentScenesAnimate; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_PlayOrderAnim
// Size: 0xb8 (Inherited: 0x80)
class UDFMAITask_PlayOrderAnim : public UGPBTTaskBase {
public:

	struct UAnimSequenceBase* AnimStart; // 0x80(0x08)
	struct UAnimSequenceBase* AnimLoop; // 0x88(0x08)
	float LoopTime; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
	struct UAnimSequenceBase* AnimEnd; // 0x98(0x08)
	char pad_A0[0x10]; // 0xa0(0x10)
	struct UAnimMontage* CurrentScenesAnimate; // 0xb0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_GroupGuardAnim
// Size: 0xf0 (Inherited: 0x80)
class UDFMAITask_GroupGuardAnim : public UGPBTTaskBase {
public:

	struct FBlackboardKeySelector AIJobBBKey; // 0x80(0x28)
	struct FBlackboardKeySelector TimeRemainBBKey; // 0xa8(0x28)
	char pad_D0[0x18]; // 0xd0(0x18)
	struct UAnimMontage* CurrentScenesAnimate; // 0xe8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class DFMGameplay.DFMAITask_Turn
// Size: 0xc0 (Inherited: 0x80)
class UDFMAITask_Turn : public UGPBTTaskBase {
public:

	enum class ETurnAnimType TurnAnimType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float MinTurnAngle; // 0x84(0x04)
	float TurnAngle; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
