/**
 * Name: DeltaForceClient-Win64-Shipping
 * Version : default
 */ 
#pragma once


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif


namespace Dumper
{
	struct Function_Engine_World_SetWorldScale_Param
	{
	public:

		enum class EWorldScale InWorldScale; // 0x00(0x01)
	};

	struct Function_Engine_World_SetSubWorldScale_Param
	{
	public:

		enum class EWorldScale InWorldScale; // 0x00(0x01)
	};

	struct Function_Engine_World_SetMiniWorld_Param
	{
	public:

		bool bInEnable; // 0x00(0x01)
	};

	struct Function_Engine_World_RestoreWorldScaleFromWorldSetting_Param
	{
	public:

	};

	struct Function_Engine_World_ResetSubWorldScale_Param
	{
	public:

	};

	struct Function_Engine_World_K2_GetWorldSettings_Param
	{
	public:

		struct AWorldSettings* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_World_HandleTimelineScrubbed_Param
	{
	public:

	};

	struct Function_Engine_World_GetWorldScale_Param
	{
	public:

		enum class EWorldScale ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_World_GetMiniWorld_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_OnlineBlueprintCallProxyBase_Activate_Param
	{
	public:

	};

	struct Function_Engine_PlayerInput_SetMouseSensitivity_Param
	{
	public:

		float Sensitivity; // 0x00(0x04)
	};

	struct Function_Engine_PlayerInput_SetBind_Param
	{
	public:

		struct FName BindName; // 0x00(0x08)
		struct FString Command; // 0x08(0x10)
	};

	struct Function_Engine_PlayerInput_InvertAxisKey_Param
	{
	public:

		struct FKey AxisKey; // 0x00(0x18)
	};

	struct Function_Engine_PlayerInput_InvertAxis_Param
	{
	public:

		struct FName AxisName; // 0x00(0x08)
	};

	struct Function_Engine_PlayerInput_ClearSmoothing_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_Walk_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ViewSelf_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ViewPlayer_Param
	{
	public:

		struct FString S; // 0x00(0x10)
	};

	struct Function_Engine_CheatManager_ViewClass_Param
	{
	public:

		struct UClass* DesiredClass; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_ViewActor_Param
	{
	public:

		struct FName ActorName; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_UpdateSafeArea_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ToggleServerStatReplicatorUpdateStatNet_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ToggleServerStatReplicatorClientOverwrite_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ToggleDebugCamera_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ToggleAILogging_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_TestCollisionDistance_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_Teleport_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_Summon_Param
	{
	public:

		struct FString ClassName; // 0x00(0x10)
	};

	struct Function_Engine_CheatManager_StreamLevelOut_Param
	{
	public:

		struct FName PackageName; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_StreamLevelIn_Param
	{
	public:

		struct FName PackageName; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_SpawnServerStatReplicator_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_Slomo_Param
	{
	public:

		float NewTimeDilation; // 0x00(0x04)
	};

	struct Function_Engine_CheatManager_SetWorldOrigin_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_SetMouseSensitivityToDefault_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ServerToggleAILogging_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ReceiveInitCheatManager_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_ReceiveEndPlay_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_PlayersOnly_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_OnlyLoadLevel_Param
	{
	public:

		struct FName PackageName; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_LogLoc_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_InvertMouse_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_God_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_Ghost_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_FreezeFrame_Param
	{
	public:

		float Delay; // 0x00(0x04)
	};

	struct Function_Engine_CheatManager_Fly_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_FlushLog_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_EnableDebugCamera_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DumpVoiceMutingState_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DumpPartyState_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DumpOnlineSessionState_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DumpChatState_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DisableDebugCamera_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DestroyTarget_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DestroyServerStatReplicator_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DestroyPawns_Param
	{
	public:

		struct UClass* aClass; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_DestroyAllPawnsExceptTarget_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DestroyAll_Param
	{
	public:

		struct UClass* aClass; // 0x00(0x08)
	};

	struct Function_Engine_CheatManager_DebugCapsuleSweepSize_Param
	{
	public:

		float HalfHeight; // 0x00(0x04)
		float radius; // 0x04(0x04)
	};

	struct Function_Engine_CheatManager_DebugCapsuleSweepPawn_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DebugCapsuleSweepComplex_Param
	{
	public:

		bool bTraceComplex; // 0x00(0x01)
	};

	struct Function_Engine_CheatManager_DebugCapsuleSweepClear_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DebugCapsuleSweepChannel_Param
	{
	public:

		enum class ECollisionChannel Channel; // 0x00(0x01)
	};

	struct Function_Engine_CheatManager_DebugCapsuleSweepCapture_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DebugCapsuleSweep_Param
	{
	public:

	};

	struct Function_Engine_CheatManager_DamageTarget_Param
	{
	public:

		float DamageAmount; // 0x00(0x04)
	};

	struct Function_Engine_CheatManager_CheatScript_Param
	{
	public:

		struct FString ScriptName; // 0x00(0x10)
	};

	struct Function_Engine_CheatManager_ChangeSize_Param
	{
	public:

		float F; // 0x00(0x04)
	};

	struct Function_Engine_CheatManager_BugItStringCreator_Param
	{
	public:

		struct FVector ViewLocation; // 0x00(0x0c)
		struct FRotator ViewRotation; // 0x0c(0x0c)
		struct FString GoString; // 0x18(0x10)
		struct FString LocString; // 0x28(0x10)
	};

	struct Function_Engine_CheatManager_BugItGo_Param
	{
	public:

		float X; // 0x00(0x04)
		float Y; // 0x04(0x04)
		float Z; // 0x08(0x04)
		float Pitch; // 0x0c(0x04)
		float Yaw; // 0x10(0x04)
		float Roll; // 0x14(0x04)
	};

	struct Function_Engine_CheatManager_BugIt_Param
	{
	public:

		struct FString ScreenShotDescription; // 0x00(0x10)
	};

	struct Function_Engine_GameUserSettings_ValidateSettings_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_SupportsHDRDisplayOutput_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_SetVSyncEnabled_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_SetVisualEffectQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetViewDistanceQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetToDefaults_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_SetTextureQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetShadowQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetShadingQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetScreenResolution_Param
	{
	public:

		struct FIntPoint Resolution; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_SetResolutionScaleValueEx_Param
	{
	public:

		float NewScaleValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetResolutionScaleValue_Param
	{
	public:

		int32_t NewScaleValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetResolutionScaleNormalized_Param
	{
	public:

		float NewScaleNormalized; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetPostProcessingQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetOverallScalabilityLevel_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetFullscreenMode_Param
	{
	public:

		enum class EWindowMode InFullscreenMode; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_SetFrameRateLimit_Param
	{
	public:

		float NewLimit; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetFoliageQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetDynamicResolutionEnabled_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_SetBenchmarkFallbackValues_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_SetAudioQualityLevel_Param
	{
	public:

		int32_t QualityLevel; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SetAntiAliasingQuality_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_SaveSettings_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_RunHardwareBenchmark_Param
	{
	public:

		int32_t WorkScale; // 0x00(0x04)
		float CPUMultiplier; // 0x04(0x04)
		float GPUMultiplier; // 0x08(0x04)
	};

	struct Function_Engine_GameUserSettings_RevertVideoMode_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_ResetToCurrentSettings_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_LoadSettings_Param
	{
	public:

		bool bForceReload; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsVSyncEnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsVSyncDirty_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsScreenResolutionDirty_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsHDREnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsFullscreenModeDirty_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsDynamicResolutionEnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsDynamicResolutionDirty_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_IsDirty_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_GetVisualEffectQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetViewDistanceQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetTextureQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetSyncInterval_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetShadowQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetShadingQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetScreenResolution_Param
	{
	public:

		struct FIntPoint ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_GetResolutionScaleNormalized_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetResolutionScaleInformationEx_Param
	{
	public:

		float CurrentScaleNormalized; // 0x00(0x04)
		float CurrentScaleValue; // 0x04(0x04)
		float MinScaleValue; // 0x08(0x04)
		float MaxScaleValue; // 0x0c(0x04)
	};

	struct Function_Engine_GameUserSettings_GetResolutionScaleInformation_Param
	{
	public:

		float CurrentScaleNormalized; // 0x00(0x04)
		int32_t CurrentScaleValue; // 0x04(0x04)
		int32_t MinScaleValue; // 0x08(0x04)
		int32_t MaxScaleValue; // 0x0c(0x04)
	};

	struct Function_Engine_GameUserSettings_GetRecommendedResolutionScale_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetPreferredFullscreenMode_Param
	{
	public:

		enum class EWindowMode ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_GetPostProcessingQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetOverallScalabilityLevel_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetLastConfirmedScreenResolution_Param
	{
	public:

		struct FIntPoint ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_GetLastConfirmedFullscreenMode_Param
	{
	public:

		enum class EWindowMode ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_GetGameUserSettings_Param
	{
	public:

		struct UGameUserSettings* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_GetFullscreenMode_Param
	{
	public:

		enum class EWindowMode ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_GetFrameRateLimit_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetFoliageQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetDesktopResolution_Param
	{
	public:

		struct FIntPoint ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_GetDefaultWindowPosition_Param
	{
	public:

		struct FIntPoint ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_GetDefaultWindowMode_Param
	{
	public:

		enum class EWindowMode ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_GetDefaultResolutionScale_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetDefaultResolution_Param
	{
	public:

		struct FIntPoint ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_GameUserSettings_GetCurrentHDRDisplayNits_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetAudioQualityLevel_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_GetAntiAliasingQuality_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_GameUserSettings_EnableHDRDisplayOutput_Param
	{
	public:

		bool bEnable; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t DisplayNits; // 0x04(0x04)
	};

	struct Function_Engine_GameUserSettings_ConfirmVideoMode_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_ApplySettings_Param
	{
	public:

		bool bCheckForCommandLineOverrides; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_ApplyResolutionSettings_Param
	{
	public:

		bool bCheckForCommandLineOverrides; // 0x00(0x01)
	};

	struct Function_Engine_GameUserSettings_ApplyNonResolutionSettings_Param
	{
	public:

	};

	struct Function_Engine_GameUserSettings_ApplyHardwareBenchmarkResults_Param
	{
	public:

	};

	struct Function_Engine_AvoidanceManager_RegisterMovementComponent_Param
	{
	public:

		struct UMovementComponent* MovementComp; // 0x00(0x08)
		float AvoidanceWeight; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_AvoidanceManager_GetObjectCount_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_AvoidanceManager_GetNewAvoidanceUID_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_AvoidanceManager_GetAvoidanceVelocityForComponent_Param
	{
	public:

		struct UMovementComponent* MovementComp; // 0x00(0x08)
		struct FVector ReturnValue; // 0x08(0x0c)
	};

	struct Function_Engine_CameraAnimInst_Stop_Param
	{
	public:

		bool bImmediate; // 0x00(0x01)
	};

	struct Function_Engine_CameraAnimInst_SetScale_Param
	{
	public:

		float NewDuration; // 0x00(0x04)
	};

	struct Function_Engine_CameraAnimInst_SetDuration_Param
	{
	public:

		float NewDuration; // 0x00(0x04)
	};

	struct Function_Engine_CameraShake_ReceiveStopShake_Param
	{
	public:

		bool bImmediately; // 0x00(0x01)
	};

	struct Function_Engine_CameraShake_ReceivePlayShake_Param
	{
	public:

		float Scale; // 0x00(0x04)
	};

	struct Function_Engine_CameraShake_ReceiveIsFinished_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_CameraShake_BlueprintUpdateCameraShake_Param
	{
	public:

		float DeltaTime; // 0x00(0x04)
		float Alpha; // 0x04(0x04)
		char pad_8[0x8]; // 0x08(0x08)
		struct FMinimalViewInfo POV; // 0x10(0x9e0)
		struct FMinimalViewInfo ModifiedPOV; // 0x9f0(0x9e0)
	};

	struct Function_Engine_Canvas_K2_TextSize_Param
	{
	public:

		struct UFont* RenderFont; // 0x00(0x08)
		struct FString RenderText; // 0x08(0x10)
		struct FVector2D Scale; // 0x18(0x08)
		struct FVector2D ReturnValue; // 0x20(0x08)
	};

	struct Function_Engine_Canvas_K2_StrLen_Param
	{
	public:

		struct UFont* RenderFont; // 0x00(0x08)
		struct FString RenderText; // 0x08(0x10)
		struct FVector2D ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_Canvas_K2_Project_Param
	{
	public:

		struct FVector WorldLocation; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_Canvas_K2_DrawTriangle_Param
	{
	public:

		struct UTexture* RenderTexture; // 0x00(0x08)
		struct TArray<struct FCanvasUVTri> Triangles; // 0x08(0x10)
	};

	struct Function_Engine_Canvas_K2_DrawTexture_Param
	{
	public:

		struct UTexture* RenderTexture; // 0x00(0x08)
		struct FVector2D ScreenPosition; // 0x08(0x08)
		struct FVector2D ScreenSize; // 0x10(0x08)
		struct FVector2D CoordinatePosition; // 0x18(0x08)
		struct FVector2D CoordinateSize; // 0x20(0x08)
		struct FLinearColor RenderColor; // 0x28(0x10)
		enum class EBlendMode BlendMode; // 0x38(0x01)
		char pad_39[0x3]; // 0x39(0x03)
		float Rotation; // 0x3c(0x04)
		struct FVector2D PivotPoint; // 0x40(0x08)
	};

	struct Function_Engine_Canvas_K2_DrawText_Param
	{
	public:

		struct UFont* RenderFont; // 0x00(0x08)
		struct FString RenderText; // 0x08(0x10)
		struct FVector2D ScreenPosition; // 0x18(0x08)
		struct FVector2D Scale; // 0x20(0x08)
		struct FLinearColor RenderColor; // 0x28(0x10)
		float Kerning; // 0x38(0x04)
		struct FLinearColor ShadowColor; // 0x3c(0x10)
		struct FVector2D ShadowOffset; // 0x4c(0x08)
		bool bCentreX; // 0x54(0x01)
		bool bCentreY; // 0x55(0x01)
		bool bOutlined; // 0x56(0x01)
		char pad_57[0x1]; // 0x57(0x01)
		struct FLinearColor OutlineColor; // 0x58(0x10)
	};

	struct Function_Engine_Canvas_K2_DrawPolygon_Param
	{
	public:

		struct UTexture* RenderTexture; // 0x00(0x08)
		struct FVector2D ScreenPosition; // 0x08(0x08)
		struct FVector2D radius; // 0x10(0x08)
		int32_t NumberOfSides; // 0x18(0x04)
		struct FLinearColor RenderColor; // 0x1c(0x10)
	};

	struct Function_Engine_Canvas_K2_DrawMaterialTriangle_Param
	{
	public:

		struct UMaterialInterface* RenderMaterial; // 0x00(0x08)
		struct TArray<struct FCanvasUVTri> Triangles; // 0x08(0x10)
	};

	struct Function_Engine_Canvas_K2_DrawMaterial_Param
	{
	public:

		struct UMaterialInterface* RenderMaterial; // 0x00(0x08)
		struct FVector2D ScreenPosition; // 0x08(0x08)
		struct FVector2D ScreenSize; // 0x10(0x08)
		struct FVector2D CoordinatePosition; // 0x18(0x08)
		struct FVector2D CoordinateSize; // 0x20(0x08)
		float Rotation; // 0x28(0x04)
		struct FVector2D PivotPoint; // 0x2c(0x08)
	};

	struct Function_Engine_Canvas_K2_DrawLine_Param
	{
	public:

		struct FVector2D ScreenPositionA; // 0x00(0x08)
		struct FVector2D ScreenPositionB; // 0x08(0x08)
		float Thickness; // 0x10(0x04)
		struct FLinearColor RenderColor; // 0x14(0x10)
	};

	struct Function_Engine_Canvas_K2_DrawBox_Param
	{
	public:

		struct FVector2D ScreenPosition; // 0x00(0x08)
		struct FVector2D ScreenSize; // 0x08(0x08)
		float Thickness; // 0x10(0x04)
		struct FLinearColor RenderColor; // 0x14(0x10)
	};

	struct Function_Engine_Canvas_K2_DrawBorder_Param
	{
	public:

		struct UTexture* BorderTexture; // 0x00(0x08)
		struct UTexture* BackgroundTexture; // 0x08(0x08)
		struct UTexture* LeftBorderTexture; // 0x10(0x08)
		struct UTexture* RightBorderTexture; // 0x18(0x08)
		struct UTexture* TopBorderTexture; // 0x20(0x08)
		struct UTexture* BottomBorderTexture; // 0x28(0x08)
		struct FVector2D ScreenPosition; // 0x30(0x08)
		struct FVector2D ScreenSize; // 0x38(0x08)
		struct FVector2D CoordinatePosition; // 0x40(0x08)
		struct FVector2D CoordinateSize; // 0x48(0x08)
		struct FLinearColor RenderColor; // 0x50(0x10)
		struct FVector2D BorderScale; // 0x60(0x08)
		struct FVector2D BackgroundScale; // 0x68(0x08)
		float Rotation; // 0x70(0x04)
		struct FVector2D PivotPoint; // 0x74(0x08)
		struct FVector2D CornerSize; // 0x7c(0x08)
	};

	struct Function_Engine_Canvas_K2_Deproject_Param
	{
	public:

		struct FVector2D ScreenPosition; // 0x00(0x08)
		struct FVector WorldOrigin; // 0x08(0x0c)
		struct FVector WorldDirection; // 0x14(0x0c)
	};

	struct Function_Engine_CurveSourceInterface_GetCurveValue_Param
	{
	public:

		struct FName CurveName; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_CurveSourceInterface_GetCurves_Param
	{
	public:

		struct TArray<struct FNamedCurveValue> OutValues; // 0x00(0x10)
	};

	struct Function_Engine_CurveSourceInterface_GetBindingName_Param
	{
	public:

		struct FName ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Exporter_ScriptRunAssetExportTask_Param
	{
	public:

		struct UAssetExportTask* Task; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_Exporter_RunAssetExportTasks_Param
	{
	public:

		struct TArray<struct UAssetExportTask*> ExportTasks; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_Exporter_RunAssetExportTask_Param
	{
	public:

		struct UAssetExportTask* Task; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_InputSettings_SaveKeyMappings_Param
	{
	public:

	};

	struct Function_Engine_InputSettings_RemoveAxisMapping_Param
	{
	public:

		struct FInputAxisKeyMapping KeyMapping; // 0x00(0x28)
		bool bForceRebuildKeymaps; // 0x28(0x01)
	};

	struct Function_Engine_InputSettings_RemoveActionMapping_Param
	{
	public:

		struct FInputActionKeyMapping KeyMapping; // 0x00(0x28)
		bool bForceRebuildKeymaps; // 0x28(0x01)
	};

	struct Function_Engine_InputSettings_GetInputSettings_Param
	{
	public:

		struct UInputSettings* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_InputSettings_GetAxisNames_Param
	{
	public:

		struct TArray<struct FName> AxisNames; // 0x00(0x10)
	};

	struct Function_Engine_InputSettings_GetAxisMappingByName_Param
	{
	public:

		struct FName InAxisName; // 0x00(0x08)
		struct TArray<struct FInputAxisKeyMapping> OutMappings; // 0x08(0x10)
	};

	struct Function_Engine_InputSettings_GetActionNames_Param
	{
	public:

		struct TArray<struct FName> ActionNames; // 0x00(0x10)
	};

	struct Function_Engine_InputSettings_GetActionMappingByName_Param
	{
	public:

		struct FName InActionName; // 0x00(0x08)
		struct TArray<struct FInputActionKeyMapping> OutMappings; // 0x08(0x10)
	};

	struct Function_Engine_InputSettings_ForceRebuildKeymaps_Param
	{
	public:

	};

	struct Function_Engine_InputSettings_AddAxisMapping_Param
	{
	public:

		struct FInputAxisKeyMapping KeyMapping; // 0x00(0x28)
		bool bForceRebuildKeymaps; // 0x28(0x01)
	};

	struct Function_Engine_InputSettings_AddActionMapping_Param
	{
	public:

		struct FInputActionKeyMapping KeyMapping; // 0x00(0x28)
		bool bForceRebuildKeymaps; // 0x28(0x01)
	};

	struct Function_Engine_PlatformInterfaceWebResponse_GetNumHeaders_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_PlatformInterfaceWebResponse_GetHeaderValue_Param
	{
	public:

		struct FString HeaderName; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_PlatformInterfaceWebResponse_GetHeader_Param
	{
	public:

		int32_t HeaderIndex; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FString Header; // 0x08(0x10)
		struct FString Value; // 0x18(0x10)
	};

	struct Function_Engine_RuntimeVirtualTexture_GetSize_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_RuntimeVirtualTexture_GetPageTableSize_Param
	{
	public:

		int32_t ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_SkeletalMeshSocket_InitializeSocketFromLocation_Param
	{
	public:

		struct USkeletalMeshComponent* SkelComp; // 0x00(0x08)
		struct FVector WorldLocation; // 0x08(0x0c)
		struct FVector WorldNormal; // 0x14(0x0c)
	};

	struct Function_Engine_SkeletalMeshSocket_GetSocketLocation_Param
	{
	public:

		struct USkeletalMeshComponent* SkelComp; // 0x00(0x08)
		struct FVector ReturnValue; // 0x08(0x0c)
	};

	struct Function_Engine_SoundSubmix_StopRecordingOutput_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		enum class EAudioRecordingExportType ExportType; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FString Name; // 0x10(0x10)
		struct FString Path; // 0x20(0x10)
		struct USoundWave* ExistingSoundWaveToOverwrite; // 0x30(0x08)
	};

	struct Function_Engine_SoundSubmix_StopEnvelopeFollowing_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
	};

	struct Function_Engine_SoundSubmix_StartRecordingOutput_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ExpectedDuration; // 0x08(0x04)
	};

	struct Function_Engine_SoundSubmix_StartEnvelopeFollowing_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
	};

	struct Function_Engine_SoundSubmix_SetSubmixOutputVolume_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float InOutputVolume; // 0x08(0x04)
	};

	struct Function_Engine_SoundSubmix_AddEnvelopeFollowerDelegate_Param
	{
	public:

	};

	struct Function_Engine_AnimNotify_Received_Notify_Param
	{
	public:

		struct USkeletalMeshComponent* MeshComp; // 0x00(0x08)
		struct UAnimSequenceBase* Animation; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_AnimNotify_GetNotifyName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_GameInstance_ReceiveShutdown_Param
	{
	public:

	};

	struct Function_Engine_GameInstance_ReceiveInit_Param
	{
	public:

	};

	struct Function_Engine_GameInstance_HandleTravelError_Param
	{
	public:

		enum class ETravelFailure FailureType; // 0x00(0x01)
	};

	struct Function_Engine_GameInstance_HandleNetworkError_Param
	{
	public:

		enum class ENetworkFailure FailureType; // 0x00(0x01)
		bool bIsServer; // 0x01(0x01)
	};

	struct Function_Engine_GameInstance_DebugRemovePlayer_Param
	{
	public:

		int32_t ControllerId; // 0x00(0x04)
	};

	struct Function_Engine_GameInstance_DebugCreatePlayer_Param
	{
	public:

		int32_t ControllerId; // 0x00(0x04)
	};

	struct Function_Engine_Actor_WasRecentlyRendered_Param
	{
	public:

		float Tolerance; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_Engine_Actor_WasRecentlyContinuousRendered_Param
	{
	public:

		struct UWorld* World; // 0x00(0x08)
		float Tolerance; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_Actor_UserConstructionScript_Param
	{
	public:

	};

	struct Function_Engine_Actor_TearOff_Param
	{
	public:

	};

	struct Function_Engine_Actor_SnapRootComponentTo_Param
	{
	public:

		struct AActor* InParentActor; // 0x00(0x08)
		struct FName InSocketName; // 0x08(0x08)
	};

	struct Function_Engine_Actor_SetTickGroup_Param
	{
	public:

		enum class ETickingGroup NewTickGroup; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetTickableWhenPaused_Param
	{
	public:

		bool bTickableWhenPaused; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetReplicates_Param
	{
	public:

		bool bInReplicates; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetReplicateMovement_Param
	{
	public:

		bool bInReplicateMovement; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetOwner_Param
	{
	public:

		struct AActor* NewOwner; // 0x00(0x08)
	};

	struct Function_Engine_Actor_SetNetDormancy_Param
	{
	public:

		enum class ENetDormancy NewDormancy; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetLifeSpan_Param
	{
	public:

		float InLifespan; // 0x00(0x04)
	};

	struct Function_Engine_Actor_SetActorTickInterval_Param
	{
	public:

		float TickInterval; // 0x00(0x04)
	};

	struct Function_Engine_Actor_SetActorTickEnabled_Param
	{
	public:

		bool bEnabled; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetActorScale3D_Param
	{
	public:

		struct FVector NewScale3D; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_SetActorRelativeScale3D_Param
	{
	public:

		struct FVector NewRelativeScale; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_SetActorHiddenInGame_Param
	{
	public:

		bool bNewHidden; // 0x00(0x01)
	};

	struct Function_Engine_Actor_SetActorEnableCollision_Param
	{
	public:

		bool bNewActorEnableCollision; // 0x00(0x01)
	};

	struct Function_Engine_Actor_RemoveTickPrerequisiteComponent_Param
	{
	public:

		struct UActorComponent* PrerequisiteComponent; // 0x00(0x08)
	};

	struct Function_Engine_Actor_RemoveTickPrerequisiteActor_Param
	{
	public:

		struct AActor* PrerequisiteActor; // 0x00(0x08)
	};

	struct Function_Engine_Actor_ReceiveTick_Param
	{
	public:

		float DeltaSeconds; // 0x00(0x04)
	};

	struct Function_Engine_Actor_ReceiveRadialDamage_Param
	{
	public:

		float DamageReceived; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct UDamageType* DamageType; // 0x08(0x08)
		struct FVector Origin; // 0x10(0x0c)
		struct FHitResult HitInfo; // 0x1c(0x88)
		char pad_A4[0x4]; // 0xa4(0x04)
		struct AController* InstigatedBy; // 0xa8(0x08)
		struct AActor* DamageCauser; // 0xb0(0x08)
	};

	struct Function_Engine_Actor_ReceivePointDamage_Param
	{
	public:

		float Damage; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct UDamageType* DamageType; // 0x08(0x08)
		struct FVector HitLocation; // 0x10(0x0c)
		struct FVector HitNormal; // 0x1c(0x0c)
		struct UPrimitiveComponent* HitComponent; // 0x28(0x08)
		struct FName BoneName; // 0x30(0x08)
		struct FVector ShotFromDirection; // 0x38(0x0c)
		char pad_44[0x4]; // 0x44(0x04)
		struct AController* InstigatedBy; // 0x48(0x08)
		struct AActor* DamageCauser; // 0x50(0x08)
		struct FHitResult HitInfo; // 0x58(0x88)
	};

	struct Function_Engine_Actor_ReceiveHit_Param
	{
	public:

		struct UPrimitiveComponent* MyComp; // 0x00(0x08)
		struct AActor* Other; // 0x08(0x08)
		struct UPrimitiveComponent* OtherComp; // 0x10(0x08)
		bool bSelfMoved; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		struct FVector HitLocation; // 0x1c(0x0c)
		struct FVector HitNormal; // 0x28(0x0c)
		struct FVector NormalImpulse; // 0x34(0x0c)
		struct FHitResult Hit; // 0x40(0x88)
	};

	struct Function_Engine_Actor_ReceiveEndPlay_Param
	{
	public:

		enum class EEndPlayReason EndPlayReason; // 0x00(0x01)
	};

	struct Function_Engine_Actor_ReceiveDestroyed_Param
	{
	public:

	};

	struct Function_Engine_Actor_ReceiveBeginPlay_Param
	{
	public:

	};

	struct Function_Engine_Actor_ReceiveAnyDamage_Param
	{
	public:

		float Damage; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct UDamageType* DamageType; // 0x08(0x08)
		struct AController* InstigatedBy; // 0x10(0x08)
		struct AActor* DamageCauser; // 0x18(0x08)
	};

	struct Function_Engine_Actor_ReceiveActorOnReleased_Param
	{
	public:

		struct FKey ButtonReleased; // 0x00(0x18)
	};

	struct Function_Engine_Actor_ReceiveActorOnInputTouchLeave_Param
	{
	public:

		enum class ETouchIndex FingerIndex; // 0x00(0x01)
	};

	struct Function_Engine_Actor_ReceiveActorOnInputTouchEnter_Param
	{
	public:

		enum class ETouchIndex FingerIndex; // 0x00(0x01)
	};

	struct Function_Engine_Actor_ReceiveActorOnInputTouchEnd_Param
	{
	public:

		enum class ETouchIndex FingerIndex; // 0x00(0x01)
	};

	struct Function_Engine_Actor_ReceiveActorOnInputTouchBegin_Param
	{
	public:

		enum class ETouchIndex FingerIndex; // 0x00(0x01)
	};

	struct Function_Engine_Actor_ReceiveActorOnClicked_Param
	{
	public:

		struct FKey ButtonPressed; // 0x00(0x18)
	};

	struct Function_Engine_Actor_ReceiveActorEndOverlap_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
	};

	struct Function_Engine_Actor_ReceiveActorEndCursorOver_Param
	{
	public:

	};

	struct Function_Engine_Actor_ReceiveActorBeginOverlap_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
	};

	struct Function_Engine_Actor_ReceiveActorBeginCursorOver_Param
	{
	public:

	};

	struct Function_Engine_Actor_PrestreamTextures_Param
	{
	public:

		float Seconds; // 0x00(0x04)
		bool bEnableStreaming; // 0x04(0x01)
		char pad_5[0x3]; // 0x05(0x03)
		int32_t CinematicTextureGroups; // 0x08(0x04)
	};

	struct Function_Engine_Actor_OnRep_ReplicateMovement_Param
	{
	public:

	};

	struct Function_Engine_Actor_OnRep_ReplicatedMovement_Param
	{
	public:

	};

	struct Function_Engine_Actor_OnRep_Owner_Param
	{
	public:

	};

	struct Function_Engine_Actor_OnRep_Instigator_Param
	{
	public:

	};

	struct Function_Engine_Actor_OnRep_AttachmentReplication_Param
	{
	public:

	};

	struct Function_Engine_Actor_MakeNoise_Param
	{
	public:

		float Loudness; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct APawn* NoiseInstigator; // 0x08(0x08)
		struct FVector NoiseLocation; // 0x10(0x0c)
		float MaxRange; // 0x1c(0x04)
		struct FName Tag; // 0x20(0x08)
	};

	struct Function_Engine_Actor_MakeMIDForMaterial_Param
	{
	public:

		struct UMaterialInterface* Parent; // 0x00(0x08)
		struct UMaterialInstanceDynamic* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_Actor_K2_TeleportTo_Param
	{
	public:

		struct FVector DestLocation; // 0x00(0x0c)
		struct FRotator DestRotation; // 0x0c(0x0c)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorTransform_Param
	{
	public:

		struct FTransform NewTransform; // 0x00(0x30)
		bool bSweep; // 0x30(0x01)
		char pad_31[0x3]; // 0x31(0x03)
		struct FHitResult SweepHitResult; // 0x34(0x88)
		bool bTeleport; // 0xbc(0x01)
		bool ReturnValue; // 0xbd(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorRotation_Param
	{
	public:

		struct FRotator NewRotation; // 0x00(0x0c)
		bool bTeleportPhysics; // 0x0c(0x01)
		bool ReturnValue; // 0x0d(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorRelativeTransform_Param
	{
	public:

		struct FTransform NewRelativeTransform; // 0x00(0x30)
		bool bSweep; // 0x30(0x01)
		char pad_31[0x3]; // 0x31(0x03)
		struct FHitResult SweepHitResult; // 0x34(0x88)
		bool bTeleport; // 0xbc(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorRelativeRotation_Param
	{
	public:

		struct FRotator NewRelativeRotation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorRelativeLocation_Param
	{
	public:

		struct FVector NewRelativeLocation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorLocationAndRotation_Param
	{
	public:

		struct FVector NewLocation; // 0x00(0x0c)
		struct FRotator NewRotation; // 0x0c(0x0c)
		bool bSweep; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		struct FHitResult SweepHitResult; // 0x1c(0x88)
		bool bTeleport; // 0xa4(0x01)
		bool ReturnValue; // 0xa5(0x01)
	};

	struct Function_Engine_Actor_K2_SetActorLocation_Param
	{
	public:

		struct FVector NewLocation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
		bool ReturnValue; // 0x99(0x01)
	};

	struct Function_Engine_Actor_K2_OnReset_Param
	{
	public:

	};

	struct Function_Engine_Actor_K2_OnEndViewTarget_Param
	{
	public:

		struct APlayerController* PC; // 0x00(0x08)
	};

	struct Function_Engine_Actor_K2_OnBecomeViewTarget_Param
	{
	public:

		struct APlayerController* PC; // 0x00(0x08)
	};

	struct Function_Engine_Actor_K2_GetRootComponent_Param
	{
	public:

		struct USceneComponent* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_K2_GetComponentsByClass_Param
	{
	public:

		struct UClass* ComponentClass; // 0x00(0x08)
		struct TArray<struct UActorComponent*> ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_Actor_K2_GetActorRotation_Param
	{
	public:

		struct FRotator ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_K2_GetActorLocation_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_K2_DetachFromActor_Param
	{
	public:

		enum class EDetachmentRule LocationRule; // 0x00(0x01)
		enum class EDetachmentRule RotationRule; // 0x01(0x01)
		enum class EDetachmentRule ScaleRule; // 0x02(0x01)
	};

	struct Function_Engine_Actor_K2_DestroyComponent_Param
	{
	public:

		struct UActorComponent* Component; // 0x00(0x08)
	};

	struct Function_Engine_Actor_K2_DestroyActor_Param
	{
	public:

	};

	struct Function_Engine_Actor_K2_AttachToComponent_Param
	{
	public:

		struct USceneComponent* Parent; // 0x00(0x08)
		struct FName SocketName; // 0x08(0x08)
		enum class EAttachmentRule LocationRule; // 0x10(0x01)
		enum class EAttachmentRule RotationRule; // 0x11(0x01)
		enum class EAttachmentRule ScaleRule; // 0x12(0x01)
		bool bWeldSimulatedBodies; // 0x13(0x01)
	};

	struct Function_Engine_Actor_K2_AttachToActor_Param
	{
	public:

		struct AActor* ParentActor; // 0x00(0x08)
		struct FName SocketName; // 0x08(0x08)
		enum class EAttachmentRule LocationRule; // 0x10(0x01)
		enum class EAttachmentRule RotationRule; // 0x11(0x01)
		enum class EAttachmentRule ScaleRule; // 0x12(0x01)
		bool bWeldSimulatedBodies; // 0x13(0x01)
	};

	struct Function_Engine_Actor_K2_AttachRootComponentToActor_Param
	{
	public:

		struct AActor* InParentActor; // 0x00(0x08)
		struct FName InSocketName; // 0x08(0x08)
		enum class EAttachLocation AttachLocationType; // 0x10(0x01)
		bool bWeldSimulatedBodies; // 0x11(0x01)
	};

	struct Function_Engine_Actor_K2_AttachRootComponentTo_Param
	{
	public:

		struct USceneComponent* InParent; // 0x00(0x08)
		struct FName InSocketName; // 0x08(0x08)
		enum class EAttachLocation AttachLocationType; // 0x10(0x01)
		bool bWeldSimulatedBodies; // 0x11(0x01)
	};

	struct Function_Engine_Actor_K2_AddActorWorldTransform_Param
	{
	public:

		struct FTransform DeltaTransform; // 0x00(0x30)
		bool bSweep; // 0x30(0x01)
		char pad_31[0x3]; // 0x31(0x03)
		struct FHitResult SweepHitResult; // 0x34(0x88)
		bool bTeleport; // 0xbc(0x01)
	};

	struct Function_Engine_Actor_K2_AddActorWorldRotation_Param
	{
	public:

		struct FRotator DeltaRotation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
	};

	struct Function_Engine_Actor_K2_AddActorWorldOffset_Param
	{
	public:

		struct FVector DeltaLocation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
	};

	struct Function_Engine_Actor_K2_AddActorLocalTransform_Param
	{
	public:

		struct FTransform NewTransform; // 0x00(0x30)
		bool bSweep; // 0x30(0x01)
		char pad_31[0x3]; // 0x31(0x03)
		struct FHitResult SweepHitResult; // 0x34(0x88)
		bool bTeleport; // 0xbc(0x01)
	};

	struct Function_Engine_Actor_K2_AddActorLocalRotation_Param
	{
	public:

		struct FRotator DeltaRotation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
	};

	struct Function_Engine_Actor_K2_AddActorLocalOffset_Param
	{
	public:

		struct FVector DeltaLocation; // 0x00(0x0c)
		bool bSweep; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct FHitResult SweepHitResult; // 0x10(0x88)
		bool bTeleport; // 0x98(0x01)
	};

	struct Function_Engine_Actor_IsOverlappingActor_Param
	{
	public:

		struct AActor* Other; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_Actor_IsChildActor_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_IsActorTickEnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_IsActorBeingDestroyed_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_HasAuthority_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_GetVerticalDistanceTo_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetVelocity_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_GetTransform_Param
	{
	public:

		struct FTransform ReturnValue; // 0x00(0x30)
	};

	struct Function_Engine_Actor_GetTickableWhenPaused_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_GetSquaredDistanceTo_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetRemoteRole_Param
	{
	public:

		enum class ENetRole ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_GetParentComponent_Param
	{
	public:

		struct UChildActorComponent* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetParentActor_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetOwner_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetOverlappingComponents_Param
	{
	public:

		struct TArray<struct UPrimitiveComponent*> OverlappingComponents; // 0x00(0x10)
	};

	struct Function_Engine_Actor_GetOverlappingActors_Param
	{
	public:

		struct TArray<struct AActor*> OverlappingActors; // 0x00(0x10)
		struct UClass* ClassFilter; // 0x10(0x08)
	};

	struct Function_Engine_Actor_GetLocalRole_Param
	{
	public:

		enum class ENetRole ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_GetLifeSpan_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_Actor_GetInstigatorController_Param
	{
	public:

		struct AController* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetInstigator_Param
	{
	public:

		struct APawn* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetInputVectorAxisValue_Param
	{
	public:

		struct FKey InputAxisKey; // 0x00(0x18)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_Actor_GetInputAxisValue_Param
	{
	public:

		struct FName InputAxisName; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetInputAxisKeyValue_Param
	{
	public:

		struct FKey InputAxisKey; // 0x00(0x18)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_Actor_GetHorizontalDotProductTo_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetHorizontalDistanceTo_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetGameTimeSinceCreation_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_Actor_GetDotProductTo_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetDistanceTo_Param
	{
	public:

		struct AActor* OtherActor; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_Actor_GetComponentsByTag_Param
	{
	public:

		struct UClass* ComponentClass; // 0x00(0x08)
		struct FName Tag; // 0x08(0x08)
		struct TArray<struct UActorComponent*> ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_Actor_GetComponentsByInterface_Param
	{
	public:

		struct UClass* Interface; // 0x00(0x08)
		struct TArray<struct UActorComponent*> ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_Actor_GetComponentByClass_Param
	{
	public:

		struct UClass* ComponentClass; // 0x00(0x08)
		struct UActorComponent* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_Actor_GetAttachParentSocketName_Param
	{
	public:

		struct FName ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetAttachParentActor_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_Actor_GetAttachedActors_Param
	{
	public:

		struct TArray<struct AActor*> OutActors; // 0x00(0x10)
		bool bResetArray; // 0x10(0x01)
	};

	struct Function_Engine_Actor_GetAllChildActors_Param
	{
	public:

		struct TArray<struct AActor*> ChildActors; // 0x00(0x10)
		bool bIncludeDescendants; // 0x10(0x01)
	};

	struct Function_Engine_Actor_GetActorUpVector_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_GetActorTimeDilation_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_Actor_GetActorTickInterval_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_Actor_GetActorScale3D_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_GetActorRightVector_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_GetActorRelativeScale3D_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_GetActorForwardVector_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_Actor_GetActorEyesViewPoint_Param
	{
	public:

		struct FVector OutLocation; // 0x00(0x0c)
		struct FRotator OutRotation; // 0x0c(0x0c)
	};

	struct Function_Engine_Actor_GetActorEnableCollision_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_Actor_GetActorBounds_Param
	{
	public:

		bool bOnlyCollidingComponents; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FVector Origin; // 0x04(0x0c)
		struct FVector BoxExtent; // 0x10(0x0c)
	};

	struct Function_Engine_Actor_ForceNetUpdate_Param
	{
	public:

	};

	struct Function_Engine_Actor_FlushNetDormancy_Param
	{
	public:

	};

	struct Function_Engine_Actor_EnableInput_Param
	{
	public:

		struct APlayerController* PlayerController; // 0x00(0x08)
	};

	struct Function_Engine_Actor_DisableInput_Param
	{
	public:

		struct APlayerController* PlayerController; // 0x00(0x08)
	};

	struct Function_Engine_Actor_DetachRootComponentFromParent_Param
	{
	public:

		bool bMaintainWorldPosition; // 0x00(0x01)
	};

	struct Function_Engine_Actor_AddTickPrerequisiteComponent_Param
	{
	public:

		struct UActorComponent* PrerequisiteComponent; // 0x00(0x08)
	};

	struct Function_Engine_Actor_AddTickPrerequisiteActor_Param
	{
	public:

		struct AActor* PrerequisiteActor; // 0x00(0x08)
	};

	struct Function_Engine_Actor_AddComponent_Param
	{
	public:

		struct FName TemplateName; // 0x00(0x08)
		bool bManualAttachment; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FTransform RelativeTransform; // 0x10(0x30)
		struct UObject* ComponentTemplateContext; // 0x40(0x08)
		struct UActorComponent* ReturnValue; // 0x48(0x08)
	};

	struct Function_Engine_Actor_ActorHasTag_Param
	{
	public:

		struct FName Tag; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_ActorComponent_ToggleActive_Param
	{
	public:

	};

	struct Function_Engine_ActorComponent_SetTickGroup_Param
	{
	public:

		enum class ETickingGroup NewTickGroup; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_SetTickableWhenPaused_Param
	{
	public:

		bool bTickableWhenPaused; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_SetIsReplicated_Param
	{
	public:

		bool ShouldReplicate; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_SetComponentTickInterval_Param
	{
	public:

		float TickInterval; // 0x00(0x04)
	};

	struct Function_Engine_ActorComponent_SetComponentTickEnabled_Param
	{
	public:

		bool bEnabled; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_SetAutoActivate_Param
	{
	public:

		bool bNewAutoActivate; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_SetActive_Param
	{
	public:

		bool bNewActive; // 0x00(0x01)
		bool bReset; // 0x01(0x01)
	};

	struct Function_Engine_ActorComponent_RemoveTickPrerequisiteComponent_Param
	{
	public:

		struct UActorComponent* PrerequisiteComponent; // 0x00(0x08)
	};

	struct Function_Engine_ActorComponent_RemoveTickPrerequisiteActor_Param
	{
	public:

		struct AActor* PrerequisiteActor; // 0x00(0x08)
	};

	struct Function_Engine_ActorComponent_ReceiveTick_Param
	{
	public:

		float DeltaSeconds; // 0x00(0x04)
	};

	struct Function_Engine_ActorComponent_ReceiveEndPlay_Param
	{
	public:

		enum class EEndPlayReason EndPlayReason; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_ReceiveBeginPlay_Param
	{
	public:

	};

	struct Function_Engine_ActorComponent_OnRep_IsActive_Param
	{
	public:

	};

	struct Function_Engine_ActorComponent_K2_DestroyComponent_Param
	{
	public:

		struct UObject* Object; // 0x00(0x08)
	};

	struct Function_Engine_ActorComponent_IsComponentTickEnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_IsBeingDestroyed_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_IsActive_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_ActorComponent_GetOwner_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_ActorComponent_GetComponentTickInterval_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_ActorComponent_Deactivate_Param
	{
	public:

	};

	struct Function_Engine_ActorComponent_ComponentHasTag_Param
	{
	public:

		struct FName Tag; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_ActorComponent_AddTickPrerequisiteComponent_Param
	{
	public:

		struct UActorComponent* PrerequisiteComponent; // 0x00(0x08)
	};

	struct Function_Engine_ActorComponent_AddTickPrerequisiteActor_Param
	{
	public:

		struct AActor* PrerequisiteActor; // 0x00(0x08)
	};

	struct Function_Engine_ActorComponent_Activate_Param
	{
	public:

		bool bReset; // 0x00(0x01)
	};

	struct Function_Engine_BlueprintAsyncActionBase_Activate_Param
	{
	public:

	};

	struct Function_Engine_MaterialInterface_SetForceMipLevelsToBeResident_Param
	{
	public:

		bool OverrideForceMiplevelsToBeResident; // 0x00(0x01)
		bool bForceMiplevelsToBeResidentValue; // 0x01(0x01)
		char pad_2[0x2]; // 0x02(0x02)
		float ForceDuration; // 0x04(0x04)
		int32_t CinematicTextureGroups; // 0x08(0x04)
		bool bFastResponse; // 0x0c(0x01)
	};

	struct Function_Engine_MaterialInterface_GetPhysicalMaterial_Param
	{
	public:

		struct UPhysicalMaterial* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_MaterialInterface_GetBaseMaterial_Param
	{
	public:

		struct UMaterial* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_LevelStreaming_ShouldBeLoaded_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_LevelStreaming_SetShouldBeVisible_Param
	{
	public:

		bool bInShouldBeVisible; // 0x00(0x01)
	};

	struct Function_Engine_LevelStreaming_SetShouldBeLoaded_Param
	{
	public:

		bool bInShouldBeLoaded; // 0x00(0x01)
	};

	struct Function_Engine_LevelStreaming_SetPriority_Param
	{
	public:

		int32_t NewPriority; // 0x00(0x04)
	};

	struct Function_Engine_LevelStreaming_SetLevelLODIndex_Param
	{
	public:

		int32_t LodIndex; // 0x00(0x04)
	};

	struct Function_Engine_LevelStreaming_IsStreamingStatePending_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_LevelStreaming_IsLevelVisible_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_LevelStreaming_IsLevelLoaded_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_LevelStreaming_GetWorldAssetPackageFName_Param
	{
	public:

		struct FName ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_LevelStreaming_GetLoadedLevel_Param
	{
	public:

		struct ULevel* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_LevelStreaming_GetLevelScriptActor_Param
	{
	public:

		struct ALevelScriptActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_LevelStreaming_CreateInstance_Param
	{
	public:

		struct FString UniqueInstanceName; // 0x00(0x10)
		struct ULevelStreaming* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_AnimNotifyState_Received_NotifyTick_Param
	{
	public:

		struct USkeletalMeshComponent* MeshComp; // 0x00(0x08)
		struct UAnimSequenceBase* Animation; // 0x08(0x08)
		float FrameDeltaTime; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_AnimNotifyState_Received_NotifyEnd_Param
	{
	public:

		struct USkeletalMeshComponent* MeshComp; // 0x00(0x08)
		struct UAnimSequenceBase* Animation; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_AnimNotifyState_Received_NotifyBegin_Param
	{
	public:

		struct USkeletalMeshComponent* MeshComp; // 0x00(0x08)
		struct UAnimSequenceBase* Animation; // 0x08(0x08)
		float TotalDuration; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_AnimNotifyState_GetNotifyName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_AnimInstance_UnlockAIResources_Param
	{
	public:

		bool bUnlockMovement; // 0x00(0x01)
		bool UnlockAILogic; // 0x01(0x01)
	};

	struct Function_Engine_AnimInstance_UnlinkAnimClassLayers_Param
	{
	public:

		struct UClass* InClass; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_TryGetPawnOwner_Param
	{
	public:

		struct APawn* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_StopSlotAnimation_Param
	{
	public:

		float InBlendOutTime; // 0x00(0x04)
		struct FName SlotNodeName; // 0x04(0x08)
	};

	struct Function_Engine_AnimInstance_SnapshotPose_Param
	{
	public:

		struct FPoseSnapshot Snapshot; // 0x00(0x38)
	};

	struct Function_Engine_AnimInstance_SetRootMotionMode_Param
	{
	public:

		enum class ERootMotionMode Value; // 0x00(0x01)
	};

	struct Function_Engine_AnimInstance_SetMorphTarget_Param
	{
	public:

		struct FName MorphTargetName; // 0x00(0x08)
		float Value; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_SavePoseSnapshot_Param
	{
	public:

		struct FName SnapshotName; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_ResetDynamics_Param
	{
	public:

		enum class ETeleportType InTeleportType; // 0x00(0x01)
	};

	struct Function_Engine_AnimInstance_PlaySlotAnimationAsDynamicMontage_Param
	{
	public:

		struct UAnimSequenceBase* Asset; // 0x00(0x08)
		struct FName SlotNodeName; // 0x08(0x08)
		float BlendInTime; // 0x10(0x04)
		float BlendOutTime; // 0x14(0x04)
		float InPlayRate; // 0x18(0x04)
		int32_t LoopCount; // 0x1c(0x04)
		float BlendOutTriggerTime; // 0x20(0x04)
		float InTimeToStartMontageAt; // 0x24(0x04)
		struct UAnimMontage* ReturnValue; // 0x28(0x08)
	};

	struct Function_Engine_AnimInstance_PlaySlotAnimation_Param
	{
	public:

		struct UAnimSequenceBase* Asset; // 0x00(0x08)
		struct FName SlotNodeName; // 0x08(0x08)
		float BlendInTime; // 0x10(0x04)
		float BlendOutTime; // 0x14(0x04)
		float InPlayRate; // 0x18(0x04)
		int32_t LoopCount; // 0x1c(0x04)
		float ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_AnimInstance_Montage_Stop_Param
	{
	public:

		float InBlendOutTime; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct UAnimMontage* Montage; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_SetPosition_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		float NewPosition; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_Montage_SetPlayRate_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		float NewPlayRate; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_Montage_SetNextSection_Param
	{
	public:

		struct FName SectionNameToChange; // 0x00(0x08)
		struct FName NextSection; // 0x08(0x08)
		struct UAnimMontage* Montage; // 0x10(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_Resume_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_Play_Param
	{
	public:

		struct UAnimMontage* MontageToPlay; // 0x00(0x08)
		float InPlayRate; // 0x08(0x04)
		enum class EMontagePlayReturnType ReturnValueType; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		float InTimeToStartMontageAt; // 0x10(0x04)
		bool bStopAllMontages; // 0x14(0x01)
		char pad_15[0x3]; // 0x15(0x03)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_AnimInstance_Montage_Pause_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_JumpToSectionsEnd_Param
	{
	public:

		struct FName SectionName; // 0x00(0x08)
		struct UAnimMontage* Montage; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_JumpToSection_Param
	{
	public:

		struct FName SectionName; // 0x00(0x08)
		struct UAnimMontage* Montage; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_IsPlaying_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_AnimInstance_Montage_IsActive_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_AnimInstance_Montage_GetPosition_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_Montage_GetPlayRate_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_Montage_GetIsStopped_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_AnimInstance_Montage_GetCurrentSection_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		struct FName ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_Montage_GetBlendTime_Param
	{
	public:

		struct UAnimMontage* Montage; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_LockAIResources_Param
	{
	public:

		bool bLockMovement; // 0x00(0x01)
		bool LockAILogic; // 0x01(0x01)
	};

	struct Function_Engine_AnimInstance_LinkAnimGraphByTag_Param
	{
	public:

		struct FName InTag; // 0x00(0x08)
		struct UClass* InClass; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_LinkAnimClassLayers_Param
	{
	public:

		struct UClass* InClass; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_IsSyncGroupBetweenMarkers_Param
	{
	public:

		struct FName InSyncGroupName; // 0x00(0x08)
		struct FName PreviousMarker; // 0x08(0x08)
		struct FName NextMarker; // 0x10(0x08)
		bool bRespectMarkerOrder; // 0x18(0x01)
		bool ReturnValue; // 0x19(0x01)
	};

	struct Function_Engine_AnimInstance_IsPlayingSlotAnimation_Param
	{
	public:

		struct UAnimSequenceBase* Asset; // 0x00(0x08)
		struct FName SlotNodeName; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_AnimInstance_IsAnyMontagePlaying_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_AnimInstance_HasMarkerBeenHitThisFrame_Param
	{
	public:

		struct FName SyncGroup; // 0x00(0x08)
		struct FName MarkerName; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_AnimInstance_GetTimeToClosestMarker_Param
	{
	public:

		struct FName SyncGroup; // 0x00(0x08)
		struct FName MarkerName; // 0x08(0x08)
		float OutMarkerTime; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_AnimInstance_GetSyncGroupPosition_Param
	{
	public:

		struct FName InSyncGroupName; // 0x00(0x08)
		struct FMarkerSyncAnimPosition ReturnValue; // 0x08(0x14)
	};

	struct Function_Engine_AnimInstance_GetRelevantAnimTimeRemainingFraction_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t StateIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetRelevantAnimTimeRemaining_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t StateIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetRelevantAnimTimeFraction_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t StateIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetRelevantAnimTime_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t StateIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetRelevantAnimLength_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t StateIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetOwningComponent_Param
	{
	public:

		struct USkeletalMeshComponent* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_GetOwningActor_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_GetLinkedAnimLayerInstanceByGroup_Param
	{
	public:

		struct FName InGroup; // 0x00(0x08)
		struct UAnimInstance* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_GetLinkedAnimLayerInstanceByClass_Param
	{
	public:

		struct UClass* InClass; // 0x00(0x08)
		struct UAnimInstance* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_GetLinkedAnimGraphInstancesByTag_Param
	{
	public:

		struct FName InTag; // 0x00(0x08)
		struct TArray<struct UAnimInstance*> OutLinkedInstances; // 0x08(0x10)
	};

	struct Function_Engine_AnimInstance_GetLinkedAnimGraphInstanceByTag_Param
	{
	public:

		struct FName InTag; // 0x00(0x08)
		struct UAnimInstance* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_AnimInstance_GetInstanceTransitionTimeElapsedFraction_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t TransitionIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceTransitionTimeElapsed_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t TransitionIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceTransitionCrossfadeDuration_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t TransitionIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceStateWeight_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		int32_t StateIndex; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceMachineWeight_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceCurrentStateElapsedTime_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceAssetPlayerTimeFromEndFraction_Param
	{
	public:

		int32_t AssetPlayerIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceAssetPlayerTimeFromEnd_Param
	{
	public:

		int32_t AssetPlayerIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceAssetPlayerTimeFraction_Param
	{
	public:

		int32_t AssetPlayerIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceAssetPlayerTime_Param
	{
	public:

		int32_t AssetPlayerIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetInstanceAssetPlayerLength_Param
	{
	public:

		int32_t AssetPlayerIndex; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_AnimInstance_GetCurveValue_Param
	{
	public:

		struct FName CurveName; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetCurrentStateName_Param
	{
	public:

		int32_t MachineIndex; // 0x00(0x04)
		struct FName ReturnValue; // 0x04(0x08)
	};

	struct Function_Engine_AnimInstance_GetCurrentActiveMontage_Param
	{
	public:

		struct UAnimMontage* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_AnimInstance_GetAnimAssetPlayPositions_Param
	{
	public:

		struct TMap<struct FName, float> ReturnValue; // 0x00(0x50)
	};

	struct Function_Engine_AnimInstance_GetAnimAssetPlayPosition_Param
	{
	public:

		struct FName InName; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_AnimInstance_GetAllCurveNames_Param
	{
	public:

		struct TArray<struct FName> OutNames; // 0x00(0x10)
	};

	struct Function_Engine_AnimInstance_GetActiveCurveNames_Param
	{
	public:

		enum class EAnimCurveType CurveType; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct TArray<struct FName> OutNames; // 0x08(0x10)
	};

	struct Function_Engine_AnimInstance_ClearMorphTargets_Param
	{
	public:

	};

	struct Function_Engine_AnimInstance_CalculateDirection_Param
	{
	public:

		struct FVector Velocity; // 0x00(0x0c)
		struct FRotator BaseRotation; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_AnimInstance_BlueprintUpdateAnimation_Param
	{
	public:

		float DeltaTimeX; // 0x00(0x04)
	};

	struct Function_Engine_AnimInstance_BlueprintPostEvaluateAnimation_Param
	{
	public:

	};

	struct Function_Engine_AnimInstance_BlueprintInitializeAnimation_Param
	{
	public:

	};

	struct Function_Engine_AnimInstance_BlueprintBeginPlay_Param
	{
	public:

	};

	struct Function_Engine_CameraModifier_IsDisabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_CameraModifier_GetViewTarget_Param
	{
	public:

		struct AActor* ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_CameraModifier_EnableModifier_Param
	{
	public:

	};

	struct Function_Engine_CameraModifier_DisableModifier_Param
	{
	public:

		bool bImmediate; // 0x00(0x01)
	};

	struct Function_Engine_CameraModifier_BlueprintModifyPostProcess_Param
	{
	public:

		float DeltaTime; // 0x00(0x04)
		float PostProcessBlendWeight; // 0x04(0x04)
		char pad_8[0x8]; // 0x08(0x08)
		struct FPostProcessSettings PostProcessSettings; // 0x10(0x950)
	};

	struct Function_Engine_CameraModifier_BlueprintModifyCamera_Param
	{
	public:

		float DeltaTime; // 0x00(0x04)
		struct FVector ViewLocation; // 0x04(0x0c)
		struct FRotator ViewRotation; // 0x10(0x0c)
		float FOV; // 0x1c(0x04)
		struct FVector NewViewLocation; // 0x20(0x0c)
		struct FRotator NewViewRotation; // 0x2c(0x0c)
		float NewFOV; // 0x38(0x04)
	};

	struct Function_Engine_CurveBase_GetValueRange_Param
	{
	public:

		float MinValue; // 0x00(0x04)
		float MaxValue; // 0x04(0x04)
	};

	struct Function_Engine_CurveBase_GetTimeRange_Param
	{
	public:

		float MinTime; // 0x00(0x04)
		float MaxTime; // 0x04(0x04)
	};

	struct Function_Engine_TimecodeProvider_GetTimecode_Param
	{
	public:

		struct FTimecode ReturnValue; // 0x00(0x14)
	};

	struct Function_Engine_TimecodeProvider_GetSynchronizationState_Param
	{
	public:

		enum class ETimecodeProviderSynchronizationState ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_TimecodeProvider_GetFrameRate_Param
	{
	public:

		struct FFrameRate ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_TimecodeProvider_GetDelayedTimecode_Param
	{
	public:

		struct FTimecode ReturnValue; // 0x00(0x14)
	};

	struct Function_Engine_GameplayStatics_UnloadStreamLevel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName LevelName; // 0x08(0x08)
		struct FLatentActionInfo LatentInfo; // 0x10(0x18)
		bool bShouldBlockOnUnload; // 0x28(0x01)
	};

	struct Function_Engine_GameplayStatics_SuggestProjectileVelocity_CustomArc_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector OutLaunchVelocity; // 0x08(0x0c)
		struct FVector StartPos; // 0x14(0x0c)
		struct FVector EndPos; // 0x20(0x0c)
		float OverrideGravityZ; // 0x2c(0x04)
		float ArcParam; // 0x30(0x04)
		bool ReturnValue; // 0x34(0x01)
	};

	struct Function_Engine_GameplayStatics_SpawnSoundAttached_Param
	{
	public:

		struct USoundBase* Sound; // 0x00(0x08)
		struct USceneComponent* AttachToComponent; // 0x08(0x08)
		struct FName AttachPointName; // 0x10(0x08)
		struct FVector Location; // 0x18(0x0c)
		struct FRotator Rotation; // 0x24(0x0c)
		enum class EAttachLocation LocationType; // 0x30(0x01)
		bool bStopWhenAttachedToDestroyed; // 0x31(0x01)
		char pad_32[0x2]; // 0x32(0x02)
		float VolumeMultiplier; // 0x34(0x04)
		float PitchMultiplier; // 0x38(0x04)
		float StartTime; // 0x3c(0x04)
		struct USoundAttenuation* AttenuationSettings; // 0x40(0x08)
		struct USoundConcurrency* ConcurrencySettings; // 0x48(0x08)
		bool bAutoDestroy; // 0x50(0x01)
		char pad_51[0x7]; // 0x51(0x07)
		struct UAudioComponent* ReturnValue; // 0x58(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnSoundAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundBase* Sound; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		struct FRotator Rotation; // 0x1c(0x0c)
		float VolumeMultiplier; // 0x28(0x04)
		float PitchMultiplier; // 0x2c(0x04)
		float StartTime; // 0x30(0x04)
		char pad_34[0x4]; // 0x34(0x04)
		struct USoundAttenuation* AttenuationSettings; // 0x38(0x08)
		struct USoundConcurrency* ConcurrencySettings; // 0x40(0x08)
		bool bAutoDestroy; // 0x48(0x01)
		char pad_49[0x7]; // 0x49(0x07)
		struct UAudioComponent* ReturnValue; // 0x50(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnSound2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundBase* Sound; // 0x08(0x08)
		float VolumeMultiplier; // 0x10(0x04)
		float PitchMultiplier; // 0x14(0x04)
		float StartTime; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct USoundConcurrency* ConcurrencySettings; // 0x20(0x08)
		bool bPersistAcrossLevelTransition; // 0x28(0x01)
		bool bAutoDestroy; // 0x29(0x01)
		char pad_2A[0x6]; // 0x2a(0x06)
		struct UAudioComponent* ReturnValue; // 0x30(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnObject_Param
	{
	public:

		struct UClass* objectClass; // 0x00(0x08)
		struct UObject* Outer; // 0x08(0x08)
		struct UObject* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnForceFeedbackAttached_Param
	{
	public:

		struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x00(0x08)
		struct USceneComponent* AttachToComponent; // 0x08(0x08)
		struct FName AttachPointName; // 0x10(0x08)
		struct FVector Location; // 0x18(0x0c)
		struct FRotator Rotation; // 0x24(0x0c)
		enum class EAttachLocation LocationType; // 0x30(0x01)
		bool bStopWhenAttachedToDestroyed; // 0x31(0x01)
		bool bLooping; // 0x32(0x01)
		char pad_33[0x1]; // 0x33(0x01)
		float IntensityMultiplier; // 0x34(0x04)
		float StartTime; // 0x38(0x04)
		char pad_3C[0x4]; // 0x3c(0x04)
		struct UForceFeedbackAttenuation* AttenuationSettings; // 0x40(0x08)
		bool bAutoDestroy; // 0x48(0x01)
		char pad_49[0x7]; // 0x49(0x07)
		struct UForceFeedbackComponent* ReturnValue; // 0x50(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnForceFeedbackAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		struct FRotator Rotation; // 0x1c(0x0c)
		bool bLooping; // 0x28(0x01)
		char pad_29[0x3]; // 0x29(0x03)
		float IntensityMultiplier; // 0x2c(0x04)
		float StartTime; // 0x30(0x04)
		char pad_34[0x4]; // 0x34(0x04)
		struct UForceFeedbackAttenuation* AttenuationSettings; // 0x38(0x08)
		bool bAutoDestroy; // 0x40(0x01)
		char pad_41[0x7]; // 0x41(0x07)
		struct UForceFeedbackComponent* ReturnValue; // 0x48(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnEmitterAttached_Param
	{
	public:

		struct UParticleSystem* EmitterTemplate; // 0x00(0x08)
		struct USceneComponent* AttachToComponent; // 0x08(0x08)
		struct FName AttachPointName; // 0x10(0x08)
		struct FVector Location; // 0x18(0x0c)
		struct FRotator Rotation; // 0x24(0x0c)
		struct FVector Scale; // 0x30(0x0c)
		enum class EAttachLocation LocationType; // 0x3c(0x01)
		bool bAutoDestroy; // 0x3d(0x01)
		enum class EPSCPoolMethod PoolingMethod; // 0x3e(0x01)
		bool bAutoActivate; // 0x3f(0x01)
		struct UParticleSystemComponent* ReturnValue; // 0x40(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnEmitterAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UParticleSystem* EmitterTemplate; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		struct FRotator Rotation; // 0x1c(0x0c)
		struct FVector Scale; // 0x28(0x0c)
		bool bAutoDestroy; // 0x34(0x01)
		enum class EPSCPoolMethod PoolingMethod; // 0x35(0x01)
		bool bAutoActivateSystem; // 0x36(0x01)
		char pad_37[0x1]; // 0x37(0x01)
		struct UParticleSystemComponent* ReturnValue; // 0x38(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnDialogueAttached_Param
	{
	public:

		struct UDialogueWave* Dialogue; // 0x00(0x08)
		struct FDialogueContext Context; // 0x08(0x18)
		struct USceneComponent* AttachToComponent; // 0x20(0x08)
		struct FName AttachPointName; // 0x28(0x08)
		struct FVector Location; // 0x30(0x0c)
		struct FRotator Rotation; // 0x3c(0x0c)
		enum class EAttachLocation LocationType; // 0x48(0x01)
		bool bStopWhenAttachedToDestroyed; // 0x49(0x01)
		char pad_4A[0x2]; // 0x4a(0x02)
		float VolumeMultiplier; // 0x4c(0x04)
		float PitchMultiplier; // 0x50(0x04)
		float StartTime; // 0x54(0x04)
		struct USoundAttenuation* AttenuationSettings; // 0x58(0x08)
		bool bAutoDestroy; // 0x60(0x01)
		char pad_61[0x7]; // 0x61(0x07)
		struct UAudioComponent* ReturnValue; // 0x68(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnDialogueAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDialogueWave* Dialogue; // 0x08(0x08)
		struct FDialogueContext Context; // 0x10(0x18)
		struct FVector Location; // 0x28(0x0c)
		struct FRotator Rotation; // 0x34(0x0c)
		float VolumeMultiplier; // 0x40(0x04)
		float PitchMultiplier; // 0x44(0x04)
		float StartTime; // 0x48(0x04)
		char pad_4C[0x4]; // 0x4c(0x04)
		struct USoundAttenuation* AttenuationSettings; // 0x50(0x08)
		bool bAutoDestroy; // 0x58(0x01)
		char pad_59[0x7]; // 0x59(0x07)
		struct UAudioComponent* ReturnValue; // 0x60(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnDialogue2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDialogueWave* Dialogue; // 0x08(0x08)
		struct FDialogueContext Context; // 0x10(0x18)
		float VolumeMultiplier; // 0x28(0x04)
		float PitchMultiplier; // 0x2c(0x04)
		float StartTime; // 0x30(0x04)
		bool bAutoDestroy; // 0x34(0x01)
		char pad_35[0x3]; // 0x35(0x03)
		struct UAudioComponent* ReturnValue; // 0x38(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnDecalAttached_Param
	{
	public:

		struct UMaterialInterface* DecalMaterial; // 0x00(0x08)
		struct FVector DecalSize; // 0x08(0x0c)
		char pad_14[0x4]; // 0x14(0x04)
		struct USceneComponent* AttachToComponent; // 0x18(0x08)
		struct FName AttachPointName; // 0x20(0x08)
		struct FVector Location; // 0x28(0x0c)
		struct FRotator Rotation; // 0x34(0x0c)
		enum class EAttachLocation LocationType; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		float LifeSpan; // 0x44(0x04)
		struct UDecalComponent* ReturnValue; // 0x48(0x08)
	};

	struct Function_Engine_GameplayStatics_SpawnDecalAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMaterialInterface* DecalMaterial; // 0x08(0x08)
		struct FVector DecalSize; // 0x10(0x0c)
		struct FVector Location; // 0x1c(0x0c)
		struct FRotator Rotation; // 0x28(0x0c)
		float LifeSpan; // 0x34(0x04)
		struct UDecalComponent* ReturnValue; // 0x38(0x08)
	};

	struct Function_Engine_GameplayStatics_SetWorldOriginLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FIntVector NewLocation; // 0x08(0x0c)
	};

	struct Function_Engine_GameplayStatics_SetViewportMouseCaptureMode_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		enum class EMouseCaptureMode MouseCaptureMode; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_SetSubtitlesEnabled_Param
	{
	public:

		bool bEnabled; // 0x00(0x01)
	};

	struct Function_Engine_GameplayStatics_SetSoundMixClassOverride_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundMix* InSoundMixModifier; // 0x08(0x08)
		struct USoundClass* InSoundClass; // 0x10(0x08)
		float Volume; // 0x18(0x04)
		float Pitch; // 0x1c(0x04)
		float FadeInTime; // 0x20(0x04)
		bool bApplyToChildren; // 0x24(0x01)
	};

	struct Function_Engine_GameplayStatics_SetPlayerControllerID_Param
	{
	public:

		struct APlayerController* Player; // 0x00(0x08)
		int32_t ControllerId; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_SetMaxAudioChannelsScaled_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float MaxChannelCountScale; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_SetGlobalTimeDilation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float TimeDilation; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_SetGlobalPitchModulation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float PitchModulation; // 0x08(0x04)
		float TimeSec; // 0x0c(0x04)
	};

	struct Function_Engine_GameplayStatics_SetGlobalListenerFocusParameters_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float FocusAzimuthScale; // 0x08(0x04)
		float NonFocusAzimuthScale; // 0x0c(0x04)
		float FocusDistanceScale; // 0x10(0x04)
		float NonFocusDistanceScale; // 0x14(0x04)
		float FocusVolumeScale; // 0x18(0x04)
		float NonFocusVolumeScale; // 0x1c(0x04)
		float FocusPriorityScale; // 0x20(0x04)
		float NonFocusPriorityScale; // 0x24(0x04)
	};

	struct Function_Engine_GameplayStatics_SetGamePaused_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool bPaused; // 0x08(0x01)
		bool ReturnValue; // 0x09(0x01)
	};

	struct Function_Engine_GameplayStatics_SetForceDisableSplitscreen_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool bDisable; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_SetEnableWorldRendering_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool bEnable; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_SetBaseSoundMix_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundMix* InSoundMix; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_SaveGameToSlot_Param
	{
	public:

		struct USaveGame* SaveGameObject; // 0x00(0x08)
		struct FString SlotName; // 0x08(0x10)
		int32_t UserIndex; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_Engine_GameplayStatics_RemovePlayer_Param
	{
	public:

		struct APlayerController* Player; // 0x00(0x08)
		bool bDestroyPawn; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_RebaseZeroOriginOntoLocal_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector WorldLocation; // 0x08(0x0c)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_GameplayStatics_RebaseLocalOriginOntoZero_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector WorldLocation; // 0x08(0x0c)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_GameplayStatics_PushSoundMixModifier_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundMix* InSoundMixModifier; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_ProjectWorldToScreen_Param
	{
	public:

		struct APlayerController* Player; // 0x00(0x08)
		struct FVector WorldPosition; // 0x08(0x0c)
		struct FVector2D ScreenPosition; // 0x14(0x08)
		bool bPlayerViewportRelative; // 0x1c(0x01)
		bool ReturnValue; // 0x1d(0x01)
	};

	struct Function_Engine_GameplayStatics_PrimeSound_Param
	{
	public:

		struct USoundBase* InSound; // 0x00(0x08)
	};

	struct Function_Engine_GameplayStatics_PopSoundMixModifier_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundMix* InSoundMixModifier; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_PlayWorldCameraShake_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* Shake; // 0x08(0x08)
		struct FVector Epicenter; // 0x10(0x0c)
		float InnerRadius; // 0x1c(0x04)
		float OuterRadius; // 0x20(0x04)
		float Falloff; // 0x24(0x04)
		bool bOrientShakeTowardsEpicenter; // 0x28(0x01)
	};

	struct Function_Engine_GameplayStatics_PlaySoundAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundBase* Sound; // 0x08(0x08)
		struct FVector Location; // 0x10(0x0c)
		struct FRotator Rotation; // 0x1c(0x0c)
		float VolumeMultiplier; // 0x28(0x04)
		float PitchMultiplier; // 0x2c(0x04)
		float StartTime; // 0x30(0x04)
		char pad_34[0x4]; // 0x34(0x04)
		struct USoundAttenuation* AttenuationSettings; // 0x38(0x08)
		struct USoundConcurrency* ConcurrencySettings; // 0x40(0x08)
		struct AActor* OwningActor; // 0x48(0x08)
	};

	struct Function_Engine_GameplayStatics_PlaySound2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundBase* Sound; // 0x08(0x08)
		float VolumeMultiplier; // 0x10(0x04)
		float PitchMultiplier; // 0x14(0x04)
		float StartTime; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct USoundConcurrency* ConcurrencySettings; // 0x20(0x08)
		struct AActor* OwningActor; // 0x28(0x08)
	};

	struct Function_Engine_GameplayStatics_PlayDialogueAtLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDialogueWave* Dialogue; // 0x08(0x08)
		struct FDialogueContext Context; // 0x10(0x18)
		struct FVector Location; // 0x28(0x0c)
		struct FRotator Rotation; // 0x34(0x0c)
		float VolumeMultiplier; // 0x40(0x04)
		float PitchMultiplier; // 0x44(0x04)
		float StartTime; // 0x48(0x04)
		char pad_4C[0x4]; // 0x4c(0x04)
		struct USoundAttenuation* AttenuationSettings; // 0x50(0x08)
	};

	struct Function_Engine_GameplayStatics_PlayDialogue2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UDialogueWave* Dialogue; // 0x08(0x08)
		struct FDialogueContext Context; // 0x10(0x18)
		float VolumeMultiplier; // 0x28(0x04)
		float PitchMultiplier; // 0x2c(0x04)
		float StartTime; // 0x30(0x04)
	};

	struct Function_Engine_GameplayStatics_ParseOption_Param
	{
	public:

		struct FString Options; // 0x00(0x10)
		struct FString Key; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_GameplayStatics_OpenLevel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName LevelName; // 0x08(0x08)
		bool bAbsolute; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct FString Options; // 0x18(0x10)
	};

	struct Function_Engine_GameplayStatics_MakeHitResult_Param
	{
	public:

		bool bBlockingHit; // 0x00(0x01)
		bool bInitialOverlap; // 0x01(0x01)
		char pad_2[0x2]; // 0x02(0x02)
		float Time; // 0x04(0x04)
		float Distance; // 0x08(0x04)
		struct FVector Location; // 0x0c(0x0c)
		struct FVector ImpactPoint; // 0x18(0x0c)
		struct FVector Normal; // 0x24(0x0c)
		struct FVector ImpactNormal; // 0x30(0x0c)
		char pad_3C[0x4]; // 0x3c(0x04)
		struct UPhysicalMaterial* PhysMat; // 0x40(0x08)
		struct AActor* HitActor; // 0x48(0x08)
		struct UPrimitiveComponent* HitComponent; // 0x50(0x08)
		struct FName HitBoneName; // 0x58(0x08)
		int32_t HitItem; // 0x60(0x04)
		int32_t FaceIndex; // 0x64(0x04)
		struct FVector TraceStart; // 0x68(0x0c)
		struct FVector TraceEnd; // 0x74(0x0c)
		struct FHitResult ReturnValue; // 0x80(0x88)
	};

	struct Function_Engine_GameplayStatics_LoadStreamLevel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName LevelName; // 0x08(0x08)
		bool bMakeVisibleAfterLoad; // 0x10(0x01)
		bool bShouldBlockOnLoad; // 0x11(0x01)
		char pad_12[0x6]; // 0x12(0x06)
		struct FLatentActionInfo LatentInfo; // 0x18(0x18)
	};

	struct Function_Engine_GameplayStatics_LoadGameFromSlot_Param
	{
	public:

		struct FString SlotName; // 0x00(0x10)
		int32_t UserIndex; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct USaveGame* ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_GameplayStatics_IsSplitscreenForceDisabled_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_IsGamePaused_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_HasOption_Param
	{
	public:

		struct FString Options; // 0x00(0x10)
		struct FString InKey; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_GameplayStatics_HasLaunchOption_Param
	{
	public:

		struct FString OptionToCheck; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_GameplayStatics_GrassOverlappingSphereCount_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UStaticMesh* StaticMesh; // 0x08(0x08)
		struct FVector CenterPosition; // 0x10(0x0c)
		float radius; // 0x1c(0x04)
		int32_t ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_GameplayStatics_GetWorldOriginLocation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FIntVector ReturnValue; // 0x08(0x0c)
	};

	struct Function_Engine_GameplayStatics_GetWorldDeltaSeconds_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetViewProjectionMatrix_Param
	{
	public:

		struct FMinimalViewInfo DesiredView; // 0x00(0x9e0)
		struct FMatrix ViewMatrix; // 0x9e0(0x40)
		struct FMatrix ProjectionMatrix; // 0xa20(0x40)
		struct FMatrix ViewProjectionMatrix; // 0xa60(0x40)
	};

	struct Function_Engine_GameplayStatics_GetViewportMouseCaptureMode_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		enum class EMouseCaptureMode ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_GetUnpausedTimeSeconds_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetTimeSeconds_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetSurfaceType_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		enum class EPhysicalSurface ReturnValue; // 0x88(0x01)
	};

	struct Function_Engine_GameplayStatics_GetStreamingLevel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName PackageName; // 0x08(0x08)
		struct ULevelStreaming* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetRealTimeSeconds_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetPlayerPawn_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t PlayerIndex; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct APawn* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetPlayerControllerID_Param
	{
	public:

		struct APlayerController* Player; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetPlayerControllerFromID_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t ControllerId; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct APlayerController* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetPlayerController_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t PlayerIndex; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct APlayerController* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetPlayerCharacter_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t PlayerIndex; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct ACHARACTER* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetPlayerCameraManager_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t PlayerIndex; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct APlayerCameraManager* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetPlatformName_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_GameplayStatics_GetObjectClass_Param
	{
	public:

		struct UObject* Object; // 0x00(0x08)
		struct UClass* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_GetMaxAudioChannelCount_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetKeyValue_Param
	{
	public:

		struct FString Pair; // 0x00(0x10)
		struct FString Key; // 0x10(0x10)
		struct FString Value; // 0x20(0x10)
	};

	struct Function_Engine_GameplayStatics_GetIntOption_Param
	{
	public:

		struct FString Options; // 0x00(0x10)
		struct FString Key; // 0x10(0x10)
		int32_t DefaultValue; // 0x20(0x04)
		int32_t ReturnValue; // 0x24(0x04)
	};

	struct Function_Engine_GameplayStatics_GetGlobalTimeDilation_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetGameState_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct AGameStateBase* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_GetGameMode_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct AGameModeBase* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_GetGameInstance_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UGameInstance* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_GetEnableWorldRendering_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_GameplayStatics_GetCurrentReverbEffect_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UReverbEffect* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_GetCurrentLevelName_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		bool bRemovePrefixString; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_GameplayStatics_GetAudioTimeSeconds_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_GameplayStatics_GetAllActorsWithTag_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName Tag; // 0x08(0x08)
		struct TArray<struct AActor*> OutActors; // 0x10(0x10)
	};

	struct Function_Engine_GameplayStatics_GetAllActorsWithInterface_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* Interface; // 0x08(0x08)
		struct TArray<struct AActor*> OutActors; // 0x10(0x10)
	};

	struct Function_Engine_GameplayStatics_GetAllActorsOfClassWithTag_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* ActorClass; // 0x08(0x08)
		struct FName Tag; // 0x10(0x08)
		struct TArray<struct AActor*> OutActors; // 0x18(0x10)
	};

	struct Function_Engine_GameplayStatics_GetAllActorsOfClass_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* ActorClass; // 0x08(0x08)
		struct TArray<struct AActor*> OutActors; // 0x10(0x10)
	};

	struct Function_Engine_GameplayStatics_GetActorOfClass_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* ActorClass; // 0x08(0x08)
		struct AActor* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_GetActorArrayBounds_Param
	{
	public:

		struct TArray<struct AActor*> actors; // 0x00(0x10)
		bool bOnlyCollidingComponents; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		struct FVector Center; // 0x14(0x0c)
		struct FVector BoxExtent; // 0x20(0x0c)
	};

	struct Function_Engine_GameplayStatics_GetActorArrayAverageLocation_Param
	{
	public:

		struct TArray<struct AActor*> actors; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_GameplayStatics_GetAccurateRealTime_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t Seconds; // 0x08(0x04)
		float PartialSeconds; // 0x0c(0x04)
	};

	struct Function_Engine_GameplayStatics_FlushLevelStreaming_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
	};

	struct Function_Engine_GameplayStatics_FinishSpawningActor_Param
	{
	public:

		struct AActor* Actor; // 0x00(0x08)
		char pad_8[0x8]; // 0x08(0x08)
		struct FTransform SpawnTransform; // 0x10(0x30)
		struct AActor* ReturnValue; // 0x40(0x08)
	};

	struct Function_Engine_GameplayStatics_FindCollisionUV_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		int32_t UVChannel; // 0x88(0x04)
		struct FVector2D UV; // 0x8c(0x08)
		bool ReturnValue; // 0x94(0x01)
	};

	struct Function_Engine_GameplayStatics_EnableLiveStreaming_Param
	{
	public:

		bool Enable; // 0x00(0x01)
	};

	struct Function_Engine_GameplayStatics_DoesSaveGameExist_Param
	{
	public:

		struct FString SlotName; // 0x00(0x10)
		int32_t UserIndex; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_GameplayStatics_DeprojectScreenToWorld_Param
	{
	public:

		struct APlayerController* Player; // 0x00(0x08)
		struct FVector2D ScreenPosition; // 0x08(0x08)
		struct FVector WorldPosition; // 0x10(0x0c)
		struct FVector WorldDirection; // 0x1c(0x0c)
		bool bPlayerViewportRelative; // 0x28(0x01)
		bool ReturnValue; // 0x29(0x01)
	};

	struct Function_Engine_GameplayStatics_DeleteGameInSlot_Param
	{
	public:

		struct FString SlotName; // 0x00(0x10)
		int32_t UserIndex; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_GameplayStatics_DeactivateReverbEffect_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FName TagName; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_CreateSound2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundBase* Sound; // 0x08(0x08)
		float VolumeMultiplier; // 0x10(0x04)
		float PitchMultiplier; // 0x14(0x04)
		float StartTime; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct USoundConcurrency* ConcurrencySettings; // 0x20(0x08)
		bool bPersistAcrossLevelTransition; // 0x28(0x01)
		bool bAutoDestroy; // 0x29(0x01)
		char pad_2A[0x6]; // 0x2a(0x06)
		struct UAudioComponent* ReturnValue; // 0x30(0x08)
	};

	struct Function_Engine_GameplayStatics_CreateSaveGameObject_Param
	{
	public:

		struct UClass* SaveGameClass; // 0x00(0x08)
		struct USaveGame* ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_GameplayStatics_CreatePlayer_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t ControllerId; // 0x08(0x04)
		bool bSpawnPlayerController; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		struct APlayerController* ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_GameplayStatics_ClearSoundMixModifiers_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
	};

	struct Function_Engine_GameplayStatics_ClearSoundMixClassOverride_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct USoundMix* InSoundMixModifier; // 0x08(0x08)
		struct USoundClass* InSoundClass; // 0x10(0x08)
		float FadeOutTime; // 0x18(0x04)
	};

	struct Function_Engine_GameplayStatics_CancelAsyncLoading_Param
	{
	public:

	};

	struct Function_Engine_GameplayStatics_BreakHitResult_Param
	{
	public:

		struct FHitResult Hit; // 0x00(0x88)
		bool bBlockingHit; // 0x88(0x01)
		bool bInitialOverlap; // 0x89(0x01)
		char pad_8A[0x2]; // 0x8a(0x02)
		float Time; // 0x8c(0x04)
		float Distance; // 0x90(0x04)
		struct FVector Location; // 0x94(0x0c)
		struct FVector ImpactPoint; // 0xa0(0x0c)
		struct FVector Normal; // 0xac(0x0c)
		struct FVector ImpactNormal; // 0xb8(0x0c)
		char pad_C4[0x4]; // 0xc4(0x04)
		struct UPhysicalMaterial* PhysMat; // 0xc8(0x08)
		struct AActor* HitActor; // 0xd0(0x08)
		struct UPrimitiveComponent* HitComponent; // 0xd8(0x08)
		struct FName HitBoneName; // 0xe0(0x08)
		int32_t HitItem; // 0xe8(0x04)
		int32_t FaceIndex; // 0xec(0x04)
		struct FVector TraceStart; // 0xf0(0x0c)
		struct FVector TraceEnd; // 0xfc(0x0c)
	};

	struct Function_Engine_GameplayStatics_BlueprintSuggestProjectileVelocity_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector TossVelocity; // 0x08(0x0c)
		struct FVector StartLocation; // 0x14(0x0c)
		struct FVector EndLocation; // 0x20(0x0c)
		float LaunchSpeed; // 0x2c(0x04)
		float OverrideGravityZ; // 0x30(0x04)
		enum class ESuggestProjVelocityTraceOption TraceOption; // 0x34(0x01)
		char pad_35[0x3]; // 0x35(0x03)
		float CollisionRadius; // 0x38(0x04)
		bool bFavorHighArc; // 0x3c(0x01)
		bool bDrawDebug; // 0x3d(0x01)
		bool ReturnValue; // 0x3e(0x01)
	};

	struct Function_Engine_GameplayStatics_Blueprint_PredictProjectilePath_ByTraceChannel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FHitResult OutHit; // 0x08(0x88)
		struct TArray<struct FVector> OutPathPositions; // 0x90(0x10)
		struct FVector OutLastTraceDestination; // 0xa0(0x0c)
		struct FVector StartPos; // 0xac(0x0c)
		struct FVector LaunchVelocity; // 0xb8(0x0c)
		bool bTracePath; // 0xc4(0x01)
		char pad_C5[0x3]; // 0xc5(0x03)
		float ProjectileRadius; // 0xc8(0x04)
		enum class ECollisionChannel TraceChannel; // 0xcc(0x01)
		bool bTraceComplex; // 0xcd(0x01)
		char pad_CE[0x2]; // 0xce(0x02)
		struct TArray<struct AActor*> ActorsToIgnore; // 0xd0(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0xe0(0x01)
		char pad_E1[0x3]; // 0xe1(0x03)
		float DrawDebugTime; // 0xe4(0x04)
		float SimFrequency; // 0xe8(0x04)
		float MaxSimTime; // 0xec(0x04)
		float OverrideGravityZ; // 0xf0(0x04)
		bool ReturnValue; // 0xf4(0x01)
	};

	struct Function_Engine_GameplayStatics_Blueprint_PredictProjectilePath_ByObjectType_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FHitResult OutHit; // 0x08(0x88)
		struct TArray<struct FVector> OutPathPositions; // 0x90(0x10)
		struct FVector OutLastTraceDestination; // 0xa0(0x0c)
		struct FVector StartPos; // 0xac(0x0c)
		struct FVector LaunchVelocity; // 0xb8(0x0c)
		bool bTracePath; // 0xc4(0x01)
		char pad_C5[0x3]; // 0xc5(0x03)
		float ProjectileRadius; // 0xc8(0x04)
		char pad_CC[0x4]; // 0xcc(0x04)
		struct TArray<enum class EObjectTypeQuery> ObjectTypes; // 0xd0(0x10)
		bool bTraceComplex; // 0xe0(0x01)
		char pad_E1[0x7]; // 0xe1(0x07)
		struct TArray<struct AActor*> ActorsToIgnore; // 0xe8(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0xf8(0x01)
		char pad_F9[0x3]; // 0xf9(0x03)
		float DrawDebugTime; // 0xfc(0x04)
		float SimFrequency; // 0x100(0x04)
		float MaxSimTime; // 0x104(0x04)
		float OverrideGravityZ; // 0x108(0x04)
		bool ReturnValue; // 0x10c(0x01)
	};

	struct Function_Engine_GameplayStatics_Blueprint_PredictProjectilePath_Advanced_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FPredictProjectilePathParams PredictParams; // 0x08(0x60)
		struct FPredictProjectilePathResult PredictResult; // 0x68(0xb8)
		bool ReturnValue; // 0x120(0x01)
	};

	struct Function_Engine_GameplayStatics_BeginSpawningActorFromClass_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* ActorClass; // 0x08(0x08)
		struct FTransform SpawnTransform; // 0x10(0x30)
		bool bNoCollisionFail; // 0x40(0x01)
		char pad_41[0x7]; // 0x41(0x07)
		struct AActor* Owner; // 0x48(0x08)
		struct AActor* ReturnValue; // 0x50(0x08)
	};

	struct Function_Engine_GameplayStatics_BeginSpawningActorFromBlueprint_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UBlueprint* Blueprint; // 0x08(0x08)
		struct FTransform SpawnTransform; // 0x10(0x30)
		bool bNoCollisionFail; // 0x40(0x01)
		char pad_41[0x7]; // 0x41(0x07)
		struct AActor* ReturnValue; // 0x48(0x08)
	};

	struct Function_Engine_GameplayStatics_BeginDeferredActorSpawnFromClass_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UClass* ActorClass; // 0x08(0x08)
		struct FTransform SpawnTransform; // 0x10(0x30)
		enum class ESpawnActorCollisionHandlingMethod CollisionHandlingOverride; // 0x40(0x01)
		char pad_41[0x7]; // 0x41(0x07)
		struct AActor* Owner; // 0x48(0x08)
		struct AActor* ReturnValue; // 0x50(0x08)
	};

	struct Function_Engine_GameplayStatics_AreSubtitlesEnabled_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_GameplayStatics_AreAnyListenersWithinRange_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Location; // 0x08(0x0c)
		float MaximumRange; // 0x14(0x04)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_GameplayStatics_ApplyRadialDamageWithFalloff_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float BaseDamage; // 0x08(0x04)
		float MinimumDamage; // 0x0c(0x04)
		struct FVector Origin; // 0x10(0x0c)
		float DamageInnerRadius; // 0x1c(0x04)
		float DamageOuterRadius; // 0x20(0x04)
		float DamageFalloff; // 0x24(0x04)
		struct UClass* DamageTypeClass; // 0x28(0x08)
		struct TArray<struct AActor*> IgnoreActors; // 0x30(0x10)
		struct AActor* DamageCauser; // 0x40(0x08)
		struct AController* InstigatedByController; // 0x48(0x08)
		enum class ECollisionChannel DamagePreventionChannel; // 0x50(0x01)
		bool ReturnValue; // 0x51(0x01)
	};

	struct Function_Engine_GameplayStatics_ApplyRadialDamage_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		float BaseDamage; // 0x08(0x04)
		struct FVector Origin; // 0x0c(0x0c)
		float DamageRadius; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct UClass* DamageTypeClass; // 0x20(0x08)
		struct TArray<struct AActor*> IgnoreActors; // 0x28(0x10)
		struct AActor* DamageCauser; // 0x38(0x08)
		struct AController* InstigatedByController; // 0x40(0x08)
		bool bDoFullDamage; // 0x48(0x01)
		enum class ECollisionChannel DamagePreventionChannel; // 0x49(0x01)
		bool ReturnValue; // 0x4a(0x01)
	};

	struct Function_Engine_GameplayStatics_ApplyPointDamage_Param
	{
	public:

		struct AActor* DamagedActor; // 0x00(0x08)
		float BaseDamage; // 0x08(0x04)
		struct FVector HitFromDirection; // 0x0c(0x0c)
		struct FHitResult HitInfo; // 0x18(0x88)
		struct AController* EventInstigator; // 0xa0(0x08)
		struct AActor* DamageCauser; // 0xa8(0x08)
		struct UClass* DamageTypeClass; // 0xb0(0x08)
		float ReturnValue; // 0xb8(0x04)
	};

	struct Function_Engine_GameplayStatics_ApplyDamage_Param
	{
	public:

		struct AActor* DamagedActor; // 0x00(0x08)
		float BaseDamage; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct AController* EventInstigator; // 0x10(0x08)
		struct AActor* DamageCauser; // 0x18(0x08)
		struct UClass* DamageTypeClass; // 0x20(0x08)
		float ReturnValue; // 0x28(0x04)
	};

	struct Function_Engine_GameplayStatics_ActivateReverbEffect_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UReverbEffect* ReverbEffect; // 0x08(0x08)
		struct FName TagName; // 0x10(0x08)
		float Priority; // 0x18(0x04)
		float Volume; // 0x1c(0x04)
		float FadeTime; // 0x20(0x04)
	};

	struct Function_Engine_BlueprintMapLibrary_SetMapPropertyByName_Param
	{
	public:

		struct UObject* Object; // 0x00(0x08)
		struct FName PropertyName; // 0x08(0x08)
		struct TMap<int32_t, int32_t> Value; // 0x10(0x50)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Values_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		struct TArray<int32_t> Values; // 0x50(0x10)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Remove_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		int32_t Key; // 0x50(0x04)
		bool ReturnValue; // 0x54(0x01)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Length_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		int32_t ReturnValue; // 0x50(0x04)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Keys_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		struct TArray<int32_t> Keys; // 0x50(0x10)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Find_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		int32_t Key; // 0x50(0x04)
		int32_t Value; // 0x54(0x04)
		bool ReturnValue; // 0x58(0x01)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Contains_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		int32_t Key; // 0x50(0x04)
		bool ReturnValue; // 0x54(0x01)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Clear_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
	};

	struct Function_Engine_BlueprintMapLibrary_Map_Add_Param
	{
	public:

		struct TMap<int32_t, int32_t> TargetMap; // 0x00(0x50)
		int32_t Key; // 0x50(0x04)
		int32_t Value; // 0x54(0x04)
	};

	struct Function_Engine_BlueprintPathsLibrary_VideoCaptureDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ValidatePath_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool bDidSucceed; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct FText OutReason; // 0x18(0x18)
	};

	struct Function_Engine_BlueprintPathsLibrary_Split_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString PathPart; // 0x10(0x10)
		struct FString FilenamePart; // 0x20(0x10)
		struct FString ExtensionPart; // 0x30(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_SourceConfigDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ShouldSaveToUserDir_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_ShaderWorkingDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_SetProjectFilePath_Param
	{
	public:

		struct FString NewGameProjectFilePath; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_SetExtension_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString InNewExtension; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ScreenShotDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_SandboxesDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_RootDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_RemoveDuplicateSlashes_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString OutPath; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectUserDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectSavedDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectPluginsDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectPersistentDownloadDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectModsDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectLogDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectIntermediateDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectContentDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProjectConfigDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ProfilingDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_NormalizeFilename_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString OutPath; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_NormalizeDirectoryName_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString OutPath; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_MakeValidFileName_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		struct FString InReplacementChar; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_MakeStandardFilename_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString OutPath; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_MakePlatformFilename_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString OutPath; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_MakePathRelativeTo_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString InRelativeTo; // 0x10(0x10)
		struct FString OutPath; // 0x20(0x10)
		bool ReturnValue; // 0x30(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_LaunchDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_IsSamePath_Param
	{
	public:

		struct FString PathA; // 0x00(0x10)
		struct FString PathB; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_IsRestrictedPath_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_IsRelative_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_IsProjectFilePathSet_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_IsDrive_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_HasProjectPersistentDownloadDir_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetToolTipLocalizationPaths_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetRestrictedFolderNames_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetRelativePathToRoot_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetPropertyNameLocalizationPaths_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetProjectFilePath_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetPath_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetInvalidFileSystemChars_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetGameLocalizationPaths_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetExtension_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool bIncludeDot; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetEngineLocalizationPaths_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetEditorLocalizationPaths_Param
	{
	public:

		struct TArray<struct FString> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetCleanFilename_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GetBaseFilename_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool bRemovePath; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GeneratedConfigDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GameUserDeveloperDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GameSourceDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GameDevelopersDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_GameAgnosticSavedDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_FileExists_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_FeaturePackDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EnterprisePluginsDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EnterpriseFeaturePackDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EnterpriseDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineVersionAgnosticUserDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineUserDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineSourceDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineSavedDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EnginePluginsDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineIntermediateDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineContentDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_EngineConfigDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_DirectoryExists_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_DiffDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_CreateTempFilename_Param
	{
	public:

		struct FString Path; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FString Extension; // 0x20(0x10)
		struct FString ReturnValue; // 0x30(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ConvertToSandboxPath_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString InSandboxName; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ConvertRelativePathToFull_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString InBasePath; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ConvertFromSandboxPath_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString InSandboxName; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_Combine_Param
	{
	public:

		struct TArray<struct FString> InPaths; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_CollapseRelativeDirectories_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString OutPath; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_BlueprintPathsLibrary_CloudDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_ChangeExtension_Param
	{
	public:

		struct FString InPath; // 0x00(0x10)
		struct FString InNewExtension; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_BugItDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_AutomationTransientDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_AutomationLogDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPathsLibrary_AutomationDir_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintPlatformLibrary_ScheduleLocalNotificationFromNow_Param
	{
	public:

		int32_t inSecondsFromNow; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FText Title; // 0x08(0x18)
		struct FText Body; // 0x20(0x18)
		struct FText Action; // 0x38(0x18)
		struct FString ActivationEvent; // 0x50(0x10)
		int32_t ReturnValue; // 0x60(0x04)
	};

	struct Function_Engine_BlueprintPlatformLibrary_ScheduleLocalNotificationBadgeFromNow_Param
	{
	public:

		int32_t inSecondsFromNow; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FString ActivationEvent; // 0x08(0x10)
	};

	struct Function_Engine_BlueprintPlatformLibrary_ScheduleLocalNotificationBadgeAtTime_Param
	{
	public:

		struct FDateTime FireDateTime; // 0x00(0x08)
		bool LocalTime; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FString ActivationEvent; // 0x10(0x10)
		int32_t ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_BlueprintPlatformLibrary_ScheduleLocalNotificationAtTime_Param
	{
	public:

		struct FDateTime FireDateTime; // 0x00(0x08)
		bool LocalTime; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FText Title; // 0x10(0x18)
		struct FText Body; // 0x28(0x18)
		struct FText Action; // 0x40(0x18)
		struct FString ActivationEvent; // 0x58(0x10)
		int32_t ReturnValue; // 0x68(0x04)
	};

	struct Function_Engine_BlueprintPlatformLibrary_GetLaunchNotification_Param
	{
	public:

		bool NotificationLaunchedApp; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FString ActivationEvent; // 0x08(0x10)
		int32_t FireDate; // 0x18(0x04)
	};

	struct Function_Engine_BlueprintPlatformLibrary_GetDeviceOrientation_Param
	{
	public:

		enum class EScreenOrientation ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_BlueprintPlatformLibrary_ClearAllLocalNotifications_Param
	{
	public:

	};

	struct Function_Engine_BlueprintPlatformLibrary_CancelLocalNotificationById_Param
	{
	public:

		int32_t NotificationId; // 0x00(0x04)
	};

	struct Function_Engine_BlueprintPlatformLibrary_CancelLocalNotification_Param
	{
	public:

		struct FString ActivationEvent; // 0x00(0x10)
	};

	struct Function_Engine_BlueprintSetLibrary_SetSetPropertyByName_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Union_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_ToArray_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_RemoveItems_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Remove_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Length_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Intersection_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Difference_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Contains_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Clear_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_AddItems_Param
	{
	public:

	};

	struct Function_Engine_BlueprintSetLibrary_Set_Add_Param
	{
	public:

	};

	struct Function_Engine_DataTableFunctionLibrary_GetDataTableRowNames_Param
	{
	public:

		struct UDataTable* Table; // 0x00(0x08)
		struct TArray<struct FName> OutRowNames; // 0x08(0x10)
	};

	struct Function_Engine_DataTableFunctionLibrary_GetDataTableRowFromName_Param
	{
	public:

		struct UDataTable* Table; // 0x00(0x08)
		struct FName RowName; // 0x08(0x08)
		struct FTableRowBase OutRow; // 0x10(0x08)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_DataTableFunctionLibrary_GetDataTableColumnAsString_Param
	{
	public:

		struct UDataTable* DataTable; // 0x00(0x08)
		struct FName PropertyName; // 0x08(0x08)
		struct TArray<struct FString> ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_DataTableFunctionLibrary_EvaluateCurveTableRow_Param
	{
	public:

		struct UCurveTable* CurveTable; // 0x00(0x08)
		struct FName RowName; // 0x08(0x08)
		float InXY; // 0x10(0x04)
		enum class EEvaluateCurveTableResult OutResult; // 0x14(0x01)
		char pad_15[0x3]; // 0x15(0x03)
		float OutXY; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct FString ContextString; // 0x20(0x10)
	};

	struct Function_Engine_DataTableFunctionLibrary_DoesDataTableRowExist_Param
	{
	public:

		struct UDataTable* Table; // 0x00(0x08)
		struct FName RowName; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_HealthSnapshotBlueprintLibrary_StopPerformanceSnapshots_Param
	{
	public:

	};

	struct Function_Engine_HealthSnapshotBlueprintLibrary_StartPerformanceSnapshots_Param
	{
	public:

	};

	struct Function_Engine_HealthSnapshotBlueprintLibrary_LogPerformanceSnapshot_Param
	{
	public:

		struct FString SnapshotTitle; // 0x00(0x10)
		bool bResetStats; // 0x10(0x01)
	};

	struct Function_Engine_ImportanceSamplingLibrary_RandomSobolFloat_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		int32_t Dimension; // 0x04(0x04)
		float Seed; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_ImportanceSamplingLibrary_RandomSobolCell3D_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		int32_t NumCells; // 0x04(0x04)
		struct FVector Cell; // 0x08(0x0c)
		struct FVector Seed; // 0x14(0x0c)
		struct FVector ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_ImportanceSamplingLibrary_RandomSobolCell2D_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		int32_t NumCells; // 0x04(0x04)
		struct FVector2D Cell; // 0x08(0x08)
		struct FVector2D Seed; // 0x10(0x08)
		struct FVector2D ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_ImportanceSamplingLibrary_NextSobolFloat_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		int32_t Dimension; // 0x04(0x04)
		float PreviousValue; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_ImportanceSamplingLibrary_NextSobolCell3D_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		int32_t NumCells; // 0x04(0x04)
		struct FVector PreviousValue; // 0x08(0x0c)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_ImportanceSamplingLibrary_NextSobolCell2D_Param
	{
	public:

		int32_t Index; // 0x00(0x04)
		int32_t NumCells; // 0x04(0x04)
		struct FVector2D PreviousValue; // 0x08(0x08)
		struct FVector2D ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_ImportanceSamplingLibrary_MakeImportanceTexture_Param
	{
	public:

		struct UTexture2D* Texture; // 0x00(0x08)
		enum class EImportanceWeight WeightingFunc; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FImportanceTexture ReturnValue; // 0x10(0x50)
	};

	struct Function_Engine_ImportanceSamplingLibrary_ImportanceSample_Param
	{
	public:

		struct FImportanceTexture Texture; // 0x00(0x50)
		struct FVector2D Rand; // 0x50(0x08)
		int32_t Samples; // 0x58(0x04)
		float Intensity; // 0x5c(0x04)
		struct FVector2D SamplePosition; // 0x60(0x08)
		struct FLinearColor SampleColor; // 0x68(0x10)
		float SampleIntensity; // 0x78(0x04)
		float SampleSize; // 0x7c(0x04)
	};

	struct Function_Engine_ImportanceSamplingLibrary_BreakImportanceTexture_Param
	{
	public:

		struct FImportanceTexture ImportanceTexture; // 0x00(0x50)
		struct UTexture2D* Texture; // 0x50(0x08)
		enum class EImportanceWeight WeightingFunc; // 0x58(0x01)
	};

	struct Function_Engine_KismetArrayLibrary_SetArrayPropertyByName_Param
	{
	public:

		struct UObject* Object; // 0x00(0x08)
		struct FName PropertyName; // 0x08(0x08)
		struct TArray<int32_t> Value; // 0x10(0x10)
	};

	struct Function_Engine_KismetArrayLibrary_FilterArray_Param
	{
	public:

		struct TArray<struct AActor*> TargetArray; // 0x00(0x10)
		struct UClass* FilterClass; // 0x10(0x08)
		struct TArray<struct AActor*> FilteredArray; // 0x18(0x10)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Swap_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t FirstIndex; // 0x10(0x04)
		int32_t SecondIndex; // 0x14(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Shuffle_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Set_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t Index; // 0x10(0x04)
		int32_t Item; // 0x14(0x04)
		bool bSizeToFit; // 0x18(0x01)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Resize_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t size; // 0x10(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_RemoveItem_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t Item; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Remove_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t IndexToRemove; // 0x10(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Length_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_LastIndex_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_IsValidIndex_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t IndexToTest; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Insert_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t NewItem; // 0x10(0x04)
		int32_t Index; // 0x14(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Identical_Param
	{
	public:

		struct TArray<int32_t> ArrayA; // 0x00(0x10)
		struct TArray<int32_t> ArrayB; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Get_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t Index; // 0x10(0x04)
		int32_t Item; // 0x14(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Find_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t ItemToFind; // 0x10(0x04)
		int32_t ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Contains_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t ItemToFind; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Clear_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Append_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		struct TArray<int32_t> SourceArray; // 0x10(0x10)
	};

	struct Function_Engine_KismetArrayLibrary_Array_AddUnique_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t NewItem; // 0x10(0x04)
		int32_t ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetArrayLibrary_Array_Add_Param
	{
	public:

		struct TArray<int32_t> TargetArray; // 0x00(0x10)
		int32_t NewItem; // 0x10(0x04)
		int32_t ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetGuidLibrary_Parse_StringToGuid_Param
	{
	public:

		struct FString GuidString; // 0x00(0x10)
		struct FGuid OutGUID; // 0x10(0x10)
		bool Success; // 0x20(0x01)
	};

	struct Function_Engine_KismetGuidLibrary_NotEqual_GuidGuid_Param
	{
	public:

		struct FGuid A; // 0x00(0x10)
		struct FGuid B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetGuidLibrary_NewGuid_Param
	{
	public:

		struct FGuid ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetGuidLibrary_IsValid_Guid_Param
	{
	public:

		struct FGuid InGuid; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetGuidLibrary_Invalidate_Guid_Param
	{
	public:

		struct FGuid InGuid; // 0x00(0x10)
	};

	struct Function_Engine_KismetGuidLibrary_EqualEqual_GuidGuid_Param
	{
	public:

		struct FGuid A; // 0x00(0x10)
		struct FGuid B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetGuidLibrary_Conv_GuidToString_Param
	{
	public:

		struct FGuid InGuid; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_IsTouchEvent_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		bool ReturnValue; // 0x70(0x01)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_IsMouseButtonDown_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		struct FKey MouseButton; // 0x70(0x18)
		bool ReturnValue; // 0x88(0x01)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetWheelDelta_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		float ReturnValue; // 0x70(0x04)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetUserIndex_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		int32_t ReturnValue; // 0x70(0x04)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetTouchpadIndex_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		int32_t ReturnValue; // 0x70(0x04)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetScreenSpacePosition_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		struct FVector2D ReturnValue; // 0x70(0x08)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetPointerIndex_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		int32_t ReturnValue; // 0x70(0x04)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetLastScreenSpacePosition_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		struct FVector2D ReturnValue; // 0x70(0x08)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetGestureType_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		enum class ESlateGesture ReturnValue; // 0x70(0x01)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetGestureDelta_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		struct FVector2D ReturnValue; // 0x70(0x08)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetEffectingButton_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		struct FKey ReturnValue; // 0x70(0x18)
	};

	struct Function_Engine_KismetInputLibrary_PointerEvent_GetCursorDelta_Param
	{
	public:

		struct FPointerEvent Input; // 0x00(0x70)
		struct FVector2D ReturnValue; // 0x70(0x08)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsVectorAxis_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsValid_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsMouseButton_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsModifierKey_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsKeyboardKey_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsGamepadKey_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_IsFloatAxis_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_GetNavigationDirectionFromKey_Param
	{
	public:

		struct FKeyEvent InKeyEvent; // 0x00(0x38)
		enum class EUINavigation ReturnValue; // 0x38(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_GetNavigationDirectionFromAnalog_Param
	{
	public:

		struct FAnalogInputEvent InAnalogEvent; // 0x00(0x40)
		enum class EUINavigation ReturnValue; // 0x40(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_GetNavigationActionFromKey_Param
	{
	public:

		struct FKeyEvent InKeyEvent; // 0x00(0x38)
		enum class EUINavigationAction ReturnValue; // 0x38(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_GetNavigationAction_Param
	{
	public:

		struct FKey InKey; // 0x00(0x18)
		enum class EUINavigationAction ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_Key_GetDisplayName_Param
	{
	public:

		struct FKey Key; // 0x00(0x18)
		struct FText ReturnValue; // 0x18(0x18)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsShiftDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsRightShiftDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsRightControlDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsRightCommandDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsRightAltDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsRepeat_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsLeftShiftDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsLeftControlDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsLeftCommandDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsLeftAltDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsControlDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsCommandDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputEvent_IsAltDown_Param
	{
	public:

		struct FInputEvent Input; // 0x00(0x18)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetInputLibrary_InputChord_GetDisplayName_Param
	{
	public:

		struct FInputChord Key; // 0x00(0x20)
		struct FText ReturnValue; // 0x20(0x18)
	};

	struct Function_Engine_KismetInputLibrary_GetUserIndex_Param
	{
	public:

		struct FKeyEvent Input; // 0x00(0x38)
		int32_t ReturnValue; // 0x38(0x04)
	};

	struct Function_Engine_KismetInputLibrary_GetKey_Param
	{
	public:

		struct FKeyEvent Input; // 0x00(0x38)
		struct FKey ReturnValue; // 0x38(0x18)
	};

	struct Function_Engine_KismetInputLibrary_GetAnalogValue_Param
	{
	public:

		struct FAnalogInputEvent Input; // 0x00(0x40)
		float ReturnValue; // 0x40(0x04)
	};

	struct Function_Engine_KismetInputLibrary_EqualEqual_KeyKey_Param
	{
	public:

		struct FKey A; // 0x00(0x18)
		struct FKey B; // 0x18(0x18)
		bool ReturnValue; // 0x30(0x01)
	};

	struct Function_Engine_KismetInputLibrary_EqualEqual_InputChordInputChord_Param
	{
	public:

		struct FInputChord A; // 0x00(0x20)
		struct FInputChord B; // 0x20(0x20)
		bool ReturnValue; // 0x40(0x01)
	};

	struct Function_Engine_KismetInputLibrary_CalibrateTilt_Param
	{
	public:

	};

	struct Function_Engine_KismetInternationalizationLibrary_SetCurrentLocale_Param
	{
	public:

		struct FString Culture; // 0x00(0x10)
		bool SaveToConfig; // 0x10(0x01)
		bool ReturnValue; // 0x11(0x01)
	};

	struct Function_Engine_KismetInternationalizationLibrary_SetCurrentLanguageAndLocale_Param
	{
	public:

		struct FString Culture; // 0x00(0x10)
		bool SaveToConfig; // 0x10(0x01)
		bool ReturnValue; // 0x11(0x01)
	};

	struct Function_Engine_KismetInternationalizationLibrary_SetCurrentLanguage_Param
	{
	public:

		struct FString Culture; // 0x00(0x10)
		bool SaveToConfig; // 0x10(0x01)
		bool ReturnValue; // 0x11(0x01)
	};

	struct Function_Engine_KismetInternationalizationLibrary_SetCurrentCulture_Param
	{
	public:

		struct FString Culture; // 0x00(0x10)
		bool SaveToConfig; // 0x10(0x01)
		bool ReturnValue; // 0x11(0x01)
	};

	struct Function_Engine_KismetInternationalizationLibrary_SetCurrentAssetGroupCulture_Param
	{
	public:

		struct FName AssetGroup; // 0x00(0x08)
		struct FString Culture; // 0x08(0x10)
		bool SaveToConfig; // 0x18(0x01)
		bool ReturnValue; // 0x19(0x01)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetSuitableCulture_Param
	{
	public:

		struct TArray<struct FString> AvailableCultures; // 0x00(0x10)
		struct FString CultureToMatch; // 0x10(0x10)
		struct FString FallbackCulture; // 0x20(0x10)
		struct FString ReturnValue; // 0x30(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetNativeCulture_Param
	{
	public:

		enum class ELocalizedTextSourceCategory TextCategory; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetLocalizedCultures_Param
	{
	public:

		bool IncludeGame; // 0x00(0x01)
		bool IncludeEngine; // 0x01(0x01)
		bool IncludeEditor; // 0x02(0x01)
		bool IncludeAdditional; // 0x03(0x01)
		char pad_4[0x4]; // 0x04(0x04)
		struct TArray<struct FString> ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetCurrentLocale_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetCurrentLanguage_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetCurrentCulture_Param
	{
	public:

		struct FString ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetCurrentAssetGroupCulture_Param
	{
	public:

		struct FName AssetGroup; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_GetCultureDisplayName_Param
	{
	public:

		struct FString Culture; // 0x00(0x10)
		bool Localized; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetInternationalizationLibrary_ClearCurrentAssetGroupCulture_Param
	{
	public:

		struct FName AssetGroup; // 0x00(0x08)
		bool SaveToConfig; // 0x08(0x01)
	};

	struct Function_Engine_KismetMaterialLibrary_SetVectorParameterValue_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMaterialParameterCollection* Collection; // 0x08(0x08)
		struct FName ParameterName; // 0x10(0x08)
		struct FLinearColor ParameterValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetMaterialLibrary_SetScalarParameterValue_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMaterialParameterCollection* Collection; // 0x08(0x08)
		struct FName ParameterName; // 0x10(0x08)
		float ParameterValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMaterialLibrary_GetVectorParameterValue_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMaterialParameterCollection* Collection; // 0x08(0x08)
		struct FName ParameterName; // 0x10(0x08)
		struct FLinearColor ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetMaterialLibrary_GetScalarParameterValue_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMaterialParameterCollection* Collection; // 0x08(0x08)
		struct FName ParameterName; // 0x10(0x08)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMaterialLibrary_CreateDynamicMaterialInstance_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UMaterialInterface* Parent; // 0x08(0x08)
		struct FName OptionalName; // 0x10(0x08)
		struct UMaterialInstanceDynamic* ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Xor_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Xor_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_WeightedMovingAverage_FVector_Param
	{
	public:

		struct FVector CurrentSample; // 0x00(0x0c)
		struct FVector PreviousSample; // 0x0c(0x0c)
		float Weight; // 0x18(0x04)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_WeightedMovingAverage_FRotator_Param
	{
	public:

		struct FRotator CurrentSample; // 0x00(0x0c)
		struct FRotator PreviousSample; // 0x0c(0x0c)
		float Weight; // 0x18(0x04)
		struct FRotator ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_WeightedMovingAverage_Float_Param
	{
	public:

		float CurrentSample; // 0x00(0x04)
		float PreviousSample; // 0x04(0x04)
		float Weight; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VSizeXYSquared_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VSizeXY_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VSizeSquared_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VSize2DSquared_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VSize2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VSize_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_VLerp_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		float Alpha; // 0x18(0x04)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_VInterpTo_Constant_Param
	{
	public:

		struct FVector Current; // 0x00(0x0c)
		struct FVector Target; // 0x0c(0x0c)
		float DeltaTime; // 0x18(0x04)
		float InterpSpeed; // 0x1c(0x04)
		struct FVector ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_VInterpTo_Param
	{
	public:

		struct FVector Current; // 0x00(0x0c)
		struct FVector Target; // 0x0c(0x0c)
		float DeltaTime; // 0x18(0x04)
		float InterpSpeed; // 0x1c(0x04)
		struct FVector ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_VectorSpringInterp_Param
	{
	public:

		struct FVector Current; // 0x00(0x0c)
		struct FVector Target; // 0x0c(0x0c)
		struct FVectorSpringState SpringState; // 0x18(0x18)
		float Stiffness; // 0x30(0x04)
		float CriticalDampingFactor; // 0x34(0x04)
		float DeltaTime; // 0x38(0x04)
		float Mass; // 0x3c(0x04)
		struct FVector ReturnValue; // 0x40(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Zero_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Up_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_UnwindEuler_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_UnitCartesianToSpherical_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ToRadians_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ToDegrees_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_SnappedToGrid_Param
	{
	public:

		struct FVector InVect; // 0x00(0x0c)
		float InGridSize; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Set_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float X; // 0x0c(0x04)
		float Y; // 0x10(0x04)
		float Z; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Right_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Reciprocal_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ProjectOnToNormal_Param
	{
	public:

		struct FVector V; // 0x00(0x0c)
		struct FVector InNormal; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_One_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_NormalUnsafe_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Normalize_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Tolerance; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Normal2D_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Tolerance; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_MirrorByPlane_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FPlane InPlane; // 0x10(0x10)
		struct FVector ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Left_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_IsZero_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector_IsUnit_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float SquaredLenthTolerance; // 0x0c(0x04)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector_IsUniform_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Tolerance; // 0x0c(0x04)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector_IsNormal_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector_IsNearlyZero_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Tolerance; // 0x0c(0x04)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector_IsNAN_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector_HeadingAngle_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_GetSignVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_GetProjection_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_GetAbsMin_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_GetAbsMax_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_GetAbs_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Forward_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Down_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_DistanceSquared_Param
	{
	public:

		struct FVector v1; // 0x00(0x0c)
		struct FVector v2; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Distance2DSquared_Param
	{
	public:

		struct FVector v1; // 0x00(0x0c)
		struct FVector v2; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Distance2D_Param
	{
	public:

		struct FVector v1; // 0x00(0x0c)
		struct FVector v2; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Distance_Param
	{
	public:

		struct FVector v1; // 0x00(0x0c)
		struct FVector v2; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_CosineAngle2D_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ComponentMin_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ComponentMax_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ClampSizeMax2D_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Max; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ClampSizeMax_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Max; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_ClampSize2D_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Min; // 0x0c(0x04)
		float Max; // 0x10(0x04)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_BoundedToCube_Param
	{
	public:

		struct FVector InVect; // 0x00(0x0c)
		float InRadius; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_BoundedToBox_Param
	{
	public:

		struct FVector InVect; // 0x00(0x0c)
		struct FVector InBoxMin; // 0x0c(0x0c)
		struct FVector InBoxMax; // 0x18(0x0c)
		struct FVector ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Backward_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_Assign_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector InVector; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Vector_AddBounded_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector InAddVect; // 0x0c(0x0c)
		float InRadius; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Zero_Param
	{
	public:

		struct FVector4 ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_SizeSquared3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_SizeSquared_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Size3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Size_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Set_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float X; // 0x10(0x04)
		float Y; // 0x14(0x04)
		float Z; // 0x18(0x04)
		float W; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_NormalUnsafe3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Normalize3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Normal3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
		char pad_14[0xc]; // 0x14(0x0c)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Negated_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_MirrorByVector3_Param
	{
	public:

		struct FVector4 Direction; // 0x00(0x10)
		struct FVector4 SurfaceNormal; // 0x10(0x10)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_IsZero_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_IsUnit3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float SquaredLenthTolerance; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_IsNormal3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_IsNearlyZero3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_IsNAN_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_DotProduct3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		float ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_DotProduct_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		float ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_CrossProduct3_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector4_Assign_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 InVector; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Vector2DInterpTo_Constant_Param
	{
	public:

		struct FVector2D Current; // 0x00(0x08)
		struct FVector2D Target; // 0x08(0x08)
		float DeltaTime; // 0x10(0x04)
		float InterpSpeed; // 0x14(0x04)
		struct FVector2D ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Vector2DInterpTo_Param
	{
	public:

		struct FVector2D Current; // 0x00(0x08)
		struct FVector2D Target; // 0x08(0x08)
		float DeltaTime; // 0x10(0x04)
		float InterpSpeed; // 0x14(0x04)
		struct FVector2D ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Vector2D_Zero_Param
	{
	public:

		struct FVector2D ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Vector2D_Unit45Deg_Param
	{
	public:

		struct FVector2D ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Vector2D_One_Param
	{
	public:

		struct FVector2D ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_VEase_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		float Alpha; // 0x18(0x04)
		enum class EEasingFunc EasingFunc; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		float BlendExp; // 0x20(0x04)
		int32_t Steps; // 0x24(0x04)
		struct FVector ReturnValue; // 0x28(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_UtcNow_Param
	{
	public:

		struct FDateTime ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_TransformRotation_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FRotator Rotation; // 0x30(0x0c)
		struct FRotator ReturnValue; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_TransformLocation_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FVector Location; // 0x30(0x0c)
		struct FVector ReturnValue; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_TransformDirection_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FVector Direction; // 0x30(0x0c)
		struct FVector ReturnValue; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Transform_Determinant_Param
	{
	public:

		struct FTransform Transform; // 0x00(0x30)
		float ReturnValue; // 0x30(0x04)
	};

	struct Function_Engine_KismetMathLibrary_ToSign2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_ToRounded2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_ToDirectionAndLength2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D OutDir; // 0x08(0x08)
		float OutLength; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Today_Param
	{
	public:

		struct FDateTime ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_TLerp_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform B; // 0x30(0x30)
		float Alpha; // 0x60(0x04)
		enum class ELerpInterpolationMode InterpMode; // 0x64(0x01)
		char pad_65[0xb]; // 0x65(0x0b)
		struct FTransform ReturnValue; // 0x70(0x30)
	};

	struct Function_Engine_KismetMathLibrary_TInterpTo_Param
	{
	public:

		struct FTransform Current; // 0x00(0x30)
		struct FTransform Target; // 0x30(0x30)
		float DeltaTime; // 0x60(0x04)
		float InterpSpeed; // 0x64(0x04)
		char pad_68[0x8]; // 0x68(0x08)
		struct FTransform ReturnValue; // 0x70(0x30)
	};

	struct Function_Engine_KismetMathLibrary_TimespanZeroValue_Param
	{
	public:

		struct FTimespan ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_TimespanRatio_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_TimespanMinValue_Param
	{
	public:

		struct FTimespan ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_TimespanMaxValue_Param
	{
	public:

		struct FTimespan ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_TimespanFromString_Param
	{
	public:

		struct FString TimespanString; // 0x00(0x10)
		struct FTimespan Result; // 0x10(0x08)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetMathLibrary_TEase_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform B; // 0x30(0x30)
		float Alpha; // 0x60(0x04)
		enum class EEasingFunc EasingFunc; // 0x64(0x01)
		char pad_65[0x3]; // 0x65(0x03)
		float BlendExp; // 0x68(0x04)
		int32_t Steps; // 0x6c(0x04)
		struct FTransform ReturnValue; // 0x70(0x30)
	};

	struct Function_Engine_KismetMathLibrary_Tan_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_VectorInt_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		int32_t B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_VectorFloat_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		struct FVector2D ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_Vector2DFloat_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float B; // 0x08(0x04)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		struct FTimespan ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_QuatQuat_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
		struct FQuat ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_LinearColorLinearColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		struct FLinearColor ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_DateTimeTimespan_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		struct FDateTime ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		struct FTimespan ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Subtract_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Square_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Sqrt_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Spherical2DToUnitCartesian_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector ReturnValue; // 0x08(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Sin_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_SignOfInteger64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_SignOfInteger_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_SignOfFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_SetRandomStreamSeed_Param
	{
	public:

		struct FRandomStream Stream; // 0x00(0x08)
		int32_t NewSeed; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Set2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float X; // 0x08(0x04)
		float Y; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_SelectVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		bool bPickA; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_SelectTransform_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform B; // 0x30(0x30)
		bool bPickA; // 0x60(0x01)
		char pad_61[0xf]; // 0x61(0x0f)
		struct FTransform ReturnValue; // 0x70(0x30)
	};

	struct Function_Engine_KismetMathLibrary_SelectString_Param
	{
	public:

		struct FString A; // 0x00(0x10)
		struct FString B; // 0x10(0x10)
		bool bPickA; // 0x20(0x01)
		char pad_21[0x7]; // 0x21(0x07)
		struct FString ReturnValue; // 0x28(0x10)
	};

	struct Function_Engine_KismetMathLibrary_SelectRotator_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		bool bPickA; // 0x18(0x01)
		char pad_19[0x3]; // 0x19(0x03)
		struct FRotator ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_SelectObject_Param
	{
	public:

		struct UObject* A; // 0x00(0x08)
		struct UObject* B; // 0x08(0x08)
		bool bSelectA; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct UObject* ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_SelectInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool bPickA; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_SelectFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool bPickA; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_SelectColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		bool bPickA; // 0x20(0x01)
		char pad_21[0x3]; // 0x21(0x03)
		struct FLinearColor ReturnValue; // 0x24(0x10)
	};

	struct Function_Engine_KismetMathLibrary_SelectClass_Param
	{
	public:

		struct UClass* A; // 0x00(0x08)
		struct UClass* B; // 0x08(0x08)
		bool bSelectA; // 0x10(0x01)
		char pad_11[0x7]; // 0x11(0x07)
		struct UClass* ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_SeedRandomStream_Param
	{
	public:

		struct FRandomStream Stream; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_SafeDivide_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Round64_Param
	{
	public:

		float A; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Round_Param
	{
	public:

		float A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RotatorFromAxisAndAngle_Param
	{
	public:

		struct FVector Axis; // 0x00(0x0c)
		float Angle; // 0x0c(0x04)
		struct FRotator ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RotateAngleAxis_Param
	{
	public:

		struct FVector InVect; // 0x00(0x0c)
		float AngleDeg; // 0x0c(0x04)
		struct FVector Axis; // 0x10(0x0c)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RLerp_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		float Alpha; // 0x18(0x04)
		bool bShortestPath; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FRotator ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RInterpTo_Constant_Param
	{
	public:

		struct FRotator Current; // 0x00(0x0c)
		struct FRotator Target; // 0x0c(0x0c)
		float DeltaTime; // 0x18(0x04)
		float InterpSpeed; // 0x1c(0x04)
		struct FRotator ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RInterpTo_Param
	{
	public:

		struct FRotator Current; // 0x00(0x0c)
		struct FRotator Target; // 0x0c(0x0c)
		float DeltaTime; // 0x18(0x04)
		float InterpSpeed; // 0x1c(0x04)
		struct FRotator ReturnValue; // 0x20(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RGBToHSV_Vector_Param
	{
	public:

		struct FLinearColor RGB; // 0x00(0x10)
		struct FLinearColor HSV; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_RGBToHSV_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float H; // 0x10(0x04)
		float S; // 0x14(0x04)
		float V; // 0x18(0x04)
		float A; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RGBLinearToHSV_Param
	{
	public:

		struct FLinearColor RGB; // 0x00(0x10)
		struct FLinearColor ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_ResetVectorSpringState_Param
	{
	public:

		struct FVectorSpringState SpringState; // 0x00(0x18)
	};

	struct Function_Engine_KismetMathLibrary_ResetRandomStream_Param
	{
	public:

		struct FRandomStream Stream; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_ResetFloatSpringState_Param
	{
	public:

		struct FFloatSpringState SpringState; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_REase_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		float Alpha; // 0x18(0x04)
		bool bShortestPath; // 0x1c(0x01)
		enum class EEasingFunc EasingFunc; // 0x1d(0x01)
		char pad_1E[0x2]; // 0x1e(0x02)
		float BlendExp; // 0x20(0x04)
		int32_t Steps; // 0x24(0x04)
		struct FRotator ReturnValue; // 0x28(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInEllipticalConeInRadiansFromStream_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float MaxYawInRadians; // 0x0c(0x04)
		float MaxPitchInRadians; // 0x10(0x04)
		struct FRandomStream Stream; // 0x14(0x08)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInEllipticalConeInRadians_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float MaxYawInRadians; // 0x0c(0x04)
		float MaxPitchInRadians; // 0x10(0x04)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInEllipticalConeInDegreesFromStream_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float MaxYawInDegrees; // 0x0c(0x04)
		float MaxPitchInDegrees; // 0x10(0x04)
		struct FRandomStream Stream; // 0x14(0x08)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInEllipticalConeInDegrees_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float MaxYawInDegrees; // 0x0c(0x04)
		float MaxPitchInDegrees; // 0x10(0x04)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInConeInRadiansFromStream_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float ConeHalfAngleInRadians; // 0x0c(0x04)
		struct FRandomStream Stream; // 0x10(0x08)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInConeInRadians_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float ConeHalfAngleInRadians; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInConeInDegreesFromStream_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float ConeHalfAngleInDegrees; // 0x0c(0x04)
		struct FRandomStream Stream; // 0x10(0x08)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorInConeInDegrees_Param
	{
	public:

		struct FVector ConeDir; // 0x00(0x0c)
		float ConeHalfAngleInDegrees; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVectorFromStream_Param
	{
	public:

		struct FRandomStream Stream; // 0x00(0x08)
		struct FVector ReturnValue; // 0x08(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomUnitVector_Param
	{
	public:

		struct FVector ReturnValue; // 0x00(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomRotatorFromStream_Param
	{
	public:

		bool bRoll; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FRandomStream Stream; // 0x04(0x08)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomRotator_Param
	{
	public:

		bool bRoll; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		struct FRotator ReturnValue; // 0x04(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomPointInBoundingBox_Param
	{
	public:

		struct FVector Origin; // 0x00(0x0c)
		struct FVector BoxExtent; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_RandomIntegerInRangeFromStream_Param
	{
	public:

		int32_t Min; // 0x00(0x04)
		int32_t Max; // 0x04(0x04)
		struct FRandomStream Stream; // 0x08(0x08)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomIntegerInRange_Param
	{
	public:

		int32_t Min; // 0x00(0x04)
		int32_t Max; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomIntegerFromStream_Param
	{
	public:

		int32_t Max; // 0x00(0x04)
		struct FRandomStream Stream; // 0x04(0x08)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomInteger64InRange_Param
	{
	public:

		int64_t Min; // 0x00(0x08)
		int64_t Max; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_RandomInteger64_Param
	{
	public:

		int64_t Max; // 0x00(0x08)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_RandomInteger_Param
	{
	public:

		int32_t Max; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomFloatInRangeFromStream_Param
	{
	public:

		float Min; // 0x00(0x04)
		float Max; // 0x04(0x04)
		struct FRandomStream Stream; // 0x08(0x08)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomFloatInRange_Param
	{
	public:

		float Min; // 0x00(0x04)
		float Max; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomFloatFromStream_Param
	{
	public:

		struct FRandomStream Stream; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomFloat_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_KismetMathLibrary_RandomBoolWithWeightFromStream_Param
	{
	public:

		float Weight; // 0x00(0x04)
		struct FRandomStream RandomStream; // 0x04(0x08)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_RandomBoolWithWeight_Param
	{
	public:

		float Weight; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_Engine_KismetMathLibrary_RandomBoolFromStream_Param
	{
	public:

		struct FRandomStream Stream; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_RandomBool_Param
	{
	public:

		bool ReturnValue; // 0x00(0x01)
	};

	struct Function_Engine_KismetMathLibrary_RadiansToDegrees_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Quat_VectorUp_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_VectorRight_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_VectorForward_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_UnrotateVector_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector V; // 0x10(0x0c)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_SizeSquared_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Size_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Quat_SetFromEuler_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector Euler; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_SetComponents_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float X; // 0x10(0x04)
		float Y; // 0x14(0x04)
		float Z; // 0x18(0x04)
		float W; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Rotator_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FRotator ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_RotateVector_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector V; // 0x10(0x0c)
		struct FVector ReturnValue; // 0x1c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Normalized_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
		char pad_14[0xc]; // 0x14(0x0c)
		struct FQuat ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Normalize_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Quat_MakeFromEuler_Param
	{
	public:

		struct FVector Euler; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FQuat ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Log_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FQuat ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_IsNormalized_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Quat_IsNonFinite_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Quat_IsIdentity_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Quat_IsFinite_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Inversed_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FQuat ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Identity_Param
	{
	public:

		struct FQuat ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_GetRotationAxis_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_GetAxisZ_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_GetAxisY_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_GetAxisX_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_GetAngle_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Exp_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FQuat ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_Euler_Param
	{
	public:

		struct FQuat Q; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Quat_EnforceShortestArcWith_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Quat_AngularDistance_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
		float ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_KismetMathLibrary_ProjectVectorOnToVector_Param
	{
	public:

		struct FVector V; // 0x00(0x0c)
		struct FVector Target; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_ProjectVectorOnToPlane_Param
	{
	public:

		struct FVector V; // 0x00(0x0c)
		struct FVector PlaneNormal; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_ProjectPointOnToPlane_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector PlaneBase; // 0x0c(0x0c)
		struct FVector PlaneNormal; // 0x18(0x0c)
		struct FVector ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_PointsAreCoplanar_Param
	{
	public:

		struct TArray<struct FVector> Points; // 0x00(0x10)
		float Tolerance; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_PerlinNoise1D_Param
	{
	public:

		float Value; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Percent_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Percent_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Percent_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Or_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Or_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Now_Param
	{
	public:

		struct FDateTime ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_NotEqualExactly_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqualExactly_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqualExactly_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		float ErrorTolerance; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		float ErrorTolerance; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		float ErrorTolerance; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_RotatorRotator_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		float ErrorTolerance; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_QuatQuat_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
		float ErrorTolerance; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_ObjectObject_Param
	{
	public:

		struct UObject* A; // 0x00(0x08)
		struct UObject* B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_NameName_Param
	{
	public:

		struct FName A; // 0x00(0x08)
		struct FName B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_MatrixMatrix_Param
	{
	public:

		struct FMatrix A; // 0x00(0x40)
		struct FMatrix B; // 0x40(0x40)
		float Tolerance; // 0x80(0x04)
		bool ReturnValue; // 0x84(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_LinearColorLinearColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_ClassClass_Param
	{
	public:

		struct UClass* A; // 0x00(0x08)
		struct UClass* B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NotEqual_BoolBool_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Not_PreBool_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool ReturnValue; // 0x01(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Not_Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Not_Int_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_NormalSafe2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float Tolerance; // 0x08(0x04)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_NormalizeToRange_Param
	{
	public:

		float Value; // 0x00(0x04)
		float RangeMin; // 0x04(0x04)
		float RangeMax; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_NormalizedDeltaRotator_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_NormalizeAxis_Param
	{
	public:

		float Angle; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Normalize2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float Tolerance; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Normal2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Normal_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Tolerance; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_NegateVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_NegateRotator_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Negated2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_NearlyEqual_TransformTransform_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform B; // 0x30(0x30)
		float LocationTolerance; // 0x60(0x04)
		float RotationTolerance; // 0x64(0x04)
		float Scale3DTolerance; // 0x68(0x04)
		bool ReturnValue; // 0x6c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_NearlyEqual_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ErrorTolerance; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_MultiplyMultiply_FloatFloat_Param
	{
	public:

		float Base; // 0x00(0x04)
		float Exp; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MultiplyByPi_Param
	{
	public:

		float Value; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_VectorInt_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		int32_t B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_VectorFloat_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		struct FVector2D ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_Vector2DFloat_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float B; // 0x08(0x04)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_TimespanFloat_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float Scalar; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTimespan ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_RotatorInt_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		int32_t B; // 0x0c(0x04)
		struct FRotator ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_RotatorFloat_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		float B; // 0x0c(0x04)
		struct FRotator ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_QuatQuat_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
		struct FQuat ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_MatrixMatrix_Param
	{
	public:

		struct FMatrix A; // 0x00(0x40)
		struct FMatrix B; // 0x40(0x40)
		struct FMatrix ReturnValue; // 0x80(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_MatrixFloat_Param
	{
	public:

		struct FMatrix A; // 0x00(0x40)
		float B; // 0x40(0x04)
		char pad_44[0xc]; // 0x44(0x0c)
		struct FMatrix ReturnValue; // 0x50(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_LinearColorLinearColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		struct FLinearColor ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_LinearColorFloat_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		float B; // 0x10(0x04)
		struct FLinearColor ReturnValue; // 0x14(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_IntFloat_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Multiply_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_MirrorVectorByNormal_Param
	{
	public:

		struct FVector InVect; // 0x00(0x0c)
		struct FVector InNormal; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MinOfIntArray_Param
	{
	public:

		struct TArray<int32_t> IntArray; // 0x00(0x10)
		int32_t IndexOfMinValue; // 0x10(0x04)
		int32_t MinValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MinOfFloatArray_Param
	{
	public:

		struct TArray<float> FloatArray; // 0x00(0x10)
		int32_t IndexOfMinValue; // 0x10(0x04)
		float MinValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MinOfByteArray_Param
	{
	public:

		struct TArray<char> ByteArray; // 0x00(0x10)
		int32_t IndexOfMinValue; // 0x10(0x04)
		char MinValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_MinInt64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MinimumAreaRectangle_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct TArray<struct FVector> InVerts; // 0x08(0x10)
		struct FVector SampleSurfaceNormal; // 0x18(0x0c)
		struct FVector OutRectCenter; // 0x24(0x0c)
		struct FRotator OutRectRotation; // 0x30(0x0c)
		float OutSideLengthX; // 0x3c(0x04)
		float OutSideLengthY; // 0x40(0x04)
		bool bDebugDraw; // 0x44(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Min_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MaxOfIntArray_Param
	{
	public:

		struct TArray<int32_t> IntArray; // 0x00(0x10)
		int32_t IndexOfMaxValue; // 0x10(0x04)
		int32_t MaxValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MaxOfFloatArray_Param
	{
	public:

		struct TArray<float> FloatArray; // 0x00(0x10)
		int32_t IndexOfMaxValue; // 0x10(0x04)
		float MaxValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MaxOfByteArray_Param
	{
	public:

		struct TArray<char> ByteArray; // 0x00(0x10)
		int32_t IndexOfMaxValue; // 0x10(0x04)
		char MaxValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_MaxInt64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Max_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_TransformVector4_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector4 V; // 0x40(0x10)
		struct FVector4 ReturnValue; // 0x50(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_TransformVector_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector V; // 0x40(0x0c)
		char pad_4C[0x4]; // 0x4c(0x04)
		struct FVector4 ReturnValue; // 0x50(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_TransformPosition_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector V; // 0x40(0x0c)
		char pad_4C[0x4]; // 0x4c(0x04)
		struct FVector4 ReturnValue; // 0x50(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_ToQuat_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FQuat ReturnValue; // 0x40(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_SetOrigin_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector NewOrigin; // 0x40(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_SetColumn_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		enum class EMatrixColumns Column; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		struct FVector Value; // 0x44(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_SetAxis_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		enum class EAxis Axis; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		struct FVector AxisVector; // 0x44(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_ScaleTranslation_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector Scale3D; // 0x40(0x0c)
		char pad_4C[0x4]; // 0x4c(0x04)
		struct FMatrix ReturnValue; // 0x50(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_RemoveTranslation_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FMatrix ReturnValue; // 0x40(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_RemoveScaling_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float Tolerance; // 0x40(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_Mirror_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		enum class EAxis MirrorAxis; // 0x40(0x01)
		enum class EAxis FlipAxis; // 0x41(0x01)
		char pad_42[0xe]; // 0x42(0x0e)
		struct FMatrix ReturnValue; // 0x50(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_InverseTransformVector_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector V; // 0x40(0x0c)
		struct FVector ReturnValue; // 0x4c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_InverseTransformPosition_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector V; // 0x40(0x0c)
		struct FVector ReturnValue; // 0x4c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_Identity_Param
	{
	public:

		struct FMatrix ReturnValue; // 0x00(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetUnitAxis_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		enum class EAxis Axis; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		struct FVector ReturnValue; // 0x44(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetUnitAxes_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector X; // 0x40(0x0c)
		struct FVector Y; // 0x4c(0x0c)
		struct FVector Z; // 0x58(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetTransposed_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FMatrix ReturnValue; // 0x40(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetTransposeAdjoint_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FMatrix ReturnValue; // 0x40(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetScaleVector_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float Tolerance; // 0x40(0x04)
		struct FVector ReturnValue; // 0x44(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetScaledAxis_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		enum class EAxis Axis; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		struct FVector ReturnValue; // 0x44(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetScaledAxes_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector X; // 0x40(0x0c)
		struct FVector Y; // 0x4c(0x0c)
		struct FVector Z; // 0x58(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetRotDeterminant_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float ReturnValue; // 0x40(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetRotator_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FRotator ReturnValue; // 0x40(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetOrigin_Param
	{
	public:

		struct FMatrix InMatrix; // 0x00(0x40)
		struct FVector ReturnValue; // 0x40(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetMaximumAxisScale_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float ReturnValue; // 0x40(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetMatrixWithoutScale_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float Tolerance; // 0x40(0x04)
		char pad_44[0xc]; // 0x44(0x0c)
		struct FMatrix ReturnValue; // 0x50(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetInverse_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FMatrix ReturnValue; // 0x40(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetFrustumTopPlane_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FPlane OutPlane; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetFrustumRightPlane_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FPlane OutPlane; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetFrustumNearPlane_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FPlane OutPlane; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetFrustumLeftPlane_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FPlane OutPlane; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetFrustumFarPlane_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FPlane OutPlane; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetFrustumBottomPlane_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FPlane OutPlane; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetDeterminant_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float ReturnValue; // 0x40(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_GetColumn_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		enum class EMatrixColumns Column; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		struct FVector ReturnValue; // 0x44(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_ContainsNaN_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		bool ReturnValue; // 0x40(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_ConcatenateTranslation_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		struct FVector translation; // 0x40(0x0c)
		char pad_4C[0x4]; // 0x4c(0x04)
		struct FMatrix ReturnValue; // 0x50(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Matrix_ApplyScale_Param
	{
	public:

		struct FMatrix M; // 0x00(0x40)
		float Scale; // 0x40(0x04)
		char pad_44[0xc]; // 0x44(0x0c)
		struct FMatrix ReturnValue; // 0x50(0x40)
	};

	struct Function_Engine_KismetMathLibrary_MapRangeUnclamped_Param
	{
	public:

		float Value; // 0x00(0x04)
		float InRangeA; // 0x04(0x04)
		float InRangeB; // 0x08(0x04)
		float OutRangeA; // 0x0c(0x04)
		float OutRangeB; // 0x10(0x04)
		float ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MapRangeClamped_Param
	{
	public:

		float Value; // 0x00(0x04)
		float InRangeA; // 0x04(0x04)
		float InRangeB; // 0x08(0x04)
		float OutRangeA; // 0x0c(0x04)
		float OutRangeB; // 0x10(0x04)
		float ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MakeVector4_Param
	{
	public:

		float X; // 0x00(0x04)
		float Y; // 0x04(0x04)
		float Z; // 0x08(0x04)
		float W; // 0x0c(0x04)
		struct FVector4 ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_MakeVector2D_Param
	{
	public:

		float X; // 0x00(0x04)
		float Y; // 0x04(0x04)
		struct FVector2D ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MakeVector_Param
	{
	public:

		float X; // 0x00(0x04)
		float Y; // 0x04(0x04)
		float Z; // 0x08(0x04)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeTransform_Param
	{
	public:

		struct FVector Location; // 0x00(0x0c)
		struct FRotator Rotation; // 0x0c(0x0c)
		struct FVector Scale; // 0x18(0x0c)
		char pad_24[0xc]; // 0x24(0x0c)
		struct FTransform ReturnValue; // 0x30(0x30)
	};

	struct Function_Engine_KismetMathLibrary_MakeTimespan2_Param
	{
	public:

		int32_t Days; // 0x00(0x04)
		int32_t Hours; // 0x04(0x04)
		int32_t Minutes; // 0x08(0x04)
		int32_t Seconds; // 0x0c(0x04)
		int32_t FractionNano; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FTimespan ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MakeTimespan_Param
	{
	public:

		int32_t Days; // 0x00(0x04)
		int32_t Hours; // 0x04(0x04)
		int32_t Minutes; // 0x08(0x04)
		int32_t Seconds; // 0x0c(0x04)
		int32_t Milliseconds; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FTimespan ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromZY_Param
	{
	public:

		struct FVector Z; // 0x00(0x0c)
		struct FVector Y; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromZX_Param
	{
	public:

		struct FVector Z; // 0x00(0x0c)
		struct FVector X; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromZ_Param
	{
	public:

		struct FVector Z; // 0x00(0x0c)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromYZ_Param
	{
	public:

		struct FVector Y; // 0x00(0x0c)
		struct FVector Z; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromYX_Param
	{
	public:

		struct FVector Y; // 0x00(0x0c)
		struct FVector X; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromY_Param
	{
	public:

		struct FVector Y; // 0x00(0x0c)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromXZ_Param
	{
	public:

		struct FVector X; // 0x00(0x0c)
		struct FVector Z; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromXY_Param
	{
	public:

		struct FVector X; // 0x00(0x0c)
		struct FVector Y; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotFromX_Param
	{
	public:

		struct FVector X; // 0x00(0x0c)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotator_Param
	{
	public:

		float Roll; // 0x00(0x04)
		float Pitch; // 0x04(0x04)
		float Yaw; // 0x08(0x04)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRotationFromAxes_Param
	{
	public:

		struct FVector Forward; // 0x00(0x0c)
		struct FVector Right; // 0x0c(0x0c)
		struct FVector Up; // 0x18(0x0c)
		struct FRotator ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_MakeRelativeTransform_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform RelativeTo; // 0x30(0x30)
		struct FTransform ReturnValue; // 0x60(0x30)
	};

	struct Function_Engine_KismetMathLibrary_MakeRandomStream_Param
	{
	public:

		int32_t InitialSeed; // 0x00(0x04)
		struct FRandomStream ReturnValue; // 0x04(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MakeQualifiedFrameTime_Param
	{
	public:

		struct FFrameNumber Frame; // 0x00(0x04)
		struct FFrameRate FrameRate; // 0x04(0x08)
		float SubFrame; // 0x0c(0x04)
		struct FQualifiedFrameTime ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_MakePulsatingValue_Param
	{
	public:

		float InCurrentTime; // 0x00(0x04)
		float InPulsesPerSecond; // 0x04(0x04)
		float InPhase; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_MakePlaneFromPointAndNormal_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector Normal; // 0x0c(0x0c)
		char pad_18[0x8]; // 0x18(0x08)
		struct FPlane ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_MakeFrameRate_Param
	{
	public:

		int32_t Numerator; // 0x00(0x04)
		int32_t Denominator; // 0x04(0x04)
		struct FFrameRate ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MakeDateTime_Param
	{
	public:

		int32_t Year; // 0x00(0x04)
		int32_t Month; // 0x04(0x04)
		int32_t Day; // 0x08(0x04)
		int32_t Hour; // 0x0c(0x04)
		int32_t Minute; // 0x10(0x04)
		int32_t Second; // 0x14(0x04)
		int32_t Millisecond; // 0x18(0x04)
		char pad_1C[0x4]; // 0x1c(0x04)
		struct FDateTime ReturnValue; // 0x20(0x08)
	};

	struct Function_Engine_KismetMathLibrary_MakeColor_Param
	{
	public:

		float R; // 0x00(0x04)
		float G; // 0x04(0x04)
		float B; // 0x08(0x04)
		float A; // 0x0c(0x04)
		struct FLinearColor ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_MakeBox2D_Param
	{
	public:

		struct FVector2D Min; // 0x00(0x08)
		struct FVector2D Max; // 0x08(0x08)
		struct FBox2D ReturnValue; // 0x10(0x14)
	};

	struct Function_Engine_KismetMathLibrary_MakeBox_Param
	{
	public:

		struct FVector Min; // 0x00(0x0c)
		struct FVector Max; // 0x0c(0x0c)
		struct FBox ReturnValue; // 0x18(0x1c)
	};

	struct Function_Engine_KismetMathLibrary_Loge_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Log_Param
	{
	public:

		float A; // 0x00(0x04)
		float Base; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinePlaneIntersection_OriginNormal_Param
	{
	public:

		struct FVector LineStart; // 0x00(0x0c)
		struct FVector LineEnd; // 0x0c(0x0c)
		struct FVector PlaneOrigin; // 0x18(0x0c)
		struct FVector PlaneNormal; // 0x24(0x0c)
		float T; // 0x30(0x04)
		struct FVector Intersection; // 0x34(0x0c)
		bool ReturnValue; // 0x40(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LinePlaneIntersection_Param
	{
	public:

		struct FVector LineStart; // 0x00(0x0c)
		struct FVector LineEnd; // 0x0c(0x0c)
		char pad_18[0x8]; // 0x18(0x08)
		struct FPlane APlane; // 0x20(0x10)
		float T; // 0x30(0x04)
		struct FVector Intersection; // 0x34(0x0c)
		bool ReturnValue; // 0x40(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LinearColorLerpUsingHSV_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		float Alpha; // 0x20(0x04)
		struct FLinearColor ReturnValue; // 0x24(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColorLerp_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		float Alpha; // 0x20(0x04)
		struct FLinearColor ReturnValue; // 0x24(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Yellow_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_White_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Transparent_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_ToRGBE_Param
	{
	public:

		struct FLinearColor InLinearColor; // 0x00(0x10)
		struct FColor ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_ToNewOpacity_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float InOpacity; // 0x10(0x04)
		struct FLinearColor ReturnValue; // 0x14(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_SetTemperature_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
		float InTemperature; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_SetRGBA_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
		float R; // 0x10(0x04)
		float G; // 0x14(0x04)
		float B; // 0x18(0x04)
		float A; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_SetRandomHue_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_SetFromSRGB_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
		struct FColor InSRGB; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_SetFromPow22_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
		struct FColor InColor; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_SetFromHSV_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
		float H; // 0x10(0x04)
		float S; // 0x14(0x04)
		float V; // 0x18(0x04)
		float A; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Set_Param
	{
	public:

		struct FLinearColor InOutColor; // 0x00(0x10)
		struct FLinearColor InColor; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Red_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_QuantizeRound_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		struct FColor ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Quantize_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		struct FColor ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_IsNearEqual_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		float Tolerance; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Green_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Gray_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_GetMin_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_GetMax_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_GetLuminance_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Distance_Param
	{
	public:

		struct FLinearColor C1; // 0x00(0x10)
		struct FLinearColor C2; // 0x10(0x10)
		float ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Desaturated_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float InDesaturation; // 0x10(0x04)
		struct FLinearColor ReturnValue; // 0x14(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Blue_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LinearColor_Black_Param
	{
	public:

		struct FLinearColor ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetMathLibrary_LessLess_VectorRotator_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_LessEqual_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LessEqual_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LessEqual_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LessEqual_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LessEqual_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_LessEqual_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Less_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Less_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Less_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Less_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Less_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Less_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Lerp_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float Alpha; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_IsZero2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_IsPointInBoxWithTransform_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTransform BoxWorldTransform; // 0x10(0x30)
		struct FVector BoxExtent; // 0x40(0x0c)
		bool ReturnValue; // 0x4c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_IsPointInBox_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector BoxOrigin; // 0x0c(0x0c)
		struct FVector BoxExtent; // 0x18(0x0c)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_Engine_KismetMathLibrary_IsNearlyZero2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float Tolerance; // 0x08(0x04)
		bool ReturnValue; // 0x0c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_IsMorning_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_IsLeapYear_Param
	{
	public:

		int32_t Year; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_Engine_KismetMathLibrary_IsAfternoon_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_InvertTransform_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FTransform ReturnValue; // 0x30(0x30)
	};

	struct Function_Engine_KismetMathLibrary_InverseTransformRotation_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FRotator Rotation; // 0x30(0x0c)
		struct FRotator ReturnValue; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_InverseTransformLocation_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FVector Location; // 0x30(0x0c)
		struct FVector ReturnValue; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_InverseTransformDirection_Param
	{
	public:

		struct FTransform T; // 0x00(0x30)
		struct FVector Direction; // 0x30(0x0c)
		struct FVector ReturnValue; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_InRange_IntInt_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
		int32_t Min; // 0x04(0x04)
		int32_t Max; // 0x08(0x04)
		bool InclusiveMin; // 0x0c(0x01)
		bool InclusiveMax; // 0x0d(0x01)
		bool ReturnValue; // 0x0e(0x01)
	};

	struct Function_Engine_KismetMathLibrary_InRange_Int64Int64_Param
	{
	public:

		int64_t Value; // 0x00(0x08)
		int64_t Min; // 0x08(0x08)
		int64_t Max; // 0x10(0x08)
		bool InclusiveMin; // 0x18(0x01)
		bool InclusiveMax; // 0x19(0x01)
		bool ReturnValue; // 0x1a(0x01)
	};

	struct Function_Engine_KismetMathLibrary_InRange_FloatFloat_Param
	{
	public:

		float Value; // 0x00(0x04)
		float Min; // 0x04(0x04)
		float Max; // 0x08(0x04)
		bool InclusiveMin; // 0x0c(0x01)
		bool InclusiveMax; // 0x0d(0x01)
		bool ReturnValue; // 0x0e(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Hypotenuse_Param
	{
	public:

		float Width; // 0x00(0x04)
		float Height; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_HSVToRGBLinear_Param
	{
	public:

		struct FLinearColor HSV; // 0x00(0x10)
		struct FLinearColor ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_HSVToRGB_Vector_Param
	{
	public:

		struct FLinearColor HSV; // 0x00(0x10)
		struct FLinearColor RGB; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_HSVToRGB_Param
	{
	public:

		float H; // 0x00(0x04)
		float S; // 0x04(0x04)
		float V; // 0x08(0x04)
		float A; // 0x0c(0x04)
		struct FLinearColor ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_GridSnap_Float_Param
	{
	public:

		float Location; // 0x00(0x04)
		float GridSize; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GreaterGreater_VectorRotator_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GreaterEqual_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_GreaterEqual_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_GreaterEqual_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_GreaterEqual_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_GreaterEqual_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_GreaterEqual_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Greater_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Greater_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Greater_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Greater_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Greater_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Greater_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_GetYear_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetYawPitchFromVector_Param
	{
	public:

		struct FVector InVec; // 0x00(0x0c)
		float Yaw; // 0x0c(0x04)
		float Pitch; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetVectorArrayAverage_Param
	{
	public:

		struct TArray<struct FVector> Vectors; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetUpVector_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetTotalSeconds_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetTotalMinutes_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetTotalMilliseconds_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetTotalHours_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetTotalDays_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetTimeOfDay_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_GetTAU_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetSlopeDegreeAngles_Param
	{
	public:

		struct FVector MyRightYAxis; // 0x00(0x0c)
		struct FVector FloorNormal; // 0x0c(0x0c)
		struct FVector UpVector; // 0x18(0x0c)
		float OutSlopePitchDegreeAngle; // 0x24(0x04)
		float OutSlopeRollDegreeAngle; // 0x28(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetSeconds_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetSecond_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetRotated2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float AngleDeg; // 0x08(0x04)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_GetRightVector_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetReflectionVector_Param
	{
	public:

		struct FVector Direction; // 0x00(0x0c)
		struct FVector SurfaceNormal; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetPointDistanceToSegment_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector SegmentStart; // 0x0c(0x0c)
		struct FVector SegmentEnd; // 0x18(0x0c)
		float ReturnValue; // 0x24(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetPointDistanceToLine_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector LineOrigin; // 0x0c(0x0c)
		struct FVector LineDirection; // 0x18(0x0c)
		float ReturnValue; // 0x24(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetPI_Param
	{
	public:

		float ReturnValue; // 0x00(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMonth_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMinutes_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMinute_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMinElement_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMin2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMilliseconds_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMillisecond_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMaxElement_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetMax2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetHours_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetHour12_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetHour_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetForwardVector_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetDuration_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_GetDirectionUnitVector_Param
	{
	public:

		struct FVector From; // 0x00(0x0c)
		struct FVector To; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetDays_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetDayOfYear_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetDay_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetDate_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_GetAzimuthAndElevation_Param
	{
	public:

		struct FVector InDirection; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTransform ReferenceFrame; // 0x10(0x30)
		float Azimuth; // 0x40(0x04)
		float Elevation; // 0x44(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetAxes_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FVector X; // 0x0c(0x0c)
		struct FVector Y; // 0x18(0x0c)
		struct FVector Z; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_GetAbsMax2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_GetAbs2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FTruncVector_Param
	{
	public:

		struct FVector InVector; // 0x00(0x0c)
		struct FIntVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_FTrunc64_Param
	{
	public:

		float A; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FTrunc_Param
	{
	public:

		float A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FromSeconds_Param
	{
	public:

		float Seconds; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FromMinutes_Param
	{
	public:

		float Minutes; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FromMilliseconds_Param
	{
	public:

		float Milliseconds; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FromHours_Param
	{
	public:

		float Hours; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FromDays_Param
	{
	public:

		float Days; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FTimespan ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Fraction_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FMod_Param
	{
	public:

		float Dividend; // 0x00(0x04)
		float Divisor; // 0x04(0x04)
		float Remainder; // 0x08(0x04)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FMin_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FMax_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FloatSpringInterp_Param
	{
	public:

		float Current; // 0x00(0x04)
		float Target; // 0x04(0x04)
		struct FFloatSpringState SpringState; // 0x08(0x08)
		float Stiffness; // 0x10(0x04)
		float CriticalDampingFactor; // 0x14(0x04)
		float DeltaTime; // 0x18(0x04)
		float Mass; // 0x1c(0x04)
		float ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FixedTurn_Param
	{
	public:

		float InCurrent; // 0x00(0x04)
		float InDesired; // 0x04(0x04)
		float InDeltaRate; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FInterpTo_Constant_Param
	{
	public:

		float Current; // 0x00(0x04)
		float Target; // 0x04(0x04)
		float DeltaTime; // 0x08(0x04)
		float InterpSpeed; // 0x0c(0x04)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FInterpTo_Param
	{
	public:

		float Current; // 0x00(0x04)
		float Target; // 0x04(0x04)
		float DeltaTime; // 0x08(0x04)
		float InterpSpeed; // 0x0c(0x04)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FInterpEaseInOut_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float Alpha; // 0x08(0x04)
		float Exponent; // 0x0c(0x04)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FindNearestPointsOnLineSegments_Param
	{
	public:

		struct FVector Segment1Start; // 0x00(0x0c)
		struct FVector Segment1End; // 0x0c(0x0c)
		struct FVector Segment2Start; // 0x18(0x0c)
		struct FVector Segment2End; // 0x24(0x0c)
		struct FVector Segment1Point; // 0x30(0x0c)
		struct FVector Segment2Point; // 0x3c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_FindLookAtRotation_Param
	{
	public:

		struct FVector Start; // 0x00(0x0c)
		struct FVector Target; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_FindClosestPointOnSegment_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector SegmentStart; // 0x0c(0x0c)
		struct FVector SegmentEnd; // 0x18(0x0c)
		struct FVector ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_FindClosestPointOnLine_Param
	{
	public:

		struct FVector Point; // 0x00(0x0c)
		struct FVector LineOrigin; // 0x0c(0x0c)
		struct FVector LineDirection; // 0x18(0x0c)
		struct FVector ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_FFloor64_Param
	{
	public:

		float A; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FFloor_Param
	{
	public:

		float A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FClamp_Param
	{
	public:

		float Value; // 0x00(0x04)
		float Min; // 0x04(0x04)
		float Max; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_FCeil64_Param
	{
	public:

		float A; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_FCeil_Param
	{
	public:

		float A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Exp_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_EqualExactly_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualExactly_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualExactly_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		float ErrorTolerance; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		float ErrorTolerance; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		float ErrorTolerance; // 0x10(0x04)
		bool ReturnValue; // 0x14(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_TransformTransform_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform B; // 0x30(0x30)
		bool ReturnValue; // 0x60(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_RotatorRotator_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		float ErrorTolerance; // 0x18(0x04)
		bool ReturnValue; // 0x1c(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_QuatQuat_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
		float Tolerance; // 0x20(0x04)
		bool ReturnValue; // 0x24(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_ObjectObject_Param
	{
	public:

		struct UObject* A; // 0x00(0x08)
		struct UObject* B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_NameName_Param
	{
	public:

		struct FName A; // 0x00(0x08)
		struct FName B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_MatrixMatrix_Param
	{
	public:

		struct FMatrix A; // 0x00(0x40)
		struct FMatrix B; // 0x40(0x40)
		float Tolerance; // 0x80(0x04)
		bool ReturnValue; // 0x84(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_LinearColorLinearColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_ClassClass_Param
	{
	public:

		struct UClass* A; // 0x00(0x08)
		struct UClass* B; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_EqualEqual_BoolBool_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Ease_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float Alpha; // 0x08(0x04)
		enum class EEasingFunc EasingFunc; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		float BlendExp; // 0x10(0x04)
		int32_t Steps; // 0x14(0x04)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DynamicWeightedMovingAverage_FVector_Param
	{
	public:

		struct FVector CurrentSample; // 0x00(0x0c)
		struct FVector PreviousSample; // 0x0c(0x0c)
		float MaxDistance; // 0x18(0x04)
		float MinWeight; // 0x1c(0x04)
		float MaxWeight; // 0x20(0x04)
		struct FVector ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_DynamicWeightedMovingAverage_FRotator_Param
	{
	public:

		struct FRotator CurrentSample; // 0x00(0x0c)
		struct FRotator PreviousSample; // 0x0c(0x0c)
		float MaxDistance; // 0x18(0x04)
		float MinWeight; // 0x1c(0x04)
		float MaxWeight; // 0x20(0x04)
		struct FRotator ReturnValue; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_DynamicWeightedMovingAverage_Float_Param
	{
	public:

		float CurrentSample; // 0x00(0x04)
		float PreviousSample; // 0x04(0x04)
		float MaxDistance; // 0x08(0x04)
		float MinWeight; // 0x0c(0x04)
		float MaxWeight; // 0x10(0x04)
		float ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DotProduct2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Dot_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		float ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Divide_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Divide_VectorInt_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		int32_t B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Divide_VectorFloat_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Divide_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Divide_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		struct FVector2D ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Divide_Vector2DFloat_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float B; // 0x08(0x04)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Divide_TimespanFloat_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		float Scalar; // 0x08(0x04)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTimespan ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Divide_LinearColorLinearColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		struct FLinearColor ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Divide_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Divide_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Divide_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Divide_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_DistanceSquared2D_Param
	{
	public:

		struct FVector2D v1; // 0x00(0x08)
		struct FVector2D v2; // 0x08(0x08)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Distance2D_Param
	{
	public:

		struct FVector2D v1; // 0x00(0x08)
		struct FVector2D v2; // 0x08(0x08)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegTan_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegSin_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegreesToRadians_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegCos_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegAtan2_Param
	{
	public:

		float Y; // 0x00(0x04)
		float X; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegAtan_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegAsin_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DegAcos_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DaysInYear_Param
	{
	public:

		int32_t Year; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DaysInMonth_Param
	{
	public:

		int32_t Year; // 0x00(0x04)
		int32_t Month; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_DateTimeMinValue_Param
	{
	public:

		struct FDateTime ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_DateTimeMaxValue_Param
	{
	public:

		struct FDateTime ReturnValue; // 0x00(0x08)
	};

	struct Function_Engine_KismetMathLibrary_DateTimeFromString_Param
	{
	public:

		struct FString DateTimeString; // 0x00(0x10)
		struct FDateTime Result; // 0x10(0x08)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetMathLibrary_DateTimeFromIsoString_Param
	{
	public:

		struct FString IsoString; // 0x00(0x10)
		struct FDateTime Result; // 0x10(0x08)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetMathLibrary_CrossProduct2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Cross_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_CreateVectorFromYawPitch_Param
	{
	public:

		float Yaw; // 0x00(0x04)
		float Pitch; // 0x04(0x04)
		float Length; // 0x08(0x04)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Cos_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_ConvertTransformToRelative_Param
	{
	public:

		struct FTransform Transform; // 0x00(0x30)
		struct FTransform ParentTransform; // 0x30(0x30)
		struct FTransform ReturnValue; // 0x60(0x30)
	};

	struct Function_Engine_KismetMathLibrary_Conv_VectorToVector2D_Param
	{
	public:

		struct FVector InVector; // 0x00(0x0c)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Conv_VectorToTransform_Param
	{
	public:

		struct FVector InLocation; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTransform ReturnValue; // 0x10(0x30)
	};

	struct Function_Engine_KismetMathLibrary_Conv_VectorToRotator_Param
	{
	public:

		struct FVector InVec; // 0x00(0x0c)
		struct FRotator ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_VectorToQuaterion_Param
	{
	public:

		struct FVector InVec; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FQuat ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Conv_VectorToLinearColor_Param
	{
	public:

		struct FVector InVec; // 0x00(0x0c)
		struct FLinearColor ReturnValue; // 0x0c(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Conv_Vector4ToVector_Param
	{
	public:

		struct FVector4 InVector4; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_Vector4ToRotator_Param
	{
	public:

		struct FVector4 InVec; // 0x00(0x10)
		struct FRotator ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_Vector4ToQuaterion_Param
	{
	public:

		struct FVector4 InVec; // 0x00(0x10)
		struct FQuat ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Conv_Vector2DToVector_Param
	{
	public:

		struct FVector2D InVector2D; // 0x00(0x08)
		float Z; // 0x08(0x04)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_Vector2DToIntPoint_Param
	{
	public:

		struct FVector2D InVector2D; // 0x00(0x08)
		struct FIntPoint ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Conv_TransformToMatrix_Param
	{
	public:

		struct FTransform Transform; // 0x00(0x30)
		struct FMatrix ReturnValue; // 0x30(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Conv_RotatorToVector_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_RotatorToTransform_Param
	{
	public:

		struct FRotator inRotator; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FTransform ReturnValue; // 0x10(0x30)
	};

	struct Function_Engine_KismetMathLibrary_Conv_MatrixToTransform_Param
	{
	public:

		struct FMatrix InMatrix; // 0x00(0x40)
		struct FTransform ReturnValue; // 0x40(0x30)
	};

	struct Function_Engine_KismetMathLibrary_Conv_MatrixToRotator_Param
	{
	public:

		struct FMatrix InMatrix; // 0x00(0x40)
		struct FRotator ReturnValue; // 0x40(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_LinearColorToVector_Param
	{
	public:

		struct FLinearColor InLinearColor; // 0x00(0x10)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_LinearColorToColor_Param
	{
	public:

		struct FLinearColor InLinearColor; // 0x00(0x10)
		bool InUseSRGB; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		struct FColor ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Conv_IntVectorToVector_Param
	{
	public:

		struct FIntVector InIntVector; // 0x00(0x0c)
		struct FVector ReturnValue; // 0x0c(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_IntToIntVector_Param
	{
	public:

		int32_t inInt; // 0x00(0x04)
		struct FIntVector ReturnValue; // 0x04(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_IntToInt64_Param
	{
	public:

		int32_t inInt; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Conv_IntToFloat_Param
	{
	public:

		int32_t inInt; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Conv_IntToByte_Param
	{
	public:

		int32_t inInt; // 0x00(0x04)
		char ReturnValue; // 0x04(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Conv_IntToBool_Param
	{
	public:

		int32_t inInt; // 0x00(0x04)
		bool ReturnValue; // 0x04(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Conv_FloatToVector_Param
	{
	public:

		float InFloat; // 0x00(0x04)
		struct FVector ReturnValue; // 0x04(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Conv_FloatToLinearColor_Param
	{
	public:

		float InFloat; // 0x00(0x04)
		struct FLinearColor ReturnValue; // 0x04(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Conv_ColorToLinearColor_Param
	{
	public:

		struct FColor InColor; // 0x00(0x04)
		struct FLinearColor ReturnValue; // 0x04(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Conv_ByteToInt_Param
	{
	public:

		char InByte; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Conv_ByteToFloat_Param
	{
	public:

		char InByte; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Conv_BoolToInt_Param
	{
	public:

		bool InBool; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Conv_BoolToFloat_Param
	{
	public:

		bool InBool; // 0x00(0x01)
		char pad_1[0x3]; // 0x01(0x03)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Conv_BoolToByte_Param
	{
	public:

		bool InBool; // 0x00(0x01)
		char ReturnValue; // 0x01(0x01)
	};

	struct Function_Engine_KismetMathLibrary_ComposeTransforms_Param
	{
	public:

		struct FTransform A; // 0x00(0x30)
		struct FTransform B; // 0x30(0x30)
		struct FTransform ReturnValue; // 0x60(0x30)
	};

	struct Function_Engine_KismetMathLibrary_ComposeRotators_Param
	{
	public:

		struct FRotator A; // 0x00(0x0c)
		struct FRotator B; // 0x0c(0x0c)
		struct FRotator ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_ClassIsChildOf_Param
	{
	public:

		struct UClass* TestClass; // 0x00(0x08)
		struct UClass* ParentClass; // 0x08(0x08)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetMathLibrary_ClampVectorSize_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float Min; // 0x0c(0x04)
		float Max; // 0x10(0x04)
		struct FVector ReturnValue; // 0x14(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_ClampInt64_Param
	{
	public:

		int64_t Value; // 0x00(0x08)
		int64_t Min; // 0x08(0x08)
		int64_t Max; // 0x10(0x08)
		int64_t ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetMathLibrary_ClampAxis_Param
	{
	public:

		float Angle; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_ClampAxes2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float MinAxisVal; // 0x08(0x04)
		float MaxAxisVal; // 0x0c(0x04)
		struct FVector2D ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_ClampAngle_Param
	{
	public:

		float AngleDegrees; // 0x00(0x04)
		float MinAngleDegrees; // 0x04(0x04)
		float MaxAngleDegrees; // 0x08(0x04)
		float ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Clamp_Param
	{
	public:

		int32_t Value; // 0x00(0x04)
		int32_t Min; // 0x04(0x04)
		int32_t Max; // 0x08(0x04)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_CInterpTo_Param
	{
	public:

		struct FLinearColor Current; // 0x00(0x10)
		struct FLinearColor Target; // 0x10(0x10)
		float DeltaTime; // 0x20(0x04)
		float InterpSpeed; // 0x24(0x04)
		struct FLinearColor ReturnValue; // 0x28(0x10)
	};

	struct Function_Engine_KismetMathLibrary_BreakVector4_Param
	{
	public:

		struct FVector4 InVec; // 0x00(0x10)
		float X; // 0x10(0x04)
		float Y; // 0x14(0x04)
		float Z; // 0x18(0x04)
		float W; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakVector2D_Param
	{
	public:

		struct FVector2D InVec; // 0x00(0x08)
		float X; // 0x08(0x04)
		float Y; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakVector_Param
	{
	public:

		struct FVector InVec; // 0x00(0x0c)
		float X; // 0x0c(0x04)
		float Y; // 0x10(0x04)
		float Z; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakTransform_Param
	{
	public:

		struct FTransform InTransform; // 0x00(0x30)
		struct FVector Location; // 0x30(0x0c)
		struct FRotator Rotation; // 0x3c(0x0c)
		struct FVector Scale; // 0x48(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_BreakTimespan2_Param
	{
	public:

		struct FTimespan InTimespan; // 0x00(0x08)
		int32_t Days; // 0x08(0x04)
		int32_t Hours; // 0x0c(0x04)
		int32_t Minutes; // 0x10(0x04)
		int32_t Seconds; // 0x14(0x04)
		int32_t FractionNano; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakTimespan_Param
	{
	public:

		struct FTimespan InTimespan; // 0x00(0x08)
		int32_t Days; // 0x08(0x04)
		int32_t Hours; // 0x0c(0x04)
		int32_t Minutes; // 0x10(0x04)
		int32_t Seconds; // 0x14(0x04)
		int32_t Milliseconds; // 0x18(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakRotIntoAxes_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		struct FVector X; // 0x0c(0x0c)
		struct FVector Y; // 0x18(0x0c)
		struct FVector Z; // 0x24(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_BreakRotator_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		float Roll; // 0x0c(0x04)
		float Pitch; // 0x10(0x04)
		float Yaw; // 0x14(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakRandomStream_Param
	{
	public:

		struct FRandomStream InRandomStream; // 0x00(0x08)
		int32_t InitialSeed; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakQualifiedFrameTime_Param
	{
	public:

		struct FQualifiedFrameTime InFrameTime; // 0x00(0x10)
		struct FFrameNumber Frame; // 0x10(0x04)
		struct FFrameRate FrameRate; // 0x14(0x08)
		float SubFrame; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakFrameRate_Param
	{
	public:

		struct FFrameRate InFrameRate; // 0x00(0x08)
		int32_t Numerator; // 0x08(0x04)
		int32_t Denominator; // 0x0c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakDateTime_Param
	{
	public:

		struct FDateTime InDateTime; // 0x00(0x08)
		int32_t Year; // 0x08(0x04)
		int32_t Month; // 0x0c(0x04)
		int32_t Day; // 0x10(0x04)
		int32_t Hour; // 0x14(0x04)
		int32_t Minute; // 0x18(0x04)
		int32_t Second; // 0x1c(0x04)
		int32_t Millisecond; // 0x20(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BreakColor_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		float R; // 0x10(0x04)
		float G; // 0x14(0x04)
		float B; // 0x18(0x04)
		float A; // 0x1c(0x04)
	};

	struct Function_Engine_KismetMathLibrary_BooleanXOR_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_BooleanOR_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_BooleanNOR_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_BooleanNAND_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_BooleanAND_Param
	{
	public:

		bool A; // 0x00(0x01)
		bool B; // 0x01(0x01)
		bool ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_BMin_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_BMax_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Atan2_Param
	{
	public:

		float Y; // 0x00(0x04)
		float X; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Atan_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Asin_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_And_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_And_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_VectorVector_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		struct FVector B; // 0x0c(0x0c)
		struct FVector ReturnValue; // 0x18(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Add_VectorInt_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		int32_t B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Add_VectorFloat_Param
	{
	public:

		struct FVector A; // 0x00(0x0c)
		float B; // 0x0c(0x04)
		struct FVector ReturnValue; // 0x10(0x0c)
	};

	struct Function_Engine_KismetMathLibrary_Add_Vector4Vector4_Param
	{
	public:

		struct FVector4 A; // 0x00(0x10)
		struct FVector4 B; // 0x10(0x10)
		struct FVector4 ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Add_Vector2DVector2D_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		struct FVector2D B; // 0x08(0x08)
		struct FVector2D ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_Vector2DFloat_Param
	{
	public:

		struct FVector2D A; // 0x00(0x08)
		float B; // 0x08(0x04)
		struct FVector2D ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_TimespanTimespan_Param
	{
	public:

		struct FTimespan A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		struct FTimespan ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_QuatQuat_Param
	{
	public:

		struct FQuat A; // 0x00(0x10)
		struct FQuat B; // 0x10(0x10)
		struct FQuat ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Add_MatrixMatrix_Param
	{
	public:

		struct FMatrix A; // 0x00(0x40)
		struct FMatrix B; // 0x40(0x40)
		struct FMatrix ReturnValue; // 0x80(0x40)
	};

	struct Function_Engine_KismetMathLibrary_Add_LinearColorLinearColor_Param
	{
	public:

		struct FLinearColor A; // 0x00(0x10)
		struct FLinearColor B; // 0x10(0x10)
		struct FLinearColor ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetMathLibrary_Add_IntInt_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t B; // 0x04(0x04)
		int32_t ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Add_Int64Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t B; // 0x08(0x08)
		int64_t ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_FloatFloat_Param
	{
	public:

		float A; // 0x00(0x04)
		float B; // 0x04(0x04)
		float ReturnValue; // 0x08(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Add_DateTimeTimespan_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FTimespan B; // 0x08(0x08)
		struct FDateTime ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_DateTimeDateTime_Param
	{
	public:

		struct FDateTime A; // 0x00(0x08)
		struct FDateTime B; // 0x08(0x08)
		struct FDateTime ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Add_ByteByte_Param
	{
	public:

		char A; // 0x00(0x01)
		char B; // 0x01(0x01)
		char ReturnValue; // 0x02(0x01)
	};

	struct Function_Engine_KismetMathLibrary_Acos_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Abs_Int64_Param
	{
	public:

		int64_t A; // 0x00(0x08)
		int64_t ReturnValue; // 0x08(0x08)
	};

	struct Function_Engine_KismetMathLibrary_Abs_Int_Param
	{
	public:

		int32_t A; // 0x00(0x04)
		int32_t ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetMathLibrary_Abs_Param
	{
	public:

		float A; // 0x00(0x04)
		float ReturnValue; // 0x04(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_MarkBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t Index; // 0x04(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_HasUnmarkedBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t NumBits; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetNodeHelperLibrary_HasMarkedBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t NumBits; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetValidValue_Param
	{
	public:

		struct UEnum* Enum; // 0x00(0x08)
		char EnumeratorValue; // 0x08(0x01)
		char ReturnValue; // 0x09(0x01)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetUnmarkedBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t StartIdx; // 0x04(0x04)
		int32_t NumBits; // 0x08(0x04)
		bool bRandom; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetRandomUnmarkedBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t StartIdx; // 0x04(0x04)
		int32_t NumBits; // 0x08(0x04)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetFirstUnmarkedBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t StartIdx; // 0x04(0x04)
		int32_t NumBits; // 0x08(0x04)
		int32_t ReturnValue; // 0x0c(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetEnumeratorValueFromIndex_Param
	{
	public:

		struct UEnum* Enum; // 0x00(0x08)
		char EnumeratorIndex; // 0x08(0x01)
		char ReturnValue; // 0x09(0x01)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetEnumeratorUserFriendlyName_Param
	{
	public:

		struct UEnum* Enum; // 0x00(0x08)
		char EnumeratorValue; // 0x08(0x01)
		char pad_9[0x7]; // 0x09(0x07)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetNodeHelperLibrary_GetEnumeratorName_Param
	{
	public:

		struct UEnum* Enum; // 0x00(0x08)
		char EnumeratorValue; // 0x08(0x01)
		char pad_9[0x3]; // 0x09(0x03)
		struct FName ReturnValue; // 0x0c(0x08)
	};

	struct Function_Engine_KismetNodeHelperLibrary_ClearBit_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t Index; // 0x04(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_ClearAllBits_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
	};

	struct Function_Engine_KismetNodeHelperLibrary_BitIsMarked_Param
	{
	public:

		int32_t Data; // 0x00(0x04)
		int32_t Index; // 0x04(0x04)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetRenderingLibrary_SetCastInsetShadowForAllAttachments_Param
	{
	public:

		struct UPrimitiveComponent* PrimitiveComponent; // 0x00(0x08)
		bool bCastInsetShadow; // 0x08(0x01)
		bool bLightAttachmentsAsGroup; // 0x09(0x01)
	};

	struct Function_Engine_KismetRenderingLibrary_RenderTargetCreateStaticTextureCubeEditorOnly_Param
	{
	public:

		struct UTextureRenderTargetCube* RenderTarget; // 0x00(0x08)
		struct FString Name; // 0x08(0x10)
		bool bForceOverride; // 0x18(0x01)
		enum class TextureCompressionSettings CompressionSettings; // 0x19(0x01)
		enum class TextureMipGenSettings MipSettings; // 0x1a(0x01)
		char pad_1B[0x5]; // 0x1b(0x05)
		struct UTextureCube* ReturnValue; // 0x20(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_RenderTargetCreateStaticTexture2DEditorOnly_Param
	{
	public:

		struct UTextureRenderTarget2D* RenderTarget; // 0x00(0x08)
		struct FString Name; // 0x08(0x10)
		enum class TextureCompressionSettings CompressionSettings; // 0x18(0x01)
		enum class TextureMipGenSettings MipSettings; // 0x19(0x01)
		char pad_1A[0x6]; // 0x1a(0x06)
		struct UTexture2D* ReturnValue; // 0x20(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ReleaseRenderTarget2D_Param
	{
	public:

		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x00(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ReadRenderTargetUV_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		float U; // 0x10(0x04)
		float V; // 0x14(0x04)
		struct FColor ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetRenderingLibrary_ReadRenderTargetRawUV_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		float U; // 0x10(0x04)
		float V; // 0x14(0x04)
		struct FLinearColor ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetRenderingLibrary_ReadRenderTargetRawPixel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		int32_t X; // 0x10(0x04)
		int32_t Y; // 0x14(0x04)
		struct FLinearColor ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetRenderingLibrary_ReadRenderTargetPixel_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		int32_t X; // 0x10(0x04)
		int32_t Y; // 0x14(0x04)
		struct FColor ReturnValue; // 0x18(0x04)
	};

	struct Function_Engine_KismetRenderingLibrary_MakeSkinWeightInfo_Param
	{
	public:

		int32_t Bone0; // 0x00(0x04)
		char Weight0; // 0x04(0x01)
		char pad_5[0x3]; // 0x05(0x03)
		int32_t Bone1; // 0x08(0x04)
		char Weight1; // 0x0c(0x01)
		char pad_D[0x3]; // 0x0d(0x03)
		int32_t Bone2; // 0x10(0x04)
		char Weight2; // 0x14(0x01)
		char pad_15[0x3]; // 0x15(0x03)
		int32_t Bone3; // 0x18(0x04)
		char Weight3; // 0x1c(0x01)
		char pad_1D[0x3]; // 0x1d(0x03)
		struct FSkelMeshSkinWeightInfo ReturnValue; // 0x20(0x28)
	};

	struct Function_Engine_KismetRenderingLibrary_ImportFileAsTexture2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FString Filename; // 0x08(0x10)
		struct UTexture2D* ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ImportBufferAsTexture2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct TArray<char> Buffer; // 0x08(0x10)
		struct UTexture2D* ReturnValue; // 0x18(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ExportTexture2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTexture2D* Texture; // 0x08(0x08)
		struct FString FilePath; // 0x10(0x10)
		struct FString Filename; // 0x20(0x10)
	};

	struct Function_Engine_KismetRenderingLibrary_ExportRenderTarget_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		struct FString FilePath; // 0x10(0x10)
		struct FString Filename; // 0x20(0x10)
	};

	struct Function_Engine_KismetRenderingLibrary_EndDrawCanvasToRenderTarget_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FDrawToRenderTargetContext Context; // 0x08(0x10)
	};

	struct Function_Engine_KismetRenderingLibrary_DrawMaterialToRenderTargetWithCoordinate_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		struct UMaterialInterface* Material; // 0x10(0x08)
		struct FVector2D ScreenPosition; // 0x18(0x08)
		struct FVector2D ScreenSize; // 0x20(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_DrawMaterialToRenderTarget_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		struct UMaterialInterface* Material; // 0x10(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_CreateRenderTarget2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		int32_t Width; // 0x08(0x04)
		int32_t Height; // 0x0c(0x04)
		enum class ETextureRenderTargetFormat Format; // 0x10(0x01)
		char pad_11[0x3]; // 0x11(0x03)
		struct FLinearColor ClearColor; // 0x14(0x10)
		bool bAutoGenerateMipMaps; // 0x24(0x01)
		bool bAutoFillMipMaps; // 0x25(0x01)
		bool bClearRenderTargetImmediatly; // 0x26(0x01)
		char pad_27[0x1]; // 0x27(0x01)
		struct UTextureRenderTarget2D* ReturnValue; // 0x28(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ConvertRenderTargetToTextureCubeEditorOnly_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTargetCube* RenderTarget; // 0x08(0x08)
		struct UTextureCube* TextureCube; // 0x10(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ConvertRenderTargetToTexture2DEditorOnly_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* RenderTarget; // 0x08(0x08)
		struct UTexture2D* Texture; // 0x10(0x08)
	};

	struct Function_Engine_KismetRenderingLibrary_ClearRenderTarget2D_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		struct FLinearColor ClearColor; // 0x10(0x10)
	};

	struct Function_Engine_KismetRenderingLibrary_BuildReflectionCaptures_Param
	{
	public:

	};

	struct Function_Engine_KismetRenderingLibrary_BreakSkinWeightInfo_Param
	{
	public:

		struct FSkelMeshSkinWeightInfo InWeight; // 0x00(0x28)
		int32_t Bone0; // 0x28(0x04)
		char Weight0; // 0x2c(0x01)
		char pad_2D[0x3]; // 0x2d(0x03)
		int32_t Bone1; // 0x30(0x04)
		char Weight1; // 0x34(0x01)
		char pad_35[0x3]; // 0x35(0x03)
		int32_t Bone2; // 0x38(0x04)
		char Weight2; // 0x3c(0x01)
		char pad_3D[0x3]; // 0x3d(0x03)
		int32_t Bone3; // 0x40(0x04)
		char Weight3; // 0x44(0x01)
	};

	struct Function_Engine_KismetRenderingLibrary_BeginDrawCanvasToRenderTarget_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct UTextureRenderTarget2D* TextureRenderTarget; // 0x08(0x08)
		struct UCanvas* Canvas; // 0x10(0x08)
		struct FVector2D size; // 0x18(0x08)
		struct FDrawToRenderTargetContext Context; // 0x20(0x10)
		bool immediateDrawing; // 0x30(0x01)
	};

	struct Function_Engine_KismetStringLibrary_TrimTrailing_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Trim_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_ToUpper_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_ToLower_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_TimeSecondsToString_Param
	{
	public:

		float InSeconds; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_StartsWith_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString InPrefix; // 0x10(0x10)
		enum class ESearchCase SearchCase; // 0x20(0x01)
		bool ReturnValue; // 0x21(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Split_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString InStr; // 0x10(0x10)
		struct FString LeftS; // 0x20(0x10)
		struct FString RightS; // 0x30(0x10)
		enum class ESearchCase SearchCase; // 0x40(0x01)
		enum class ESearchDir SearchDir; // 0x41(0x01)
		bool ReturnValue; // 0x42(0x01)
	};

	struct Function_Engine_KismetStringLibrary_RightPad_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t ChCount; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_RightChop_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t Count; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Right_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t Count; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Reverse_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_ReplaceInline_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString SearchText; // 0x10(0x10)
		struct FString ReplacementText; // 0x20(0x10)
		enum class ESearchCase SearchCase; // 0x30(0x01)
		char pad_31[0x3]; // 0x31(0x03)
		int32_t ReturnValue; // 0x34(0x04)
	};

	struct Function_Engine_KismetStringLibrary_Replace_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString From; // 0x10(0x10)
		struct FString To; // 0x20(0x10)
		enum class ESearchCase SearchCase; // 0x30(0x01)
		char pad_31[0x7]; // 0x31(0x07)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringLibrary_ParseIntoArray_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString Delimiter; // 0x10(0x10)
		bool CullEmptyStrings; // 0x20(0x01)
		char pad_21[0x7]; // 0x21(0x07)
		struct TArray<struct FString> ReturnValue; // 0x28(0x10)
	};

	struct Function_Engine_KismetStringLibrary_NotEqual_StrStr_Param
	{
	public:

		struct FString A; // 0x00(0x10)
		struct FString B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetStringLibrary_NotEqual_StriStri_Param
	{
	public:

		struct FString A; // 0x00(0x10)
		struct FString B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Mid_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t Start; // 0x10(0x04)
		int32_t Count; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_MatchesWildcard_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString Wildcard; // 0x10(0x10)
		enum class ESearchCase SearchCase; // 0x20(0x01)
		bool ReturnValue; // 0x21(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Len_Param
	{
	public:

		struct FString S; // 0x00(0x10)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetStringLibrary_LeftPad_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t ChCount; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_LeftChop_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t Count; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Left_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t Count; // 0x10(0x04)
		char pad_14[0x4]; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_JoinStringArray_Param
	{
	public:

		struct TArray<struct FString> SourceArray; // 0x00(0x10)
		struct FString Separator; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetStringLibrary_IsNumeric_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		bool ReturnValue; // 0x10(0x01)
	};

	struct Function_Engine_KismetStringLibrary_GetSubstring_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t StartIndex; // 0x10(0x04)
		int32_t Length; // 0x14(0x04)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringLibrary_GetCharacterAsNumber_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		int32_t Index; // 0x10(0x04)
		int32_t ReturnValue; // 0x14(0x04)
	};

	struct Function_Engine_KismetStringLibrary_GetCharacterArrayFromString_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct TArray<struct FString> ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_FindSubstring_Param
	{
	public:

		struct FString SearchIn; // 0x00(0x10)
		struct FString SubString; // 0x10(0x10)
		bool bUseCase; // 0x20(0x01)
		bool bSearchFromEnd; // 0x21(0x01)
		char pad_22[0x2]; // 0x22(0x02)
		int32_t StartPosition; // 0x24(0x04)
		int32_t ReturnValue; // 0x28(0x04)
	};

	struct Function_Engine_KismetStringLibrary_EqualEqual_StrStr_Param
	{
	public:

		struct FString A; // 0x00(0x10)
		struct FString B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetStringLibrary_EqualEqual_StriStri_Param
	{
	public:

		struct FString A; // 0x00(0x10)
		struct FString B; // 0x10(0x10)
		bool ReturnValue; // 0x20(0x01)
	};

	struct Function_Engine_KismetStringLibrary_EndsWith_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct FString InSuffix; // 0x10(0x10)
		enum class ESearchCase SearchCase; // 0x20(0x01)
		bool ReturnValue; // 0x21(0x01)
	};

	struct Function_Engine_KismetStringLibrary_CullArray_Param
	{
	public:

		struct FString SourceString; // 0x00(0x10)
		struct TArray<struct FString> inArray; // 0x10(0x10)
		int32_t ReturnValue; // 0x20(0x04)
	};

	struct Function_Engine_KismetStringLibrary_Conv_VectorToString_Param
	{
	public:

		struct FVector InVec; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_Vector2dToString_Param
	{
	public:

		struct FVector2D InVec; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_TransformToString_Param
	{
	public:

		struct FTransform InTrans; // 0x00(0x30)
		struct FString ReturnValue; // 0x30(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToVector2D_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		struct FVector2D OutConvertedVector2D; // 0x10(0x08)
		bool OutIsValid; // 0x18(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToVector_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		struct FVector OutConvertedVector; // 0x10(0x0c)
		bool OutIsValid; // 0x1c(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToRotator_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		struct FRotator OutConvertedRotator; // 0x10(0x0c)
		bool OutIsValid; // 0x1c(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToName_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		struct FName ReturnValue; // 0x10(0x08)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToInt_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		int32_t ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToFloat_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		float ReturnValue; // 0x10(0x04)
	};

	struct Function_Engine_KismetStringLibrary_Conv_StringToColor_Param
	{
	public:

		struct FString inString; // 0x00(0x10)
		struct FLinearColor OutConvertedColor; // 0x10(0x10)
		bool OutIsValid; // 0x20(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Conv_RotatorToString_Param
	{
	public:

		struct FRotator InRot; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_ObjectToString_Param
	{
	public:

		struct UObject* InObj; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_NameToString_Param
	{
	public:

		struct FName InName; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_MatrixToString_Param
	{
	public:

		struct FMatrix InMatrix; // 0x00(0x40)
		struct FString ReturnValue; // 0x40(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_IntVectorToString_Param
	{
	public:

		struct FIntVector InIntVec; // 0x00(0x0c)
		char pad_C[0x4]; // 0x0c(0x04)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_IntToString_Param
	{
	public:

		int32_t inInt; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_FloatToString_Param
	{
	public:

		float InFloat; // 0x00(0x04)
		char pad_4[0x4]; // 0x04(0x04)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_ColorToString_Param
	{
	public:

		struct FLinearColor InColor; // 0x00(0x10)
		struct FString ReturnValue; // 0x10(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_ByteToString_Param
	{
	public:

		char InByte; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Conv_BoolToString_Param
	{
	public:

		bool InBool; // 0x00(0x01)
		char pad_1[0x7]; // 0x01(0x07)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringLibrary_Contains_Param
	{
	public:

		struct FString SearchIn; // 0x00(0x10)
		struct FString SubString; // 0x10(0x10)
		bool bUseCase; // 0x20(0x01)
		bool bSearchFromEnd; // 0x21(0x01)
		bool ReturnValue; // 0x22(0x01)
	};

	struct Function_Engine_KismetStringLibrary_Concat_StrStr_Param
	{
	public:

		struct FString A; // 0x00(0x10)
		struct FString B; // 0x10(0x10)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Vector2d_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FVector2D InVector2D; // 0x20(0x08)
		struct FString Suffix; // 0x28(0x10)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Vector_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FVector InVector; // 0x20(0x0c)
		char pad_2C[0x4]; // 0x2c(0x04)
		struct FString Suffix; // 0x30(0x10)
		struct FString ReturnValue; // 0x40(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Rotator_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FRotator InRot; // 0x20(0x0c)
		char pad_2C[0x4]; // 0x2c(0x04)
		struct FString Suffix; // 0x30(0x10)
		struct FString ReturnValue; // 0x40(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Object_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct UObject* InObj; // 0x20(0x08)
		struct FString Suffix; // 0x28(0x10)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Name_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FName InName; // 0x20(0x08)
		struct FString Suffix; // 0x28(0x10)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_IntVector_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FIntVector InIntVector; // 0x20(0x0c)
		char pad_2C[0x4]; // 0x2c(0x04)
		struct FString Suffix; // 0x30(0x10)
		struct FString ReturnValue; // 0x40(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Int_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		int32_t inInt; // 0x20(0x04)
		char pad_24[0x4]; // 0x24(0x04)
		struct FString Suffix; // 0x28(0x10)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Float_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		float InFloat; // 0x20(0x04)
		char pad_24[0x4]; // 0x24(0x04)
		struct FString Suffix; // 0x28(0x10)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Color_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		struct FLinearColor InColor; // 0x20(0x10)
		struct FString Suffix; // 0x30(0x10)
		struct FString ReturnValue; // 0x40(0x10)
	};

	struct Function_Engine_KismetStringLibrary_BuildString_Bool_Param
	{
	public:

		struct FString AppendTo; // 0x00(0x10)
		struct FString Prefix; // 0x10(0x10)
		bool InBool; // 0x20(0x01)
		char pad_21[0x7]; // 0x21(0x07)
		struct FString Suffix; // 0x28(0x10)
		struct FString ReturnValue; // 0x38(0x10)
	};

	struct Function_Engine_KismetStringTableLibrary_IsRegisteredTableId_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		bool ReturnValue; // 0x08(0x01)
	};

	struct Function_Engine_KismetStringTableLibrary_IsRegisteredTableEntry_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		struct FString Key; // 0x08(0x10)
		bool ReturnValue; // 0x18(0x01)
	};

	struct Function_Engine_KismetStringTableLibrary_GetTableNamespace_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		struct FString ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetStringTableLibrary_GetTableEntrySourceString_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		struct FString Key; // 0x08(0x10)
		struct FString ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringTableLibrary_GetTableEntryMetaData_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		struct FString Key; // 0x08(0x10)
		struct FName MetaDataId; // 0x18(0x08)
		struct FString ReturnValue; // 0x20(0x10)
	};

	struct Function_Engine_KismetStringTableLibrary_GetRegisteredStringTables_Param
	{
	public:

		struct TArray<struct FName> ReturnValue; // 0x00(0x10)
	};

	struct Function_Engine_KismetStringTableLibrary_GetMetaDataIdsFromStringTableEntry_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		struct FString Key; // 0x08(0x10)
		struct TArray<struct FName> ReturnValue; // 0x18(0x10)
	};

	struct Function_Engine_KismetStringTableLibrary_GetKeysFromStringTable_Param
	{
	public:

		struct FName TableId; // 0x00(0x08)
		struct TArray<struct FString> ReturnValue; // 0x08(0x10)
	};

	struct Function_Engine_KismetSystemLibrary_UnregisterForRemoteNotifications_Param
	{
	public:

	};

	struct Function_Engine_KismetSystemLibrary_UnloadPrimaryAssetList_Param
	{
	public:

		struct TArray<struct FPrimaryAssetId> PrimaryAssetIdList; // 0x00(0x10)
	};

	struct Function_Engine_KismetSystemLibrary_UnloadPrimaryAsset_Param
	{
	public:

		struct FPrimaryAssetId PrimaryAssetId; // 0x00(0x10)
	};

	struct Function_Engine_KismetSystemLibrary_TransactObject_Param
	{
	public:

		struct UObject* Object; // 0x00(0x08)
	};

	struct Function_Engine_KismetSystemLibrary_StackTrace_Param
	{
	public:

	};

	struct Function_Engine_KismetSystemLibrary_SphereTraceSingleForObjects_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Start; // 0x08(0x0c)
		struct FVector End; // 0x14(0x0c)
		float radius; // 0x20(0x04)
		char pad_24[0x4]; // 0x24(0x04)
		struct TArray<enum class EObjectTypeQuery> ObjectTypes; // 0x28(0x10)
		bool bTraceComplex; // 0x38(0x01)
		char pad_39[0x7]; // 0x39(0x07)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x40(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0x50(0x01)
		char pad_51[0x3]; // 0x51(0x03)
		struct FHitResult OutHit; // 0x54(0x88)
		bool bIgnoreSelf; // 0xdc(0x01)
		char pad_DD[0x3]; // 0xdd(0x03)
		struct FLinearColor TraceColor; // 0xe0(0x10)
		struct FLinearColor TraceHitColor; // 0xf0(0x10)
		float DrawTime; // 0x100(0x04)
		bool ReturnValue; // 0x104(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereTraceSingleByProfile_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Start; // 0x08(0x0c)
		struct FVector End; // 0x14(0x0c)
		float radius; // 0x20(0x04)
		struct FName ProfileName; // 0x24(0x08)
		bool bTraceComplex; // 0x2c(0x01)
		char pad_2D[0x3]; // 0x2d(0x03)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x30(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0x40(0x01)
		char pad_41[0x3]; // 0x41(0x03)
		struct FHitResult OutHit; // 0x44(0x88)
		bool bIgnoreSelf; // 0xcc(0x01)
		char pad_CD[0x3]; // 0xcd(0x03)
		struct FLinearColor TraceColor; // 0xd0(0x10)
		struct FLinearColor TraceHitColor; // 0xe0(0x10)
		float DrawTime; // 0xf0(0x04)
		bool ReturnValue; // 0xf4(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereTraceSingle_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Start; // 0x08(0x0c)
		struct FVector End; // 0x14(0x0c)
		float radius; // 0x20(0x04)
		enum class ETraceTypeQuery TraceChannel; // 0x24(0x01)
		bool bTraceComplex; // 0x25(0x01)
		char pad_26[0x2]; // 0x26(0x02)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x28(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0x38(0x01)
		char pad_39[0x3]; // 0x39(0x03)
		struct FHitResult OutHit; // 0x3c(0x88)
		bool bIgnoreSelf; // 0xc4(0x01)
		char pad_C5[0x3]; // 0xc5(0x03)
		struct FLinearColor TraceColor; // 0xc8(0x10)
		struct FLinearColor TraceHitColor; // 0xd8(0x10)
		float DrawTime; // 0xe8(0x04)
		bool ReturnValue; // 0xec(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereTraceMultiForObjects_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Start; // 0x08(0x0c)
		struct FVector End; // 0x14(0x0c)
		float radius; // 0x20(0x04)
		char pad_24[0x4]; // 0x24(0x04)
		struct TArray<enum class EObjectTypeQuery> ObjectTypes; // 0x28(0x10)
		bool bTraceComplex; // 0x38(0x01)
		char pad_39[0x7]; // 0x39(0x07)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x40(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0x50(0x01)
		char pad_51[0x7]; // 0x51(0x07)
		struct TArray<struct FHitResult> OutHits; // 0x58(0x10)
		bool bIgnoreSelf; // 0x68(0x01)
		char pad_69[0x3]; // 0x69(0x03)
		struct FLinearColor TraceColor; // 0x6c(0x10)
		struct FLinearColor TraceHitColor; // 0x7c(0x10)
		float DrawTime; // 0x8c(0x04)
		bool ReturnValue; // 0x90(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereTraceMultiByProfile_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Start; // 0x08(0x0c)
		struct FVector End; // 0x14(0x0c)
		float radius; // 0x20(0x04)
		struct FName ProfileName; // 0x24(0x08)
		bool bTraceComplex; // 0x2c(0x01)
		char pad_2D[0x3]; // 0x2d(0x03)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x30(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0x40(0x01)
		char pad_41[0x7]; // 0x41(0x07)
		struct TArray<struct FHitResult> OutHits; // 0x48(0x10)
		bool bIgnoreSelf; // 0x58(0x01)
		char pad_59[0x3]; // 0x59(0x03)
		struct FLinearColor TraceColor; // 0x5c(0x10)
		struct FLinearColor TraceHitColor; // 0x6c(0x10)
		float DrawTime; // 0x7c(0x04)
		bool ReturnValue; // 0x80(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereTraceMulti_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector Start; // 0x08(0x0c)
		struct FVector End; // 0x14(0x0c)
		float radius; // 0x20(0x04)
		enum class ETraceTypeQuery TraceChannel; // 0x24(0x01)
		bool bTraceComplex; // 0x25(0x01)
		char pad_26[0x2]; // 0x26(0x02)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x28(0x10)
		enum class EDrawDebugTrace DrawDebugType; // 0x38(0x01)
		char pad_39[0x7]; // 0x39(0x07)
		struct TArray<struct FHitResult> OutHits; // 0x40(0x10)
		bool bIgnoreSelf; // 0x50(0x01)
		char pad_51[0x3]; // 0x51(0x03)
		struct FLinearColor TraceColor; // 0x54(0x10)
		struct FLinearColor TraceHitColor; // 0x64(0x10)
		float DrawTime; // 0x74(0x04)
		bool ReturnValue; // 0x78(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereOverlapComponents_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector SpherePos; // 0x08(0x0c)
		float SphereRadius; // 0x14(0x04)
		struct TArray<enum class EObjectTypeQuery> ObjectTypes; // 0x18(0x10)
		struct UClass* ComponentClassFilter; // 0x28(0x08)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x30(0x10)
		struct TArray<struct UPrimitiveComponent*> OutComponents; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SphereOverlapActors_Param
	{
	public:

		struct UObject* WorldContextObject; // 0x00(0x08)
		struct FVector SpherePos; // 0x08(0x0c)
		float SphereRadius; // 0x14(0x04)
		struct TArray<enum class EObjectTypeQuery> ObjectTypes; // 0x18(0x10)
		struct UClass* ActorClassFilter; // 0x28(0x08)
		struct TArray<struct AActor*> ActorsToIgnore; // 0x30(0x10)
		struct TArray<struct AActor*> OutActors; // 0x40(0x10)
		bool ReturnValue; // 0x50(0x01)
	};

	struct Function_Engine_KismetSystemLibrary_SnapshotObject_Param
	{
	public:

