
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Class Engine.ReplicationDriver
// Size: 0x30 (Inherited: 0x30)
class UReplicationDriver : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ReplicationConnectionDriver
// Size: 0x30 (Inherited: 0x30)
class UReplicationConnectionDriver : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AssetUserData
// Size: 0x30 (Inherited: 0x30)
class UAssetUserData : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AssetManager
// Size: 0x4b0 (Inherited: 0x30)
class UAssetManager : public UObject {
public:

	char pad_30[0x308]; // 0x30(0x308)
	struct TArray<struct UObject*> ObjectReferenceList; // 0x338(0x10)
	bool bIsGlobalAsyncScanEnvironment; // 0x348(0x01)
	bool bShouldGuessTypeAndName; // 0x349(0x01)
	bool bShouldUseSynchronousLoad; // 0x34a(0x01)
	bool bIsLoadingFromPakFiles; // 0x34b(0x01)
	bool bShouldAcquireMissingChunksOnLoad; // 0x34c(0x01)
	bool bOnlyCookProductionAssets; // 0x34d(0x01)
	bool bIsBulkScanning; // 0x34e(0x01)
	bool bIsPrimaryAssetDirectoryCurrent; // 0x34f(0x01)
	bool bIsManagementDatabaseCurrent; // 0x350(0x01)
	bool bUpdateManagementDatabaseAfterScan; // 0x351(0x01)
	bool bIncludeOnlyOnDiskAssets; // 0x352(0x01)
	char pad_353[0x1]; // 0x353(0x01)
	int32_t NumberOfSpawnedNotifications; // 0x354(0x04)
	char pad_358[0x158]; // 0x358(0x158)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.WorldComposition
// Size: 0x70 (Inherited: 0x30)
class UWorldComposition : public UObject {
public:

	char pad_30[0x20]; // 0x30(0x20)
	struct TArray<struct ULevelStreaming*> TilesStreaming; // 0x50(0x10)
	double TilesStreamingTimeThreshold; // 0x60(0x08)
	bool bLoadAllTilesDuringCinematic; // 0x68(0x01)
	bool bRebaseOriginIn3DSpace; // 0x69(0x01)
	bool bPhysicsStaticScene; // 0x6a(0x01)
	char pad_6B[0x1]; // 0x6b(0x01)
	float RebaseOriginDistance; // 0x6c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.World
// Size: 0x7f0 (Inherited: 0x30)
class UWorld : public UObject {
public:

	static class UWorld** GWorld; // 0x00(0x08)
	char pad_30[0x8]; // 0x30(0x08)
	struct UNetDriver* NetDriver; // 0x38(0x08)
	char pad_40[0x8]; // 0x40(0x08)
	struct ULineBatchComponent* LineBatcher; // 0x48(0x08)
	struct ULineBatchComponent* PersistentLineBatcher; // 0x50(0x08)
	struct ULineBatchComponent* ForegroundLineBatcher; // 0x58(0x08)
	struct AGameNetworkManager* NetworkManager; // 0x60(0x08)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x68(0x08)
	struct TArray<struct UObject*> ExtraReferencedObjects; // 0x70(0x10)
	struct TArray<struct UObject*> PerModuleDataObjects; // 0x80(0x10)
	struct TArray<struct AActor*> LevelSequenceActors; // 0x90(0x10)
	struct TArray<struct ULevelStreaming*> StreamingLevels; // 0xa0(0x10)
	struct FStreamingLevelsToConsider StreamingLevelsToConsider; // 0xb0(0x28)
	struct FString StreamingLevelsPrefix; // 0xd8(0x10)
	struct ULevel* CurrentLevelPendingVisibility; // 0xe8(0x08)
	struct ULevel* CurrentLevelPendingInvisibility; // 0xf0(0x08)
	struct UDemoNetDriver* DemoNetDriver; // 0xf8(0x08)
	struct AParticleEventManager* MyParticleEventManager; // 0x100(0x08)
	struct ULevel* PersistentLevel; // 0x108(0x08)
	struct APhysicsVolume* DefaultPhysicsVolume; // 0x110(0x08)
	char pad_118[0x26]; // 0x118(0x26)
	char pad_13E_0 : 2; // 0x13e(0x01)
	char bAreConstraintsDirty : 1; // 0x13e(0x01)
	char pad_13E_3 : 5; // 0x13e(0x01)
	char pad_13F[0x1]; // 0x13f(0x01)
	struct UNavigationSystemBase* NavigationSystem; // 0x140(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x148(0x08)
	struct AGameStateBase* GameState; // 0x150(0x08)
	struct UAISystemBase* AISystem; // 0x158(0x08)
	struct UAvoidanceManager* AvoidanceManager; // 0x160(0x08)
	struct TArray<struct ULevel*> Levels; // 0x168(0x10)
	struct TArray<struct FLevelCollection> LevelCollections; // 0x178(0x10)
	char pad_188[0x8]; // 0x188(0x08)
	struct UGameInstance* OwningGameInstance; // 0x190(0x08)
	struct TArray<struct UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x198(0x10)
	struct UCanvas* CanvasForRenderingToTarget; // 0x1a8(0x08)
	struct UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x1b0(0x08)
	char pad_1B8[0x50]; // 0x1b8(0x50)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x208(0x10)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x218(0x10)
	char pad_228[0x420]; // 0x228(0x420)
	struct UWorldComposition* WorldComposition; // 0x648(0x08)
	char pad_650[0x70]; // 0x650(0x70)
	struct FWorldPSCPool PSCPool; // 0x6c0(0x58)
	char pad_718[0xd8]; // 0x718(0xd8)

	void SetWorldScale(enum class EWorldScale InWorldScale); // Function Engine.World.SetWorldScale // (Final|Native|Public|BlueprintCallable) // @ game+0x9ecf070
	void SetSubWorldScale(enum class EWorldScale InWorldScale); // Function Engine.World.SetSubWorldScale // (Final|Native|Public|BlueprintCallable) // @ game+0x9ecef70
	void SetMiniWorld(bool bInEnable); // Function Engine.World.SetMiniWorld // (Final|Native|Public|BlueprintCallable) // @ game+0x9ecece0
	void RestoreWorldScaleFromWorldSetting(); // Function Engine.World.RestoreWorldScaleFromWorldSetting // (Final|Native|Public|BlueprintCallable) // @ game+0x9eceb50
	void ResetSubWorldScale(); // Function Engine.World.ResetSubWorldScale // (Final|Native|Public|BlueprintCallable) // @ game+0x9eceb30
	struct AWorldSettings* K2_GetWorldSettings(); // Function Engine.World.K2_GetWorldSettings // (Final|Native|Public|BlueprintCallable) // @ game+0x9ece0c0
	void HandleTimelineScrubbed(); // Function Engine.World.HandleTimelineScrubbed // (Final|Native|Public) // @ game+0x9ece0a0
	enum class EWorldScale GetWorldScale(); // Function Engine.World.GetWorldScale // (Final|Native|Public|BlueprintCallable) // @ game+0x9ece070
	bool GetMiniWorld(); // Function Engine.World.GetMiniWorld // (Final|Native|Public|BlueprintCallable) // @ game+0x9ece010
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PackageMapClient
// Size: 0x400 (Inherited: 0xe8)
class UPackageMapClient : public UPackageMap {
public:

	char pad_E8[0x318]; // 0xe8(0x318)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.OnlineBlueprintCallProxyBase
// Size: 0x30 (Inherited: 0x30)
class UOnlineBlueprintCallProxyBase : public UObject {
public:


	void Activate(); // Function Engine.OnlineBlueprintCallProxyBase.Activate // (Native|Public|BlueprintCallable) // @ game+0x8951b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.OnlineEngineInterface
// Size: 0x30 (Inherited: 0x30)
class UOnlineEngineInterface : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.OnlineSession
// Size: 0x30 (Inherited: 0x30)
class UOnlineSession : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PlayerInput
// Size: 0x3b0 (Inherited: 0x30)
class UPlayerInput : public UObject {
public:

	char pad_30[0xf8]; // 0x30(0xf8)
	struct TArray<struct FKeyBind> DebugExecBindings; // 0x128(0x10)
	char pad_138[0x30]; // 0x138(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x168(0x10)
	char pad_178[0x238]; // 0x178(0x238)

	void SetMouseSensitivity(float Sensitivity); // Function Engine.PlayerInput.SetMouseSensitivity // (Final|Exec|Native|Public) // @ game+0x9e83ab0
	void SetBind(struct FName BindName, struct FString Command); // Function Engine.PlayerInput.SetBind // (Final|Exec|Native|Public) // @ game+0x9e83420
	void InvertAxisKey(struct FKey AxisKey); // Function Engine.PlayerInput.InvertAxisKey // (Final|Exec|Native|Public) // @ game+0x9e82fa0
	void InvertAxis(struct FName AxisName); // Function Engine.PlayerInput.InvertAxis // (Final|Exec|Native|Public) // @ game+0x9e82f20
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // (Final|Exec|Native|Public) // @ game+0x9e82a90
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
class UCheatManager : public UObject {
public:

	struct ADebugCameraController* DebugCameraControllerRef; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	void Walk(); // Function Engine.CheatManager.Walk // (Exec|Native|Public|BlueprintCallable) // @ game+0x895960
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // (Exec|Native|Public) // @ game+0x9d9a180
	void ViewPlayer(struct FString S); // Function Engine.CheatManager.ViewPlayer // (Exec|Native|Public) // @ game+0x4a1e970
	void ViewClass(struct UClass* DesiredClass); // Function Engine.CheatManager.ViewClass // (Exec|Native|Public) // @ game+0x4970ae0
	void ViewActor(struct FName ActorName); // Function Engine.CheatManager.ViewActor // (Exec|Native|Public) // @ game+0x49709d0
	void UpdateSafeArea(); // Function Engine.CheatManager.UpdateSafeArea // (Final|Exec|Native|Public) // @ game+0x9d9a160
	void ToggleServerStatReplicatorUpdateStatNet(); // Function Engine.CheatManager.ToggleServerStatReplicatorUpdateStatNet // (Final|Exec|Native|Public) // @ game+0x9d9a140
	void ToggleServerStatReplicatorClientOverwrite(); // Function Engine.CheatManager.ToggleServerStatReplicatorClientOverwrite // (Final|Exec|Native|Public) // @ game+0x9d9a120
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // (Exec|Native|Public) // @ game+0xaa7710
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // (Exec|Native|Public) // @ game+0x9212d0
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // (Exec|Native|Public) // @ game+0x9d9a100
	void Teleport(); // Function Engine.CheatManager.Teleport // (Exec|Native|Public|BlueprintCallable) // @ game+0x924260
	void Summon(struct FString ClassName); // Function Engine.CheatManager.Summon // (Exec|Native|Public) // @ game+0x9d9a030
	void StreamLevelOut(struct FName PackageName); // Function Engine.CheatManager.StreamLevelOut // (Exec|Native|Public) // @ game+0x9d5c0c0
	void StreamLevelIn(struct FName PackageName); // Function Engine.CheatManager.StreamLevelIn // (Exec|Native|Public) // @ game+0x9d584a0
	void SpawnServerStatReplicator(); // Function Engine.CheatManager.SpawnServerStatReplicator // (Final|Exec|Native|Public) // @ game+0x9d9a010
	void Slomo(float NewTimeDilation); // Function Engine.CheatManager.Slomo // (Exec|Native|Public|BlueprintCallable) // @ game+0x48e3a00
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // (Final|Exec|Native|Public) // @ game+0x9d99ff0
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // (Exec|Native|Public) // @ game+0x129c6f0
	void ServerToggleAILogging(); // Function Engine.CheatManager.ServerToggleAILogging // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x9d99f20
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // (Exec|Native|Public|BlueprintCallable) // @ game+0x496f830
	void OnlyLoadLevel(struct FName PackageName); // Function Engine.CheatManager.OnlyLoadLevel // (Exec|Native|Public) // @ game+0x9d58530
	void LogLoc(); // Function Engine.CheatManager.LogLoc // (Exec|Native|Public) // @ game+0x40aad40
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // (Exec|Native|Public) // @ game+0x9d99f00
	void God(); // Function Engine.CheatManager.God // (Exec|Native|Public|BlueprintCallable) // @ game+0x8959a0
	void Ghost(); // Function Engine.CheatManager.Ghost // (Exec|Native|Public|BlueprintCallable) // @ game+0x895980
	void FreezeFrame(float Delay); // Function Engine.CheatManager.FreezeFrame // (Exec|Native|Public|BlueprintCallable) // @ game+0x624c650
	void Fly(); // Function Engine.CheatManager.Fly // (Exec|Native|Public|BlueprintCallable) // @ game+0xaa2210
	void FlushLog(); // Function Engine.CheatManager.FlushLog // (Exec|Native|Public) // @ game+0x40ab190
	void EnableDebugCamera(); // Function Engine.CheatManager.EnableDebugCamera // (Native|Protected|BlueprintCallable) // @ game+0x9d99ee0
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // (Exec|Native|Public) // @ game+0x48e3160
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // (Exec|Native|Public) // @ game+0x9d99ec0
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // (Exec|Native|Public) // @ game+0x9d99ea0
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // (Exec|Native|Public) // @ game+0x9d99e80
	void DisableDebugCamera(); // Function Engine.CheatManager.DisableDebugCamera // (Native|Protected|BlueprintCallable) // @ game+0x9d99e60
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // (Exec|Native|Public|BlueprintCallable) // @ game+0x4081b80
	void DestroyServerStatReplicator(); // Function Engine.CheatManager.DestroyServerStatReplicator // (Final|Exec|Native|Public) // @ game+0x9d99e40
	void DestroyPawns(struct UClass* aClass); // Function Engine.CheatManager.DestroyPawns // (Exec|Native|Public) // @ game+0x36a7e30
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // (Exec|Native|Public) // @ game+0xaa9850
	void DestroyAll(struct UClass* aClass); // Function Engine.CheatManager.DestroyAll // (Exec|Native|Public) // @ game+0xcb2b40
	void DebugCapsuleSweepSize(float HalfHeight, float radius); // Function Engine.CheatManager.DebugCapsuleSweepSize // (Exec|Native|Public) // @ game+0x9d99d70
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // (Exec|Native|Public) // @ game+0x9d99d50
	void DebugCapsuleSweepComplex(bool bTraceComplex); // Function Engine.CheatManager.DebugCapsuleSweepComplex // (Exec|Native|Public) // @ game+0x9d99cc0
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // (Exec|Native|Public) // @ game+0x9d99ca0
	void DebugCapsuleSweepChannel(enum class ECollisionChannel Channel); // Function Engine.CheatManager.DebugCapsuleSweepChannel // (Exec|Native|Public) // @ game+0x9d99c20
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // (Exec|Native|Public) // @ game+0x4094d90
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // (Exec|Native|Public) // @ game+0x9d99c00
	void DamageTarget(float DamageAmount); // Function Engine.CheatManager.DamageTarget // (Exec|Native|Public|BlueprintCallable) // @ game+0x9d99b80
	void CheatScript(struct FString ScriptName); // Function Engine.CheatManager.CheatScript // (Final|Exec|Native|Public) // @ game+0x9d99a60
	void ChangeSize(float F); // Function Engine.CheatManager.ChangeSize // (Exec|Native|Public|BlueprintCallable) // @ game+0xaa2310
	void BugItStringCreator(struct FVector ViewLocation, struct FRotator ViewRotation, struct FString& GoString, struct FString& LocString); // Function Engine.CheatManager.BugItStringCreator // (Exec|Native|Public|HasOutParms|HasDefaults) // @ game+0x9d99850
	void BugItGo(float X, float Y, float Z, float Pitch, float Yaw, float Roll); // Function Engine.CheatManager.BugItGo // (Exec|Native|Public) // @ game+0x9d99680
	void BugIt(struct FString ScreenShotDescription); // Function Engine.CheatManager.BugIt // (Exec|Native|Public) // @ game+0x9d995b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.GameUserSettings
// Size: 0x128 (Inherited: 0x30)
class UGameUserSettings : public UObject {
public:

	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x56]; // 0x32(0x56)
	uint32_t ResolutionSizeX; // 0x88(0x04)
	uint32_t ResolutionSizeY; // 0x8c(0x04)
	uint32_t LastUserConfirmedResolutionSizeX; // 0x90(0x04)
	uint32_t LastUserConfirmedResolutionSizeY; // 0x94(0x04)
	int32_t WindowPosX; // 0x98(0x04)
	int32_t WindowPosY; // 0x9c(0x04)
	int32_t FullscreenMode; // 0xa0(0x04)
	int32_t LastConfirmedFullscreenMode; // 0xa4(0x04)
	int32_t PreferredFullscreenMode; // 0xa8(0x04)
	uint32_t Version; // 0xac(0x04)
	int32_t AudioQualityLevel; // 0xb0(0x04)
	int32_t LastConfirmedAudioQualityLevel; // 0xb4(0x04)
	float FrameRateLimit; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	int32_t DesiredScreenWidth; // 0xc0(0x04)
	bool bUseDesiredScreenHeight; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
	int32_t DesiredScreenHeight; // 0xc8(0x04)
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xcc(0x04)
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xd0(0x04)
	float LastRecommendedScreenWidth; // 0xd4(0x04)
	float LastRecommendedScreenHeight; // 0xd8(0x04)
	float LastCPUBenchmarkResult; // 0xdc(0x04)
	float LastGPUBenchmarkResult; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xe8(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xf8(0x10)
	float LastGPUBenchmarkMultiplier; // 0x108(0x04)
	bool bUseHDRDisplayOutput; // 0x10c(0x01)
	char pad_10D[0x3]; // 0x10d(0x03)
	int32_t HDRDisplayOutputNits; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	/*struct FMulticastInlineDelegate*/char OnGameUserSettingsUINeedsUpdate[0x10]; // 0x118(0x10)

	void ValidateSettings(); // Function Engine.GameUserSettings.ValidateSettings // (Native|Public|BlueprintCallable) // @ game+0x895960
	bool SupportsHDRDisplayOutput(); // Function Engine.GameUserSettings.SupportsHDRDisplayOutput // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6eb0
	void SetVSyncEnabled(bool bEnable); // Function Engine.GameUserSettings.SetVSyncEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6d20
	void SetVisualEffectQuality(int32_t Value); // Function Engine.GameUserSettings.SetVisualEffectQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6e30
	void SetViewDistanceQuality(int32_t Value); // Function Engine.GameUserSettings.SetViewDistanceQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6db0
	void SetToDefaults(); // Function Engine.GameUserSettings.SetToDefaults // (Native|Public|BlueprintCallable) // @ game+0x4094dd0
	void SetTextureQuality(int32_t Value); // Function Engine.GameUserSettings.SetTextureQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6ca0
	void SetShadowQuality(int32_t Value); // Function Engine.GameUserSettings.SetShadowQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6c20
	void SetShadingQuality(int32_t Value); // Function Engine.GameUserSettings.SetShadingQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6ba0
	void SetScreenResolution(struct FIntPoint Resolution); // Function Engine.GameUserSettings.SetScreenResolution // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc6b20
	void SetResolutionScaleValueEx(float NewScaleValue); // Function Engine.GameUserSettings.SetResolutionScaleValueEx // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6aa0
	void SetResolutionScaleValue(int32_t NewScaleValue); // Function Engine.GameUserSettings.SetResolutionScaleValue // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6a20
	void SetResolutionScaleNormalized(float NewScaleNormalized); // Function Engine.GameUserSettings.SetResolutionScaleNormalized // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc69a0
	void SetPostProcessingQuality(int32_t Value); // Function Engine.GameUserSettings.SetPostProcessingQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6920
	void SetOverallScalabilityLevel(int32_t Value); // Function Engine.GameUserSettings.SetOverallScalabilityLevel // (Native|Public|BlueprintCallable) // @ game+0x8dfe3c0
	void SetFullscreenMode(enum class EWindowMode InFullscreenMode); // Function Engine.GameUserSettings.SetFullscreenMode // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc68a0
	void SetFrameRateLimit(float NewLimit); // Function Engine.GameUserSettings.SetFrameRateLimit // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6820
	void SetFoliageQuality(int32_t Value); // Function Engine.GameUserSettings.SetFoliageQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc67a0
	void SetDynamicResolutionEnabled(bool bEnable); // Function Engine.GameUserSettings.SetDynamicResolutionEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6710
	void SetBenchmarkFallbackValues(); // Function Engine.GameUserSettings.SetBenchmarkFallbackValues // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc66f0
	void SetAudioQualityLevel(int32_t QualityLevel); // Function Engine.GameUserSettings.SetAudioQualityLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc6670
	void SetAntiAliasingQuality(int32_t Value); // Function Engine.GameUserSettings.SetAntiAliasingQuality // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc65f0
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // (Native|Public|BlueprintCallable) // @ game+0x8959a0
	void RunHardwareBenchmark(int32_t WorkScale, float CPUMultiplier, float GPUMultiplier); // Function Engine.GameUserSettings.RunHardwareBenchmark // (Native|Public|BlueprintCallable) // @ game+0x9dc64f0
	void RevertVideoMode(); // Function Engine.GameUserSettings.RevertVideoMode // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc64d0
	void ResetToCurrentSettings(); // Function Engine.GameUserSettings.ResetToCurrentSettings // (Native|Public|BlueprintCallable) // @ game+0xaa2020
	void LoadSettings(bool bForceReload); // Function Engine.GameUserSettings.LoadSettings // (Native|Public|BlueprintCallable) // @ game+0x9dc6440
	bool IsVSyncEnabled(); // Function Engine.GameUserSettings.IsVSyncEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x49d90b0
	bool IsVSyncDirty(); // Function Engine.GameUserSettings.IsVSyncDirty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6410
	bool IsScreenResolutionDirty(); // Function Engine.GameUserSettings.IsScreenResolutionDirty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc63e0
	bool IsHDREnabled(); // Function Engine.GameUserSettings.IsHDREnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc63b0
	bool IsFullscreenModeDirty(); // Function Engine.GameUserSettings.IsFullscreenModeDirty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6380
	bool IsDynamicResolutionEnabled(); // Function Engine.GameUserSettings.IsDynamicResolutionEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6350
	bool IsDynamicResolutionDirty(); // Function Engine.GameUserSettings.IsDynamicResolutionDirty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6320
	bool IsDirty(); // Function Engine.GameUserSettings.IsDirty // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xaa7690
	int32_t GetVisualEffectQuality(); // Function Engine.GameUserSettings.GetVisualEffectQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc62c0
	int32_t GetViewDistanceQuality(); // Function Engine.GameUserSettings.GetViewDistanceQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6290
	int32_t GetTextureQuality(); // Function Engine.GameUserSettings.GetTextureQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6260
	int32_t STATIC_GetSyncInterval(); // Function Engine.GameUserSettings.GetSyncInterval // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dc6230
	int32_t GetShadowQuality(); // Function Engine.GameUserSettings.GetShadowQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6200
	int32_t GetShadingQuality(); // Function Engine.GameUserSettings.GetShadingQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc61d0
	struct FIntPoint GetScreenResolution(); // Function Engine.GameUserSettings.GetScreenResolution // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6150
	float GetResolutionScaleNormalized(); // Function Engine.GameUserSettings.GetResolutionScaleNormalized // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc6120
	void GetResolutionScaleInformationEx(float& CurrentScaleNormalized, float& CurrentScaleValue, float& MinScaleValue, float& MaxScaleValue); // Function Engine.GameUserSettings.GetResolutionScaleInformationEx // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5f80
	void GetResolutionScaleInformation(float& CurrentScaleNormalized, int32_t& CurrentScaleValue, int32_t& MinScaleValue, int32_t& MaxScaleValue); // Function Engine.GameUserSettings.GetResolutionScaleInformation // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5de0
	float GetRecommendedResolutionScale(); // Function Engine.GameUserSettings.GetRecommendedResolutionScale // (Native|Public|BlueprintCallable) // @ game+0x9dc5da0
	enum class EWindowMode GetPreferredFullscreenMode(); // Function Engine.GameUserSettings.GetPreferredFullscreenMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5d70
	int32_t GetPostProcessingQuality(); // Function Engine.GameUserSettings.GetPostProcessingQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5d40
	int32_t GetOverallScalabilityLevel(); // Function Engine.GameUserSettings.GetOverallScalabilityLevel // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5bd0
	struct FIntPoint GetLastConfirmedScreenResolution(); // Function Engine.GameUserSettings.GetLastConfirmedScreenResolution // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5b90
	enum class EWindowMode GetLastConfirmedFullscreenMode(); // Function Engine.GameUserSettings.GetLastConfirmedFullscreenMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5b60
	struct UGameUserSettings* STATIC_GetGameUserSettings(); // Function Engine.GameUserSettings.GetGameUserSettings // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc5b30
	enum class EWindowMode GetFullscreenMode(); // Function Engine.GameUserSettings.GetFullscreenMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5b00
	float GetFrameRateLimit(); // Function Engine.GameUserSettings.GetFrameRateLimit // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5ad0
	int32_t GetFoliageQuality(); // Function Engine.GameUserSettings.GetFoliageQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5aa0
	struct FIntPoint GetDesktopResolution(); // Function Engine.GameUserSettings.GetDesktopResolution // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5a60
	struct FIntPoint STATIC_GetDefaultWindowPosition(); // Function Engine.GameUserSettings.GetDefaultWindowPosition // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc5a20
	enum class EWindowMode STATIC_GetDefaultWindowMode(); // Function Engine.GameUserSettings.GetDefaultWindowMode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc59f0
	float GetDefaultResolutionScale(); // Function Engine.GameUserSettings.GetDefaultResolutionScale // (Native|Public|BlueprintCallable) // @ game+0x9dc59b0
	struct FIntPoint STATIC_GetDefaultResolution(); // Function Engine.GameUserSettings.GetDefaultResolution // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc5970
	int32_t GetCurrentHDRDisplayNits(); // Function Engine.GameUserSettings.GetCurrentHDRDisplayNits // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5940
	int32_t GetAudioQualityLevel(); // Function Engine.GameUserSettings.GetAudioQualityLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dc5920
	int32_t GetAntiAliasingQuality(); // Function Engine.GameUserSettings.GetAntiAliasingQuality // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2021460
	void EnableHDRDisplayOutput(bool bEnable, int32_t DisplayNits); // Function Engine.GameUserSettings.EnableHDRDisplayOutput // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc5860
	void ConfirmVideoMode(); // Function Engine.GameUserSettings.ConfirmVideoMode // (Native|Public|BlueprintCallable) // @ game+0x8964b0
	void ApplySettings(bool bCheckForCommandLineOverrides); // Function Engine.GameUserSettings.ApplySettings // (Native|Public|BlueprintCallable) // @ game+0x9021d70
	void ApplyResolutionSettings(bool bCheckForCommandLineOverrides); // Function Engine.GameUserSettings.ApplyResolutionSettings // (Final|Native|Public|BlueprintCallable) // @ game+0x9dc57d0
	void ApplyNonResolutionSettings(); // Function Engine.GameUserSettings.ApplyNonResolutionSettings // (Native|Public|BlueprintCallable) // @ game+0x895c00
	void ApplyHardwareBenchmarkResults(); // Function Engine.GameUserSettings.ApplyHardwareBenchmarkResults // (Native|Public|BlueprintCallable) // @ game+0x496f830
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DPICustomScalingRule
// Size: 0x30 (Inherited: 0x30)
class UDPICustomScalingRule : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimMetaData
// Size: 0x30 (Inherited: 0x30)
class UAnimMetaData : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavAreaBase
// Size: 0x38 (Inherited: 0x30)
class UNavAreaBase : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
class USaveGame : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EngineCustomTimeStep
// Size: 0x30 (Inherited: 0x30)
class UEngineCustomTimeStep : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Model
// Size: 0x2b0 (Inherited: 0x30)
class UModel : public UObject {
public:

	char pad_30[0x280]; // 0x30(0x280)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AISystemBase
// Size: 0x60 (Inherited: 0x30)
class UAISystemBase : public UObject {
public:

	struct FSoftClassPath AISystemClassName; // 0x30(0x18)
	struct FName AISystemModuleName; // 0x48(0x08)
	char pad_50[0x8]; // 0x50(0x08)
	bool bInstantiateAISystemOnClient; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimationBatchManager
// Size: 0x60 (Inherited: 0x30)
class UAnimationBatchManager : public UObject {
public:

	char pad_30[0x18]; // 0x30(0x18)
	struct TArray<struct USkeletalMeshComponent*> SkeletalMeshComps; // 0x48(0x10)
	char pad_58[0x8]; // 0x58(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimBoneCompressionSettings
// Size: 0x40 (Inherited: 0x30)
class UAnimBoneCompressionSettings : public UObject {
public:

	struct TArray<struct UAnimBoneCompressionCodec*> Codecs; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimClassData
// Size: 0x240 (Inherited: 0x30)
class UAnimClassData : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct FBakedAnimationStateMachine> BakedStateMachines; // 0x38(0x10)
	struct USkeleton* TargetSkeleton; // 0x48(0x08)
	struct TArray<struct FAnimNotifyEvent> AnimNotifies; // 0x50(0x10)
	struct TMap<struct FName, struct FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x60(0x50)
	struct TArray<struct FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xb0(0x10)
	/*struct TArray<struct TFieldPath<FNone>>*/char AnimNodeProperties[0x10]; // 0xc0(0x10)
	/*struct TArray<struct TFieldPath<FNone>>*/char LinkedAnimGraphNodeProperties[0x10]; // 0xd0(0x10)
	/*struct TArray<struct TFieldPath<FNone>>*/char LinkedAnimLayerNodeProperties[0x10]; // 0xe0(0x10)
	/*struct TArray<struct TFieldPath<FNone>>*/char PreUpdateNodeProperties[0x10]; // 0xf0(0x10)
	/*struct TArray<struct TFieldPath<FNone>>*/char DynamicResetNodeProperties[0x10]; // 0x100(0x10)
	/*struct TMap<struct FName, struct TFieldPath<FNone>>*/char AsestPlayerMapNodeProperties[0x50]; // 0x110(0x50)
	/*struct TArray<struct TFieldPath<FNone>>*/char StateMachineNodeProperties[0x10]; // 0x160(0x10)
	/*struct TArray<struct TFieldPath<FNone>>*/char InitializationNodeProperties[0x10]; // 0x170(0x10)
	struct TMap<struct FName, struct FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x180(0x50)
	struct TArray<struct FName> SyncGroupNames; // 0x1d0(0x10)
	struct TArray<struct FExposedValueHandler> EvaluateGraphExposedInputs; // 0x1e0(0x10)
	struct TMap<struct FName, struct FAnimGraphBlendOptions> GraphBlendOptions; // 0x1f0(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimClassInterface
// Size: 0x30 (Inherited: 0x30)
class UAnimClassInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimCurveCompressionSettings
// Size: 0x38 (Inherited: 0x30)
class UAnimCurveCompressionSettings : public UObject {
public:

	struct UAnimCurveCompressionCodec* Codec; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimLayerInterface
// Size: 0x30 (Inherited: 0x30)
class UAnimLayerInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimSet
// Size: 0xf8 (Inherited: 0x30)
class UAnimSet : public UObject {
public:

	char bAnimRotationOnly : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<struct FName> TrackBoneNames; // 0x38(0x10)
	struct TArray<struct FAnimSetMeshLinkup> LinkupCache; // 0x48(0x10)
	struct TArray<char> BoneUseAnimTranslation; // 0x58(0x10)
	struct TArray<char> ForceUseMeshTranslation; // 0x68(0x10)
	struct TArray<struct FName> UseTranslationBoneNames; // 0x78(0x10)
	struct TArray<struct FName> ForceMeshTranslationBoneNames; // 0x88(0x10)
	struct FName PreviewSkelMeshName; // 0x98(0x08)
	struct FName BestRatioSkelMeshName; // 0xa0(0x08)
	char pad_A8[0x50]; // 0xa8(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimStateMachineTypes
// Size: 0x30 (Inherited: 0x30)
class UAnimStateMachineTypes : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AssetExportTask
// Size: 0x80 (Inherited: 0x30)
class UAssetExportTask : public UObject {
public:

	struct UObject* Object; // 0x30(0x08)
	struct UExporter* Exporter; // 0x38(0x08)
	struct FString Filename; // 0x40(0x10)
	bool bSelected; // 0x50(0x01)
	bool bReplaceIdentical; // 0x51(0x01)
	bool bPrompt; // 0x52(0x01)
	bool bAutomated; // 0x53(0x01)
	bool bUseFileArchive; // 0x54(0x01)
	bool bWriteEmptyFiles; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	struct TArray<struct UObject*> IgnoreObjectList; // 0x58(0x10)
	struct UObject* Options; // 0x68(0x08)
	struct TArray<struct FString> Errors; // 0x70(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AssetImportData
// Size: 0x30 (Inherited: 0x30)
class UAssetImportData : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AssetMappingTable
// Size: 0x40 (Inherited: 0x30)
class UAssetMappingTable : public UObject {
public:

	struct TArray<struct FAssetMapping> MappedAssets; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AutomationTestSettings
// Size: 0x330 (Inherited: 0x30)
class UAutomationTestSettings : public UObject {
public:

	struct TArray<struct FString> EngineTestModules; // 0x30(0x10)
	struct TArray<struct FString> EditorTestModules; // 0x40(0x10)
	struct FSoftObjectPath AutomationTestmap; // 0x50(0x18)
	struct TArray<struct FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x68(0x10)
	struct TArray<struct FSoftObjectPath> AssetsToOpen; // 0x78(0x10)
	struct FBuildPromotionTestSettings BuildPromotionTest; // 0x88(0x1f0)
	struct FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x278(0x30)
	struct FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2a8(0x10)
	struct FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2b8(0x30)
	struct TArray<struct FString> TestLevelFolders; // 0x2e8(0x10)
	struct TArray<struct FExternalToolDefinition> ExternalTools; // 0x2f8(0x10)
	struct TArray<struct FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x308(0x10)
	struct TArray<struct FLaunchOnTestSettings> LaunchOnSettings; // 0x318(0x10)
	struct FIntPoint DefaultScreenshotResolution; // 0x328(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AvoidanceManager
// Size: 0xe8 (Inherited: 0x30)
class UAvoidanceManager : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	float DefaultTimeToLive; // 0x38(0x04)
	float LockTimeAfterAvoid; // 0x3c(0x04)
	float LockTimeAfterClean; // 0x40(0x04)
	float DeltaTimeToPredict; // 0x44(0x04)
	float ArtificialRadiusExpansion; // 0x48(0x04)
	float TestHeightDifference; // 0x4c(0x04)
	float HeightCheckMargin; // 0x50(0x04)
	char pad_54[0x94]; // 0x54(0x94)

	bool RegisterMovementComponent(struct UMovementComponent* MovementComp, float AvoidanceWeight); // Function Engine.AvoidanceManager.RegisterMovementComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x9d7cb40
	int32_t GetObjectCount(); // Function Engine.AvoidanceManager.GetObjectCount // (Final|Native|Public|BlueprintCallable) // @ game+0x9d7cb10
	int32_t GetNewAvoidanceUID(); // Function Engine.AvoidanceManager.GetNewAvoidanceUID // (Final|Native|Public|BlueprintCallable) // @ game+0x9d7cae0
	struct FVector GetAvoidanceVelocityForComponent(struct UMovementComponent* MovementComp); // Function Engine.AvoidanceManager.GetAvoidanceVelocityForComponent // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d7ca40
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BinaryAsset
// Size: 0xd0 (Inherited: 0x30)
class UBinaryAsset : public UObject {
public:

	char pad_30[0xa0]; // 0x30(0xa0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlendableInterface
// Size: 0x30 (Inherited: 0x30)
class UBlendableInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlendProfile
// Size: 0x50 (Inherited: 0x30)
class UBlendProfile : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct USkeleton* OwningSkeleton; // 0x38(0x08)
	struct TArray<struct FBlendProfileBoneEntry> ProfileEntries; // 0x40(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintExtension
// Size: 0x30 (Inherited: 0x30)
class UBlueprintExtension : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BoneMaskFilter
// Size: 0x40 (Inherited: 0x30)
class UBoneMaskFilter : public UObject {
public:

	struct TArray<struct FInputBlendPose> BlendPoses; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Breakpoint
// Size: 0x48 (Inherited: 0x30)
class UBreakpoint : public UObject {
public:

	char bEnabled : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UEdGraphNode* Node; // 0x38(0x08)
	char bStepOnce : 1; // 0x40(0x01)
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x40(0x01)
	char bStepOnce_RemoveAfterHit : 1; // 0x40(0x01)
	char pad_40_3 : 5; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BrushBuilder
// Size: 0x88 (Inherited: 0x30)
class UBrushBuilder : public UObject {
public:

	struct FString BitmapFilename; // 0x30(0x10)
	struct FString ToolTip; // 0x40(0x10)
	char NotifyBadParams : 1; // 0x50(0x01)
	char pad_50_1 : 7; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct TArray<struct FVector> Vertices; // 0x58(0x10)
	struct TArray<struct FBuilderPoly> Polys; // 0x68(0x10)
	struct FName Layer; // 0x78(0x08)
	char MergeCoplanars : 1; // 0x80(0x01)
	char pad_80_1 : 7; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ButtonStyleAsset
// Size: 0x2c8 (Inherited: 0x30)
class UButtonStyleAsset : public UObject {
public:

	struct FButtonStyle ButtonStyle; // 0x30(0x298)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CameraAnim
// Size: 0x9c0 (Inherited: 0x30)
class UCameraAnim : public UObject {
public:

	struct UInterpGroup* CameraInterpGroup; // 0x30(0x08)
	float AnimLength; // 0x38(0x04)
	struct FBox BoundingBox; // 0x3c(0x1c)
	char bRelativeToInitialTransform : 1; // 0x58(0x01)
	char bRelativeToInitialFOV : 1; // 0x58(0x01)
	char pad_58_2 : 6; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float BaseFOV; // 0x5c(0x04)
	struct FPostProcessSettings BasePostProcessSettings; // 0x60(0x950)
	float BasePostProcessBlendWeight; // 0x9b0(0x04)
	char pad_9B4[0xc]; // 0x9b4(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CameraAnimInst
// Size: 0x120 (Inherited: 0x30)
class UCameraAnimInst : public UObject {
public:

	struct UCameraAnim* CamAnim; // 0x30(0x08)
	struct UInterpGroupInst* InterpGroupInst; // 0x38(0x08)
	char pad_40[0x18]; // 0x40(0x18)
	float PlayRate; // 0x58(0x04)
	char pad_5C[0x14]; // 0x5c(0x14)
	struct UInterpTrackMove* MoveTrack; // 0x70(0x08)
	struct UInterpTrackInstMove* MoveInst; // 0x78(0x08)
	enum class ECameraAnimPlaySpace PlaySpace; // 0x80(0x01)
	char pad_81[0x9f]; // 0x81(0x9f)

	void Stop(bool bImmediate); // Function Engine.CameraAnimInst.Stop // (Final|Native|Public|BlueprintCallable) // @ game+0x9d8e6f0
	void SetScale(float NewDuration); // Function Engine.CameraAnimInst.SetScale // (Final|Native|Public|BlueprintCallable) // @ game+0x9d8e5e0
	void SetDuration(float NewDuration); // Function Engine.CameraAnimInst.SetDuration // (Final|Native|Public|BlueprintCallable) // @ game+0x9d8e2e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CameraShake
// Size: 0x170 (Inherited: 0x30)
class UCameraShake : public UObject {
public:

	char bSingleInstance : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float OscillationDuration; // 0x34(0x04)
	float OscillationBlendInTime; // 0x38(0x04)
	float OscillationBlendOutTime; // 0x3c(0x04)
	struct FROscillator RotOscillation; // 0x40(0x24)
	struct FVOscillator LocOscillation; // 0x64(0x24)
	struct FFOscillator FOVOscillation; // 0x88(0x0c)
	float AnimPlayRate; // 0x94(0x04)
	float AnimScale; // 0x98(0x04)
	float AnimBlendInTime; // 0x9c(0x04)
	float AnimBlendOutTime; // 0xa0(0x04)
	float RandomAnimSegmentDuration; // 0xa4(0x04)
	struct UCameraAnim* Anim; // 0xa8(0x08)
	char bRandomAnimSegment : 1; // 0xb0(0x01)
	char pad_B0_1 : 7; // 0xb0(0x01)
	char pad_B1[0x17]; // 0xb1(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc8(0x08)
	char pad_D0[0x88]; // 0xd0(0x88)
	float ShakeScale; // 0x158(0x04)
	float OscillatorTimeRemaining; // 0x15c(0x04)
	struct UCameraAnimInst* AnimInst; // 0x160(0x08)
	char pad_168[0x8]; // 0x168(0x08)

	void ReceiveStopShake(bool bImmediately); // Function Engine.CameraShake.ReceiveStopShake // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceivePlayShake(float Scale); // Function Engine.CameraShake.ReceivePlayShake // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	bool ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1761230
	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, struct FMinimalViewInfo& POV, struct FMinimalViewInfo& ModifiedPOV); // Function Engine.CameraShake.BlueprintUpdateCameraShake // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Canvas
// Size: 0x2d0 (Inherited: 0x30)
class UCanvas : public UObject {
public:

	float OrgX; // 0x30(0x04)
	float OrgY; // 0x34(0x04)
	float ClipX; // 0x38(0x04)
	float ClipY; // 0x3c(0x04)
	struct FColor DrawColor; // 0x40(0x04)
	char bCenterX : 1; // 0x44(0x01)
	char bCenterY : 1; // 0x44(0x01)
	char bNoSmooth : 1; // 0x44(0x01)
	char pad_44_3 : 5; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	int32_t SizeX; // 0x48(0x04)
	int32_t SizeY; // 0x4c(0x04)
	struct FPlane ColorModulate; // 0x50(0x10)
	struct UTexture2D* DefaultTexture; // 0x60(0x08)
	struct UTexture2D* GradientTexture0; // 0x68(0x08)
	struct UReporterGraph* ReporterGraph; // 0x70(0x08)
	char pad_78[0x258]; // 0x78(0x258)

	struct FVector2D K2_TextSize(struct UFont* RenderFont, struct FString RenderText, struct FVector2D Scale); // Function Engine.Canvas.K2_TextSize // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8df30
	struct FVector2D K2_StrLen(struct UFont* RenderFont, struct FString RenderText); // Function Engine.Canvas.K2_StrLen // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8de20
	struct FVector K2_Project(struct FVector WorldLocation); // Function Engine.Canvas.K2_Project // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8dd70
	void K2_DrawTriangle(struct UTexture* RenderTexture, struct TArray<struct FCanvasUVTri> Triangles); // Function Engine.Canvas.K2_DrawTriangle // (Final|Native|Public|BlueprintCallable) // @ game+0x9d8dc10
	void K2_DrawTexture(struct UTexture* RenderTexture, struct FVector2D ScreenPosition, struct FVector2D ScreenSize, struct FVector2D CoordinatePosition, struct FVector2D CoordinateSize, struct FLinearColor RenderColor, enum class EBlendMode BlendMode, float Rotation, struct FVector2D PivotPoint); // Function Engine.Canvas.K2_DrawTexture // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8d990
	void K2_DrawText(struct UFont* RenderFont, struct FString RenderText, struct FVector2D ScreenPosition, struct FVector2D Scale, struct FLinearColor RenderColor, float Kerning, struct FLinearColor ShadowColor, struct FVector2D ShadowOffset, bool bCentreX, bool bCentreY, bool bOutlined, struct FLinearColor OutlineColor); // Function Engine.Canvas.K2_DrawText // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8d5e0
	void K2_DrawPolygon(struct UTexture* RenderTexture, struct FVector2D ScreenPosition, struct FVector2D radius, int32_t NumberOfSides, struct FLinearColor RenderColor); // Function Engine.Canvas.K2_DrawPolygon // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8d450
	void K2_DrawMaterialTriangle(struct UMaterialInterface* RenderMaterial, struct TArray<struct FCanvasUVTri> Triangles); // Function Engine.Canvas.K2_DrawMaterialTriangle // (Final|Native|Public|BlueprintCallable) // @ game+0x9d8d2f0
	void K2_DrawMaterial(struct UMaterialInterface* RenderMaterial, struct FVector2D ScreenPosition, struct FVector2D ScreenSize, struct FVector2D CoordinatePosition, struct FVector2D CoordinateSize, float Rotation, struct FVector2D PivotPoint); // Function Engine.Canvas.K2_DrawMaterial // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8d0e0
	void K2_DrawLine(struct FVector2D ScreenPositionA, struct FVector2D ScreenPositionB, float Thickness, struct FLinearColor RenderColor); // Function Engine.Canvas.K2_DrawLine // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8cf90
	void K2_DrawBox(struct FVector2D ScreenPosition, struct FVector2D ScreenSize, float Thickness, struct FLinearColor RenderColor); // Function Engine.Canvas.K2_DrawBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8ce40
	void K2_DrawBorder(struct UTexture* BorderTexture, struct UTexture* BackgroundTexture, struct UTexture* LeftBorderTexture, struct UTexture* RightBorderTexture, struct UTexture* TopBorderTexture, struct UTexture* BottomBorderTexture, struct FVector2D ScreenPosition, struct FVector2D ScreenSize, struct FVector2D CoordinatePosition, struct FVector2D CoordinateSize, struct FLinearColor RenderColor, struct FVector2D BorderScale, struct FVector2D BackgroundScale, float Rotation, struct FVector2D PivotPoint, struct FVector2D CornerSize); // Function Engine.Canvas.K2_DrawBorder // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d8ca00
	void K2_Deproject(struct FVector2D ScreenPosition, struct FVector& WorldOrigin, struct FVector& WorldDirection); // Function Engine.Canvas.K2_Deproject // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d8c8e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ChaosPhysicalMaterial
// Size: 0x40 (Inherited: 0x30)
class UChaosPhysicalMaterial : public UObject {
public:

	float Friction; // 0x30(0x04)
	float Restitution; // 0x34(0x04)
	float SleepingLinearVelocityThreshold; // 0x38(0x04)
	float SleepingAngularVelocityThreshold; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CheckBoxStyleAsset
// Size: 0x5f8 (Inherited: 0x30)
class UCheckBoxStyleAsset : public UObject {
public:

	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0x5c8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Console
// Size: 0x138 (Inherited: 0x30)
class UConsole : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* ConsoleTargetPlayer; // 0x40(0x08)
	struct UTexture2D* DefaultTexture_Black; // 0x48(0x08)
	struct UTexture2D* DefaultTexture_White; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0xb8]; // 0x80(0xb8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CurveEdPresetCurve
// Size: 0x30 (Inherited: 0x30)
class UCurveEdPresetCurve : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CurveSourceInterface
// Size: 0x30 (Inherited: 0x30)
class UCurveSourceInterface : public UInterface {
public:


	float GetCurveValue(struct FName CurveName); // Function Engine.CurveSourceInterface.GetCurveValue // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x9d9fee0
	void GetCurves(struct TArray<struct FNamedCurveValue>& OutValues); // Function Engine.CurveSourceInterface.GetCurves // (Native|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x9d9ff80
	struct FName GetBindingName(); // Function Engine.CurveSourceInterface.GetBindingName // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x36d5850
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DamageType
// Size: 0x48 (Inherited: 0x30)
class UDamageType : public UObject {
public:

	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DestructibleInterface
// Size: 0x30 (Inherited: 0x30)
class UDestructibleInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DeviceProfileManager
// Size: 0xb8 (Inherited: 0x30)
class UDeviceProfileManager : public UObject {
public:

	struct TArray<struct UObject*> Profiles; // 0x30(0x10)
	char pad_40[0x78]; // 0x40(0x78)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DialogueVoice
// Size: 0x48 (Inherited: 0x30)
class UDialogueVoice : public UObject {
public:

	enum class EGrammaticalGender gender; // 0x30(0x01)
	enum class EGrammaticalNumber Plurality; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	struct FGuid LocalizationGUID; // 0x34(0x10)
	char pad_44[0x4]; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DialogueWave
// Size: 0x78 (Inherited: 0x30)
class UDialogueWave : public UObject {
public:

	char bMature : 1; // 0x30(0x01)
	char bOverride_SubtitleOverride : 1; // 0x30(0x01)
	char pad_30_2 : 6; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FString SpokenText; // 0x38(0x10)
	struct FString SubtitleOverride; // 0x48(0x10)
	struct TArray<struct FDialogueContextMapping> ContextMappings; // 0x58(0x10)
	struct FGuid LocalizationGUID; // 0x68(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EdGraph
// Size: 0x68 (Inherited: 0x30)
class UEdGraph : public UObject {
public:

	struct UClass* Schema; // 0x30(0x08)
	struct TArray<struct UEdGraphNode*> Nodes; // 0x38(0x10)
	char bEditable : 1; // 0x48(0x01)
	char bAllowDeletion : 1; // 0x48(0x01)
	char bAllowRenaming : 1; // 0x48(0x01)
	char pad_48_3 : 5; // 0x48(0x01)
	char pad_49[0x1f]; // 0x49(0x1f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.GraphNodeContextMenuContext
// Size: 0x58 (Inherited: 0x30)
class UGraphNodeContextMenuContext : public UObject {
public:

	struct UBlueprint* Blueprint; // 0x30(0x08)
	struct UEdGraph* Graph; // 0x38(0x08)
	struct UEdGraphNode* Node; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)
	bool bIsDebugging; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x120 (Inherited: 0x30)
class UEdGraphPin_Deprecated : public UObject {
public:

	struct FString PinName; // 0x30(0x10)
	struct FString PinToolTip; // 0x40(0x10)
	enum class EEdGraphPinDirection Direction; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct FEdGraphPinType PinType; // 0x58(0x58)
	struct FString DefaultValue; // 0xb0(0x10)
	struct FString AutogeneratedDefaultValue; // 0xc0(0x10)
	struct UObject* DefaultObject; // 0xd0(0x08)
	struct FText DefaultTextValue; // 0xd8(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> LinkedTo; // 0xf0(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> SubPins; // 0x100(0x10)
	struct UEdGraphPin_Deprecated* ParentPin; // 0x110(0x08)
	struct UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x118(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EdGraphSchema
// Size: 0x30 (Inherited: 0x30)
class UEdGraphSchema : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EngineBaseTypes
// Size: 0x30 (Inherited: 0x30)
class UEngineBaseTypes : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EngineHandlerComponentFactory
// Size: 0x30 (Inherited: 0x30)
class UEngineHandlerComponentFactory : public UHandlerComponentFactory {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EngineTypes
// Size: 0x30 (Inherited: 0x30)
class UEngineTypes : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Exporter
// Size: 0x80 (Inherited: 0x30)
class UExporter : public UObject {
public:

	struct UClass* SupportedClass; // 0x30(0x08)
	struct UObject* ExportRootScope; // 0x38(0x08)
	struct TArray<struct FString> FormatExtension; // 0x40(0x10)
	struct TArray<struct FString> FormatDescription; // 0x50(0x10)
	int32_t PreferredFormatIndex; // 0x60(0x04)
	int32_t TextIndent; // 0x64(0x04)
	char bText : 1; // 0x68(0x01)
	char bSelectedOnly : 1; // 0x68(0x01)
	char bForceFileOperations : 1; // 0x68(0x01)
	char pad_68_3 : 5; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UAssetExportTask* ExportTask; // 0x70(0x08)
	char pad_78[0x8]; // 0x78(0x08)

	bool ScriptRunAssetExportTask(struct UAssetExportTask* Task); // Function Engine.Exporter.ScriptRunAssetExportTask // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	bool STATIC_RunAssetExportTasks(struct TArray<struct UAssetExportTask*>& ExportTasks); // Function Engine.Exporter.RunAssetExportTasks // (Final|RequiredAPI|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9db36f0
	bool STATIC_RunAssetExportTask(struct UAssetExportTask* Task); // Function Engine.Exporter.RunAssetExportTask // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable) // @ game+0x9db3670
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Font
// Size: 0x1d8 (Inherited: 0x30)
class UFont : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	enum class EFontCacheType FontCacheType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct TArray<struct FFontCharacter> Characters; // 0x40(0x10)
	struct TArray<struct UTexture2D*> Textures; // 0x50(0x10)
	int32_t IsRemapped; // 0x60(0x04)
	float EmScale; // 0x64(0x04)
	float Ascent; // 0x68(0x04)
	float Descent; // 0x6c(0x04)
	float Leading; // 0x70(0x04)
	int32_t Kerning; // 0x74(0x04)
	struct FFontImportOptionsData ImportOptions; // 0x78(0xb0)
	int32_t NumCharacters; // 0x128(0x04)
	char pad_12C[0x4]; // 0x12c(0x04)
	struct TArray<int32_t> MaxCharHeight; // 0x130(0x10)
	float ScalingFactor; // 0x140(0x04)
	int32_t LegacyFontSize; // 0x144(0x04)
	struct FName LegacyFontName; // 0x148(0x08)
	struct FCompositeFont CompositeFont; // 0x150(0x38)
	char pad_188[0x50]; // 0x188(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.FontFace
// Size: 0x60 (Inherited: 0x30)
class UFontFace : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct FString SourceFilename; // 0x38(0x10)
	enum class EFontHinting Hinting; // 0x48(0x01)
	enum class EFontLoadingPolicy LoadingPolicy; // 0x49(0x01)
	enum class EFontLayoutMethod LayoutMethod; // 0x4a(0x01)
	char pad_4B[0x15]; // 0x4b(0x15)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.FontImportOptions
// Size: 0xe0 (Inherited: 0x30)
class UFontImportOptions : public UObject {
public:

	struct FFontImportOptionsData Data; // 0x30(0xb0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ForceFeedbackAttenuation
// Size: 0xf8 (Inherited: 0x30)
class UForceFeedbackAttenuation : public UObject {
public:

	struct FForceFeedbackAttenuationSettings Attenuation; // 0x30(0xc8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
class UForceFeedbackEffect : public UObject {
public:

	struct TArray<struct FForceFeedbackChannelDetails> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.GpuMergeTextureTask
// Size: 0x70 (Inherited: 0x30)
class UGpuMergeTextureTask : public UObject {
public:

	struct UGpuMergedTexture* TargetTexture; // 0x30(0x08)
	struct UGpuMergedTexture* IntermediateGpuMergedTexture; // 0x38(0x08)
	char pad_40[0x20]; // 0x40(0x20)
	int64_t WaitRtcEndTimeTicks; // 0x60(0x08)
	char pad_68[0x8]; // 0x68(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.HLODProxy
// Size: 0x40 (Inherited: 0x30)
class UHLODProxy : public UObject {
public:

	struct TArray<struct FHLODProxyMesh> ProxyMeshes; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AmbisonicsSubmixSettingsBase
// Size: 0x30 (Inherited: 0x30)
class UAmbisonicsSubmixSettingsBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SpatializationPluginSourceSettingsBase
// Size: 0x30 (Inherited: 0x30)
class USpatializationPluginSourceSettingsBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.OcclusionPluginSourceSettingsBase
// Size: 0x30 (Inherited: 0x30)
class UOcclusionPluginSourceSettingsBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundModulationPluginSourceSettingsBase
// Size: 0x30 (Inherited: 0x30)
class USoundModulationPluginSourceSettingsBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ReverbPluginSourceSettingsBase
// Size: 0x30 (Inherited: 0x30)
class UReverbPluginSourceSettingsBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ImportantToggleSettingInterface
// Size: 0x30 (Inherited: 0x30)
class UImportantToggleSettingInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InheritableComponentHandler
// Size: 0x50 (Inherited: 0x30)
class UInheritableComponentHandler : public UObject {
public:

	struct TArray<struct FComponentOverrideRecord> Records; // 0x30(0x10)
	struct TArray<struct UActorComponent*> UnnecessaryComponents; // 0x40(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InputSettings
// Size: 0xf8 (Inherited: 0x30)
class UInputSettings : public UObject {
public:

	struct TArray<struct FInputAxisConfigEntry> AxisConfig; // 0x30(0x10)
	char bAltEnterTogglesFullscreen : 1; // 0x40(0x01)
	char bF11TogglesFullscreen : 1; // 0x40(0x01)
	char bUseMouseForTouch : 1; // 0x40(0x01)
	char bEnableMouseSmoothing : 1; // 0x40(0x01)
	char bEnableFOVScaling : 1; // 0x40(0x01)
	char bCaptureMouseOnLaunch : 1; // 0x40(0x01)
	char bDefaultViewportMouseLock : 1; // 0x40(0x01)
	char bAlwaysShowTouchInterface : 1; // 0x40(0x01)
	char bShowConsoleOnFourFingerTap : 1; // 0x41(0x01)
	char bEnableGestureRecognizer : 1; // 0x41(0x01)
	char pad_41_2 : 6; // 0x41(0x01)
	bool bUseAutocorrect; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)
	struct TArray<struct FString> ExcludedAutocorrectOS; // 0x48(0x10)
	struct TArray<struct FString> ExcludedAutocorrectCultures; // 0x58(0x10)
	struct TArray<struct FString> ExcludedAutocorrectDeviceModels; // 0x68(0x10)
	enum class EMouseCaptureMode DefaultViewportMouseCaptureMode; // 0x78(0x01)
	enum class EMouseLockMode DefaultViewportMouseLockMode; // 0x79(0x01)
	char pad_7A[0x2]; // 0x7a(0x02)
	float FOVScale; // 0x7c(0x04)
	float DoubleClickTime; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct TArray<struct FInputActionKeyMapping> ActionMappings; // 0x88(0x10)
	struct TArray<struct FInputAxisKeyMapping> AxisMappings; // 0x98(0x10)
	struct TArray<struct FInputActionSpeechMapping> SpeechMappings; // 0xa8(0x10)
	struct FSoftObjectPath DefaultTouchInterface; // 0xb8(0x18)
	struct FKey ConsoleKey; // 0xd0(0x18)
	struct TArray<struct FKey> ConsoleKeys; // 0xe8(0x10)

	void SaveKeyMappings(); // Function Engine.InputSettings.SaveKeyMappings // (Final|Native|Public|BlueprintCallable) // @ game+0x9dd1dc0
	void RemoveAxisMapping(struct FInputAxisKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.RemoveAxisMapping // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd1b70
	void RemoveActionMapping(struct FInputActionKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.RemoveActionMapping // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd19f0
	struct UInputSettings* STATIC_GetInputSettings(); // Function Engine.InputSettings.GetInputSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dd1320
	void GetAxisNames(struct TArray<struct FName>& AxisNames); // Function Engine.InputSettings.GetAxisNames // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dd0e60
	void GetAxisMappingByName(struct FName InAxisName, struct TArray<struct FInputAxisKeyMapping>& OutMappings); // Function Engine.InputSettings.GetAxisMappingByName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dd0d00
	void GetActionNames(struct TArray<struct FName>& ActionNames); // Function Engine.InputSettings.GetActionNames // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dd0c30
	void GetActionMappingByName(struct FName InActionName, struct TArray<struct FInputActionKeyMapping>& OutMappings); // Function Engine.InputSettings.GetActionMappingByName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9dd0ad0
	void ForceRebuildKeymaps(); // Function Engine.InputSettings.ForceRebuildKeymaps // (Final|Native|Public|BlueprintCallable) // @ game+0x9dd0ab0
	void AddAxisMapping(struct FInputAxisKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.AddAxisMapping // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd0360
	void AddActionMapping(struct FInputActionKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.AddActionMapping // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd01e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Interface_AssetUserData
// Size: 0x30 (Inherited: 0x30)
class UInterface_AssetUserData : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Interface_CollisionDataProvider
// Size: 0x30 (Inherited: 0x30)
class UInterface_CollisionDataProvider : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Interface_PostProcessVolume
// Size: 0x30 (Inherited: 0x30)
class UInterface_PostProcessVolume : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Interface_PreviewMeshProvider
// Size: 0x30 (Inherited: 0x30)
class UInterface_PreviewMeshProvider : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpCurveEdSetup
// Size: 0x48 (Inherited: 0x30)
class UInterpCurveEdSetup : public UObject {
public:

	struct TArray<struct FCurveEdTab> Tabs; // 0x30(0x10)
	int32_t ActiveTab; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpData
// Size: 0x78 (Inherited: 0x30)
class UInterpData : public UObject {
public:

	float InterpLength; // 0x30(0x04)
	float PathBuildTime; // 0x34(0x04)
	struct TArray<struct UInterpGroup*> InterpGroups; // 0x38(0x10)
	struct UInterpCurveEdSetup* CurveEdSetup; // 0x48(0x08)
	float EdSectionStart; // 0x50(0x04)
	float EdSectionEnd; // 0x54(0x04)
	char bShouldBakeAndPrune : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct UInterpGroupDirector* CachedDirectorGroup; // 0x60(0x08)
	struct TArray<struct FName> AllEventNames; // 0x68(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.IntSerialization
// Size: 0x58 (Inherited: 0x30)
class UIntSerialization : public UObject {
public:

	uint16_t UnsignedInt16Variable; // 0x30(0x02)
	char pad_32[0x2]; // 0x32(0x02)
	uint32_t UnsignedInt32Variable; // 0x34(0x04)
	uint64_t UnsignedInt64Variable; // 0x38(0x08)
	int8_t SignedInt8Variable; // 0x40(0x01)
	char pad_41[0x1]; // 0x41(0x01)
	int16_t SignedInt16Variable; // 0x42(0x02)
	char pad_44[0x4]; // 0x44(0x04)
	int64_t SignedInt64Variable; // 0x48(0x08)
	char UnsignedInt8Variable; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	int32_t SignedInt32Variable; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Layer
// Size: 0x50 (Inherited: 0x30)
class ULayer : public UObject {
public:

	struct FName LayerName; // 0x30(0x08)
	char bIsVisible : 1; // 0x38(0x01)
	char pad_38_1 : 7; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct TArray<struct FLayerActorStats> ActorStats; // 0x40(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Level
// Size: 0x3c0 (Inherited: 0x30)
class ULevel : public UObject {
public:

	char pad_30[0x88-0x10]; // 0x30(0x88)
	struct TArray<struct AActor*> Actors;
	struct UWorld* OwningWorld; // 0xb8(0x08)
	struct UModel* Model; // 0xc0(0x08)
	struct TArray<struct UModelComponent*> ModelComponents; // 0xc8(0x10)
	struct ULevelActorContainer* ActorCluster; // 0xd8(0x08)
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0(0x04)
	int32_t NumTextureStreamingDirtyResources; // 0xe4(0x04)
	struct ALevelScriptActor* LevelScriptActor; // 0xe8(0x08)
	struct ANavigationObjectBase* NavListStart; // 0xf0(0x08)
	struct ANavigationObjectBase* NavListEnd; // 0xf8(0x08)
	struct TArray<struct UNavigationDataChunk*> NavDataChunks; // 0x100(0x10)
	float LightmapTotalSize; // 0x110(0x04)
	float ShadowmapTotalSize; // 0x114(0x04)
	struct TArray<struct FVector> StaticNavigableGeometry; // 0x118(0x10)
	struct TArray<struct FGuid> StreamingTextureGuids; // 0x128(0x10)
	char pad_138[0x98]; // 0x138(0x98)
	struct FGuid LevelBuildDataId; // 0x1d0(0x10)
	struct UMapBuildDataRegistry* MapBuildData; // 0x1e0(0x08)
	struct FIntVector LightBuildLevelOffset; // 0x1e8(0x0c)
	char bIsLightingScenario : 1; // 0x1f4(0x01)
	char pad_1F4_1 : 2; // 0x1f4(0x01)
	char bTextureStreamingRotationChanged : 1; // 0x1f4(0x01)
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4(0x01)
	char bIsVisible : 1; // 0x1f4(0x01)
	char pad_1F4_6 : 2; // 0x1f4(0x01)
	char pad_1F5[0x5b]; // 0x1f5(0x5b)
	struct AWorldSettings* WorldSettings; // 0x250(0x08)
	char pad_258[0x8]; // 0x258(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x260(0x10)
	char pad_270[0x10]; // 0x270(0x10)
	/*struct TArray<struct FReplicatedStaticActorDestructionInfo>*/char DestroyedReplicatedStaticActors[0x10]; // 0x280(0x10)
	char pad_290[0x130]; // 0x290(0x130)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LevelActorContainer
// Size: 0x40 (Inherited: 0x30)
class ULevelActorContainer : public UObject {
public:

	struct TArray<struct AActor*> actors; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LightmappedSurfaceCollection
// Size: 0x48 (Inherited: 0x30)
class ULightmappedSurfaceCollection : public UObject {
public:

	struct UModel* SourceModel; // 0x30(0x08)
	struct TArray<int32_t> Surfaces; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LightmassPrimitiveSettingsObject
// Size: 0x50 (Inherited: 0x30)
class ULightmassPrimitiveSettingsObject : public UObject {
public:

	struct FLightmassPrimitiveSettings LightmassSettings; // 0x30(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LocalLightGroupBake
// Size: 0x220 (Inherited: 0x30)
class ULocalLightGroupBake : public UObject {
public:

	struct TArray<struct FLocalLightGroupBakeLightMapInfo> LightMapInfos; // 0x30(0x10)
	struct TArray<struct FLocalLightGroupBakeShadowMapInfo> ShadowMapInfos; // 0x40(0x10)
	char pad_50[0x140]; // 0x50(0x140)
	struct TArray<struct ULightMapVirtualTexture2D*> ConvertedVTLightmaps; // 0x190(0x10)
	bool bForHD; // 0x1a0(0x01)
	char pad_1A1[0x7f]; // 0x1a1(0x7f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LocalReflectionGroupBake
// Size: 0xe8 (Inherited: 0x30)
class ULocalReflectionGroupBake : public UObject {
public:

	char pad_30[0xb8]; // 0x30(0xb8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MapBuildDataRegistry
// Size: 0x240 (Inherited: 0x30)
class UMapBuildDataRegistry : public UObject {
public:

	enum class ELightingBuildQuality LevelLightingQuality; // 0x30(0x01)
	char pad_31[0x20f]; // 0x31(0x20f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TetLightCache
// Size: 0x80 (Inherited: 0x30)
class UTetLightCache : public UObject {
public:

	char pad_30[0x50]; // 0x30(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MaterialParameterCollection
// Size: 0x80 (Inherited: 0x30)
class UMaterialParameterCollection : public UObject {
public:

	struct FGuid StateId; // 0x30(0x10)
	struct TArray<struct FCollectionScalarParameter> ScalarParameters; // 0x40(0x10)
	struct TArray<struct FCollectionVectorParameter> VectorParameters; // 0x50(0x10)
	char pad_60[0x20]; // 0x60(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MaterialParameterCollectionInstance
// Size: 0xf8 (Inherited: 0x30)
class UMaterialParameterCollectionInstance : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct UMaterialParameterCollection* Collection; // 0x38(0x08)
	char pad_40[0xb8]; // 0x40(0xb8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MatineeAnimInterface
// Size: 0x30 (Inherited: 0x30)
class UMatineeAnimInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MatineeInterface
// Size: 0x30 (Inherited: 0x30)
class UMatineeInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MorphTarget
// Size: 0x50 (Inherited: 0x30)
class UMorphTarget : public UObject {
public:

	struct USkeletalMesh* BaseSkelMesh; // 0x30(0x08)
	char pad_38[0x18]; // 0x38(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavAgentInterface
// Size: 0x30 (Inherited: 0x30)
class UNavAgentInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavCollisionBase
// Size: 0x78 (Inherited: 0x30)
class UNavCollisionBase : public UObject {
public:

	char bIsDynamicObstacle : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x47]; // 0x31(0x47)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavEdgeProviderInterface
// Size: 0x30 (Inherited: 0x30)
class UNavEdgeProviderInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavigationDataChunk
// Size: 0x38 (Inherited: 0x30)
class UNavigationDataChunk : public UObject {
public:

	struct FName NavigationDataName; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavigationDataInterface
// Size: 0x30 (Inherited: 0x30)
class UNavigationDataInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavigationSystemBase
// Size: 0x30 (Inherited: 0x30)
class UNavigationSystemBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavLinkDefinition
// Size: 0x58 (Inherited: 0x30)
class UNavLinkDefinition : public UObject {
public:

	struct TArray<struct FNavigationLink> Links; // 0x30(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x40(0x10)
	char pad_50[0x8]; // 0x50(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavPathObserverInterface
// Size: 0x30 (Inherited: 0x30)
class UNavPathObserverInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavRelevantInterface
// Size: 0x30 (Inherited: 0x30)
class UNavRelevantInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NetworkPredictionInterface
// Size: 0x30 (Inherited: 0x30)
class UNetworkPredictionInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NodeMappingContainer
// Size: 0x170 (Inherited: 0x30)
class UNodeMappingContainer : public UObject {
public:

	struct TMap<struct FName, struct FNodeItem> SourceItems; // 0x30(0x50)
	struct TMap<struct FName, struct FNodeItem> TargetItems; // 0x80(0x50)
	struct TMap<struct FName, struct FName> SourceToTarget; // 0xd0(0x50)
	/*struct TSoftObjectPtr<UObject>*/char SourceAsset[0x28]; // 0x120(0x28)
	/*struct TSoftObjectPtr<UObject>*/char TargetAsset[0x28]; // 0x148(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NodeMappingProviderInterface
// Size: 0x30 (Inherited: 0x30)
class UNodeMappingProviderInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.GI2DData
// Size: 0x80 (Inherited: 0x30)
class UGI2DData : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	/*struct TArray<struct TSoftObjectPtr<UTexture2D>>*/char GITextureSoftPtrs[0x10]; // 0x40(0x10)
	struct UTexture2D* GITexture; // 0x50(0x08)
	char pad_58[0x8]; // 0x58(0x08)
	struct UTexture2D* AOTexture; // 0x60(0x08)
	char pad_68[0x8]; // 0x68(0x08)
	struct FVector4 GI2DMinMax; // 0x70(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TetLightDataMap
// Size: 0x80 (Inherited: 0x30)
class UTetLightDataMap : public UObject {
public:

	/*struct TMap<struct FIntVector, struct TSoftObjectPtr<UTetLightData>>*/char DataMap[0x50]; // 0x30(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ObjectLibrary
// Size: 0xb0 (Inherited: 0x30)
class UObjectLibrary : public UObject {
public:

	struct UClass* ObjectBaseClass; // 0x30(0x08)
	bool bHasBlueprintClasses; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct TArray<struct UObject*> Objects; // 0x40(0x10)
	struct TArray<struct TWeakObjectPtr<struct UObject>> WeakObjects; // 0x50(0x10)
	bool bUseWeakReferences; // 0x60(0x01)
	bool bIsFullyLoaded; // 0x61(0x01)
	char pad_62[0x4e]; // 0x62(0x4e)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ObjectPoolInterface
// Size: 0x30 (Inherited: 0x30)
class UObjectPoolInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ObjectPoolableInterface
// Size: 0x30 (Inherited: 0x30)
class UObjectPoolableInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ObjectReferencer
// Size: 0x40 (Inherited: 0x30)
class UObjectReferencer : public UObject {
public:

	struct TArray<struct UObject*> ReferencedObjects; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ParticleLODLevel
// Size: 0xc0 (Inherited: 0x30)
class UParticleLODLevel : public UObject {
public:

	int32_t Level; // 0x30(0x04)
	char bEnabled : 1; // 0x34(0x01)
	char pad_34_1 : 7; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct UParticleModuleRequired* RequiredModule; // 0x38(0x08)
	struct TArray<struct UParticleModule*> Modules; // 0x40(0x10)
	struct UParticleModuleTypeDataBase* TypeDataModule; // 0x50(0x08)
	struct UParticleModuleSpawn* SpawnModule; // 0x58(0x08)
	struct UParticleModuleEventGenerator* EventGenerator; // 0x60(0x08)
	struct TArray<struct UParticleModuleSpawnBase*> SpawningModules; // 0x68(0x10)
	struct TArray<struct UParticleModule*> SpawnModules; // 0x78(0x10)
	struct TArray<struct UParticleModule*> UpdateModules; // 0x88(0x10)
	struct TArray<struct UParticleModuleOrbit*> OrbitModules; // 0x98(0x10)
	struct TArray<struct UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa8(0x10)
	char ConvertedModules : 1; // 0xb8(0x01)
	char pad_B8_1 : 7; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32_t PeakActiveParticles; // 0xbc(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ParticleModuleEventSendToGame
// Size: 0x30 (Inherited: 0x30)
class UParticleModuleEventSendToGame : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ParticleSystemReplay
// Size: 0x48 (Inherited: 0x30)
class UParticleSystemReplay : public UObject {
public:

	int32_t ClipIDNumber; // 0x30(0x04)
	char pad_34[0x14]; // 0x34(0x14)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PathFollowingAgentInterface
// Size: 0x30 (Inherited: 0x30)
class UPathFollowingAgentInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PhysicalMaterial
// Size: 0x88 (Inherited: 0x30)
class UPhysicalMaterial : public UObject {
public:

	float Friction; // 0x30(0x04)
	enum class EFrictionCombineMode FrictionCombineMode; // 0x34(0x01)
	bool bOverrideFrictionCombineMode; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	float Restitution; // 0x38(0x04)
	enum class EFrictionCombineMode RestitutionCombineMode; // 0x3c(0x01)
	bool bOverrideRestitutionCombineMode; // 0x3d(0x01)
	char pad_3E[0x2]; // 0x3e(0x02)
	float Density; // 0x40(0x04)
	float RaiseMassToPower; // 0x44(0x04)
	float DestructibleDamageThresholdScale; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x50(0x08)
	enum class EPhysicalSurface SurfaceType; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float TireFrictionScale; // 0x5c(0x04)
	struct TArray<struct FTireFrictionScalePair> TireFrictionScales; // 0x60(0x10)
	char pad_70[0x18]; // 0x70(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PhysicalMaterialPropertyBase
// Size: 0x30 (Inherited: 0x30)
class UPhysicalMaterialPropertyBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PhysicsAsset
// Size: 0x128 (Inherited: 0x30)
class UPhysicsAsset : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<int32_t> BoundsBodies; // 0x38(0x10)
	struct TArray<struct USkeletalBodySetup*> SkeletalBodySetups; // 0x48(0x10)
	struct TArray<struct UPhysicsConstraintTemplate*> ConstraintSetup; // 0x58(0x10)
	char bNotForDedicatedServer : 1; // 0x68(0x01)
	char pad_68_1 : 7; // 0x68(0x01)
	char pad_69[0xa7]; // 0x69(0xa7)
	struct UThumbnailInfo* ThumbnailInfo; // 0x110(0x08)
	struct TArray<struct UBodySetup*> BodySetup; // 0x118(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PhysicsCollisionHandler
// Size: 0x48 (Inherited: 0x30)
class UPhysicsCollisionHandler : public UObject {
public:

	float ImpactThreshold; // 0x30(0x04)
	float ImpactReFireDelay; // 0x34(0x04)
	struct USoundBase* DefaultImpactSound; // 0x38(0x08)
	float LastImpactSoundTime; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PhysicsConstraintTemplate
// Size: 0x300 (Inherited: 0x30)
class UPhysicsConstraintTemplate : public UObject {
public:

	struct FConstraintInstance DefaultInstance; // 0x30(0x1b8)
	struct TArray<struct FPhysicsConstraintProfileHandle> ProfileHandles; // 0x1e8(0x10)
	struct FConstraintProfileProperties DefaultProfile; // 0x1f8(0x104)
	char pad_2FC[0x4]; // 0x2fc(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PlatformInterfaceWebResponse
// Size: 0xb8 (Inherited: 0x30)
class UPlatformInterfaceWebResponse : public UObject {
public:

	struct FString OriginalURL; // 0x30(0x10)
	int32_t ResponseCode; // 0x40(0x04)
	int32_t Tag; // 0x44(0x04)
	struct FString StringResponse; // 0x48(0x10)
	struct TArray<char> BinaryResponse; // 0x58(0x10)
	char pad_68[0x50]; // 0x68(0x50)

	int32_t GetNumHeaders(); // Function Engine.PlatformInterfaceWebResponse.GetNumHeaders // (Native|Public) // @ game+0x9e73b80
	struct FString GetHeaderValue(struct FString HeaderName); // Function Engine.PlatformInterfaceWebResponse.GetHeaderValue // (Native|Public) // @ game+0x9e739e0
	void GetHeader(int32_t HeaderIndex, struct FString& Header, struct FString& Value); // Function Engine.PlatformInterfaceWebResponse.GetHeader // (Native|Public|HasOutParms) // @ game+0x9e73840
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Polys
// Size: 0x40 (Inherited: 0x30)
class UPolys : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PoseWatch
// Size: 0x40 (Inherited: 0x30)
class UPoseWatch : public UObject {
public:

	struct UEdGraphNode* Node; // 0x30(0x08)
	struct FColor PoseWatchColour; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PreBakeTODDirectionalShadowDepthMap
// Size: 0x80 (Inherited: 0x30)
class UPreBakeTODDirectionalShadowDepthMap : public UObject {
public:

	struct TMap<struct FString, struct FPreBakeDirectionalShadowDepthMap> DirectionalShadowDepthMaps; // 0x30(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PreviewCollectionInterface
// Size: 0x30 (Inherited: 0x30)
class UPreviewCollectionInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ReverbEffect
// Size: 0x60 (Inherited: 0x30)
class UReverbEffect : public UObject {
public:

	float Density; // 0x30(0x04)
	float Diffusion; // 0x34(0x04)
	float Gain; // 0x38(0x04)
	float GainHF; // 0x3c(0x04)
	float DecayTime; // 0x40(0x04)
	float DecayHFRatio; // 0x44(0x04)
	float ReflectionsGain; // 0x48(0x04)
	float ReflectionsDelay; // 0x4c(0x04)
	float LateGain; // 0x50(0x04)
	float LateDelay; // 0x54(0x04)
	float AirAbsorptionGainHF; // 0x58(0x04)
	float RoomRolloffFactor; // 0x5c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Rig
// Size: 0x58 (Inherited: 0x30)
class URig : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct FTransformBase> TransformBases; // 0x38(0x10)
	struct TArray<struct FNode> Nodes; // 0x48(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.RuntimeOptionsBase
// Size: 0x40 (Inherited: 0x30)
class URuntimeOptionsBase : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.RuntimeVirtualTexture
// Size: 0x170 (Inherited: 0x30)
class URuntimeVirtualTexture : public UObject {
public:

	int32_t TileCount; // 0x30(0x04)
	int32_t TileSize; // 0x34(0x04)
	int32_t TileBorderSize; // 0x38(0x04)
	enum class ERuntimeVirtualTextureMaterialType MaterialType; // 0x3c(0x01)
	bool bCompressTextures; // 0x3d(0x01)
	bool bEnableRTCDecompressSimulation; // 0x3e(0x01)
	char pad_3F[0x1]; // 0x3f(0x01)
	struct FRTCProfile RuntimeTexCompressionProfile; // 0x40(0x0c)
	struct FRTCProfile RTCProfileTex0; // 0x4c(0x0c)
	struct FRTCProfile RTCProfileTex1; // 0x58(0x0c)
	struct FRTCProfile RTCProfileTex2; // 0x64(0x0c)
	bool bEnable; // 0x70(0x01)
	bool bClearTextures; // 0x71(0x01)
	bool bSinglePhysicalSpace; // 0x72(0x01)
	bool bPrivateSpace; // 0x73(0x01)
	bool bAdaptive; // 0x74(0x01)
	bool bContinuousUpdate; // 0x75(0x01)
	bool bEnableScalability; // 0x76(0x01)
	char pad_77[0x1]; // 0x77(0x01)
	int32_t RemoveLowMips; // 0x78(0x04)
	int32_t size; // 0x7c(0x04)
	int32_t StreamLowMips; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct URuntimeVirtualTextureStreamingProxy* StreamingTexture_ForPC; // 0x88(0x08)
	struct URuntimeVirtualTextureStreamingProxy* StreamingTexture_Runtime; // 0x90(0x08)
	int32_t StreamTextureMipLevel; // 0x98(0x04)
	int32_t SubSVTRegionSize; // 0x9c(0x04)
	int32_t SubSVTRegionMipOffset; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FSVTRegionDataSoftObject RegionSVT0sSoftPath; // 0xa8(0x20)
	/*struct TSoftObjectPtr<URuntimeVirtualTextureStreamingProxy>*/char SVT1SoftPath[0x28]; // 0xc8(0x28)
	char pad_F0[0x80]; // 0xf0(0x80)

	int32_t GetSize(); // Function Engine.RuntimeVirtualTexture.GetSize // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e93480
	int32_t GetPageTableSize(); // Function Engine.RuntimeVirtualTexture.GetPageTableSize // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e93450
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.RVOAvoidanceInterface
// Size: 0x30 (Inherited: 0x30)
class URVOAvoidanceInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Scene
// Size: 0x30 (Inherited: 0x30)
class UScene : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SCS_Node
// Size: 0xe0 (Inherited: 0x30)
class USCS_Node : public UObject {
public:

	struct UClass* ComponentClass; // 0x30(0x08)
	struct UActorComponent* ComponentTemplate; // 0x38(0x08)
	struct FBlueprintCookedComponentInstancingData CookedComponentInstancingData; // 0x40(0x48)
	struct FName AttachToName; // 0x88(0x08)
	struct FName ParentComponentOrVariableName; // 0x90(0x08)
	struct FName ParentComponentOwnerClassName; // 0x98(0x08)
	bool bIsParentComponentNative; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
	struct TArray<struct USCS_Node*> ChildNodes; // 0xa8(0x10)
	struct TArray<struct FBPVariableMetaDataEntry> MetaDataArray; // 0xb8(0x10)
	struct FGuid VariableGuid; // 0xc8(0x10)
	struct FName InternalVariableName; // 0xd8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Selection
// Size: 0xa8 (Inherited: 0x30)
class USelection : public UObject {
public:

	char pad_30[0x78]; // 0x30(0x78)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SimpleConstructionScript
// Size: 0xa8 (Inherited: 0x30)
class USimpleConstructionScript : public UObject {
public:

	struct TArray<struct USCS_Node*> RootNodes; // 0x30(0x10)
	struct TArray<struct USCS_Node*> AllNodes; // 0x40(0x10)
	struct USCS_Node* DefaultSceneRootNode; // 0x50(0x08)
	char pad_58[0x50]; // 0x58(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SkeletalMeshSocket
// Size: 0x68 (Inherited: 0x30)
class USkeletalMeshSocket : public UObject {
public:

	struct FName SocketName; // 0x30(0x08)
	struct FName BoneName; // 0x38(0x08)
	struct FVector RelativeLocation; // 0x40(0x0c)
	struct FRotator RelativeRotation; // 0x4c(0x0c)
	struct FVector RelativeScale; // 0x58(0x0c)
	bool bForceAlwaysAnimated; // 0x64(0x01)
	char pad_65[0x1]; // 0x65(0x01)
	bool bOverrideByMeshOnlySocket; // 0x66(0x01)
	char pad_67[0x1]; // 0x67(0x01)

	void InitializeSocketFromLocation(struct USkeletalMeshComponent* SkelComp, struct FVector WorldLocation, struct FVector WorldNormal); // Function Engine.SkeletalMeshSocket.InitializeSocketFromLocation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9ea72a0
	struct FVector GetSocketLocation(struct USkeletalMeshComponent* SkelComp); // Function Engine.SkeletalMeshSocket.GetSocketLocation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ea7020
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SlateBrushAsset
// Size: 0xc0 (Inherited: 0x30)
class USlateBrushAsset : public UObject {
public:

	struct FSlateBrush Brush; // 0x30(0x90)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SlateTextureAtlasInterface
// Size: 0x30 (Inherited: 0x30)
class USlateTextureAtlasInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundAttenuation
// Size: 0x380 (Inherited: 0x30)
class USoundAttenuation : public UObject {
public:

	struct FSoundAttenuationSettings Attenuation; // 0x30(0x350)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundClass
// Size: 0x98 (Inherited: 0x30)
class USoundClass : public UObject {
public:

	struct FSoundClassProperties Properties; // 0x30(0x30)
	struct TArray<struct USoundClass*> ChildClasses; // 0x60(0x10)
	struct TArray<struct FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0x70(0x10)
	struct FSoundModulation Modulation; // 0x80(0x10)
	struct USoundClass* ParentClass; // 0x90(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundConcurrency
// Size: 0x50 (Inherited: 0x30)
class USoundConcurrency : public UObject {
public:

	struct FSoundConcurrencySettings Concurrency; // 0x30(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundEffectSourcePresetChain
// Size: 0x48 (Inherited: 0x30)
class USoundEffectSourcePresetChain : public UObject {
public:

	struct TArray<struct FSourceEffectChainEntry> Chain; // 0x30(0x10)
	char bPlayEffectChainTails : 1; // 0x40(0x01)
	char pad_40_1 : 7; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundGroups
// Size: 0x90 (Inherited: 0x30)
class USoundGroups : public UObject {
public:

	struct TArray<struct FSoundGroup> SoundGroupProfiles; // 0x30(0x10)
	char pad_40[0x50]; // 0x40(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundMix
// Size: 0x90 (Inherited: 0x30)
class USoundMix : public UObject {
public:

	char bApplyEQ : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float EQPriority; // 0x34(0x04)
	struct FAudioEQEffect EQSettings; // 0x38(0x38)
	struct TArray<struct FSoundClassAdjuster> SoundClassEffects; // 0x70(0x10)
	float InitialDelay; // 0x80(0x04)
	float FadeInTime; // 0x84(0x04)
	float Duration; // 0x88(0x04)
	float FadeOutTime; // 0x8c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundSubmix
// Size: 0x90 (Inherited: 0x30)
class USoundSubmix : public UObject {
public:

	struct TArray<struct USoundSubmix*> ChildSubmixes; // 0x30(0x10)
	struct USoundSubmix* ParentSubmix; // 0x40(0x08)
	enum class ESubmixChannelFormat ChannelFormat; // 0x48(0x01)
	char bMuteWhenBackgrounded : 1; // 0x49(0x01)
	char pad_49_1 : 7; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
	struct TArray<struct USoundEffectSubmixPreset*> SubmixEffectChain; // 0x50(0x10)
	struct UAmbisonicsSubmixSettingsBase* AmbisonicsPluginSettings; // 0x60(0x08)
	int32_t EnvelopeFollowerAttackTime; // 0x68(0x04)
	int32_t EnvelopeFollowerReleaseTime; // 0x6c(0x04)
	float OutputVolume; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	/*struct FMulticastInlineDelegate*/char OnSubmixRecordedFileDone[0x10]; // 0x78(0x10)
	char pad_88[0x8]; // 0x88(0x08)

	void StopRecordingOutput(struct UObject* WorldContextObject, enum class EAudioRecordingExportType ExportType, struct FString Name, struct FString Path, struct USoundWave* ExistingSoundWaveToOverwrite); // Function Engine.SoundSubmix.StopRecordingOutput // (Final|Native|Public|BlueprintCallable) // @ game+0x9eb8340
	void StopEnvelopeFollowing(struct UObject* WorldContextObject); // Function Engine.SoundSubmix.StopEnvelopeFollowing // (Final|Native|Public|BlueprintCallable) // @ game+0x9eb82c0
	void StartRecordingOutput(struct UObject* WorldContextObject, float ExpectedDuration); // Function Engine.SoundSubmix.StartRecordingOutput // (Final|Native|Public|BlueprintCallable) // @ game+0x9eb8200
	void StartEnvelopeFollowing(struct UObject* WorldContextObject); // Function Engine.SoundSubmix.StartEnvelopeFollowing // (Final|Native|Public|BlueprintCallable) // @ game+0x9eb8180
	void SetSubmixOutputVolume(struct UObject* WorldContextObject, float InOutputVolume); // Function Engine.SoundSubmix.SetSubmixOutputVolume // (Final|Native|Public|BlueprintCallable) // @ game+0x9eb7b60
	void AddEnvelopeFollowerDelegate(/*struct UObject* WorldContextObject, struct FDelegate& OnSubmixEnvelopeBP*/); // Function Engine.SoundSubmix.AddEnvelopeFollowerDelegate // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9eb2dc0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SplineMetadata
// Size: 0x30 (Inherited: 0x30)
class USplineMetadata : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.StaticMeshSocket
// Size: 0x70 (Inherited: 0x30)
class UStaticMeshSocket : public UObject {
public:

	struct FName SocketName; // 0x30(0x08)
	struct FVector RelativeLocation; // 0x38(0x0c)
	struct FRotator RelativeRotation; // 0x44(0x0c)
	struct FVector RelativeScale; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FString Tag; // 0x60(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.StringTable
// Size: 0x48 (Inherited: 0x30)
class UStringTable : public UObject {
public:

	char pad_30[0x18]; // 0x30(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SubsurfaceProfile
// Size: 0xc0 (Inherited: 0x30)
class USubsurfaceProfile : public UObject {
public:

	struct FSubsurfaceProfileStruct Settings; // 0x30(0x8c)
	char pad_BC[0x4]; // 0xbc(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SubUVAnimation
// Size: 0x70 (Inherited: 0x30)
class USubUVAnimation : public UObject {
public:

	struct UTexture2D* SubUVTexture; // 0x30(0x08)
	int32_t SubImages_Horizontal; // 0x38(0x04)
	int32_t SubImages_Vertical; // 0x3c(0x04)
	enum class ESubUVBoundingVertexCount BoundingMode; // 0x40(0x01)
	enum class EOpacitySourceMode OpacitySourceMode; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	float AlphaThreshold; // 0x44(0x04)
	char pad_48[0x28]; // 0x48(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TetLightData
// Size: 0x90 (Inherited: 0x30)
class UTetLightData : public UObject {
public:

	char pad_30[0x60]; // 0x30(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TextPropertyTestObject
// Size: 0x78 (Inherited: 0x30)
class UTextPropertyTestObject : public UObject {
public:

	struct FText DefaultedText; // 0x30(0x18)
	struct FText UndefaultedText; // 0x48(0x18)
	struct FText TransientText; // 0x60(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ThumbnailInfo
// Size: 0x30 (Inherited: 0x30)
class UThumbnailInfo : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TimelineTemplate
// Size: 0xb8 (Inherited: 0x30)
class UTimelineTemplate : public UObject {
public:

	float TimelineLength; // 0x30(0x04)
	enum class ETimelineLengthMode LengthMode; // 0x34(0x01)
	char bAutoPlay : 1; // 0x35(0x01)
	char bLoop : 1; // 0x35(0x01)
	char bReplicated : 1; // 0x35(0x01)
	char bIgnoreTimeDilation : 1; // 0x35(0x01)
	char pad_35_4 : 4; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	struct TArray<struct FTTEventTrack> EventTracks; // 0x38(0x10)
	struct TArray<struct FTTFloatTrack> FloatTracks; // 0x48(0x10)
	struct TArray<struct FTTVectorTrack> VectorTracks; // 0x58(0x10)
	struct TArray<struct FTTLinearColorTrack> LinearColorTracks; // 0x68(0x10)
	struct TArray<struct FBPVariableMetaDataEntry> MetaDataArray; // 0x78(0x10)
	struct FGuid TimelineGuid; // 0x88(0x10)
	struct FName VariableName; // 0x98(0x08)
	struct FName DirectionPropertyName; // 0xa0(0x08)
	struct FName UpdateFunctionName; // 0xa8(0x08)
	struct FName FinishedFunctionName; // 0xb0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TouchInterface
// Size: 0x60 (Inherited: 0x30)
class UTouchInterface : public UObject {
public:

	struct TArray<struct FTouchInputControl> Controls; // 0x30(0x10)
	float ActiveOpacity; // 0x40(0x04)
	float InactiveOpacity; // 0x44(0x04)
	float TimeUntilDeactive; // 0x48(0x04)
	float TimeUntilReset; // 0x4c(0x04)
	float ActivationDelay; // 0x50(0x04)
	bool bPreventRecenter; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	float StartupDelay; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.UserDefinedEnum
// Size: 0xb8 (Inherited: 0x68)
class UUserDefinedEnum : public UEnum {
public:

	struct TMap<struct FName, struct FText> DisplayNameMap; // 0x68(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.UserDefinedStruct
// Size: 0x118 (Inherited: 0xd0)
class UUserDefinedStruct : public UScriptStruct {
public:

	enum class EUserDefinedStructureStatus Status; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	struct FGuid Guid; // 0xd4(0x10)
	char pad_E4[0x34]; // 0xe4(0x34)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.VirtualTexturePoolConfig
// Size: 0x48 (Inherited: 0x30)
class UVirtualTexturePoolConfig : public UObject {
public:

	int32_t DefaultSizeInMegabyte; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<struct FVirtualTextureSpacePoolConfig> Pools; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.VisualLoggerAutomationTests
// Size: 0x30 (Inherited: 0x30)
class UVisualLoggerAutomationTests : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.VisualLoggerDebugSnapshotInterface
// Size: 0x30 (Inherited: 0x30)
class UVisualLoggerDebugSnapshotInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.HierarchicalLODSetup
// Size: 0x68 (Inherited: 0x30)
class UHierarchicalLODSetup : public UObject {
public:

	struct TArray<struct FHierarchicalSimplification> HierarchicalLODSetup; // 0x30(0x10)
	/*struct TSoftObjectPtr<UMaterialInterface>*/char OverrideBaseMaterial[0x28]; // 0x40(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// BlueprintGeneratedClass Engine.Default__BlueprintGeneratedClass
// Size: 0x00 (Inherited: 0x00)
class Default__BlueprintGeneratedClass {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// AnimBlueprintGeneratedClass Engine.Default__AnimBlueprintGeneratedClass
// Size: 0x00 (Inherited: 0x00)
class Default__AnimBlueprintGeneratedClass {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
class UBlueprintFunctionLibrary : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
class UAnimNotify : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)

	bool Received_Notify(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotify.Received_Notify // (Event|Public|BlueprintEvent|Const) // @ game+0x7ed88c0
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x9d713c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.GameInstance
// Size: 0x1a8 (Inherited: 0x30)
class UGameInstance : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct ULocalPlayer*> LocalPlayers; // 0x40(0x10)
	struct UOnlineSession* OnlineSession; // 0x50(0x08)
	struct TArray<struct UObject*> ReferencedObjects; // 0x58(0x10)
	char pad_68[0x140]; // 0x68(0x140)

	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void HandleTravelError(enum class ETravelFailure FailureType); // Function Engine.GameInstance.HandleTravelError // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer); // Function Engine.GameInstance.HandleNetworkError // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void DebugRemovePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugRemovePlayer // (Exec|Native|Public) // @ game+0x6fb0850
	void DebugCreatePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugCreatePlayer // (Exec|Native|Public) // @ game+0x9dbb2e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Subsystem
// Size: 0x38 (Inherited: 0x30)
class USubsystem : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Actor
// Size: 0x378 (Inherited: 0x30)
class AActor : public UObject {
public:

	struct FActorTickFunction PrimaryActorTick; // 0x30(0x68)
	char bHidden : 1; // 0x98(0x01)
	char bNetTemporary : 1; // 0x98(0x01)
	char bNetStartup : 1; // 0x98(0x01)
	char bOnlyRelevantToOwner : 1; // 0x98(0x01)
	char bAlwaysRelevant : 1; // 0x98(0x01)
	char bReplicateMovement : 1; // 0x98(0x01)
	char bShouldCallPreReplication : 1; // 0x98(0x01)
	char pad_98_7 : 1; // 0x98(0x01)
	char bTearOff : 1; // 0x99(0x01)
	char bExchangedRoles : 1; // 0x99(0x01)
	char bNetLoadOnClient : 1; // 0x99(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x99(0x01)
	char bRelevantForNetworkReplays : 1; // 0x99(0x01)
	char bRelevantForLevelBounds : 1; // 0x99(0x01)
	char bReplayRewindable : 1; // 0x99(0x01)
	char bAllowTickBeforeBeginPlay : 1; // 0x99(0x01)
	char bAllowBluePrintTick : 1; // 0x9a(0x01)
	char bAutoDestroyWhenFinished : 1; // 0x9a(0x01)
	char bBlockInput : 1; // 0x9a(0x01)
	char bCanBeDamaged : 1; // 0x9a(0x01)
	char bCollideWhenPlacing : 1; // 0x9a(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x9a(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x9a(0x01)
	char bIgnoresOriginShifting : 1; // 0x9a(0x01)
	char bEnableAutoLODGeneration : 1; // 0x9b(0x01)
	char bIsEditorOnlyActor : 1; // 0x9b(0x01)
	char bActorSeamlessTraveled : 1; // 0x9b(0x01)
	char bReplicates : 1; // 0x9b(0x01)
	char bCanBeInCluster : 1; // 0x9b(0x01)
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x9b(0x01)
	char pad_9B_6 : 2; // 0x9b(0x01)
	char pad_9C_0 : 6; // 0x9c(0x01)
	char bActorEnableCollision : 1; // 0x9c(0x01)
	char bActorIsBeingDestroyed : 1; // 0x9c(0x01)
	char pad_9D[0x1]; // 0x9d(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x9e(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x9f(0x01)
	enum class ENetRole RemoteRole; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FRepMovement ReplicatedMovement; // 0xa4(0x34)
	float InitialLifeSpan; // 0xd8(0x04)
	float CustomTimeDilation; // 0xdc(0x04)
	char pad_E0[0x8]; // 0xe0(0x08)
	struct FRepAttachment AttachmentReplication; // 0xe8(0x40)
	struct AActor* Owner; // 0x128(0x08)
	struct FName NetDriverName; // 0x130(0x08)
	enum class ENetRole Role; // 0x138(0x01)
	enum class ENetDormancy NetDormancy; // 0x139(0x01)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x13a(0x01)
	enum class EAutoReceiveInput AutoReceiveInput; // 0x13b(0x01)
	int32_t InputPriority; // 0x13c(0x04)
	struct UInputComponent* InputComponent; // 0x140(0x08)
	float NetCullDistanceSquared; // 0x148(0x04)
	float NetCullDistanceSquared_HD; // 0x14c(0x04)
	float NetCullDistanceSquared_M; // 0x150(0x04)
	int32_t NetTag; // 0x154(0x04)
	float NetUpdateFrequency; // 0x158(0x04)
	float MinNetUpdateFrequency; // 0x15c(0x04)
	float NetPriority; // 0x160(0x04)
	char pad_164[0xc]; // 0x164(0x0c)
	struct APawn* Instigator; // 0x170(0x08)
	struct TArray<struct AActor*> Children; // 0x178(0x10)
	struct USceneComponent* RootComponent; // 0x188(0x08)
	struct TArray<struct AMatineeActor*> ControllingMatineeActors; // 0x190(0x10)
	char pad_1A0[0x8]; // 0x1a0(0x08)
	struct TArray<struct FName> Layers; // 0x1a8(0x10)
	struct TWeakObjectPtr<struct UChildActorComponent> ParentComponent; // 0x1b8(0x08)
	struct TArray<struct FName> Tags; // 0x1c0(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x1d0(0x01)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x1d1(0x01)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x1d2(0x01)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x1d3(0x01)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0x1d4(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x1d5(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x1d6(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x1d7(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x1d8(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x1d9(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x1da(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x1db(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x1dc(0x01)
	struct FMulticastSparseDelegate OnActorHit; // 0x1dd(0x01)
	char pad_1DE[0x22]; // 0x1de(0x22)
	struct FMulticastSparseDelegate OnDestroyed; // 0x200(0x01)
	struct FMulticastSparseDelegate OnEndPlay; // 0x201(0x01)
	char pad_202[0x76]; // 0x202(0x76)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x278(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x288(0x10)
	char pad_298[0xe0]; // 0x298(0xe0)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5c950
	bool WasRecentlyContinuousRendered(struct UWorld* World, float Tolerance); // Function Engine.Actor.WasRecentlyContinuousRendered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5c890
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void TearOff(); // Function Engine.Actor.TearOff // (Native|Public|BlueprintCallable) // @ game+0x895c00
	void SnapRootComponentTo(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.SnapRootComponentTo // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5c7d0
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.Actor.SetTickGroup // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5c6c0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5c740
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x9d5c630
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement // (Native|Public|BlueprintCallable) // @ game+0x6391040
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner // (Native|Public|BlueprintCallable) // @ game+0x360c630
	void SetNetDormancy(enum class ENetDormancy NewDormancy); // Function Engine.Actor.SetNetDormancy // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x9d5c5b0
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan // (Native|Public|BlueprintCallable) // @ game+0x9d5c530
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5c4b0
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5c420
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d5c390
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d5c300
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame // (Native|Public|BlueprintCallable) // @ game+0x9d5c270
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5c1e0
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // @ game+0x9d5c150
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor // (Native|Public|BlueprintCallable) // @ game+0x9d5c0c0
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult& HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage // (BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x7ed88c0
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult& HitInfo); // Function Engine.Actor.ReceivePointDamage // (BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Engine.Actor.ReceiveHit // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.Actor.ReceiveEndPlay // (Event|Protected|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorOnClicked(struct FKey ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures // (Native|Public|BlueprintCallable) // @ game+0x9d5bfb0
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // (Native|Public) // @ game+0x8951b0
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // (Native|Public) // @ game+0x3624900
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // (Native|Protected) // @ game+0x921830
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // (Native|Public) // @ game+0xaa9890
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // (Native|Public) // @ game+0x895960
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise // (Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d5be20
	struct UMaterialInstanceDynamic* MakeMIDForMaterial(struct UMaterialInterface* Parent); // Function Engine.Actor.MakeMIDForMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5bd90
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d5bca0
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5baa0
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9d5b9c0
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5b7c0
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5b620
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5b480
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5b280
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5b0d0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5b0b0
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(struct UClass* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5afd0
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5af20
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5aeb0
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule); // Function Engine.Actor.K2_DetachFromActor // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5adb0
	void K2_DestroyComponent(struct UActorComponent* Component); // Function Engine.Actor.K2_DestroyComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5ad30
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // (Native|Public|BlueprintCallable) // @ game+0x49bcba0
	void K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5ab70
	void K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5a9b0
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5a860
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5a710
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5a510
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5a370
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d5a1d0
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d59fd0
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d59e30
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d59c90
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59c00
	bool IsChildActor(); // Function Engine.Actor.IsChildActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59bd0
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59ba0
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59b70
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59b40
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59aa0
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59a60
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59a10
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d599e0
	float GetSquaredDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59940
	enum class ENetRole GetRemoteRole(); // Function Engine.Actor.GetRemoteRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59920
	struct UChildActorComponent* GetParentComponent(); // Function Engine.Actor.GetParentComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d598f0
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d598c0
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d598a0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d597d0
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct UClass* ClassFilter); // Function Engine.Actor.GetOverlappingActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d596b0
	enum class ENetRole GetLocalRole(); // Function Engine.Actor.GetLocalRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59690
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59650
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59620
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d595f0
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d594f0
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59450
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59360
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d592c0
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59220
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d591f0
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d59150
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d590b0
	struct TArray<struct UActorComponent*> GetComponentsByTag(struct UClass* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58fa0
	struct TArray<struct UActorComponent*> GetComponentsByInterface(struct UClass* Interface); // Function Engine.Actor.GetComponentsByInterface // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58ec0
	struct UActorComponent* GetComponentByClass(struct UClass* ComponentClass); // Function Engine.Actor.GetComponentByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58e30
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58cd0
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58ca0
	void GetAttachedActors(struct TArray<struct AActor*>& OutActors, bool bResetArray); // Function Engine.Actor.GetAttachedActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58d10
	void GetAllChildActors(struct TArray<struct AActor*>& ChildActors, bool bIncludeDescendants); // Function Engine.Actor.GetAllChildActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58b80
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58b10
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58ae0
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58ab0
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58a70
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58a00
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d589c0
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58950
	void GetActorEyesViewPoint(struct FVector& OutLocation, struct FRotator& OutRotation); // Function Engine.Actor.GetActorEyesViewPoint // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58860
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58830
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector& Origin, struct FVector& BoxExtent); // Function Engine.Actor.GetActorBounds // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58700
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // (Native|Public|BlueprintCallable) // @ game+0x7895230
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x9d586e0
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput // (Native|Public|BlueprintCallable) // @ game+0x9d58650
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // (Native|Public|BlueprintCallable) // @ game+0xcb2910
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // (Final|Native|Public|BlueprintCallable) // @ game+0x9d585c0
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // @ game+0x9d58530
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor // (Native|Public|BlueprintCallable) // @ game+0x9d584a0
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, struct UObject* ComponentTemplateContext); // Function Engine.Actor.AddComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d582e0
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d58250
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
class UDataAsset : public UObject {
public:

	struct UClass* NativeClass; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ActorComponent
// Size: 0x100 (Inherited: 0x30)
class UActorComponent : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct FActorComponentTickFunction PrimaryComponentTick; // 0x38(0x68)
	struct TArray<struct FName> ComponentTags; // 0xa0(0x10)
	char bAllowBluePrintTick : 1; // 0xb0(0x01)
	char pad_B0_1 : 7; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0xb8(0x10)
	char pad_C8[0x8]; // 0xc8(0x08)
	char pad_D0_0 : 3; // 0xd0(0x01)
	char bReplicates : 1; // 0xd0(0x01)
	char bShouldCallPreReplication : 1; // 0xd0(0x01)
	char bNetAddressable : 1; // 0xd0(0x01)
	char bRegisterAsData : 1; // 0xd0(0x01)
	char pad_D0_7 : 1; // 0xd0(0x01)
	char pad_D1[0x1]; // 0xd1(0x01)
	enum class EComponentReplicationFlags ReplicationFlag; // 0xd2(0x01)
	char pad_D3_0 : 4; // 0xd3(0x01)
	char bAutoActivate : 1; // 0xd3(0x01)
	char bIsActive : 1; // 0xd3(0x01)
	char bEditableWhenInherited : 1; // 0xd3(0x01)
	char pad_D3_7 : 1; // 0xd3(0x01)
	char bCanEverAffectNavigation : 1; // 0xd4(0x01)
	char pad_D4_1 : 1; // 0xd4(0x01)
	char bIsEditorOnly : 1; // 0xd4(0x01)
	char pad_D4_3 : 5; // 0xd4(0x01)
	char pad_D5[0x1]; // 0xd5(0x01)
	enum class EComponentCreationMethod CreationMethod; // 0xd6(0x01)
	struct FMulticastSparseDelegate OnComponentActivated; // 0xd7(0x01)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
	struct TArray<struct FSimpleMemberReference> UCSModifiedProperties; // 0xe0(0x10)
	char pad_F0[0x10]; // 0xf0(0x10)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive // (Native|Public|BlueprintCallable) // @ game+0x921830
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.ActorComponent.SetTickGroup // (Final|Native|Public|BlueprintCallable) // @ game+0x9d602b0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused // (Final|Native|Public|BlueprintCallable) // @ game+0x9d60330
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated // (Final|Native|Public|BlueprintCallable) // @ game+0x9d60220
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval // (Final|Native|Public|BlueprintCallable) // @ game+0x9d601a0
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled // (Native|Public|BlueprintCallable) // @ game+0x9d60110
	void SetAutoActivate(bool bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate // (Native|Public|BlueprintCallable) // @ game+0x6391040
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive // (Native|Public|BlueprintCallable) // @ game+0x9d60040
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // @ game+0x9d5ffb0
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor // (Native|Public|BlueprintCallable) // @ game+0x9d5ff20
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // (Native|Public) // @ game+0x8951b0
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x9d5fe20
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5fdf0
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5fdc0
	bool IsActive(); // Function Engine.ActorComponent.IsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5fd90
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5fd70
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5fd40
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // (Native|Public|BlueprintCallable) // @ game+0x8964b0
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d5fb30
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // @ game+0x9d5f9e0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor // (Native|Public|BlueprintCallable) // @ game+0x9d5f950
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate // (Native|Public|BlueprintCallable) // @ game+0x624b450
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DeveloperSettings
// Size: 0x40 (Inherited: 0x30)
class UDeveloperSettings : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintCore
// Size: 0x58 (Inherited: 0x30)
class UBlueprintCore : public UObject {
public:

	struct UClass* SkeletonGeneratedClass; // 0x30(0x08)
	struct UClass* GeneratedClass; // 0x38(0x08)
	bool bLegacyNeedToPurgeSkelRefs; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FGuid BlueprintGuid; // 0x44(0x10)
	char pad_54[0x4]; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x370 (Inherited: 0x270)
class UBlueprintGeneratedClass : public UClass {
public:

	int32_t NumReplicatedProperties; // 0x270(0x04)
	char bHasNativizedParent : 1; // 0x274(0x01)
	char bHasCookedComponentInstancingData : 1; // 0x274(0x01)
	char pad_274_2 : 6; // 0x274(0x01)
	char pad_275[0x3]; // 0x275(0x03)
	struct TArray<struct UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x278(0x10)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x288(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x298(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides; // 0x2a8(0x10)
	/*struct USimpleConstructionScript**/char SimpleConstructionScript[0x8]; // 0x2b8(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x2c0(0x08)
	struct UStructProperty* UberGraphFramePointerProperty; // 0x2c8(0x08)
	char pad_2D0[0x8]; // 0x2d0(0x08)
	struct UFunction* UberGraphFunction; // 0x2d8(0x08)
	bool bForceClusteringDisable; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)
	struct TMap<struct FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2e8(0x50)
	char pad_338[0x38]; // 0x338(0x38)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintAsyncActionBase
// Size: 0x38 (Inherited: 0x30)
class UBlueprintAsyncActionBase : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate // (Native|Public|BlueprintCallable) // @ game+0x8951b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.StreamableRenderAsset
// Size: 0x48 (Inherited: 0x30)
class UStreamableRenderAsset : public UObject {
public:

	double ForceMipLevelsToBeResidentTimestamp; // 0x30(0x08)
	int32_t NumCinematicMipLevels; // 0x38(0x04)
	int32_t StreamingIndex; // 0x3c(0x04)
	int32_t CachedCombinedLODBias; // 0x40(0x04)
	char CachedNumResidentLODs; // 0x44(0x01)
	char CachedNumPerfectWantedLODs; // 0x45(0x01)
	char bCachedReadyForStreaming : 1; // 0x46(0x01)
	char NeverStream : 1; // 0x46(0x01)
	char bGlobalForceMipLevelsToBeResident : 1; // 0x46(0x01)
	char bIsStreamable : 1; // 0x46(0x01)
	char bHasStreamingUpdatePending : 1; // 0x46(0x01)
	char bForceMiplevelsToBeResident : 1; // 0x46(0x01)
	char bIgnoreStreamingMipBias : 1; // 0x46(0x01)
	char bUseCinematicMipLevels : 1; // 0x46(0x01)
	char bForceKeepFullMipLevels : 1; // 0x47(0x01)
	char pad_47_1 : 7; // 0x47(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimBoneCompressionCodec
// Size: 0x40 (Inherited: 0x30)
class UAnimBoneCompressionCodec : public UObject {
public:

	struct FString Description; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimCurveCompressionCodec
// Size: 0x30 (Inherited: 0x30)
class UAnimCurveCompressionCodec : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MaterialInterface
// Size: 0x90 (Inherited: 0x30)
class UMaterialInterface : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x40(0x08)
	char pad_48[0x10]; // 0x48(0x10)
	struct FLightmassMaterialInterfaceSettings LightmassSettings; // 0x58(0x10)
	struct TArray<struct FMaterialTextureInfo> TextureStreamingData; // 0x68(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x78(0x10)
	char pad_88[0x8]; // 0x88(0x08)

	void SetForceMipLevelsToBeResident(bool OverrideForceMiplevelsToBeResident, bool bForceMiplevelsToBeResidentValue, float ForceDuration, int32_t CinematicTextureGroups, bool bFastResponse); // Function Engine.MaterialInterface.SetForceMipLevelsToBeResident // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9e4ebe0
	struct UPhysicalMaterial* GetPhysicalMaterial(); // Function Engine.MaterialInterface.GetPhysicalMaterial // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x893de0
	struct UMaterial* GetBaseMaterial(); // Function Engine.MaterialInterface.GetBaseMaterial // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9e4e810
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LevelStreaming
// Size: 0x148 (Inherited: 0x30)
class ULevelStreaming : public UObject {
public:

	/*struct TSoftObjectPtr<UWorld>*/char WorldAsset[0x28]; // 0x30(0x28)
	struct FName PackageNameToLoad; // 0x58(0x08)
	struct TArray<struct FName> LODPackageNames; // 0x60(0x10)
	char pad_70[0x10]; // 0x70(0x10)
	struct FTransform LevelTransform; // 0x80(0x30)
	int32_t LevelLODIndex; // 0xb0(0x04)
	int32_t StreamingPriority; // 0xb4(0x04)
	char pad_B8[0x2]; // 0xb8(0x02)
	char pad_BA_0 : 3; // 0xba(0x01)
	char bShouldBeVisible : 1; // 0xba(0x01)
	char bShouldBeLoaded : 1; // 0xba(0x01)
	char bLocked : 1; // 0xba(0x01)
	char bIsStatic : 1; // 0xba(0x01)
	char bShouldBlockOnLoad : 1; // 0xba(0x01)
	char bShouldBlockOnUnload : 1; // 0xbb(0x01)
	char bDisableDistanceStreaming : 1; // 0xbb(0x01)
	char bDrawOnLevelStatusMap : 1; // 0xbb(0x01)
	char pad_BB_3 : 5; // 0xbb(0x01)
	struct FLinearColor LevelColor; // 0xbc(0x10)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct TArray<struct ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0(0x10)
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	/*struct FMulticastInlineDelegate*/char OnLevelLoaded[0x10]; // 0xe8(0x10)
	/*struct FMulticastInlineDelegate*/char OnLevelUnloaded[0x10]; // 0xf8(0x10)
	/*struct FMulticastInlineDelegate*/char OnLevelShown[0x10]; // 0x108(0x10)
	/*struct FMulticastInlineDelegate*/char OnLevelHidden[0x10]; // 0x118(0x10)
	struct ULevel* LoadedLevel; // 0x128(0x08)
	struct ULevel* PendingUnloadLevel; // 0x130(0x08)
	char pad_138[0x10]; // 0x138(0x10)

	bool ShouldBeLoaded(); // Function Engine.LevelStreaming.ShouldBeLoaded // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17617b0
	void SetShouldBeVisible(bool bInShouldBeVisible); // Function Engine.LevelStreaming.SetShouldBeVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x9e36cf0
	void SetShouldBeLoaded(bool bInShouldBeLoaded); // Function Engine.LevelStreaming.SetShouldBeLoaded // (Native|Public|BlueprintCallable) // @ game+0x9021d70
	void SetPriority(int32_t NewPriority); // Function Engine.LevelStreaming.SetPriority // (Final|Native|Public|BlueprintCallable) // @ game+0x9e36b70
	void SetLevelLODIndex(int32_t LodIndex); // Function Engine.LevelStreaming.SetLevelLODIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x9e36480
	bool IsStreamingStatePending(); // Function Engine.LevelStreaming.IsStreamingStatePending // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e35230
	bool IsLevelVisible(); // Function Engine.LevelStreaming.IsLevelVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e35200
	bool IsLevelLoaded(); // Function Engine.LevelStreaming.IsLevelLoaded // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e351d0
	struct FName GetWorldAssetPackageFName(); // Function Engine.LevelStreaming.GetWorldAssetPackageFName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9e35160
	struct ULevel* GetLoadedLevel(); // Function Engine.LevelStreaming.GetLoadedLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d598a0
	struct ALevelScriptActor* GetLevelScriptActor(); // Function Engine.LevelStreaming.GetLevelScriptActor // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e350c0
	struct ULevelStreaming* CreateInstance(struct FString UniqueInstanceName); // Function Engine.LevelStreaming.CreateInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x9e34fc0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
class UAnimNotifyState : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime); // Function Engine.AnimNotifyState.Received_NotifyTick // (Event|Public|BlueprintEvent|Const) // @ game+0x7ed88c0
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotifyState.Received_NotifyEnd // (Event|Public|BlueprintEvent|Const) // @ game+0x7ed88c0
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration); // Function Engine.AnimNotifyState.Received_NotifyBegin // (Event|Public|BlueprintEvent|Const) // @ game+0x7ed88c0
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x9d713c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpTrack
// Size: 0x78 (Inherited: 0x30)
class UInterpTrack : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UInterpTrack*> SubTracks; // 0x40(0x10)
	struct UClass* TrackInstClass; // 0x50(0x08)
	enum class ETrackActiveCondition ActiveCondition; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct FString TrackTitle; // 0x60(0x10)
	char bOnePerGroup : 1; // 0x70(0x01)
	char bDirGroupOnly : 1; // 0x70(0x01)
	char bDisableTrack : 1; // 0x70(0x01)
	char bIsSelected : 1; // 0x70(0x01)
	char bIsAnimControlTrack : 1; // 0x70(0x01)
	char bSubTrackOnly : 1; // 0x70(0x01)
	char bVisible : 1; // 0x70(0x01)
	char bIsRecording : 1; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpTrackInst
// Size: 0x30 (Inherited: 0x30)
class UInterpTrackInst : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Commandlet
// Size: 0x88 (Inherited: 0x30)
class UCommandlet : public UObject {
public:

	struct FString HelpDescription; // 0x30(0x10)
	struct FString HelpUsage; // 0x40(0x10)
	struct FString HelpWebLink; // 0x50(0x10)
	struct TArray<struct FString> HelpParamNames; // 0x60(0x10)
	struct TArray<struct FString> HelpParamDescriptions; // 0x70(0x10)
	char IsServer : 1; // 0x80(0x01)
	char IsClient : 1; // 0x80(0x01)
	char IsEditor : 1; // 0x80(0x01)
	char LogToConsole : 1; // 0x80(0x01)
	char ShowErrorCount : 1; // 0x80(0x01)
	char ForceSuccess : 1; // 0x80(0x01)
	char ShowProgress : 1; // 0x80(0x01)
	char pad_80_7 : 1; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Channel
// Size: 0x78 (Inherited: 0x30)
class UChannel : public UObject {
public:

	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x40]; // 0x38(0x40)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
class UPlayer : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct APlayerController* PlayerController; // 0x38(0x08)
	int32_t CurrentNetSpeed; // 0x40(0x04)
	int32_t ConfiguredInternetSpeed; // 0x44(0x04)
	int32_t ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NetDriver
// Size: 0x7b8 (Inherited: 0x30)
class UNetDriver : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	struct FString ReplicationDriverClassName; // 0x48(0x10)
	int32_t MaxDownloadSize; // 0x58(0x04)
	char bClampListenServerTickRate : 1; // 0x5c(0x01)
	char pad_5C_1 : 7; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	int32_t NetServerMaxTickRate; // 0x60(0x04)
	int32_t MaxNetTickRate; // 0x64(0x04)
	int32_t MaxInternetClientRate; // 0x68(0x04)
	int32_t MaxClientRate; // 0x6c(0x04)
	float ServerTravelPause; // 0x70(0x04)
	float SpawnPrioritySeconds; // 0x74(0x04)
	float RelevantTimeout; // 0x78(0x04)
	float KeepAliveTime; // 0x7c(0x04)
	float InitialConnectTimeout; // 0x80(0x04)
	float ConnectionTimeout; // 0x84(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x88(0x04)
	bool bNoTimeouts; // 0x8c(0x01)
	bool bNeverApplyNetworkEmulationSettings; // 0x8d(0x01)
	char pad_8E[0x2]; // 0x8e(0x02)
	struct UNetConnection* ServerConnection; // 0x90(0x08)
	struct TArray<struct UNetConnection*> ClientConnections; // 0x98(0x10)
	char pad_A8[0x60]; // 0xa8(0x60)
	int32_t RecentlyDisconnectedTrackingTime; // 0x108(0x04)
	char pad_10C[0x3c]; // 0x10c(0x3c)
	struct UWorld* World; // 0x148(0x08)
	struct UPackage* WorldPackage; // 0x150(0x08)
	char pad_158[0x20]; // 0x158(0x20)
	struct UClass* NetConnectionClass; // 0x178(0x08)
	struct UClass* ReplicationDriverClass; // 0x180(0x08)
	char pad_188[0x10]; // 0x188(0x10)
	struct FName NetDriverName; // 0x198(0x08)
	struct TArray<struct FChannelDefinition> ChannelDefinitions; // 0x1a0(0x10)
	struct TMap<struct FName, struct FChannelDefinition> ChannelDefinitionMap; // 0x1b0(0x50)
	struct TArray<struct UChannel*> ActorChannelPool; // 0x200(0x10)
	char pad_210[0x8]; // 0x210(0x08)
	float Time; // 0x218(0x04)
	char pad_21C[0x4d4]; // 0x21c(0x4d4)
	struct UReplicationDriver* ReplicationDriver; // 0x6f0(0x08)
	char pad_6F8[0xc0]; // 0x6f8(0xc0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MaterialExpression
// Size: 0x48 (Inherited: 0x30)
class UMaterialExpression : public UObject {
public:

	struct UMaterial* Material; // 0x30(0x08)
	struct UMaterialFunction* Function; // 0x38(0x08)
	char bIsParameterExpression : 1; // 0x40(0x01)
	char pad_40_1 : 7; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimInstance
// Size: 0x280 (Inherited: 0x30)
class UAnimInstance : public UObject {
public:

	struct USkeleton* CurrentSkeleton; // 0x30(0x08)
	enum class ERootMotionMode RootMotionMode; // 0x38(0x01)
	char bUseMultiThreadedAnimationUpdate : 1; // 0x39(0x01)
	char bUsingCopyPoseFromMesh : 1; // 0x39(0x01)
	char pad_39_2 : 2; // 0x39(0x01)
	char bQueueMontageEvents : 1; // 0x39(0x01)
	char pad_39_5 : 3; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	/*struct FMulticastInlineDelegate*/char OnMontageBlendingOut[0x10]; // 0x40(0x10)
	/*struct FMulticastInlineDelegate*/char OnMontageStarted[0x10]; // 0x50(0x10)
	/*struct FMulticastInlineDelegate*/char OnMontageEnded[0x10]; // 0x60(0x10)
	/*struct FMulticastInlineDelegate*/char OnAllMontageInstancesEnded[0x10]; // 0x70(0x10)
	char pad_80[0x88]; // 0x80(0x88)
	struct FAnimNotifyQueue NotifyQueue; // 0x108(0x70)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x178(0x10)
	char pad_188[0x61]; // 0x188(0x61)
	char bSkipBlueprintUpdateAnimation : 1; // 0x1e9(0x01)
	char bSkipBlueprintPostEvaluateAnimation : 1; // 0x1e9(0x01)
	char pad_1E9_2 : 6; // 0x1e9(0x01)
	char pad_1EA[0x96]; // 0x1ea(0x96)

	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x9d68220
	void UnlinkAnimClassLayers(struct UClass* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers // (Final|Native|Public|BlueprintCallable) // @ game+0x9d681a0
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d68170
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x9d680a0
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.AnimInstance.SnapshotPose // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9d67f80
	void SetRootMotionMode(enum class ERootMotionMode Value); // Function Engine.AnimInstance.SetRootMotionMode // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67f00
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67e40
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot // (Native|Public|BlueprintCallable) // @ game+0x72c5c60
	void ResetDynamics(enum class ETeleportType InTeleportType); // Function Engine.AnimInstance.ResetDynamics // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67dc0
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67b80
	float PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x9d679c0
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop // (Final|Native|Public|BlueprintCallable) // @ game+0x9d678f0
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67830
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67770
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67670
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume // (Final|Native|Public|BlueprintCallable) // @ game+0x9d675f0
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_Play // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67460
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause // (Final|Native|Public|BlueprintCallable) // @ game+0x9d673e0
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67320
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection // (Final|Native|Public|BlueprintCallable) // @ game+0x9d67260
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d671d0
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d67140
	float Montage_GetPosition(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d670a0
	float Montage_GetPlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPlayRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d67000
	bool Montage_GetIsStopped(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetIsStopped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66f70
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66ee0
	float Montage_GetBlendTime(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetBlendTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66e40
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x9d66d70
	void LinkAnimGraphByTag(struct FName InTag, struct UClass* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag // (Final|Native|Public|BlueprintCallable) // @ game+0x9d66cb0
	void LinkAnimClassLayers(struct UClass* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers // (Final|Native|Public|BlueprintCallable) // @ game+0x9d66c30
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66ae0
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66a20
	bool IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d669f0
	bool HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66930
	bool GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime); // Function Engine.AnimInstance.GetTimeToClosestMarker // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66820
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(struct FName InSyncGroupName); // Function Engine.AnimInstance.GetSyncGroupPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66780
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d666c0
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d66600
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d66540
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d66480
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d663c0
	struct USkeletalMeshComponent* GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66390
	struct AActor* GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66360
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d662d0
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(struct UClass* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66240
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d66130
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d660a0
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65fe0
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65f20
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65e60
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65da0
	float GetInstanceMachineWeight(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceMachineWeight // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65d10
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65c80
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65bf0
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65b60
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65ad0
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65a40
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d659b0
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d65910
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d65880
	struct UAnimMontage* GetCurrentActiveMontage(); // Function Engine.AnimInstance.GetCurrentActiveMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d65850
	struct TMap<struct FName, float> GetAnimAssetPlayPositions(); // Function Engine.AnimInstance.GetAnimAssetPlayPositions // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d65710
	float GetAnimAssetPlayPosition(struct FName InName); // Function Engine.AnimInstance.GetAnimAssetPlayPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d65670
	void GetAllCurveNames(struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetAllCurveNames // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d655a0
	void GetActiveCurveNames(enum class EAnimCurveType CurveType, struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetActiveCurveNames // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d65490
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets // (Final|Native|Public|BlueprintCallable) // @ game+0x9d65470
	float CalculateDirection(struct FVector& Velocity, struct FRotator& BaseRotation); // Function Engine.AnimInstance.CalculateDirection // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d65370
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BlueprintBeginPlay(); // Function Engine.AnimInstance.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Engine
// Size: 0xf60 (Inherited: 0x30)
class UEngine : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FSoftObjectPath TinyFontName; // 0x40(0x18)
	struct UFont* SmallFont; // 0x58(0x08)
	struct FSoftObjectPath SmallFontName; // 0x60(0x18)
	struct UFont* MediumFont; // 0x78(0x08)
	struct FSoftObjectPath MediumFontName; // 0x80(0x18)
	struct UFont* LargeFont; // 0x98(0x08)
	struct FSoftObjectPath LargeFontName; // 0xa0(0x18)
	struct UFont* SubtitleFont; // 0xb8(0x08)
	struct FSoftObjectPath SubtitleFontName; // 0xc0(0x18)
	struct TArray<struct UFont*> AdditionalFonts; // 0xd8(0x10)
	char pad_E8[0x8]; // 0xe8(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0xf0(0x10)
	struct UClass* ConsoleClass; // 0x100(0x08)
	struct FSoftClassPath ConsoleClassName; // 0x108(0x18)
	struct UClass* GameViewportClientClass; // 0x120(0x08)
	struct FSoftClassPath GameViewportClientClassName; // 0x128(0x18)
	struct UClass* LocalPlayerClass; // 0x140(0x08)
	struct FSoftClassPath LocalPlayerClassName; // 0x148(0x18)
	struct UClass* WorldSettingsClass; // 0x160(0x08)
	struct FSoftClassPath WorldSettingsClassName; // 0x168(0x18)
	struct FSoftClassPath NavigationSystemClassName; // 0x180(0x18)
	struct UClass* NavigationSystemClass; // 0x198(0x08)
	struct FSoftClassPath NavigationSystemConfigClassName; // 0x1a0(0x18)
	struct UClass* NavigationSystemConfigClass; // 0x1b8(0x08)
	struct FSoftClassPath AvoidanceManagerClassName; // 0x1c0(0x18)
	struct UClass* AvoidanceManagerClass; // 0x1d8(0x08)
	struct UClass* PhysicsCollisionHandlerClass; // 0x1e0(0x08)
	struct FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1e8(0x18)
	struct FSoftClassPath GameUserSettingsClassName; // 0x200(0x18)
	struct UClass* GameUserSettingsClass; // 0x218(0x08)
	struct FSoftClassPath AIControllerClassName; // 0x220(0x18)
	struct UGameUserSettings* GameUserSettings; // 0x238(0x08)
	struct UClass* LevelScriptActorClass; // 0x240(0x08)
	struct FSoftClassPath LevelScriptActorClassName; // 0x248(0x18)
	struct FSoftClassPath DefaultBlueprintBaseClassName; // 0x260(0x18)
	struct FSoftClassPath GameSingletonClassName; // 0x278(0x18)
	struct UObject* GameSingleton; // 0x290(0x08)
	struct FSoftClassPath AssetManagerClassName; // 0x298(0x18)
	struct UAssetManager* AssetManager; // 0x2b0(0x08)
	struct UTexture2D* DefaultTexture; // 0x2b8(0x08)
	struct FSoftObjectPath DefaultTextureName; // 0x2c0(0x18)
	struct UTexture* DefaultDiffuseTexture; // 0x2d8(0x08)
	struct FSoftObjectPath DefaultDiffuseTextureName; // 0x2e0(0x18)
	struct UTexture2D* DefaultBSPVertexTexture; // 0x2f8(0x08)
	struct FSoftObjectPath DefaultBSPVertexTextureName; // 0x300(0x18)
	struct UTexture2D* HighFrequencyNoiseTexture; // 0x318(0x08)
	struct FSoftObjectPath HighFrequencyNoiseTextureName; // 0x320(0x18)
	struct UTexture2D* DefaultBokehTexture; // 0x338(0x08)
	struct FSoftObjectPath DefaultBokehTextureName; // 0x340(0x18)
	struct UTexture2D* DefaultBloomKernelTexture; // 0x358(0x08)
	struct FSoftObjectPath DefaultBloomKernelTextureName; // 0x360(0x18)
	struct UMaterial* WireframeMaterial; // 0x378(0x08)
	struct FString WireframeMaterialName; // 0x380(0x10)
	struct UMaterial* HairDefaultMaterial; // 0x390(0x08)
	struct FString HairDefaultMaterialName; // 0x398(0x10)
	struct UMaterial* HairDebugMaterial; // 0x3a8(0x08)
	struct FString HairDebugMaterialName; // 0x3b0(0x10)
	struct UMaterial* ErrorMeshMaterial; // 0x3c0(0x08)
	struct UMaterial* WIPMeshMaterial; // 0x3c8(0x08)
	struct UMaterial* WarningMeshMaterial; // 0x3d0(0x08)
	struct FString ErrorMeshMaterialName; // 0x3d8(0x10)
	struct FString WIPMeshMaterialName; // 0x3e8(0x10)
	struct FString WarningMeshMaterialName; // 0x3f8(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x408(0x08)
	struct FSoftObjectPath DebugMeshMaterialName; // 0x410(0x18)
	struct UMaterial* EmissiveMeshMaterial; // 0x428(0x08)
	struct FSoftObjectPath EmissiveMeshMaterialName; // 0x430(0x18)
	struct UMaterial* LevelColorationLitMaterial; // 0x448(0x08)
	struct FString LevelColorationLitMaterialName; // 0x450(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x460(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x468(0x10)
	struct UMaterial* LightingTexelDensityMaterial; // 0x478(0x08)
	struct FString LightingTexelDensityName; // 0x480(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x490(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x498(0x10)
	struct UMaterial* ShadedLevelColorationUnlitMaterial; // 0x4a8(0x08)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x4b0(0x10)
	struct UMaterial* SolidCollisionMaterial; // 0x4c0(0x08)
	struct FString SolidCollisionMaterialName; // 0x4c8(0x10)
	struct UMaterial* VolumeTranslucenceMaterial; // 0x4d8(0x08)
	struct FString VolumeTranslucenceMaterialName; // 0x4e0(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x4f0(0x08)
	struct FSoftObjectPath RemoveSurfaceMaterialName; // 0x4f8(0x18)
	struct UMaterial* VertexColorMaterial; // 0x510(0x08)
	struct FString VertexColorMaterialName; // 0x518(0x10)
	struct UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x528(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x530(0x10)
	struct UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x540(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x548(0x10)
	struct UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x558(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x560(0x10)
	struct UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x570(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x578(0x10)
	struct UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x588(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x590(0x10)
	struct FSoftObjectPath DebugEditorMaterialName; // 0x5a0(0x18)
	struct UMaterial* ConstraintLimitMaterial; // 0x5b8(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x5c0(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x5c8(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x5d0(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x5d8(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x5e0(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x5e8(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x5f0(0x08)
	struct UMaterial* InvalidLightmapSettingsMaterial; // 0x5f8(0x08)
	struct FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x600(0x18)
	struct UMaterial* PreviewShadowsIndicatorMaterial; // 0x618(0x08)
	struct FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x620(0x18)
	struct UMaterial* ArrowMaterial; // 0x638(0x08)
	struct UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x640(0x08)
	struct FSoftObjectPath ArrowMaterialName; // 0x648(0x18)
	struct FLinearColor LightingOnlyBrightness; // 0x660(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x670(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x680(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x690(0x10)
	struct TArray<struct FLinearColor> CustomLightComplexityColors; // 0x6a0(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x6b0(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x6c0(0x10)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x6d0(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x6e0(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x6f0(0x04)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x6f4(0x04)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x6f8(0x04)
	float MinLightMapDensity; // 0x6fc(0x04)
	float IdealLightMapDensity; // 0x700(0x04)
	float MaxLightMapDensity; // 0x704(0x04)
	char bRenderLightMapDensityGrayscale : 1; // 0x708(0x01)
	char pad_708_1 : 7; // 0x708(0x01)
	char pad_709[0x3]; // 0x709(0x03)
	float RenderLightMapDensityGrayscaleScale; // 0x70c(0x04)
	float RenderLightMapDensityColorScale; // 0x710(0x04)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x714(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x724(0x10)
	char pad_734[0x4]; // 0x734(0x04)
	struct TArray<struct FStatColorMapping> StatColorMappings; // 0x738(0x10)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x748(0x08)
	struct FSoftObjectPath DefaultPhysMaterialName; // 0x750(0x18)
	struct TArray<struct FGameNameRedirect> ActiveGameNameRedirects; // 0x768(0x10)
	struct TArray<struct FClassRedirect> ActiveClassRedirects; // 0x778(0x10)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects; // 0x788(0x10)
	struct TArray<struct FStructRedirect> ActiveStructRedirects; // 0x798(0x10)
	struct UTexture2D* PreIntegratedSkinBRDFTexture; // 0x7a8(0x08)
	struct FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x7b0(0x18)
	struct UTexture2D* MobilePreIntegratedSkinBRDFTexture; // 0x7c8(0x08)
	struct FSoftObjectPath MobilePreIntegratedSkinBRDFTextureName; // 0x7d0(0x18)
	struct UTexture2D* LandscapeShadowmaskTexture; // 0x7e8(0x08)
	struct FVector4 LandscapePositionAndSize; // 0x7f0(0x10)
	struct FVector4 LandscapeHeightInfo; // 0x800(0x10)
	struct UTexture2D* LandscapeLocalHeightmap; // 0x810(0x08)
	struct FVector2D LandscapeLocalHeightmapLeftTop; // 0x818(0x08)
	float LandscapeLocalHeightmapInvPatchSize; // 0x820(0x04)
	char pad_824[0x4]; // 0x824(0x04)
	struct TArray<struct FVector4> LandscapeLocalHeightmapOffsetScale; // 0x828(0x10)
	struct FSoftObjectPath SMAAAreaTextureName; // 0x838(0x18)
	struct FSoftObjectPath SMAASearchTextureName; // 0x850(0x18)
	struct UTexture2D* SmaaSearchTexture; // 0x868(0x08)
	struct UTexture2D* SmaaAreaTexture; // 0x870(0x08)
	struct UTexture2D* BlueNoiseTexture; // 0x878(0x08)
	struct FSoftObjectPath BlueNoiseTextureName; // 0x880(0x18)
	struct UTexture2D* MiniFontTexture; // 0x898(0x08)
	struct FSoftObjectPath MiniFontTextureName; // 0x8a0(0x18)
	struct UTexture* WeightMapPlaceholderTexture; // 0x8b8(0x08)
	struct FSoftObjectPath WeightMapPlaceholderTextureName; // 0x8c0(0x18)
	struct UTexture2D* LightMapDensityTexture; // 0x8d8(0x08)
	struct FSoftObjectPath LightMapDensityTextureName; // 0x8e0(0x18)
	char pad_8F8[0x8]; // 0x8f8(0x08)
	struct UGameViewportClient* GameViewport; // 0x900(0x08)
	struct TArray<struct FString> DeferredCommands; // 0x908(0x10)
	int32_t TickCycles; // 0x918(0x04)
	int32_t GameCycles; // 0x91c(0x04)
	int32_t ClientCycles; // 0x920(0x04)
	float NearClipPlane; // 0x924(0x04)
	char bHardwareSurveyEnabled : 1; // 0x928(0x01)
	char bSubtitlesEnabled : 1; // 0x928(0x01)
	char bSubtitlesForcedOff : 1; // 0x928(0x01)
	char pad_928_3 : 5; // 0x928(0x01)
	char pad_929[0x3]; // 0x929(0x03)
	int32_t MaximumLoopIterationCount; // 0x92c(0x04)
	char bCanBlueprintsTickByDefault : 1; // 0x930(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x930(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x930(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x930(0x01)
	char pad_930_4 : 1; // 0x930(0x01)
	char bSmoothFrameRate : 1; // 0x930(0x01)
	char bUseFixedFrameRate : 1; // 0x930(0x01)
	char pad_930_7 : 1; // 0x930(0x01)
	char pad_931[0x3]; // 0x931(0x03)
	float FixedFrameRate; // 0x934(0x04)
	struct FFloatRange SmoothedFrameRateRange; // 0x938(0x10)
	struct UEngineCustomTimeStep* DefaultCustomTimeStep; // 0x948(0x08)
	struct UEngineCustomTimeStep* CurrentCustomTimeStep; // 0x950(0x08)
	struct FSoftClassPath CustomTimeStepClassName; // 0x958(0x18)
	struct UTimecodeProvider* DefaultTimecodeProvider; // 0x970(0x08)
	struct UTimecodeProvider* CustomTimecodeProvider; // 0x978(0x08)
	struct FSoftClassPath DefaultTimecodeProviderClassName; // 0x980(0x18)
	struct FSoftClassPath TimecodeProviderClassName; // 0x998(0x18)
	struct FFrameRate DefaultTimecodeFrameRate; // 0x9b0(0x08)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x9b8(0x01)
	char pad_9B8_1 : 7; // 0x9b8(0x01)
	char pad_9B9[0x3]; // 0x9b9(0x03)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x9bc(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x9c0(0x01)
	char pad_9C0_1 : 7; // 0x9c0(0x01)
	char pad_9C1[0x3]; // 0x9c1(0x03)
	struct FColor C_WorldBox; // 0x9c4(0x04)
	struct FColor C_BrushWire; // 0x9c8(0x04)
	struct FColor C_AddWire; // 0x9cc(0x04)
	struct FColor C_SubtractWire; // 0x9d0(0x04)
	struct FColor C_SemiSolidWire; // 0x9d4(0x04)
	struct FColor C_NonSolidWire; // 0x9d8(0x04)
	struct FColor C_WireBackground; // 0x9dc(0x04)
	struct FColor C_ScaleBoxHi; // 0x9e0(0x04)
	struct FColor C_VolumeCollision; // 0x9e4(0x04)
	struct FColor C_BSPCollision; // 0x9e8(0x04)
	struct FColor C_OrthoBackground; // 0x9ec(0x04)
	struct FColor C_Volume; // 0x9f0(0x04)
	struct FColor C_BrushShape; // 0x9f4(0x04)
	float StreamingDistanceFactor; // 0x9f8(0x04)
	char pad_9FC[0x4]; // 0x9fc(0x04)
	struct FDirectoryPath GameScreenshotSaveDirectory; // 0xa00(0x10)
	enum class ETransitionType TransitionType; // 0xa10(0x01)
	char pad_A11[0x7]; // 0xa11(0x07)
	struct FString TransitionDescription; // 0xa18(0x10)
	struct FString TransitionGameMode; // 0xa28(0x10)
	float MeshLODRange; // 0xa38(0x04)
	char bAllowMatureLanguage : 1; // 0xa3c(0x01)
	char pad_A3C_1 : 7; // 0xa3c(0x01)
	char pad_A3D[0x3]; // 0xa3d(0x03)
	float CameraRotationThreshold; // 0xa40(0x04)
	float CameraTranslationThreshold; // 0xa44(0x04)
	float PrimitiveProbablyVisibleTime; // 0xa48(0x04)
	float MaxOcclusionPixelsFraction; // 0xa4c(0x04)
	char bPauseOnLossOfFocus : 1; // 0xa50(0x01)
	char pad_A50_1 : 7; // 0xa50(0x01)
	char pad_A51[0x3]; // 0xa51(0x03)
	int32_t MaxParticleResize; // 0xa54(0x04)
	int32_t MaxParticleResizeWarn; // 0xa58(0x04)
	char pad_A5C[0x4]; // 0xa5c(0x04)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes; // 0xa60(0x10)
	float NetClientTicksPerSecond; // 0xa70(0x04)
	float DisplayGamma; // 0xa74(0x04)
	float MinDesiredFrameRate; // 0xa78(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0xa7c(0x10)
	struct FLinearColor SelectedMaterialColor; // 0xa8c(0x10)
	struct FLinearColor SelectionOutlineColor; // 0xa9c(0x10)
	struct FLinearColor SubduedSelectionOutlineColor; // 0xaac(0x10)
	struct FLinearColor SelectedMaterialColorOverride; // 0xabc(0x10)
	bool bIsOverridingSelectedColor; // 0xacc(0x01)
	char pad_ACD[0x3]; // 0xacd(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0xad0(0x01)
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0xad0(0x01)
	char bSuppressMapWarnings : 1; // 0xad0(0x01)
	char bDisableAILogging : 1; // 0xad0(0x01)
	char pad_AD0_4 : 4; // 0xad0(0x01)
	char pad_AD1[0x3]; // 0xad1(0x03)
	uint32_t bEnableVisualLogRecordingOnStart; // 0xad4(0x04)
	char pad_AD8[0x4]; // 0xad8(0x04)
	int32_t ScreenSaverInhibitorSemaphore; // 0xadc(0x04)
	char bLockReadOnlyLevels : 1; // 0xae0(0x01)
	char pad_AE0_1 : 7; // 0xae0(0x01)
	char pad_AE1[0x7]; // 0xae1(0x07)
	struct FString ParticleEventManagerClassPath; // 0xae8(0x10)
	char pad_AF8[0x10]; // 0xaf8(0x10)
	float SelectionHighlightIntensity; // 0xb08(0x04)
	float BSPSelectionHighlightIntensity; // 0xb0c(0x04)
	float SelectionHighlightIntensityBillboards; // 0xb10(0x04)
	char pad_B14[0x264]; // 0xb14(0x264)
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions; // 0xd78(0x10)
	struct TArray<struct FString> ServerActors; // 0xd88(0x10)
	struct TArray<struct FString> RuntimeServerActors; // 0xd98(0x10)
	float NetErrorLogInterval; // 0xda8(0x04)
	char bStartedLoadMapMovie : 1; // 0xdac(0x01)
	char pad_DAC_1 : 7; // 0xdac(0x01)
	char pad_DAD[0x1b]; // 0xdad(0x1b)
	int32_t NextWorldContextHandle; // 0xdc8(0x04)
	char pad_DCC[0x194]; // 0xdcc(0x194)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ScriptViewportClient
// Size: 0x40 (Inherited: 0x30)
class UScriptViewportClient : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CameraModifier
// Size: 0x50 (Inherited: 0x30)
class UCameraModifier : public UObject {
public:

	char bDebug : 1; // 0x30(0x01)
	char bExclusive : 1; // 0x30(0x01)
	char pad_30_2 : 6; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	char Priority; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct APlayerCameraManager* CameraOwner; // 0x38(0x08)
	float AlphaInTime; // 0x40(0x04)
	float AlphaOutTime; // 0x44(0x04)
	float Alpha; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)

	bool IsDisabled(); // Function Engine.CameraModifier.IsDisabled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17602c0
	struct AActor* GetViewTarget(); // Function Engine.CameraModifier.GetViewTarget // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6fa6200
	void EnableModifier(); // Function Engine.CameraModifier.EnableModifier // (Native|Public|BlueprintCallable) // @ game+0x895960
	void DisableModifier(bool bImmediate); // Function Engine.CameraModifier.DisableModifier // (Native|Public|BlueprintCallable) // @ game+0x6391040
	void BlueprintModifyPostProcess(float DeltaTime, float& PostProcessBlendWeight, struct FPostProcessSettings& PostProcessSettings); // Function Engine.CameraModifier.BlueprintModifyPostProcess // (BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x7ed88c0
	void BlueprintModifyCamera(float DeltaTime, struct FVector ViewLocation, struct FRotator ViewRotation, float FOV, struct FVector& NewViewLocation, struct FRotator& NewViewRotation, float& NewFOV); // Function Engine.CameraModifier.BlueprintModifyCamera // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DynamicBlueprintBinding
// Size: 0x30 (Inherited: 0x30)
class UDynamicBlueprintBinding : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundEffectPreset
// Size: 0x48 (Inherited: 0x30)
class USoundEffectPreset : public UObject {
public:

	char pad_30[0x18]; // 0x30(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundBase
// Size: 0x168 (Inherited: 0x30)
class USoundBase : public UObject {
public:

	struct USoundClass* SoundClassObject; // 0x30(0x08)
	char bDebug : 1; // 0x38(0x01)
	char bOverrideConcurrency : 1; // 0x38(0x01)
	char bOutputToBusOnly : 1; // 0x38(0x01)
	char bHasDelayNode : 1; // 0x38(0x01)
	char bHasConcatenatorNode : 1; // 0x38(0x01)
	char bBypassVolumeScaleForPriority : 1; // 0x38(0x01)
	char pad_38_6 : 2; // 0x38(0x01)
	enum class EVirtualizationMode VirtualizationMode; // 0x39(0x01)
	char pad_3A[0x56]; // 0x3a(0x56)
	/*struct TSet<struct USoundConcurrency*>*/char ConcurrencySet[0x50]; // 0x90(0x50)
	struct FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0(0x20)
	float Duration; // 0x100(0x04)
	float MaxDistance; // 0x104(0x04)
	float TotalSamples; // 0x108(0x04)
	float Priority; // 0x10c(0x04)
	struct USoundAttenuation* AttenuationSettings; // 0x110(0x08)
	struct FSoundModulation Modulation; // 0x118(0x10)
	struct USoundSubmix* SoundSubmixObject; // 0x128(0x08)
	struct TArray<struct FSoundSubmixSendInfo> SoundSubmixSends; // 0x130(0x10)
	struct USoundEffectSourcePresetChain* SourceEffectChain; // 0x140(0x08)
	struct TArray<struct FSoundSourceBusSendInfo> BusSends; // 0x148(0x10)
	struct TArray<struct FSoundSourceBusSendInfo> PreEffectBusSends; // 0x158(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.AnimationAsset
// Size: 0x88 (Inherited: 0x30)
class UAnimationAsset : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct USkeleton* Skeleton; // 0x40(0x08)
	char pad_48[0x20]; // 0x48(0x20)
	struct TArray<struct UAnimMetaData*> MetaData; // 0x68(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x78(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Skeleton
// Size: 0x378 (Inherited: 0x30)
class USkeleton : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct FBoneNode> BoneTree; // 0x40(0x10)
	struct TArray<struct FTransform> RefLocalPoses; // 0x50(0x10)
	char pad_60[0x118]; // 0x60(0x118)
	struct FGuid VirtualBoneGuid; // 0x178(0x10)
	struct TArray<struct FVirtualBone> VirtualBones; // 0x188(0x10)
	struct TArray<struct USkeletalMeshSocket*> Sockets; // 0x198(0x10)
	char pad_1A8[0x50]; // 0x1a8(0x50)
	struct FSmartNameContainer SmartNames; // 0x1f8(0x50)
	char pad_248[0x28]; // 0x248(0x28)
	struct USkeleton* MasterSkeleton; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)
	struct TArray<struct UBlendProfile*> BlendProfiles; // 0x280(0x10)
	struct TArray<struct FAnimSlotGroup> SlotGroups; // 0x290(0x10)
	char pad_2A0[0xc8]; // 0x2a0(0xc8)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x368(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BodySetup
// Size: 0x258 (Inherited: 0x30)
class UBodySetup : public UObject {
public:

	struct FKAggregateGeom AggGeom; // 0x30(0x58)
	struct FName BoneName; // 0x88(0x08)
	enum class EPhysicsType PhysicsType; // 0x90(0x01)
	char bAlwaysFullAnimWeight : 1; // 0x91(0x01)
	char bConsiderForBounds : 1; // 0x91(0x01)
	char bMeshCollideAll : 1; // 0x91(0x01)
	char bDoubleSidedGeometry : 1; // 0x91(0x01)
	char bGenerateNonMirroredCollision : 1; // 0x91(0x01)
	char bSharedCookedData : 1; // 0x91(0x01)
	char bGenerateMirroredCollision : 1; // 0x91(0x01)
	char pad_91_7 : 1; // 0x91(0x01)
	char pad_92[0x1]; // 0x92(0x01)
	char BindedTraceMaskFilter; // 0x93(0x01)
	enum class EBodyCollisionResponse CollisionReponse; // 0x94(0x01)
	enum class ECollisionTraceFlag CollisionTraceFlag; // 0x95(0x01)
	char pad_96[0x2]; // 0x96(0x02)
	struct UPhysicalMaterial* PhysMaterial; // 0x98(0x08)
	struct FWalkableSlopeOverride WalkableSlopeOverride; // 0xa0(0x10)
	char pad_B0[0x68]; // 0xb0(0x68)
	struct FBodyInstance DefaultInstance; // 0x118(0x120)
	char pad_238[0x8]; // 0x238(0x08)
	struct FVector BuildScale3D; // 0x240(0x0c)
	char pad_24C[0xc]; // 0x24c(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BookmarkBase
// Size: 0x30 (Inherited: 0x30)
class UBookmarkBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PlatformInterfaceBase
// Size: 0x40 (Inherited: 0x30)
class UPlatformInterfaceBase : public UObject {
public:

	struct TArray<struct FDelegateArray> AllDelegates; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CurveTable
// Size: 0xa8 (Inherited: 0x30)
class UCurveTable : public UObject {
public:

	char pad_30[0x78]; // 0x30(0x78)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DataTable
// Size: 0x148 (Inherited: 0x30)
class UDataTable : public UObject {
public:

	struct UScriptStruct* RowStruct; // 0x30(0x08)
	char pad_38[0xb0]; // 0x38(0xb0)
	char bStripFromClientBuilds : 1; // 0xe8(0x01)
	char bIgnoreExtraFields : 1; // 0xe8(0x01)
	char bIgnoreMissingFields : 1; // 0xe8(0x01)
	char pad_E8_3 : 5; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)
	struct FString ImportKeyField; // 0xf0(0x10)
	char bIgnoreReferencedObjectsGC : 1; // 0x100(0x01)
	char bCanMMapToFile : 1; // 0x100(0x01)
	char pad_100_2 : 6; // 0x100(0x01)
	char pad_101[0x1]; // 0x101(0x01)
	bool bIgnoreKeepReferenceObject; // 0x102(0x01)
	char pad_103[0x45]; // 0x103(0x45)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
class UCurveBase : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	void GetValueRange(float& MinValue, float& MaxValue); // Function Engine.CurveBase.GetValueRange // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d9c480
	void GetTimeRange(float& MinTime, float& MaxTime); // Function Engine.CurveBase.GetTimeRange // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9d9c3a0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PendingNetGame
// Size: 0xc8 (Inherited: 0x30)
class UPendingNetGame : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct UNetDriver* NetDriver; // 0x38(0x08)
	struct UDemoNetDriver* DemoNetDriver; // 0x40(0x08)
	char pad_48[0x80]; // 0x48(0x80)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TextureLODSettings
// Size: 0x40 (Inherited: 0x30)
class UTextureLODSettings : public UObject {
public:

	struct TArray<struct FTextureLODGroup> TextureLODGroups; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.Distribution
// Size: 0x38 (Inherited: 0x30)
class UDistribution : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.EdGraphNode
// Size: 0xa0 (Inherited: 0x30)
class UEdGraphNode : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40(0x10)
	int32_t NodePosX; // 0x50(0x04)
	int32_t NodePosY; // 0x54(0x04)
	int32_t NodeWidth; // 0x58(0x04)
	int32_t NodeHeight; // 0x5c(0x04)
	enum class ENodeAdvancedPins AdvancedPinDisplay; // 0x60(0x01)
	enum class ENodeEnabledState EnabledState; // 0x61(0x01)
	char pad_62[0x1]; // 0x62(0x01)
	char pad_63_0 : 1; // 0x63(0x01)
	char bDisplayAsDisabled : 1; // 0x63(0x01)
	char bUserSetEnabledState : 1; // 0x63(0x01)
	char pad_63_3 : 1; // 0x63(0x01)
	char bIsNodeEnabled : 1; // 0x63(0x01)
	char pad_63_5 : 1; // 0x63(0x01)
	char bHasCompilerMessage : 1; // 0x63(0x01)
	char pad_63_7 : 1; // 0x63(0x01)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString NodeComment; // 0x68(0x10)
	int32_t ErrorType; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FString ErrorMsg; // 0x80(0x10)
	struct FGuid NodeGuid; // 0x90(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.LocalMessage
// Size: 0x30 (Inherited: 0x30)
class ULocalMessage : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.HapticFeedbackEffect_Base
// Size: 0x30 (Inherited: 0x30)
class UHapticFeedbackEffect_Base : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpFilter
// Size: 0x40 (Inherited: 0x30)
class UInterpFilter : public UObject {
public:

	struct FString Caption; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpGroup
// Size: 0x58 (Inherited: 0x30)
class UInterpGroup : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct UInterpTrack*> InterpTracks; // 0x38(0x10)
	struct FName GroupName; // 0x48(0x08)
	struct FColor GroupColor; // 0x50(0x04)
	char bCollapsed : 1; // 0x54(0x01)
	char bVisible : 1; // 0x54(0x01)
	char bIsFolder : 1; // 0x54(0x01)
	char bIsParented : 1; // 0x54(0x01)
	char bIsSelected : 1; // 0x54(0x01)
	char pad_54_5 : 3; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.InterpGroupInst
// Size: 0x50 (Inherited: 0x30)
class UInterpGroupInst : public UObject {
public:

	struct UInterpGroup* Group; // 0x30(0x08)
	struct AActor* GroupActor; // 0x38(0x08)
	struct TArray<struct UInterpTrackInst*> TrackInst; // 0x40(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.MaterialFunctionInterface
// Size: 0x48 (Inherited: 0x30)
class UMaterialFunctionInterface : public UObject {
public:

	struct FGuid StateId; // 0x30(0x10)
	enum class EMaterialFunctionUsage MaterialFunctionUsage; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.NavigationSystemConfig
// Size: 0x58 (Inherited: 0x30)
class UNavigationSystemConfig : public UObject {
public:

	struct FSoftClassPath NavigationSystemClass; // 0x30(0x18)
	struct FNavAgentSelector SupportedAgentsMask; // 0x48(0x04)
	struct FName DefaultAgentName; // 0x4c(0x08)
	char bIsOverriden : 1; // 0x54(0x01)
	char pad_54_1 : 7; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ParticleEmitter
// Size: 0x1c0 (Inherited: 0x30)
class UParticleEmitter : public UObject {
public:

	struct FName EmitterName; // 0x30(0x08)
	int32_t SubUVDataOffset; // 0x38(0x04)
	enum class EEmitterRenderMode EmitterRenderMode; // 0x3c(0x01)
	enum class EParticleSignificanceLevel SignificanceLevel; // 0x3d(0x01)
	enum class EParticleVRSShadingRate ParticleVRSShadingRate; // 0x3e(0x01)
	char pad_3F[0x1]; // 0x3f(0x01)
	char bUseLegacySpawningBehavior : 1; // 0x40(0x01)
	char pad_40_1 : 3; // 0x40(0x01)
	char ConvertedModules : 1; // 0x40(0x01)
	char bIsSoloing : 1; // 0x40(0x01)
	char bCookedOut : 1; // 0x40(0x01)
	char bDisabledLODsKeepEmitterAlive : 1; // 0x40(0x01)
	char bDisableWhenInsignficant : 1; // 0x41(0x01)
	char pad_41_1 : 7; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct TArray<struct UParticleLODLevel*> LODLevels; // 0x48(0x10)
	int32_t PeakActiveParticles; // 0x58(0x04)
	int32_t InitialAllocationCount; // 0x5c(0x04)
	float QualityLevelSpawnRateScale; // 0x60(0x04)
	uint32_t DetailModeBitmask; // 0x64(0x04)
	char pad_68[0x158]; // 0x68(0x158)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ParticleModule
// Size: 0x38 (Inherited: 0x30)
class UParticleModule : public UObject {
public:

	char bSpawnModule : 1; // 0x30(0x01)
	char bUpdateModule : 1; // 0x30(0x01)
	char bFinalUpdateModule : 1; // 0x30(0x01)
	char bUpdateForGPUEmitter : 1; // 0x30(0x01)
	char bCurvesAsColor : 1; // 0x30(0x01)
	char b3DDrawMode : 1; // 0x30(0x01)
	char bSupported3DDrawMode : 1; // 0x30(0x01)
	char bEnabled : 1; // 0x30(0x01)
	char bEditable : 1; // 0x31(0x01)
	char LODDuplicate : 1; // 0x31(0x01)
	char bSupportsRandomSeed : 1; // 0x31(0x01)
	char bRequiresLoopingNotification : 1; // 0x31(0x01)
	char pad_31_4 : 4; // 0x31(0x01)
	char LODValidity; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.FXSystemAsset
// Size: 0x38 (Inherited: 0x30)
class UFXSystemAsset : public UObject {
public:

	uint32_t MaxPoolSize; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.PreBakeShadowDepthMap
// Size: 0x68 (Inherited: 0x30)
class UPreBakeShadowDepthMap : public UObject {
public:

	int32_t ShadowMapResolution; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<uint32_t> AllTileQuantizedQuadEntry; // 0x38(0x10)
	struct TArray<uint32_t> AllTileFlattenQuadTree; // 0x48(0x10)
	struct TArray<uint32_t> TileDataOffset; // 0x58(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ReporterBase
// Size: 0x38 (Inherited: 0x30)
class UReporterBase : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.SoundNode
// Size: 0x48 (Inherited: 0x30)
class USoundNode : public UObject {
public:

	struct TArray<struct USoundNode*> ChildNodes; // 0x30(0x10)
	char pad_40[0x8]; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.TimecodeProvider
// Size: 0x38 (Inherited: 0x30)
class UTimecodeProvider : public UObject {
public:

	int32_t FrameDelay; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	struct FTimecode GetTimecode(); // Function Engine.TimecodeProvider.GetTimecode // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ec5d90
	enum class ETimecodeProviderSynchronizationState GetSynchronizationState(); // Function Engine.TimecodeProvider.GetSynchronizationState // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ec5d60
	struct FFrameRate GetFrameRate(); // Function Engine.TimecodeProvider.GetFrameRate // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ec5c90
	struct FTimecode GetDelayedTimecode(); // Function Engine.TimecodeProvider.GetDelayedTimecode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9ec5c50
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.VectorField
// Size: 0x50 (Inherited: 0x30)
class UVectorField : public UObject {
public:

	struct FBox Bounds; // 0x30(0x1c)
	float Intensity; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.VirtualTexture
// Size: 0x30 (Inherited: 0x30)
class UVirtualTexture : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.GameplayStatics
// Size: 0x30 (Inherited: 0x30)
class UGameplayStatics : public UBlueprintFunctionLibrary {
public:


	void STATIC_UnloadStreamLevel(struct UObject* WorldContextObject, struct FName LevelName, struct FLatentActionInfo LatentInfo, bool bShouldBlockOnUnload); // Function Engine.GameplayStatics.UnloadStreamLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc3930
	bool STATIC_SuggestProjectileVelocity_CustomArc(struct UObject* WorldContextObject, struct FVector& OutLaunchVelocity, struct FVector StartPos, struct FVector EndPos, float OverrideGravityZ, float ArcParam); // Function Engine.GameplayStatics.SuggestProjectileVelocity_CustomArc // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dc3750
	struct UAudioComponent* STATIC_SpawnSoundAttached(struct USoundBase* Sound, struct USceneComponent* AttachToComponent, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, enum class EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnSoundAttached // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc33c0
	struct UAudioComponent* STATIC_SpawnSoundAtLocation(struct UObject* WorldContextObject, struct USoundBase* Sound, struct FVector Location, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnSoundAtLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc30f0
	struct UAudioComponent* STATIC_SpawnSound2D(struct UObject* WorldContextObject, struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundConcurrency* ConcurrencySettings, bool bPersistAcrossLevelTransition, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnSound2D // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x9dc2ec0
	struct UObject* STATIC_SpawnObject(struct UClass* objectClass, struct UObject* Outer); // Function Engine.GameplayStatics.SpawnObject // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc2e00
	struct UForceFeedbackComponent* STATIC_SpawnForceFeedbackAttached(struct UForceFeedbackEffect* ForceFeedbackEffect, struct USceneComponent* AttachToComponent, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, enum class EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, bool bLooping, float IntensityMultiplier, float StartTime, struct UForceFeedbackAttenuation* AttenuationSettings, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnForceFeedbackAttached // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc2aa0
	struct UForceFeedbackComponent* STATIC_SpawnForceFeedbackAtLocation(struct UObject* WorldContextObject, struct UForceFeedbackEffect* ForceFeedbackEffect, struct FVector Location, struct FRotator Rotation, bool bLooping, float IntensityMultiplier, float StartTime, struct UForceFeedbackAttenuation* AttenuationSettings, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnForceFeedbackAtLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc2810
	struct UParticleSystemComponent* STATIC_SpawnEmitterAttached(struct UParticleSystem* EmitterTemplate, struct USceneComponent* AttachToComponent, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, struct FVector Scale, enum class EAttachLocation LocationType, bool bAutoDestroy, enum class EPSCPoolMethod PoolingMethod, bool bAutoActivate); // Function Engine.GameplayStatics.SpawnEmitterAttached // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc2530
	struct UParticleSystemComponent* STATIC_SpawnEmitterAtLocation(struct UObject* WorldContextObject, struct UParticleSystem* EmitterTemplate, struct FVector Location, struct FRotator Rotation, struct FVector Scale, bool bAutoDestroy, enum class EPSCPoolMethod PoolingMethod, bool bAutoActivateSystem); // Function Engine.GameplayStatics.SpawnEmitterAtLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc22d0
	struct UAudioComponent* STATIC_SpawnDialogueAttached(struct UDialogueWave* Dialogue, struct FDialogueContext& Context, struct USceneComponent* AttachToComponent, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, enum class EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnDialogueAttached // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dc1ee0
	struct UAudioComponent* STATIC_SpawnDialogueAtLocation(struct UObject* WorldContextObject, struct UDialogueWave* Dialogue, struct FDialogueContext& Context, struct FVector Location, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnDialogueAtLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dc1bc0
	struct UAudioComponent* STATIC_SpawnDialogue2D(struct UObject* WorldContextObject, struct UDialogueWave* Dialogue, struct FDialogueContext& Context, float VolumeMultiplier, float PitchMultiplier, float StartTime, bool bAutoDestroy); // Function Engine.GameplayStatics.SpawnDialogue2D // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dc1980
	struct UDecalComponent* STATIC_SpawnDecalAttached(struct UMaterialInterface* DecalMaterial, struct FVector DecalSize, struct USceneComponent* AttachToComponent, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, enum class EAttachLocation LocationType, float LifeSpan); // Function Engine.GameplayStatics.SpawnDecalAttached // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc1530
	struct UDecalComponent* STATIC_SpawnDecalAtLocation(struct UObject* WorldContextObject, struct UMaterialInterface* DecalMaterial, struct FVector DecalSize, struct FVector Location, struct FRotator Rotation, float LifeSpan); // Function Engine.GameplayStatics.SpawnDecalAtLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc1350
	void STATIC_SetWorldOriginLocation(struct UObject* WorldContextObject, struct FIntVector NewLocation); // Function Engine.GameplayStatics.SetWorldOriginLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dc11f0
	void STATIC_SetViewportMouseCaptureMode(struct UObject* WorldContextObject, enum class EMouseCaptureMode MouseCaptureMode); // Function Engine.GameplayStatics.SetViewportMouseCaptureMode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc1140
	void STATIC_SetSubtitlesEnabled(bool bEnabled); // Function Engine.GameplayStatics.SetSubtitlesEnabled // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc10c0
	void STATIC_SetSoundMixClassOverride(struct UObject* WorldContextObject, struct USoundMix* InSoundMixModifier, struct USoundClass* InSoundClass, float Volume, float Pitch, float FadeInTime, bool bApplyToChildren); // Function Engine.GameplayStatics.SetSoundMixClassOverride // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0ed0
	void STATIC_SetPlayerControllerID(struct APlayerController* Player, int32_t ControllerId); // Function Engine.GameplayStatics.SetPlayerControllerID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0e20
	void STATIC_SetMaxAudioChannelsScaled(struct UObject* WorldContextObject, float MaxChannelCountScale); // Function Engine.GameplayStatics.SetMaxAudioChannelsScaled // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0d70
	void STATIC_SetGlobalTimeDilation(struct UObject* WorldContextObject, float TimeDilation); // Function Engine.GameplayStatics.SetGlobalTimeDilation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0cc0
	void STATIC_SetGlobalPitchModulation(struct UObject* WorldContextObject, float PitchModulation, float TimeSec); // Function Engine.GameplayStatics.SetGlobalPitchModulation // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0bd0
	void STATIC_SetGlobalListenerFocusParameters(struct UObject* WorldContextObject, float FocusAzimuthScale, float NonFocusAzimuthScale, float FocusDistanceScale, float NonFocusDistanceScale, float FocusVolumeScale, float NonFocusVolumeScale, float FocusPriorityScale, float NonFocusPriorityScale); // Function Engine.GameplayStatics.SetGlobalListenerFocusParameters // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0950
	bool STATIC_SetGamePaused(struct UObject* WorldContextObject, bool bPaused); // Function Engine.GameplayStatics.SetGamePaused // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0890
	void STATIC_SetForceDisableSplitscreen(struct UObject* WorldContextObject, bool bDisable); // Function Engine.GameplayStatics.SetForceDisableSplitscreen // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc07d0
	void STATIC_SetEnableWorldRendering(struct UObject* WorldContextObject, bool bEnable); // Function Engine.GameplayStatics.SetEnableWorldRendering // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0710
	void STATIC_SetBaseSoundMix(struct UObject* WorldContextObject, struct USoundMix* InSoundMix); // Function Engine.GameplayStatics.SetBaseSoundMix // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0660
	bool STATIC_SaveGameToSlot(struct USaveGame* SaveGameObject, struct FString SlotName, int32_t UserIndex); // Function Engine.GameplayStatics.SaveGameToSlot // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc03d0
	void STATIC_RemovePlayer(struct APlayerController* Player, bool bDestroyPawn); // Function Engine.GameplayStatics.RemovePlayer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dc0100
	struct FVector STATIC_RebaseZeroOriginOntoLocal(struct UObject* WorldContextObject, struct FVector WorldLocation); // Function Engine.GameplayStatics.RebaseZeroOriginOntoLocal // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dc0020
	struct FVector STATIC_RebaseLocalOriginOntoZero(struct UObject* WorldContextObject, struct FVector WorldLocation); // Function Engine.GameplayStatics.RebaseLocalOriginOntoZero // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbff40
	void STATIC_PushSoundMixModifier(struct UObject* WorldContextObject, struct USoundMix* InSoundMixModifier); // Function Engine.GameplayStatics.PushSoundMixModifier // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbfe30
	bool STATIC_ProjectWorldToScreen(struct APlayerController* Player, struct FVector& WorldPosition, struct FVector2D& ScreenPosition, bool bPlayerViewportRelative); // Function Engine.GameplayStatics.ProjectWorldToScreen // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbfce0
	void STATIC_PrimeSound(struct USoundBase* InSound); // Function Engine.GameplayStatics.PrimeSound // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbfc70
	void STATIC_PopSoundMixModifier(struct UObject* WorldContextObject, struct USoundMix* InSoundMixModifier); // Function Engine.GameplayStatics.PopSoundMixModifier // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbfbc0
	void STATIC_PlayWorldCameraShake(struct UObject* WorldContextObject, struct UClass* Shake, struct FVector Epicenter, float InnerRadius, float OuterRadius, float Falloff, bool bOrientShakeTowardsEpicenter); // Function Engine.GameplayStatics.PlayWorldCameraShake // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dbf9b0
	void STATIC_PlaySoundAtLocation(struct UObject* WorldContextObject, struct USoundBase* Sound, struct FVector Location, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings, struct AActor* OwningActor); // Function Engine.GameplayStatics.PlaySoundAtLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dbf6e0
	void STATIC_PlaySound2D(struct UObject* WorldContextObject, struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundConcurrency* ConcurrencySettings, struct AActor* OwningActor); // Function Engine.GameplayStatics.PlaySound2D // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x9dbf4f0
	void STATIC_PlayDialogueAtLocation(struct UObject* WorldContextObject, struct UDialogueWave* Dialogue, struct FDialogueContext& Context, struct FVector Location, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings); // Function Engine.GameplayStatics.PlayDialogueAtLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dbf210
	void STATIC_PlayDialogue2D(struct UObject* WorldContextObject, struct UDialogueWave* Dialogue, struct FDialogueContext& Context, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Function Engine.GameplayStatics.PlayDialogue2D // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dbf010
	struct FString STATIC_ParseOption(struct FString Options, struct FString Key); // Function Engine.GameplayStatics.ParseOption // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbee30
	void STATIC_OpenLevel(struct UObject* WorldContextObject, struct FName LevelName, bool bAbsolute, struct FString Options); // Function Engine.GameplayStatics.OpenLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbec60
	struct FHitResult STATIC_MakeHitResult(bool bBlockingHit, bool bInitialOverlap, float Time, float Distance, struct FVector Location, struct FVector ImpactPoint, struct FVector Normal, struct FVector ImpactNormal, struct UPhysicalMaterial* PhysMat, struct AActor* HitActor, struct UPrimitiveComponent* HitComponent, struct FName HitBoneName, int32_t HitItem, int32_t FaceIndex, struct FVector TraceStart, struct FVector TraceEnd); // Function Engine.GameplayStatics.MakeHitResult // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbe6b0
	void STATIC_LoadStreamLevel(struct UObject* WorldContextObject, struct FName LevelName, bool bMakeVisibleAfterLoad, bool bShouldBlockOnLoad, struct FLatentActionInfo LatentInfo); // Function Engine.GameplayStatics.LoadStreamLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbe500
	struct USaveGame* STATIC_LoadGameFromSlot(struct FString SlotName, int32_t UserIndex); // Function Engine.GameplayStatics.LoadGameFromSlot // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbe400
	bool STATIC_IsSplitscreenForceDisabled(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.IsSplitscreenForceDisabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbe270
	bool STATIC_IsGamePaused(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.IsGamePaused // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbe1f0
	bool STATIC_HasOption(struct FString Options, struct FString InKey); // Function Engine.GameplayStatics.HasOption // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbdf90
	bool STATIC_HasLaunchOption(struct FString OptionToCheck); // Function Engine.GameplayStatics.HasLaunchOption // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbdea0
	int32_t STATIC_GrassOverlappingSphereCount(struct UObject* WorldContextObject, struct UStaticMesh* StaticMesh, struct FVector CenterPosition, float radius); // Function Engine.GameplayStatics.GrassOverlappingSphereCount // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9dbdcd0
	struct FIntVector STATIC_GetWorldOriginLocation(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetWorldOriginLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbdc30
	float STATIC_GetWorldDeltaSeconds(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetWorldDeltaSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbdba0
	void STATIC_GetViewProjectionMatrix(struct FMinimalViewInfo DesiredView, struct FMatrix& ViewMatrix, struct FMatrix& ProjectionMatrix, struct FMatrix& ViewProjectionMatrix); // Function Engine.GameplayStatics.GetViewProjectionMatrix // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbd7d0
	enum class EMouseCaptureMode STATIC_GetViewportMouseCaptureMode(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetViewportMouseCaptureMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbdb20
	float STATIC_GetUnpausedTimeSeconds(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetUnpausedTimeSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd740
	float STATIC_GetTimeSeconds(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetTimeSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd6b0
	enum class EPhysicalSurface STATIC_GetSurfaceType(struct FHitResult& Hit); // Function Engine.GameplayStatics.GetSurfaceType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dbd5e0
	struct ULevelStreaming* STATIC_GetStreamingLevel(struct UObject* WorldContextObject, struct FName PackageName); // Function Engine.GameplayStatics.GetStreamingLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd520
	float STATIC_GetRealTimeSeconds(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetRealTimeSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd490
	struct APawn* STATIC_GetPlayerPawn(struct UObject* WorldContextObject, int32_t PlayerIndex); // Function Engine.GameplayStatics.GetPlayerPawn // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd3d0
	int32_t STATIC_GetPlayerControllerID(struct APlayerController* Player); // Function Engine.GameplayStatics.GetPlayerControllerID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd350
	struct APlayerController* STATIC_GetPlayerControllerFromID(struct UObject* WorldContextObject, int32_t ControllerId); // Function Engine.GameplayStatics.GetPlayerControllerFromID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd290
	struct APlayerController* STATIC_GetPlayerController(struct UObject* WorldContextObject, int32_t PlayerIndex); // Function Engine.GameplayStatics.GetPlayerController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd1d0
	struct ACHARACTER* STATIC_GetPlayerCharacter(struct UObject* WorldContextObject, int32_t PlayerIndex); // Function Engine.GameplayStatics.GetPlayerCharacter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd110
	struct APlayerCameraManager* STATIC_GetPlayerCameraManager(struct UObject* WorldContextObject, int32_t PlayerIndex); // Function Engine.GameplayStatics.GetPlayerCameraManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbd050
	struct FString STATIC_GetPlatformName(); // Function Engine.GameplayStatics.GetPlatformName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbcfd0
	struct UClass* STATIC_GetObjectClass(struct UObject* Object); // Function Engine.GameplayStatics.GetObjectClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbcf50
	int32_t STATIC_GetMaxAudioChannelCount(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetMaxAudioChannelCount // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbce70
	void STATIC_GetKeyValue(struct FString Pair, struct FString& Key, struct FString& Value); // Function Engine.GameplayStatics.GetKeyValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dbcc80
	int32_t STATIC_GetIntOption(struct FString Options, struct FString Key, int32_t DefaultValue); // Function Engine.GameplayStatics.GetIntOption // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbcb00
	float STATIC_GetGlobalTimeDilation(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetGlobalTimeDilation // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbca70
	struct AGameStateBase* STATIC_GetGameState(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetGameState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbc9f0
	struct AGameModeBase* STATIC_GetGameMode(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetGameMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbc970
	struct UGameInstance* STATIC_GetGameInstance(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetGameInstance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbc8f0
	bool STATIC_GetEnableWorldRendering(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetEnableWorldRendering // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbc870
	struct UReverbEffect* STATIC_GetCurrentReverbEffect(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetCurrentReverbEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbc750
	struct FString STATIC_GetCurrentLevelName(struct UObject* WorldContextObject, bool bRemovePrefixString); // Function Engine.GameplayStatics.GetCurrentLevelName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbc640
	float STATIC_GetAudioTimeSeconds(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.GetAudioTimeSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dbc5b0
	void STATIC_GetAllActorsWithTag(struct UObject* WorldContextObject, struct FName Tag, struct TArray<struct AActor*>& OutActors); // Function Engine.GameplayStatics.GetAllActorsWithTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dbc470
	void STATIC_GetAllActorsWithInterface(struct UObject* WorldContextObject, struct UClass* Interface, struct TArray<struct AActor*>& OutActors); // Function Engine.GameplayStatics.GetAllActorsWithInterface // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dbc330
	void STATIC_GetAllActorsOfClassWithTag(struct UObject* WorldContextObject, struct UClass* ActorClass, struct FName Tag, struct TArray<struct AActor*>& OutActors); // Function Engine.GameplayStatics.GetAllActorsOfClassWithTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dbc1b0
	void STATIC_GetAllActorsOfClass(struct UObject* WorldContextObject, struct UClass* ActorClass, struct TArray<struct AActor*>& OutActors); // Function Engine.GameplayStatics.GetAllActorsOfClass // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dbc070
	struct AActor* STATIC_GetActorOfClass(struct UObject* WorldContextObject, struct UClass* ActorClass); // Function Engine.GameplayStatics.GetActorOfClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbbfb0
	void STATIC_GetActorArrayBounds(struct TArray<struct AActor*>& actors, bool bOnlyCollidingComponents, struct FVector& Center, struct FVector& BoxExtent); // Function Engine.GameplayStatics.GetActorArrayBounds // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dbbe00
	struct FVector STATIC_GetActorArrayAverageLocation(struct TArray<struct AActor*>& actors); // Function Engine.GameplayStatics.GetActorArrayAverageLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dbbd20
	void STATIC_GetAccurateRealTime(struct UObject* WorldContextObject, int32_t& Seconds, float& PartialSeconds); // Function Engine.GameplayStatics.GetAccurateRealTime // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dbbc00
	void STATIC_FlushLevelStreaming(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.FlushLevelStreaming // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbbb90
	struct AActor* STATIC_FinishSpawningActor(struct AActor* Actor, struct FTransform& SpawnTransform); // Function Engine.GameplayStatics.FinishSpawningActor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9dbba70
	bool STATIC_FindCollisionUV(struct FHitResult& Hit, int32_t UVChannel, struct FVector2D& UV); // Function Engine.GameplayStatics.FindCollisionUV // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbb7e0
	void STATIC_EnableLiveStreaming(bool Enable); // Function Engine.GameplayStatics.EnableLiveStreaming // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbb740
	bool STATIC_DoesSaveGameExist(struct FString SlotName, int32_t UserIndex); // Function Engine.GameplayStatics.DoesSaveGameExist // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbb640
	bool STATIC_DeprojectScreenToWorld(struct APlayerController* Player, struct FVector2D& ScreenPosition, struct FVector& WorldPosition, struct FVector& WorldDirection, bool bPlayerViewportRelative); // Function Engine.GameplayStatics.DeprojectScreenToWorld // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dbb470
	bool STATIC_DeleteGameInSlot(struct FString SlotName, int32_t UserIndex); // Function Engine.GameplayStatics.DeleteGameInSlot // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbb370
	void STATIC_DeactivateReverbEffect(struct UObject* WorldContextObject, struct FName TagName); // Function Engine.GameplayStatics.DeactivateReverbEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbb230
	struct UAudioComponent* STATIC_CreateSound2D(struct UObject* WorldContextObject, struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundConcurrency* ConcurrencySettings, bool bPersistAcrossLevelTransition, bool bAutoDestroy); // Function Engine.GameplayStatics.CreateSound2D // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x9dbb000
	struct USaveGame* STATIC_CreateSaveGameObject(struct UClass* SaveGameClass); // Function Engine.GameplayStatics.CreateSaveGameObject // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbaf80
	struct APlayerController* STATIC_CreatePlayer(struct UObject* WorldContextObject, int32_t ControllerId, bool bSpawnPlayerController); // Function Engine.GameplayStatics.CreatePlayer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbae90
	void STATIC_ClearSoundMixModifiers(struct UObject* WorldContextObject); // Function Engine.GameplayStatics.ClearSoundMixModifiers // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbae20
	void STATIC_ClearSoundMixClassOverride(struct UObject* WorldContextObject, struct USoundMix* InSoundMixModifier, struct USoundClass* InSoundClass, float FadeOutTime); // Function Engine.GameplayStatics.ClearSoundMixClassOverride // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbacf0
	void STATIC_CancelAsyncLoading(); // Function Engine.GameplayStatics.CancelAsyncLoading // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9dbaae0
	void STATIC_BreakHitResult(struct FHitResult& Hit, bool& bBlockingHit, bool& bInitialOverlap, float& Time, float& Distance, struct FVector& Location, struct FVector& ImpactPoint, struct FVector& Normal, struct FVector& ImpactNormal, struct UPhysicalMaterial*& PhysMat, struct AActor*& HitActor, struct UPrimitiveComponent*& HitComponent, struct FName& HitBoneName, int32_t& HitItem, int32_t& FaceIndex, struct FVector& TraceStart, struct FVector& TraceEnd); // Function Engine.GameplayStatics.BreakHitResult // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dba3f0
	bool STATIC_BlueprintSuggestProjectileVelocity(struct UObject* WorldContextObject, struct FVector& TossVelocity, struct FVector StartLocation, struct FVector EndLocation, float LaunchSpeed, float OverrideGravityZ, enum class ESuggestProjVelocityTraceOption TraceOption, float CollisionRadius, bool bFavorHighArc, bool bDrawDebug); // Function Engine.GameplayStatics.BlueprintSuggestProjectileVelocity // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db9310
	bool STATIC_Blueprint_PredictProjectilePath_ByTraceChannel(struct UObject* WorldContextObject, struct FHitResult& OutHit, struct TArray<struct FVector>& OutPathPositions, struct FVector& OutLastTraceDestination, struct FVector StartPos, struct FVector LaunchVelocity, bool bTracePath, float ProjectileRadius, enum class ECollisionChannel TraceChannel, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, enum class EDrawDebugTrace DrawDebugType, float DrawDebugTime, float SimFrequency, float MaxSimTime, float OverrideGravityZ); // Function Engine.GameplayStatics.Blueprint_PredictProjectilePath_ByTraceChannel // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db9e70
	bool STATIC_Blueprint_PredictProjectilePath_ByObjectType(struct UObject* WorldContextObject, struct FHitResult& OutHit, struct TArray<struct FVector>& OutPathPositions, struct FVector& OutLastTraceDestination, struct FVector StartPos, struct FVector LaunchVelocity, bool bTracePath, float ProjectileRadius, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, enum class EDrawDebugTrace DrawDebugType, float DrawDebugTime, float SimFrequency, float MaxSimTime, float OverrideGravityZ); // Function Engine.GameplayStatics.Blueprint_PredictProjectilePath_ByObjectType // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db98a0
	bool STATIC_Blueprint_PredictProjectilePath_Advanced(struct UObject* WorldContextObject, struct FPredictProjectilePathParams& PredictParams, struct FPredictProjectilePathResult& PredictResult); // Function Engine.GameplayStatics.Blueprint_PredictProjectilePath_Advanced // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9db9600
	struct AActor* STATIC_BeginSpawningActorFromClass(struct UObject* WorldContextObject, struct UClass* ActorClass, struct FTransform& SpawnTransform, bool bNoCollisionFail, struct AActor* Owner); // Function Engine.GameplayStatics.BeginSpawningActorFromClass // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db9110
	struct AActor* STATIC_BeginSpawningActorFromBlueprint(struct UObject* WorldContextObject, struct UBlueprint* Blueprint, struct FTransform& SpawnTransform, bool bNoCollisionFail); // Function Engine.GameplayStatics.BeginSpawningActorFromBlueprint // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db8f70
	struct AActor* STATIC_BeginDeferredActorSpawnFromClass(struct UObject* WorldContextObject, struct UClass* ActorClass, struct FTransform& SpawnTransform, enum class ESpawnActorCollisionHandlingMethod CollisionHandlingOverride, struct AActor* Owner); // Function Engine.GameplayStatics.BeginDeferredActorSpawnFromClass // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db8d80
	bool STATIC_AreSubtitlesEnabled(); // Function Engine.GameplayStatics.AreSubtitlesEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9db8d50
	bool STATIC_AreAnyListenersWithinRange(struct UObject* WorldContextObject, struct FVector Location, float MaximumRange); // Function Engine.GameplayStatics.AreAnyListenersWithinRange // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9db8c40
	bool STATIC_ApplyRadialDamageWithFalloff(struct UObject* WorldContextObject, float BaseDamage, float MinimumDamage, struct FVector& Origin, float DamageInnerRadius, float DamageOuterRadius, float DamageFalloff, struct UClass* DamageTypeClass, struct TArray<struct AActor*>& IgnoreActors, struct AActor* DamageCauser, struct AController* InstigatedByController, enum class ECollisionChannel DamagePreventionChannel); // Function Engine.GameplayStatics.ApplyRadialDamageWithFalloff // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db88a0
	bool STATIC_ApplyRadialDamage(struct UObject* WorldContextObject, float BaseDamage, struct FVector& Origin, float DamageRadius, struct UClass* DamageTypeClass, struct TArray<struct AActor*>& IgnoreActors, struct AActor* DamageCauser, struct AController* InstigatedByController, bool bDoFullDamage, enum class ECollisionChannel DamagePreventionChannel); // Function Engine.GameplayStatics.ApplyRadialDamage // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db8590
	float STATIC_ApplyPointDamage(struct AActor* DamagedActor, float BaseDamage, struct FVector& HitFromDirection, struct FHitResult& HitInfo, struct AController* EventInstigator, struct AActor* DamageCauser, struct UClass* DamageTypeClass); // Function Engine.GameplayStatics.ApplyPointDamage // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9db8340
	float STATIC_ApplyDamage(struct AActor* DamagedActor, float BaseDamage, struct AController* EventInstigator, struct AActor* DamageCauser, struct UClass* DamageTypeClass); // Function Engine.GameplayStatics.ApplyDamage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x9db81c0
	void STATIC_ActivateReverbEffect(struct UObject* WorldContextObject, struct UReverbEffect* ReverbEffect, struct FName TagName, float Priority, float Volume, float FadeTime); // Function Engine.GameplayStatics.ActivateReverbEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9db8010
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintMapLibrary
// Size: 0x30 (Inherited: 0x30)
class UBlueprintMapLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_SetMapPropertyByName(struct UObject* Object, struct FName PropertyName, struct TMap<int32_t, int32_t>& Value); // Function Engine.BlueprintMapLibrary.SetMapPropertyByName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d80c60
	void STATIC_Map_Values(struct TMap<int32_t, int32_t>& TargetMap, struct TArray<int32_t>& Values); // Function Engine.BlueprintMapLibrary.Map_Values // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d80b60
	bool STATIC_Map_Remove(struct TMap<int32_t, int32_t>& TargetMap, int32_t& Key); // Function Engine.BlueprintMapLibrary.Map_Remove // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d809b0
	int32_t STATIC_Map_Length(struct TMap<int32_t, int32_t>& TargetMap); // Function Engine.BlueprintMapLibrary.Map_Length // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d80900
	void STATIC_Map_Keys(struct TMap<int32_t, int32_t>& TargetMap, struct TArray<int32_t>& Keys); // Function Engine.BlueprintMapLibrary.Map_Keys // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d80800
	bool STATIC_Map_Find(struct TMap<int32_t, int32_t>& TargetMap, int32_t& Key, int32_t& Value); // Function Engine.BlueprintMapLibrary.Map_Find // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d80570
	bool STATIC_Map_Contains(struct TMap<int32_t, int32_t>& TargetMap, int32_t& Key); // Function Engine.BlueprintMapLibrary.Map_Contains // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d803c0
	void STATIC_Map_Clear(struct TMap<int32_t, int32_t>& TargetMap); // Function Engine.BlueprintMapLibrary.Map_Clear // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d80320
	void STATIC_Map_Add(struct TMap<int32_t, int32_t>& TargetMap, int32_t& Key, int32_t& Value); // Function Engine.BlueprintMapLibrary.Map_Add // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d800b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintPathsLibrary
// Size: 0x30 (Inherited: 0x30)
class UBlueprintPathsLibrary : public UBlueprintFunctionLibrary {
public:


	struct FString STATIC_VideoCaptureDir(); // Function Engine.BlueprintPathsLibrary.VideoCaptureDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d86a50
	void STATIC_ValidatePath(struct FString InPath, bool& bDidSucceed, struct FText& OutReason); // Function Engine.BlueprintPathsLibrary.ValidatePath // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d868b0
	void STATIC_Split(struct FString InPath, struct FString& PathPart, struct FString& FilenamePart, struct FString& ExtensionPart); // Function Engine.BlueprintPathsLibrary.Split // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d86650
	struct FString STATIC_SourceConfigDir(); // Function Engine.BlueprintPathsLibrary.SourceConfigDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c51520
	bool STATIC_ShouldSaveToUserDir(); // Function Engine.BlueprintPathsLibrary.ShouldSaveToUserDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d86620
	struct FString STATIC_ShaderWorkingDir(); // Function Engine.BlueprintPathsLibrary.ShaderWorkingDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d865a0
	void STATIC_SetProjectFilePath(struct FString NewGameProjectFilePath); // Function Engine.BlueprintPathsLibrary.SetProjectFilePath // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9d864f0
	struct FString STATIC_SetExtension(struct FString InPath, struct FString InNewExtension); // Function Engine.BlueprintPathsLibrary.SetExtension // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d86370
	struct FString STATIC_ScreenShotDir(); // Function Engine.BlueprintPathsLibrary.ScreenShotDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d862f0
	struct FString STATIC_SandboxesDir(); // Function Engine.BlueprintPathsLibrary.SandboxesDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d85a70
	struct FString STATIC_RootDir(); // Function Engine.BlueprintPathsLibrary.RootDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c51bf0
	void STATIC_RemoveDuplicateSlashes(struct FString InPath, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.RemoveDuplicateSlashes // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d85930
	struct FString STATIC_ProjectUserDir(); // Function Engine.BlueprintPathsLibrary.ProjectUserDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c51820
	struct FString STATIC_ProjectSavedDir(); // Function Engine.BlueprintPathsLibrary.ProjectSavedDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c517a0
	struct FString STATIC_ProjectPluginsDir(); // Function Engine.BlueprintPathsLibrary.ProjectPluginsDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d858b0
	struct FString STATIC_ProjectPersistentDownloadDir(); // Function Engine.BlueprintPathsLibrary.ProjectPersistentDownloadDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d85830
	struct FString STATIC_ProjectModsDir(); // Function Engine.BlueprintPathsLibrary.ProjectModsDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c51720
	struct FString STATIC_ProjectLogDir(); // Function Engine.BlueprintPathsLibrary.ProjectLogDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d857b0
	struct FString STATIC_ProjectIntermediateDir(); // Function Engine.BlueprintPathsLibrary.ProjectIntermediateDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c516a0
	struct FString STATIC_ProjectDir(); // Function Engine.BlueprintPathsLibrary.ProjectDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c51620
	struct FString STATIC_ProjectContentDir(); // Function Engine.BlueprintPathsLibrary.ProjectContentDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c515a0
	struct FString STATIC_ProjectConfigDir(); // Function Engine.BlueprintPathsLibrary.ProjectConfigDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c51520
	struct FString STATIC_ProfilingDir(); // Function Engine.BlueprintPathsLibrary.ProfilingDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d85730
	void STATIC_NormalizeFilename(struct FString InPath, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.NormalizeFilename // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d855f0
	void STATIC_NormalizeDirectoryName(struct FString InPath, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.NormalizeDirectoryName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d854b0
	struct FString STATIC_MakeValidFileName(struct FString inString, struct FString InReplacementChar); // Function Engine.BlueprintPathsLibrary.MakeValidFileName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d85330
	void STATIC_MakeStandardFilename(struct FString InPath, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.MakeStandardFilename // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d851f0
	void STATIC_MakePlatformFilename(struct FString InPath, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.MakePlatformFilename // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d850b0
	bool STATIC_MakePathRelativeTo(struct FString InPath, struct FString InRelativeTo, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.MakePathRelativeTo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d84ef0
	struct FString STATIC_LaunchDir(); // Function Engine.BlueprintPathsLibrary.LaunchDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c50200
	bool STATIC_IsSamePath(struct FString PathA, struct FString PathB); // Function Engine.BlueprintPathsLibrary.IsSamePath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84db0
	bool STATIC_IsRestrictedPath(struct FString InPath); // Function Engine.BlueprintPathsLibrary.IsRestrictedPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84cf0
	bool STATIC_IsRelative(struct FString InPath); // Function Engine.BlueprintPathsLibrary.IsRelative // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84c30
	bool STATIC_IsProjectFilePathSet(); // Function Engine.BlueprintPathsLibrary.IsProjectFilePathSet // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84c00
	bool STATIC_IsDrive(struct FString InPath); // Function Engine.BlueprintPathsLibrary.IsDrive // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84b40
	bool STATIC_HasProjectPersistentDownloadDir(); // Function Engine.BlueprintPathsLibrary.HasProjectPersistentDownloadDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84b10
	struct TArray<struct FString> STATIC_GetToolTipLocalizationPaths(); // Function Engine.BlueprintPathsLibrary.GetToolTipLocalizationPaths // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84ad0
	struct TArray<struct FString> STATIC_GetRestrictedFolderNames(); // Function Engine.BlueprintPathsLibrary.GetRestrictedFolderNames // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84a90
	struct FString STATIC_GetRelativePathToRoot(); // Function Engine.BlueprintPathsLibrary.GetRelativePathToRoot // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84a50
	struct TArray<struct FString> STATIC_GetPropertyNameLocalizationPaths(); // Function Engine.BlueprintPathsLibrary.GetPropertyNameLocalizationPaths // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84a10
	struct FString STATIC_GetProjectFilePath(); // Function Engine.BlueprintPathsLibrary.GetProjectFilePath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84990
	struct FString STATIC_GetPath(struct FString InPath); // Function Engine.BlueprintPathsLibrary.GetPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84880
	struct FString STATIC_GetInvalidFileSystemChars(); // Function Engine.BlueprintPathsLibrary.GetInvalidFileSystemChars // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84690
	struct TArray<struct FString> STATIC_GetGameLocalizationPaths(); // Function Engine.BlueprintPathsLibrary.GetGameLocalizationPaths // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84650
	struct FString STATIC_GetExtension(struct FString InPath, bool bIncludeDot); // Function Engine.BlueprintPathsLibrary.GetExtension // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84500
	struct TArray<struct FString> STATIC_GetEngineLocalizationPaths(); // Function Engine.BlueprintPathsLibrary.GetEngineLocalizationPaths // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d844c0
	struct TArray<struct FString> STATIC_GetEditorLocalizationPaths(); // Function Engine.BlueprintPathsLibrary.GetEditorLocalizationPaths // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84480
	struct FString STATIC_GetCleanFilename(struct FString InPath); // Function Engine.BlueprintPathsLibrary.GetCleanFilename // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84340
	struct FString STATIC_GetBaseFilename(struct FString InPath, bool bRemovePath); // Function Engine.BlueprintPathsLibrary.GetBaseFilename // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d841f0
	struct FString STATIC_GeneratedConfigDir(); // Function Engine.BlueprintPathsLibrary.GeneratedConfigDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84170
	struct FString STATIC_GameUserDeveloperDir(); // Function Engine.BlueprintPathsLibrary.GameUserDeveloperDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d840f0
	struct FString STATIC_GameSourceDir(); // Function Engine.BlueprintPathsLibrary.GameSourceDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84070
	struct FString STATIC_GameDevelopersDir(); // Function Engine.BlueprintPathsLibrary.GameDevelopersDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83ff0
	struct FString STATIC_GameAgnosticSavedDir(); // Function Engine.BlueprintPathsLibrary.GameAgnosticSavedDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83b30
	bool STATIC_FileExists(struct FString InPath); // Function Engine.BlueprintPathsLibrary.FileExists // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83f30
	struct FString STATIC_FeaturePackDir(); // Function Engine.BlueprintPathsLibrary.FeaturePackDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83eb0
	struct FString STATIC_EnterprisePluginsDir(); // Function Engine.BlueprintPathsLibrary.EnterprisePluginsDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83e30
	struct FString STATIC_EnterpriseFeaturePackDir(); // Function Engine.BlueprintPathsLibrary.EnterpriseFeaturePackDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83db0
	struct FString STATIC_EnterpriseDir(); // Function Engine.BlueprintPathsLibrary.EnterpriseDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83d30
	struct FString STATIC_EngineVersionAgnosticUserDir(); // Function Engine.BlueprintPathsLibrary.EngineVersionAgnosticUserDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83cb0
	struct FString STATIC_EngineUserDir(); // Function Engine.BlueprintPathsLibrary.EngineUserDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83c30
	struct FString STATIC_EngineSourceDir(); // Function Engine.BlueprintPathsLibrary.EngineSourceDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83bb0
	struct FString STATIC_EngineSavedDir(); // Function Engine.BlueprintPathsLibrary.EngineSavedDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83b30
	struct FString STATIC_EnginePluginsDir(); // Function Engine.BlueprintPathsLibrary.EnginePluginsDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83ab0
	struct FString STATIC_EngineIntermediateDir(); // Function Engine.BlueprintPathsLibrary.EngineIntermediateDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83a30
	struct FString STATIC_EngineDir(); // Function Engine.BlueprintPathsLibrary.EngineDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d839b0
	struct FString STATIC_EngineContentDir(); // Function Engine.BlueprintPathsLibrary.EngineContentDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83930
	struct FString STATIC_EngineConfigDir(); // Function Engine.BlueprintPathsLibrary.EngineConfigDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d838b0
	bool STATIC_DirectoryExists(struct FString InPath); // Function Engine.BlueprintPathsLibrary.DirectoryExists // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d837f0
	struct FString STATIC_DiffDir(); // Function Engine.BlueprintPathsLibrary.DiffDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83770
	struct FString STATIC_CreateTempFilename(struct FString Path, struct FString Prefix, struct FString Extension); // Function Engine.BlueprintPathsLibrary.CreateTempFilename // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83570
	struct FString STATIC_ConvertToSandboxPath(struct FString InPath, struct FString InSandboxName); // Function Engine.BlueprintPathsLibrary.ConvertToSandboxPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d833f0
	struct FString STATIC_ConvertRelativePathToFull(struct FString InPath, struct FString InBasePath); // Function Engine.BlueprintPathsLibrary.ConvertRelativePathToFull // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d83270
	struct FString STATIC_ConvertFromSandboxPath(struct FString InPath, struct FString InSandboxName); // Function Engine.BlueprintPathsLibrary.ConvertFromSandboxPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d830f0
	struct FString STATIC_Combine(struct TArray<struct FString>& InPaths); // Function Engine.BlueprintPathsLibrary.Combine // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d82f90
	bool STATIC_CollapseRelativeDirectories(struct FString InPath, struct FString& OutPath); // Function Engine.BlueprintPathsLibrary.CollapseRelativeDirectories // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d82e40
	struct FString STATIC_CloudDir(); // Function Engine.BlueprintPathsLibrary.CloudDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d82dc0
	struct FString STATIC_ChangeExtension(struct FString InPath, struct FString InNewExtension); // Function Engine.BlueprintPathsLibrary.ChangeExtension // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d82c20
	struct FString STATIC_BugItDir(); // Function Engine.BlueprintPathsLibrary.BugItDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d82a80
	struct FString STATIC_AutomationTransientDir(); // Function Engine.BlueprintPathsLibrary.AutomationTransientDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d82a00
	struct FString STATIC_AutomationLogDir(); // Function Engine.BlueprintPathsLibrary.AutomationLogDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d82980
	struct FString STATIC_AutomationDir(); // Function Engine.BlueprintPathsLibrary.AutomationDir // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d82900
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintPlatformLibrary
// Size: 0x30 (Inherited: 0x30)
class UBlueprintPlatformLibrary : public UBlueprintFunctionLibrary {
public:


	int32_t STATIC_ScheduleLocalNotificationFromNow(int32_t inSecondsFromNow, struct FText& Title, struct FText& Body, struct FText& Action, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationFromNow // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d86040
	void STATIC_ScheduleLocalNotificationBadgeFromNow(int32_t inSecondsFromNow, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationBadgeFromNow // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9d85f50
	int32_t STATIC_ScheduleLocalNotificationBadgeAtTime(struct FDateTime& FireDateTime, bool LocalTime, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationBadgeAtTime // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d85df0
	int32_t STATIC_ScheduleLocalNotificationAtTime(struct FDateTime& FireDateTime, bool LocalTime, struct FText& Title, struct FText& Body, struct FText& Action, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationAtTime // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9d85af0
	void STATIC_GetLaunchNotification(bool& NotificationLaunchedApp, struct FString& ActivationEvent, int32_t& FireDate); // Function Engine.BlueprintPlatformLibrary.GetLaunchNotification // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d84710
	enum class EScreenOrientation STATIC_GetDeviceOrientation(); // Function Engine.BlueprintPlatformLibrary.GetDeviceOrientation // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9d84450
	void STATIC_ClearAllLocalNotifications(); // Function Engine.BlueprintPlatformLibrary.ClearAllLocalNotifications // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9d82da0
	void STATIC_CancelLocalNotificationById(int32_t NotificationId); // Function Engine.BlueprintPlatformLibrary.CancelLocalNotificationById // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9d82bb0
	void STATIC_CancelLocalNotification(struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.CancelLocalNotification // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9d82b00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.BlueprintSetLibrary
// Size: 0x30 (Inherited: 0x30)
class UBlueprintSetLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_SetSetPropertyByName(/*struct UObject* Object, struct FName PropertyName, struct TSet<int32_t>& Value*/); // Function Engine.BlueprintSetLibrary.SetSetPropertyByName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89100
	void STATIC_Set_Union(/*struct TSet<int32_t>& A, struct TSet<int32_t>& B, struct TSet<int32_t>& Result*/); // Function Engine.BlueprintSetLibrary.Set_Union // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89e20
	void STATIC_Set_ToArray(/*struct TSet<int32_t>& A, struct TArray<int32_t>& Result*/); // Function Engine.BlueprintSetLibrary.Set_ToArray // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89d20
	void STATIC_Set_RemoveItems(/*struct TSet<int32_t>& TargetSet, struct TArray<int32_t>& Items*/); // Function Engine.BlueprintSetLibrary.Set_RemoveItems // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89c20
	bool STATIC_Set_Remove(/*struct TSet<int32_t>& TargetSet, int32_t& Item*/); // Function Engine.BlueprintSetLibrary.Set_Remove // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89a70
	int32_t STATIC_Set_Length(/*struct TSet<int32_t>& TargetSet*/); // Function Engine.BlueprintSetLibrary.Set_Length // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d899c0
	void STATIC_Set_Intersection(/*struct TSet<int32_t>& A, struct TSet<int32_t>& B, struct TSet<int32_t>& Result*/); // Function Engine.BlueprintSetLibrary.Set_Intersection // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89850
	void STATIC_Set_Difference(/*struct TSet<int32_t>& A, struct TSet<int32_t>& B, struct TSet<int32_t>& Result*/); // Function Engine.BlueprintSetLibrary.Set_Difference // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d896e0
	bool STATIC_Set_Contains(/*struct TSet<int32_t>& TargetSet, int32_t& ItemToFind*/); // Function Engine.BlueprintSetLibrary.Set_Contains // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9d89530
	void STATIC_Set_Clear(/*struct TSet<int32_t>& TargetSet*/); // Function Engine.BlueprintSetLibrary.Set_Clear // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89490
	void STATIC_Set_AddItems(/*struct TSet<int32_t>& TargetSet, struct TArray<int32_t>& NewItems*/); // Function Engine.BlueprintSetLibrary.Set_AddItems // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d89390
	void STATIC_Set_Add(/*struct TSet<int32_t>& TargetSet, int32_t& NewItem*/); // Function Engine.BlueprintSetLibrary.Set_Add // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d891f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DataTableFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
class UDataTableFunctionLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_GetDataTableRowNames(struct UDataTable* Table, struct TArray<struct FName>& OutRowNames); // Function Engine.DataTableFunctionLibrary.GetDataTableRowNames // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da04d0
	bool STATIC_GetDataTableRowFromName(struct UDataTable* Table, struct FName RowName, struct FTableRowBase& OutRow); // Function Engine.DataTableFunctionLibrary.GetDataTableRowFromName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9da0240
	struct TArray<struct FString> STATIC_GetDataTableColumnAsString(struct UDataTable* DataTable, struct FName PropertyName); // Function Engine.DataTableFunctionLibrary.GetDataTableColumnAsString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9da0050
	void STATIC_EvaluateCurveTableRow(struct UCurveTable* CurveTable, struct FName RowName, float InXY, enum class EEvaluateCurveTableResult& OutResult, float& OutXY, struct FString ContextString); // Function Engine.DataTableFunctionLibrary.EvaluateCurveTableRow // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9d9fb60
	bool STATIC_DoesDataTableRowExist(struct UDataTable* Table, struct FName RowName); // Function Engine.DataTableFunctionLibrary.DoesDataTableRowExist // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9d9faa0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.DebugDrawService
// Size: 0x30 (Inherited: 0x30)
class UDebugDrawService : public UBlueprintFunctionLibrary {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.HealthSnapshotBlueprintLibrary
// Size: 0x30 (Inherited: 0x30)
class UHealthSnapshotBlueprintLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_StopPerformanceSnapshots(); // Function Engine.HealthSnapshotBlueprintLibrary.StopPerformanceSnapshots // (Final|Exec|Native|Static|Public|BlueprintCallable) // @ game+0x9dccb80
	void STATIC_StartPerformanceSnapshots(); // Function Engine.HealthSnapshotBlueprintLibrary.StartPerformanceSnapshots // (Final|Exec|Native|Static|Public|BlueprintCallable) // @ game+0x9dccb60
	void STATIC_LogPerformanceSnapshot(struct FString SnapshotTitle, bool bResetStats); // Function Engine.HealthSnapshotBlueprintLibrary.LogPerformanceSnapshot // (Final|Exec|Native|Static|Public|BlueprintCallable) // @ game+0x9dcbde0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.ImportanceSamplingLibrary
// Size: 0x30 (Inherited: 0x30)
class UImportanceSamplingLibrary : public UBlueprintFunctionLibrary {
public:


	float STATIC_RandomSobolFloat(int32_t Index, int32_t Dimension, float Seed); // Function Engine.ImportanceSamplingLibrary.RandomSobolFloat // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dcc760
	struct FVector STATIC_RandomSobolCell3D(int32_t Index, int32_t NumCells, struct FVector Cell, struct FVector Seed); // Function Engine.ImportanceSamplingLibrary.RandomSobolCell3D // (Final|RequiredAPI|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dcc5d0
	struct FVector2D STATIC_RandomSobolCell2D(int32_t Index, int32_t NumCells, struct FVector2D Cell, struct FVector2D Seed); // Function Engine.ImportanceSamplingLibrary.RandomSobolCell2D // (Final|RequiredAPI|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dcc490
	float STATIC_NextSobolFloat(int32_t Index, int32_t Dimension, float PreviousValue); // Function Engine.ImportanceSamplingLibrary.NextSobolFloat // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dcc2f0
	struct FVector STATIC_NextSobolCell3D(int32_t Index, int32_t NumCells, struct FVector PreviousValue); // Function Engine.ImportanceSamplingLibrary.NextSobolCell3D // (Final|RequiredAPI|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dcc1d0
	struct FVector2D STATIC_NextSobolCell2D(int32_t Index, int32_t NumCells, struct FVector2D PreviousValue); // Function Engine.ImportanceSamplingLibrary.NextSobolCell2D // (Final|RequiredAPI|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dcc0d0
	struct FImportanceTexture STATIC_MakeImportanceTexture(struct UTexture2D* Texture, enum class EImportanceWeight WeightingFunc); // Function Engine.ImportanceSamplingLibrary.MakeImportanceTexture // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dcbf40
	void STATIC_ImportanceSample(struct FImportanceTexture& Texture, struct FVector2D& Rand, int32_t Samples, float Intensity, struct FVector2D& SamplePosition, struct FLinearColor& SampleColor, float& SampleIntensity, float& SampleSize); // Function Engine.ImportanceSamplingLibrary.ImportanceSample // (Final|RequiredAPI|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dcbb10
	void STATIC_BreakImportanceTexture(struct FImportanceTexture& ImportanceTexture, struct UTexture2D*& Texture, enum class EImportanceWeight& WeightingFunc); // Function Engine.ImportanceSamplingLibrary.BreakImportanceTexture // (Final|RequiredAPI|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dca030
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.KismetArrayLibrary
// Size: 0x30 (Inherited: 0x30)
class UKismetArrayLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_SetArrayPropertyByName(struct UObject* Object, struct FName PropertyName, struct TArray<int32_t>& Value); // Function Engine.KismetArrayLibrary.SetArrayPropertyByName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9ddabd0
	void STATIC_FilterArray(struct TArray<struct AActor*>& TargetArray, struct UClass* FilterClass, struct TArray<struct AActor*>& FilteredArray); // Function Engine.KismetArrayLibrary.FilterArray // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9ddaa40
	void STATIC_Array_Swap(struct TArray<int32_t>& TargetArray, int32_t FirstIndex, int32_t SecondIndex); // Function Engine.KismetArrayLibrary.Array_Swap // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda910
	void STATIC_Array_Shuffle(struct TArray<int32_t>& TargetArray); // Function Engine.KismetArrayLibrary.Array_Shuffle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda870
	void STATIC_Array_Set(struct TArray<int32_t>& TargetArray, int32_t Index, int32_t& Item, bool bSizeToFit); // Function Engine.KismetArrayLibrary.Array_Set // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda650
	void STATIC_Array_Resize(struct TArray<int32_t>& TargetArray, int32_t size); // Function Engine.KismetArrayLibrary.Array_Resize // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda560
	bool STATIC_Array_RemoveItem(struct TArray<int32_t>& TargetArray, int32_t& Item); // Function Engine.KismetArrayLibrary.Array_RemoveItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda3b0
	void STATIC_Array_Remove(struct TArray<int32_t>& TargetArray, int32_t IndexToRemove); // Function Engine.KismetArrayLibrary.Array_Remove // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dda2c0
	int32_t STATIC_Array_Length(struct TArray<int32_t>& TargetArray); // Function Engine.KismetArrayLibrary.Array_Length // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dda210
	int32_t STATIC_Array_LastIndex(struct TArray<int32_t>& TargetArray); // Function Engine.KismetArrayLibrary.Array_LastIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dda160
	bool STATIC_Array_IsValidIndex(struct TArray<int32_t>& TargetArray, int32_t IndexToTest); // Function Engine.KismetArrayLibrary.Array_IsValidIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dda070
	void STATIC_Array_Insert(struct TArray<int32_t>& TargetArray, int32_t& NewItem, int32_t Index); // Function Engine.KismetArrayLibrary.Array_Insert // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd9e90
	bool STATIC_Array_Identical(struct TArray<int32_t>& ArrayA, struct TArray<int32_t>& ArrayB); // Function Engine.KismetArrayLibrary.Array_Identical // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dd9d80
	void STATIC_Array_Get(struct TArray<int32_t>& TargetArray, int32_t Index, int32_t& Item); // Function Engine.KismetArrayLibrary.Array_Get // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dd9b90
	int32_t STATIC_Array_Find(struct TArray<int32_t>& TargetArray, int32_t& ItemToFind); // Function Engine.KismetArrayLibrary.Array_Find // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dd99e0
	bool STATIC_Array_Contains(struct TArray<int32_t>& TargetArray, int32_t& ItemToFind); // Function Engine.KismetArrayLibrary.Array_Contains // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dd9820
	void STATIC_Array_Clear(struct TArray<int32_t>& TargetArray); // Function Engine.KismetArrayLibrary.Array_Clear // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd9780
	void STATIC_Array_Append(struct TArray<int32_t>& TargetArray, struct TArray<int32_t>& SourceArray); // Function Engine.KismetArrayLibrary.Array_Append // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd9680
	int32_t STATIC_Array_AddUnique(struct TArray<int32_t>& TargetArray, int32_t& NewItem); // Function Engine.KismetArrayLibrary.Array_AddUnique // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd94d0
	int32_t STATIC_Array_Add(struct TArray<int32_t>& TargetArray, int32_t& NewItem); // Function Engine.KismetArrayLibrary.Array_Add // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9dd9320
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.KismetGuidLibrary
// Size: 0x30 (Inherited: 0x30)
class UKismetGuidLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_Parse_StringToGuid(struct FString GuidString, struct FGuid& OutGUID, bool& Success); // Function Engine.KismetGuidLibrary.Parse_StringToGuid // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dff350
	bool STATIC_NotEqual_GuidGuid(struct FGuid& A, struct FGuid& B); // Function Engine.KismetGuidLibrary.NotEqual_GuidGuid // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dfe420
	struct FGuid STATIC_NewGuid(); // Function Engine.KismetGuidLibrary.NewGuid // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dfd510
	bool STATIC_IsValid_Guid(struct FGuid& InGuid); // Function Engine.KismetGuidLibrary.IsValid_Guid // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9df3390
	void STATIC_Invalidate_Guid(struct FGuid& InGuid); // Function Engine.KismetGuidLibrary.Invalidate_Guid // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9df2680
	bool STATIC_EqualEqual_GuidGuid(struct FGuid& A, struct FGuid& B); // Function Engine.KismetGuidLibrary.EqualEqual_GuidGuid // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9deb7d0
	struct FString STATIC_Conv_GuidToString(struct FGuid& InGuid); // Function Engine.KismetGuidLibrary.Conv_GuidToString // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9de7ee0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.KismetInputLibrary
// Size: 0x30 (Inherited: 0x30)
class UKismetInputLibrary : public UBlueprintFunctionLibrary {
public:


	bool STATIC_PointerEvent_IsTouchEvent(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_IsTouchEvent // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e00690
	bool STATIC_PointerEvent_IsMouseButtonDown(struct FPointerEvent& Input, struct FKey MouseButton); // Function Engine.KismetInputLibrary.PointerEvent_IsMouseButtonDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e004d0
	float STATIC_PointerEvent_GetWheelDelta(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetWheelDelta // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e003a0
	int32_t STATIC_PointerEvent_GetUserIndex(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetUserIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e00270
	int32_t STATIC_PointerEvent_GetTouchpadIndex(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetTouchpadIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9e00140
	struct FVector2D STATIC_PointerEvent_GetScreenSpacePosition(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetScreenSpacePosition // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e00010
	int32_t STATIC_PointerEvent_GetPointerIndex(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetPointerIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dffee0
	struct FVector2D STATIC_PointerEvent_GetLastScreenSpacePosition(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetLastScreenSpacePosition // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dffdb0
	enum class ESlateGesture STATIC_PointerEvent_GetGestureType(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetGestureType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dffc80
	struct FVector2D STATIC_PointerEvent_GetGestureDelta(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetGestureDelta // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dffb50
	struct FKey STATIC_PointerEvent_GetEffectingButton(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetEffectingButton // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dff9f0
	struct FVector2D STATIC_PointerEvent_GetCursorDelta(struct FPointerEvent& Input); // Function Engine.KismetInputLibrary.PointerEvent_GetCursorDelta // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9dff8c0
	bool STATIC_Key_IsVectorAxis(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsVectorAxis // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3ec0
	bool STATIC_Key_IsValid(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsValid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3df0
	bool STATIC_Key_IsMouseButton(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsMouseButton // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3d20
	bool STATIC_Key_IsModifierKey(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsModifierKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3c50
	bool STATIC_Key_IsKeyboardKey(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsKeyboardKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3b80
	bool STATIC_Key_IsGamepadKey(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsGamepadKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3ab0
	bool STATIC_Key_IsFloatAxis(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_IsFloatAxis // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df39e0
	enum class EUINavigation STATIC_Key_GetNavigationDirectionFromKey(struct FKeyEvent& InKeyEvent); // Function Engine.KismetInputLibrary.Key_GetNavigationDirectionFromKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df38e0
	enum class EUINavigation STATIC_Key_GetNavigationDirectionFromAnalog(struct FAnalogInputEvent& InAnalogEvent); // Function Engine.KismetInputLibrary.Key_GetNavigationDirectionFromAnalog // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df37d0
	enum class EUINavigationAction STATIC_Key_GetNavigationActionFromKey(struct FKeyEvent& InKeyEvent); // Function Engine.KismetInputLibrary.Key_GetNavigationActionFromKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df36d0
	enum class EUINavigationAction STATIC_Key_GetNavigationAction(struct FKey& InKey); // Function Engine.KismetInputLibrary.Key_GetNavigationAction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df3600
	struct FText STATIC_Key_GetDisplayName(struct FKey& Key); // Function Engine.KismetInputLibrary.Key_GetDisplayName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df34e0
	bool STATIC_InputEvent_IsShiftDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsShiftDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df25d0
	bool STATIC_InputEvent_IsRightShiftDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsRightShiftDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df2520
	bool STATIC_InputEvent_IsRightControlDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsRightControlDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df2470
	bool STATIC_InputEvent_IsRightCommandDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsRightCommandDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df23c0
	bool STATIC_InputEvent_IsRightAltDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsRightAltDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df2310
	bool STATIC_InputEvent_IsRepeat(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsRepeat // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df2260
	bool STATIC_InputEvent_IsLeftShiftDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsLeftShiftDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df21b0
	bool STATIC_InputEvent_IsLeftControlDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsLeftControlDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df2100
	bool STATIC_InputEvent_IsLeftCommandDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsLeftCommandDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df2050
	bool STATIC_InputEvent_IsLeftAltDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsLeftAltDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df1fa0
	bool STATIC_InputEvent_IsControlDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsControlDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df1ef0
	bool STATIC_InputEvent_IsCommandDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsCommandDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df1e40
	bool STATIC_InputEvent_IsAltDown(struct FInputEvent& Input); // Function Engine.KismetInputLibrary.InputEvent_IsAltDown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df1d90
	struct FText STATIC_InputChord_GetDisplayName(struct FInputChord& Key); // Function Engine.KismetInputLibrary.InputChord_GetDisplayName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df1c40
	int32_t STATIC_GetUserIndex(struct FKeyEvent& Input); // Function Engine.KismetInputLibrary.GetUserIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9df0610
	struct FKey STATIC_GetKey(struct FKeyEvent& Input); // Function Engine.KismetInputLibrary.GetKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9deed00
	float STATIC_GetAnalogValue(struct FAnalogInputEvent& Input); // Function Engine.KismetInputLibrary.GetAnalogValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9dedf60
	bool STATIC_EqualEqual_KeyKey(struct FKey A, struct FKey B); // Function Engine.KismetInputLibrary.EqualEqual_KeyKey // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9debb60
	bool STATIC_EqualEqual_InputChordInputChord(struct FInputChord A, struct FInputChord B); // Function Engine.KismetInputLibrary.EqualEqual_InputChordInputChord // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9deb8d0
	void STATIC_CalibrateTilt(); // Function Engine.KismetInputLibrary.CalibrateTilt // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9de7150
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.KismetInternationalizationLibrary
// Size: 0x30 (Inherited: 0x30)
class UKismetInternationalizationLibrary : public UBlueprintFunctionLibrary {
public:


	bool STATIC_SetCurrentLocale(struct FString Culture, bool SaveToConfig); // Function Engine.KismetInternationalizationLibrary.SetCurrentLocale // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e05810
	bool STATIC_SetCurrentLanguageAndLocale(struct FString Culture, bool SaveToConfig); // Function Engine.KismetInternationalizationLibrary.SetCurrentLanguageAndLocale // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e05710
	bool STATIC_SetCurrentLanguage(struct FString Culture, bool SaveToConfig); // Function Engine.KismetInternationalizationLibrary.SetCurrentLanguage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e05610
	bool STATIC_SetCurrentCulture(struct FString Culture, bool SaveToConfig); // Function Engine.KismetInternationalizationLibrary.SetCurrentCulture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e05510
	bool STATIC_SetCurrentAssetGroupCulture(struct FName AssetGroup, struct FString Culture, bool SaveToConfig); // Function Engine.KismetInternationalizationLibrary.SetCurrentAssetGroupCulture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9e053d0
	struct FString STATIC_GetSuitableCulture(struct TArray<struct FString>& AvailableCultures, struct FString CultureToMatch, struct FString FallbackCulture); // Function Engine.KismetInternationalizationLibrary.GetSuitableCulture // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9defff0
	struct FString STATIC_GetNativeCulture(enum class ELocalizedTextSourceCategory TextCategory); // Function Engine.KismetInternationalizationLibrary.GetNativeCulture // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9def570
	struct TArray<struct FString> STATIC_GetLocalizedCultures(bool IncludeGame, bool IncludeEngine, bool IncludeEditor, bool IncludeAdditional); // Function Engine.KismetInternationalizationLibrary.GetLocalizedCultures // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9deee30
	struct FString STATIC_GetCurrentLocale(); // Function Engine.KismetInternationalizationLibrary.GetCurrentLocale // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dee670
	struct FString STATIC_GetCurrentLanguage(); // Function Engine.KismetInternationalizationLibrary.GetCurrentLanguage // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dee5f0
	struct FString STATIC_GetCurrentCulture(); // Function Engine.KismetInternationalizationLibrary.GetCurrentCulture // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dee5f0
	struct FString STATIC_GetCurrentAssetGroupCulture(struct FName AssetGroup); // Function Engine.KismetInternationalizationLibrary.GetCurrentAssetGroupCulture // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dee520
	struct FString STATIC_GetCultureDisplayName(struct FString Culture, bool Localized); // Function Engine.KismetInternationalizationLibrary.GetCultureDisplayName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9dee3d0
	void STATIC_ClearCurrentAssetGroupCulture(struct FName AssetGroup, bool SaveToConfig); // Function Engine.KismetInternationalizationLibrary.ClearCurrentAssetGroupCulture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x9de7760
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.KismetMaterialLibrary
// Size: 0x30 (Inherited: 0x30)
class UKismetMaterialLibrary : public UBlueprintFunctionLibrary {
public:


	void STATIC_SetVectorParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName, struct FLinearColor& ParameterValue); // Function Engine.KismetMaterialLibrary.SetVectorParameterValue // (Final|RequiredAPI|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9e05b10
	void STATIC_SetScalarParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName, float ParameterValue); // Function Engine.KismetMaterialLibrary.SetScalarParameterValue // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable) // @ game+0x9e059e0
	struct FLinearColor STATIC_GetVectorParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName); // Function Engine.KismetMaterialLibrary.GetVectorParameterValue // (Final|RequiredAPI|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x9df07f0
	float STATIC_GetScalarParameterValue(struct UObject* WorldContextObject, struct UMaterialParameterCollection* Collection, struct FName ParameterName); // Function Engine.KismetMaterialLibrary.GetScalarParameterValue // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable) // @ game+0x9defc70
	struct UMaterialInstanceDynamic* STATIC_CreateDynamicMaterialInstance(struct UObject* WorldContextObject, struct UMaterialInterface* Parent, struct FName OptionalName); // Function Engine.KismetMaterialLibrary.CreateDynamicMaterialInstance // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable) // @ game+0x9de9010
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Engine.KismetMathLibrary
// Size: 0x30 (Inherited: 0x30)
class UKismetMathLibrary : public UBlueprintFunctionLibrary {
public:


	int32_t STATIC_Xor_IntInt(int32_t A, int32_t B); // Function Engine.KismetMathLibrary.Xor_IntInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e0d050
	int64_t STATIC_Xor_Int64Int64(int64_t A, int64_t B); // Function Engine.KismetMathLibrary.Xor_Int64Int64 // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e0cf90
	struct FVector STATIC_WeightedMovingAverage_FVector(struct FVector CurrentSample, struct FVector PreviousSample, float Weight); // Function Engine.KismetMathLibrary.WeightedMovingAverage_FVector // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e0cd40
	struct FRotator STATIC_WeightedMovingAverage_FRotator(struct FRotator CurrentSample, struct FRotator PreviousSample, float Weight); // Function Engine.KismetMathLibrary.WeightedMovingAverage_FRotator // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e0cc00
	float STATIC_WeightedMovingAverage_Float(float CurrentSample, float PreviousSample, float Weight); // Function Engine.KismetMathLibrary.WeightedMovingAverage_Float // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9e0ce80
	float STATIC_VSizeXYSquared(struct FVector A); // Function Engine.KismetMathLibrary.VSizeXYSquared // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08720
	float STATIC_VSizeXY(struct FVector A); // Function Engine.KismetMathLibrary.VSizeXY // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08690
	float STATIC_VSizeSquared(struct FVector A); // Function Engine.KismetMathLibrary.VSizeSquared // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08600
	float STATIC_VSize2DSquared(struct FVector2D A); // Function Engine.KismetMathLibrary.VSize2DSquared // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e084e0
	float STATIC_VSize2D(struct FVector2D A); // Function Engine.KismetMathLibrary.VSize2D // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08450
	float STATIC_VSize(struct FVector A); // Function Engine.KismetMathLibrary.VSize // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08560
	struct FVector STATIC_VLerp(struct FVector A, struct FVector B, float Alpha); // Function Engine.KismetMathLibrary.VLerp // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08320
	struct FVector STATIC_VInterpTo_Constant(struct FVector Current, struct FVector Target, float DeltaTime, float InterpSpeed); // Function Engine.KismetMathLibrary.VInterpTo_Constant // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e081a0
	struct FVector STATIC_VInterpTo(struct FVector Current, struct FVector Target, float DeltaTime, float InterpSpeed); // Function Engine.KismetMathLibrary.VInterpTo // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x9e08020
