
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Class GameletJsEnv.GameletDynamicDelegateProxy
// Size: 0x78 (Inherited: 0x30)
class UGameletDynamicDelegateProxy : public UObject {
public:

	char pad_30[0x48]; // 0x30(0x48)

	void Fire(); // Function GameletJsEnv.GameletDynamicDelegateProxy.Fire // (Final|Native|Public|BlueprintCallable) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletExtensionMethods
// Size: 0x30 (Inherited: 0x30)
class UGameletExtensionMethods : public UBlueprintFunctionLibrary {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletJSAnimGeneratedClass
// Size: 0x5e0 (Inherited: 0x580)
class UGameletJSAnimGeneratedClass : public UAnimBlueprintGeneratedClass {
public:

	char pad_580[0x60]; // 0x580(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletJSGeneratedClass
// Size: 0x3d0 (Inherited: 0x370)
class UGameletJSGeneratedClass : public UBlueprintGeneratedClass {
public:

	char pad_370[0x60]; // 0x370(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletJSGeneratedFunction
// Size: 0x158 (Inherited: 0xf8)
class UGameletJSGeneratedFunction : public UFunction {
public:

	char pad_F8[0x48]; // 0xf8(0x48)
	struct UFunction* Original; // 0x140(0x08)
	char pad_148[0x10]; // 0x148(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletJSWidgetGeneratedClass
// Size: 0x418 (Inherited: 0x3b8)
class UGameletJSWidgetGeneratedClass : public UWidgetBlueprintGeneratedClass {
public:

	char pad_3B8[0x60]; // 0x3b8(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletTypeScriptBlueprint
// Size: 0xa8 (Inherited: 0xa8)
class UGameletTypeScriptBlueprint : public UBlueprint {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletTypeScriptGeneratedClass
// Size: 0x410 (Inherited: 0x370)
class UGameletTypeScriptGeneratedClass : public UBlueprintGeneratedClass {
public:

	char pad_370[0x99]; // 0x370(0x99)
	bool HasConstructor; // 0x409(0x01)
	char pad_40A[0x6]; // 0x40a(0x06)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GameletJsEnv.GameletTypeScriptObject
// Size: 0x30 (Inherited: 0x30)
class UGameletTypeScriptObject : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// GameletJSAnimGeneratedClass GameletJsEnv.Default__GameletJSAnimGeneratedClass
// Size: 0x00 (Inherited: 0x00)
class Default__GameletJSAnimGeneratedClass {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// GameletJSGeneratedClass GameletJsEnv.Default__GameletJSGeneratedClass
// Size: 0x00 (Inherited: 0x00)
class Default__GameletJSGeneratedClass {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// GameletJSWidgetGeneratedClass GameletJsEnv.Default__GameletJSWidgetGeneratedClass
// Size: 0x00 (Inherited: 0x00)
class Default__GameletJSWidgetGeneratedClass {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// GameletTypeScriptGeneratedClass GameletJsEnv.Default__GameletTypeScriptGeneratedClass
// Size: 0x00 (Inherited: 0x00)
class Default__GameletTypeScriptGeneratedClass {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
