
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Class GPGameplay.GPPackageMapClient
// Size: 0x530 (Inherited: 0x458)
class UGPPackageMapClient : public UPropertyReplicationPackageMapClient {
public:

	char pad_458[0xd0]; // 0x458(0xd0)
	int32_t NetActorRenameLevel; // 0x528(0x04)
	char pad_52C[0x4]; // 0x52c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameInstance
// Size: 0x3e0 (Inherited: 0x1d8)
class UGPGameInstance : public UBaseGameInstance {
public:

	char pad_1D8[0x8]; // 0x1d8(0x08)
	struct TArray<struct UObject*> PreloadedObjects; // 0x1e0(0x10)
	char pad_1F0[0x140]; // 0x1f0(0x140)
	struct TMap<struct FName, struct UClass*> PredloadClassList; // 0x330(0x50)
	struct AMovementReplicationActor* MovementReplicationActor; // 0x380(0x08)
	struct UDataTable* CharacterPreSpawnTable; // 0x388(0x08)
	struct TMap<struct UClass*, struct FCharacterArray> PreSpawnedCharacters; // 0x390(0x50)

	void PreloadLevels(struct TArray<struct UObject*>& OutPreloadedObjects); // Function GPGameplay.GPGameInstance.PreloadLevels // (Final|Native|Public|HasOutParms) // @ game+0x35fd300
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AbilityEntityManager
// Size: 0x108 (Inherited: 0x30)
class UAbilityEntityManager : public UObject {
public:

	char pad_30[0xd8]; // 0x30(0xd8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AbilityProjectileActorInterface
// Size: 0x30 (Inherited: 0x30)
class UAbilityProjectileActorInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AdrenalineWeaponDataComponent
// Size: 0x640 (Inherited: 0x5f0)
class UAdrenalineWeaponDataComponent : public UGPWeaponDataComponentBase {
public:

	enum class EOutLineEffectType OutLineEffectType; // 0x5f0(0x04)
	float AdrenalineEffectRange; // 0x5f4(0x04)
	struct FName AdrenalineEffectName; // 0x5f8(0x08)
	struct FName AdrenalineEffectParameterName; // 0x600(0x08)
	struct FName MobileFXName; // 0x608(0x08)
	bool bShowEffect; // 0x610(0x01)
	char pad_611[0x7]; // 0x611(0x07)
	struct TArray<struct AActor*> OutLineCharArray; // 0x618(0x10)
	int32_t TickCnt; // 0x628(0x04)
	char pad_62C[0x4]; // 0x62c(0x04)
	struct UFXResourceContainerComponent* MobileFXComp; // 0x630(0x08)
	int32_t MobileFXCompHandle; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AIDebugPanelV2
// Size: 0x3c8 (Inherited: 0x3b8)
class UAIDebugPanelV2 : public UMobileGamePadView {
public:

	struct TWeakObjectPtr<struct UGPAIAnimInstance> AnimInst; // 0x3b8(0x08)
	struct TWeakObjectPtr<struct UGPAIAnimInstance> OldAnimInst; // 0x3c0(0x08)

	void OnDebugTargetChanged(); // Function GPGameplay.AIDebugPanelV2.OnDebugTargetChanged // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void BP_Update(float DeltaSecond); // Function GPGameplay.AIDebugPanelV2.BP_Update // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AmmoTimeLineOwnerInterface
// Size: 0x30 (Inherited: 0x30)
class UAmmoTimeLineOwnerInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimLODConfig
// Size: 0x60 (Inherited: 0x40)
class UAnimLODConfig : public UDeveloperSettings {
public:

	int32_t AnimLODNum; // 0x40(0x04)
	int32_t AnimLODFeatureLevelNum; // 0x44(0x04)
	int32_t AnimLODCutOffset; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FAnimLODConfigParam> AnimLODConfigParams; // 0x50(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_BreakSkillLockState
// Size: 0x50 (Inherited: 0x40)
class UAnimNotify_BreakSkillLockState : public UAnimNotify {
public:

	struct FName NotifyName; // 0x40(0x08)
	enum class EFSMForbidReason BreakForbidReason; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_CharacterSimulatePhysics
// Size: 0x40 (Inherited: 0x40)
class UAnimNotify_CharacterSimulatePhysics : public UAnimNotify {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_CloseEyeScreenFXInfo
// Size: 0x58 (Inherited: 0x40)
class UAnimNotify_CloseEyeScreenFXInfo : public UAnimNotify {
public:

	struct FCloseEyeScreenFXInfo CloseEyeScreenFXParams; // 0x40(0x0c)
	struct FName EffectName; // 0x4c(0x08)
	char pad_54[0x4]; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_GPPlayMontage
// Size: 0x50 (Inherited: 0x40)
class UAnimNotify_GPPlayMontage : public UAnimNotify {
public:

	struct FName NotifyName; // 0x40(0x08)
	struct FName AddTag; // 0x48(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_GPPlayParticleEffect
// Size: 0xa0 (Inherited: 0x90)
class UAnimNotify_GPPlayParticleEffect : public UAnimNotify_PlayParticleEffect {
public:

	enum class EGPPlayParticleEffectRole ParticleEffectRole; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	struct FName ParticleName; // 0x94(0x08)
	char pad_9C[0x4]; // 0x9c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_GPRemoveLoopParticleEffect
// Size: 0x48 (Inherited: 0x40)
class UAnimNotify_GPRemoveLoopParticleEffect : public UAnimNotify {
public:

	struct FName ParticleName; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_PlayRagDoll
// Size: 0x40 (Inherited: 0x40)
class UAnimNotify_PlayRagDoll : public UAnimNotify {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_PlayResourceParticleEffect
// Size: 0xa0 (Inherited: 0x40)
class UAnimNotify_PlayResourceParticleEffect : public UAnimNotify {
public:

	struct FName ResourceId; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	struct FVector Scale; // 0x60(0x0c)
	char pad_6C[0x14]; // 0x6c(0x14)
	struct FName AvatarID; // 0x80(0x08)
	struct FName SocketName; // 0x88(0x08)
	bool CheckAvatarID; // 0x90(0x01)
	bool bIsTppAnim; // 0x91(0x01)
	char pad_92[0xe]; // 0x92(0x0e)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_RagDollDelay
// Size: 0x40 (Inherited: 0x40)
class UAnimNotify_RagDollDelay : public UAnimNotify {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_SimulatePhysics
// Size: 0xb8 (Inherited: 0x40)
class UAnimNotify_SimulatePhysics : public UAnimNotify {
public:

	char bMaintainVelocityOfAnim : 1; // 0x40(0x01)
	char pad_40_1 : 7; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float MaintainedVelocityScale; // 0x44(0x04)
	char pad_48[0x50]; // 0x48(0x50)
	struct USkeletalMeshComponent* MeshComponent; // 0x98(0x08)
	struct TArray<struct UGPPhysicsSimulatableComponent*> PhysicsSimulateComponentArray; // 0xa0(0x10)
	char pad_B0[0x8]; // 0xb0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_VaultSetting
// Size: 0x50 (Inherited: 0x40)
class UAnimNotify_VaultSetting : public UAnimNotify {
public:

	enum class EVaultNotifySettingType Type; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t CurveIndex; // 0x44(0x04)
	bool bIsExtraNode; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	int32_t AllFrameCount; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotify_ClimbLadderSetting
// Size: 0x50 (Inherited: 0x40)
class UAnimNotify_ClimbLadderSetting : public UAnimNotify {
public:

	enum class EClimbLadderNotifySettingType Type; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t CurveIndex; // 0x44(0x04)
	int32_t AllFrameCount; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotifyState_AvoidPenetration
// Size: 0x70 (Inherited: 0x38)
class UAnimNotifyState_AvoidPenetration : public UAnimNotifyState {
public:

	float InitSimulateProb; // 0x38(0x04)
	struct FName SweepStartBoneName; // 0x3c(0x08)
	struct FName SweepEndBoneName; // 0x44(0x08)
	float DetectRadius; // 0x4c(0x04)
	struct FName SimulateRootBoneName; // 0x50(0x08)
	float SimulateTime; // 0x58(0x04)
	float SimulateOpentime; // 0x5c(0x04)
	float SimulateRandomOffsettime; // 0x60(0x04)
	char bEnableRootBodyGravity : 1; // 0x64(0x01)
	char bEnableDebugDraw : 1; // 0x64(0x01)
	char pad_64_2 : 6; // 0x64(0x01)
	char pad_65[0xb]; // 0x65(0x0b)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotifyState_IKBlend
// Size: 0x40 (Inherited: 0x38)
class UAnimNotifyState_IKBlend : public UAnimNotifyState {
public:

	enum class EAnimNotifyStateIKBlend AnimNotifyIKBlendState; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float BlendTime; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotifyState_MoveMeshToTarget
// Size: 0x40 (Inherited: 0x38)
class UAnimNotifyState_MoveMeshToTarget : public UAnimNotifyState {
public:

	struct FName AttachBoneName; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AnimNotifyState_ReloadModifyClip
// Size: 0x48 (Inherited: 0x38)
class UAnimNotifyState_ReloadModifyClip : public UAnimNotifyState {
public:

	struct FName AttachBoneName; // 0x38(0x08)
	struct UModularWeaponDataComponentAppearance* ModularWeaponDataComponent; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AttachableItemInterface
// Size: 0x30 (Inherited: 0x30)
class UAttachableItemInterface : public UInterface {
public:


	void AttachableItem_SetParentItemID(int32_t ParentItemID); // Function GPGameplay.AttachableItemInterface.AttachableItem_SetParentItemID // (Native|Public) // @ game+0x356f770
	void AttachableItem_OnParentDestroyed(); // Function GPGameplay.AttachableItemInterface.AttachableItem_OnParentDestroyed // (Native|Public) // @ game+0xaa2b00
	bool AttachableItem_IsDestroyed(); // Function GPGameplay.AttachableItemInterface.AttachableItem_IsDestroyed // (Native|Public) // @ game+0x1036840
	int32_t AttachableItem_GetParentItemID(); // Function GPGameplay.AttachableItemInterface.AttachableItem_GetParentItemID // (Native|Public) // @ game+0x356f740
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AttackerValueDataManager
// Size: 0x48 (Inherited: 0x38)
class UAttackerValueDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	struct FSoftObjectPath GetKillIconPath(uint64_t AttackerValueId); // Function GPGameplay.AttackerValueDataManager.GetKillIconPath // (Final|Native|Public|HasDefaults) // @ game+0x35741b0
	struct FSoftObjectPath GetDeathDetailIconPath(uint64_t AttackerValueId); // Function GPGameplay.AttackerValueDataManager.GetDeathDetailIconPath // (Final|Native|Public|HasDefaults) // @ game+0x3574110
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponDataAttackerValueManager
// Size: 0x48 (Inherited: 0x38)
class UWeaponDataAttackerValueManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AttackLevelDetailCorrectionManager
// Size: 0x48 (Inherited: 0x38)
class UAttackLevelDetailCorrectionManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	struct FAttackLevelCorrection GetRowByGroupId(int32_t GroupID); // Function GPGameplay.AttackLevelDetailCorrectionManager.GetRowByGroupId // (Final|Native|Public|Const) // @ game+0x3574360
	struct FAttackLevelParamGroup GetRowByDelta(uint64_t GroupID, int32_t AttackLevel, int32_t ArmorLevel); // Function GPGameplay.AttackLevelDetailCorrectionManager.GetRowByDelta // (Final|Native|Public|Const) // @ game+0x3574250
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageExplodeValueManager
// Size: 0x48 (Inherited: 0x38)
class UDamageExplodeValueManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamagePhysicalValueManager
// Size: 0x48 (Inherited: 0x38)
class UDamagePhysicalValueManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageBuffValueManager
// Size: 0x48 (Inherited: 0x38)
class UDamageBuffValueManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.VehicleArmorDamageCorrectionManager
// Size: 0x50 (Inherited: 0x38)
class UVehicleArmorDamageCorrectionManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)
	struct UEnum* EGPVehicleArmorPtr; // 0x48(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.KillInfoWeaponInfoFuzzyMatchManager
// Size: 0x40 (Inherited: 0x38)
class UKillInfoWeaponInfoFuzzyMatchManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	bool IsRowQualifyId(struct FKillInfoWeaponImageRow InRow, struct FFuzzyMatchIdCollection InFuzzyMatchIdCollection); // Function GPGameplay.KillInfoWeaponInfoFuzzyMatchManager.IsRowQualifyId // (Final|Native|Public) // @ game+0x35745f0
	bool GetByFuzzyMatchIdCollection(struct FFuzzyMatchIdCollection InFuzzyMatchIdCollection, struct FText& OutDescName, struct FSoftObjectPath& OutPath, enum class EWeaponItemType& OutWeaponItemType); // Function GPGameplay.KillInfoWeaponInfoFuzzyMatchManager.GetByFuzzyMatchIdCollection // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x3573f00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AttributeDataUtil
// Size: 0x30 (Inherited: 0x30)
class UAttributeDataUtil : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AttributeOperatorEffect
// Size: 0x80 (Inherited: 0x30)
class UAttributeOperatorEffect : public UObject {
public:

	struct TArray<struct FDFMAttributeModEffect> ModEffects; // 0x30(0x10)
	struct UCurveTable* CurveTable; // 0x40(0x08)
	struct FString reason; // 0x48(0x10)
	enum class EAttributeEffectInstanceType InstanceType; // 0x58(0x01)
	enum class EAttributeEffectMainTag MainTag; // 0x59(0x01)
	char pad_5A[0x6]; // 0x5a(0x06)
	struct FGameplayTagContainer TagContainer; // 0x60(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.HeadsetAudioPostProcessTableManager
// Size: 0x50 (Inherited: 0x38)
class UHeadsetAudioPostProcessTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x18]; // 0x38(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AWeaponRagdollActor
// Size: 0x3c0 (Inherited: 0x378)
class AAWeaponRagdollActor : public AActor {
public:

	struct UBoxComponent* BoxCollisionComponent; // 0x378(0x08)
	struct USkeletalMeshComponent* BaseSkeletalMeshComponent; // 0x380(0x08)
	float WeaponRagdollVerticalSpeed; // 0x388(0x04)
	float WeaponRagdollHorizontalSpeed; // 0x38c(0x04)
	struct FVector WeaponRagdollAngularVelocity; // 0x390(0x0c)
	struct FVector WeaponRagdollBoxExtend; // 0x39c(0x0c)
	float LinearDamping; // 0x3a8(0x04)
	float Mass; // 0x3ac(0x04)
	bool UseCustomGravityScale; // 0x3b0(0x01)
	char pad_3B1[0x3]; // 0x3b1(0x03)
	float CustomGravityScale; // 0x3b4(0x04)
	char pad_3B8[0x8]; // 0x3b8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.BaseGameSession
// Size: 0x390 (Inherited: 0x390)
class ABaseGameSession : public AGameSession {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.ConstraintCanvasCache
// Size: 0xa0 (Inherited: 0x38)
class UConstraintCanvasCache : public UWorldSubsystem {
public:

	char pad_38[0x68]; // 0x38(0x68)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.UserWidgetHelperLib
// Size: 0x30 (Inherited: 0x30)
class UUserWidgetHelperLib : public UBlueprintFunctionLibrary {
public:


	void STATIC_SetCanvasSlotPos(struct UObject* Widget, struct FVector2D& ScreenSpacePosition, struct FVector2D AlignPos, struct UObject* WorldContexntObject); // Function GPGameplay.UserWidgetHelperLib.SetCanvasSlotPos // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3574dd0
	void STATIC_RemoveUserWidget(struct UObject* Widget); // Function GPGameplay.UserWidgetHelperLib.RemoveUserWidget // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x3574b30
	struct FVector2D STATIC_GetSpriteSize(struct UObject* Sprite); // Function GPGameplay.UserWidgetHelperLib.GetSpriteSize // (Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3574530
	void STATIC_AddUserWidget(struct UObject* Widget, int32_t ZOrder, int32_t LayerOrder); // Function GPGameplay.UserWidgetHelperLib.AddUserWidget // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x3573d20
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.BipodInterface
// Size: 0x30 (Inherited: 0x30)
class UBipodInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.BowArrow
// Size: 0x3d8 (Inherited: 0x378)
class ABowArrow : public AActor {
public:

	struct FName FireArrowMeshTag; // 0x378(0x08)
	struct FName ProxSensorArrowMeshTag; // 0x380(0x08)
	struct UStaticMeshComponent* FireArrowMeshComponent; // 0x388(0x08)
	struct UStaticMeshComponent* ProxSensorArrowMeshComponent; // 0x390(0x08)
	struct UFXResourceContainerComponent* ArrowFX; // 0x398(0x08)
	struct FName FireArrowFXName; // 0x3a0(0x08)
	struct FName ProxSensorArrowFXName; // 0x3a8(0x08)
	struct FVector FireArrowFXOffset; // 0x3b0(0x0c)
	struct FVector ProxSensorArrowFXOffset; // 0x3bc(0x0c)
	char pad_3C8[0x10]; // 0x3c8(0x10)

	void SetArrowType(bool IsProxSensorArrow); // Function GPGameplay.BowArrow.SetArrowType // (Final|Native|Public) // @ game+0x3574d40
	void SetArrowEffect(bool bActive); // Function GPGameplay.BowArrow.SetArrowEffect // (Final|Native|Public) // @ game+0x3574c20
	void OnChargeStateChange(bool ischarging); // Function GPGameplay.BowArrow.OnChargeStateChange // (Final|Native|Public) // @ game+0x35748c0
	void BP_SetFXRenderMatrixMode(struct UFXResourceContainerComponent* FXResource, enum class ERenderMatrixMode MatrixMode); // Function GPGameplay.BowArrow.BP_SetFXRenderMatrixMode // (Final|Native|Public|BlueprintCallable) // @ game+0x3573e10
	void BP_OnChargeStateChange(bool ischarging); // Function GPGameplay.BowArrow.BP_OnChargeStateChange // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.BowDataComponentArrowAppearance
// Size: 0x638 (Inherited: 0x5f0)
class UBowDataComponentArrowAppearance : public UGPWeaponDataComponentBase {
public:

	int32_t ProxSensorArrowSkillID; // 0x5f0(0x04)
	int32_t FireArrowSkillID; // 0x5f4(0x04)
	struct FName BowChargingHudName; // 0x5f8(0x08)
	struct FName BowControlButtonName; // 0x600(0x08)
	struct FName BowCancelChargingButtonName; // 0x608(0x08)
	struct FName BowArrowMeshSocketName; // 0x610(0x08)
	struct UClass* ArrowActorClass; // 0x618(0x08)
	bool bEnableProne; // 0x620(0x01)
	char pad_621[0x7]; // 0x621(0x07)
	struct ABowArrow* BowArrowMesh; // 0x628(0x08)
	char pad_630[0x8]; // 0x630(0x08)

	void TryInitArrowActor(); // Function GPGameplay.BowDataComponentArrowAppearance.TryInitArrowActor // (Final|Native|Private) // @ game+0x3575240
	bool ShowZoomHUD3P(struct FName HudName, bool bActive); // Function GPGameplay.BowDataComponentArrowAppearance.ShowZoomHUD3P // (Final|Native|Public|BlueprintCallable) // @ game+0x35750c0
	bool ShowZoomHUD(struct FName HudName, bool bActive); // Function GPGameplay.BowDataComponentArrowAppearance.ShowZoomHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x3575180
	void SetWeaponHUDState3P(bool bActive); // Function GPGameplay.BowDataComponentArrowAppearance.SetWeaponHUDState3P // (Final|Native|Public) // @ game+0x3574fa0
	void SetWeaponHUDState(bool bActive); // Function GPGameplay.BowDataComponentArrowAppearance.SetWeaponHUDState // (Final|Native|Public) // @ game+0x3575030
	void SetMask(bool bEnable); // Function GPGameplay.BowDataComponentArrowAppearance.SetMask // (Final|Native|Public) // @ game+0x3574f10
	void SetArrowMeshActive(bool bActive); // Function GPGameplay.BowDataComponentArrowAppearance.SetArrowMeshActive // (Final|Native|Private) // @ game+0x3574cb0
	void SetArrow(struct ABowArrow* ArrowMesh); // Function GPGameplay.BowDataComponentArrowAppearance.SetArrow // (Final|Native|Public|BlueprintCallable) // @ game+0x3574ba0
	void RegisterLiveSpectating(bool doRegister); // Function GPGameplay.BowDataComponentArrowAppearance.RegisterLiveSpectating // (Final|Native|Public) // @ game+0x3574aa0
	void OnLocalPlayerPawnChanged(struct AActor* OldCharacter, struct AActor* NewCharacter); // Function GPGameplay.BowDataComponentArrowAppearance.OnLocalPlayerPawnChanged // (Final|Native|Public) // @ game+0x35749e0
	void OnChargeStateChange(bool ischarging); // Function GPGameplay.BowDataComponentArrowAppearance.OnChargeStateChange // (Final|Native|Public) // @ game+0x3574950
	void OnCancelChargingBtnClicked(); // Function GPGameplay.BowDataComponentArrowAppearance.OnCancelChargingBtnClicked // (Final|Native|Public) // @ game+0x35748a0
	bool IsProxSensorArow(); // Function GPGameplay.BowDataComponentArrowAppearance.IsProxSensorArow // (Final|Native|Public|BlueprintCallable) // @ game+0x35745c0
	bool CheckIsSpectating(); // Function GPGameplay.BowDataComponentArrowAppearance.CheckIsSpectating // (Final|Native|Public) // @ game+0x3573ed0
	void BP_SetBowArrowMeshActive(bool Active, bool NeedEffect); // Function GPGameplay.BowDataComponentArrowAppearance.BP_SetBowArrowMeshActive // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.BowWeaponCacheFireComponent
// Size: 0x178 (Inherited: 0x168)
class UBowWeaponCacheFireComponent : public UGPWeaponFuncComponentBase {
public:

	bool bIsStateChacheEndFire; // 0x168(0x01)
	char pad_169[0x7]; // 0x169(0x07)
	struct UWeaponDataComponentState* ComponentState; // 0x170(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.BreathInfo
// Size: 0x148 (Inherited: 0x30)
class UBreathInfo : public UObject {
public:

	float CurBreathValue; // 0x30(0x04)
	enum class EBreathState BreathState; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float MaxBreathValue; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FHoldBreathConfig HoldBreathConfig; // 0x40(0xb8)
	float LastHoldBreathTime; // 0xf8(0x04)
	bool bHoldBreathEnable; // 0xfc(0x01)
	bool bZooming; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	/*struct FMulticastInlineDelegate*/char BreathValueFullCB[0x10]; // 0x100(0x10)
	/*struct FMulticastInlineDelegate*/char BreathValueEmptyCB[0x10]; // 0x110(0x10)
	/*struct FMulticastInlineDelegate*/char BreathStateChangedCB[0x10]; // 0x120(0x10)
	/*struct FMulticastInlineDelegate*/char BreathNotifyDisable[0x10]; // 0x130(0x10)
	char pad_140[0x8]; // 0x140(0x08)

	void ToggleHoldBreath(); // Function GPGameplay.BreathInfo.ToggleHoldBreath // (Native|Public|BlueprintCallable) // @ game+0x8951b0
	bool CheckCanHoldBreath(); // Function GPGameplay.BreathInfo.CheckCanHoldBreath // (Native|Public|BlueprintCallable) // @ game+0x17617b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CampConfigManager
// Size: 0x98 (Inherited: 0x38)
class UCampConfigManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x58]; // 0x38(0x58)
	struct UDataTable* DataTable; // 0x90(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CampInfoArray
// Size: 0x40 (Inherited: 0x30)
class UCampInfoArray : public UObject {
public:

	struct TArray<struct FCampInfo> Camps; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CharacterAnimSnapshotManager
// Size: 0xa0 (Inherited: 0x38)
class UCharacterAnimSnapshotManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x58]; // 0x38(0x58)
	struct UEnum* BasePoseEnum; // 0x90(0x08)
	struct UEnum* SubPoseEnum; // 0x98(0x08)

	struct FCharacterSnapShotPoseType STATIC_GetCharacterSnapShotPoseType(struct AGPCharacter* InGPCharacter); // Function GPGameplay.CharacterAnimSnapshotManager.GetCharacterSnapShotPoseType // (Final|Native|Static|Public) // @ game+0x3578fd0
	bool GetBoneTransformOnVehicle(uint64_t VehicleId, struct FName SeatName, struct FName BoneName, bool bLeanOut, struct FTransform& OutTransform); // Function GPGameplay.CharacterAnimSnapshotManager.GetBoneTransformOnVehicle // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x3578df0
	bool GetBoneTransformOnSceneWeapon(uint64_t SceneWeaponID, struct FName BoneName, struct FTransform& OutTransform); // Function GPGameplay.CharacterAnimSnapshotManager.GetBoneTransformOnSceneWeapon // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x3578c90
	bool GetBoneTransform(enum class ECharacterSnatshotBasePose Pose, enum class ECharacterSnatshotSubPose Lean, struct FName BoneName, struct FTransform& OutTransform); // Function GPGameplay.CharacterAnimSnapshotManager.GetBoneTransform // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x3578ae0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.ChargeGunDataCompAmmoAppearance
// Size: 0x5f0 (Inherited: 0x5f0)
class UChargeGunDataCompAmmoAppearance : public UGPWeaponDataComponentBase {
public:


	void OnAmmoCountChange(float WeaponAmmoCount, float CarryWeaponAmmoCount); // Function GPGameplay.ChargeGunDataCompAmmoAppearance.OnAmmoCountChange // (Final|Native|Public) // @ game+0x3579260
	struct USkeletalMeshComponent* GetDynamicSkeletalMeshComponent(enum class EAdapterItemType InAdpaterType); // Function GPGameplay.ChargeGunDataCompAmmoAppearance.GetDynamicSkeletalMeshComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x3579050
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CombatRangeFinderProxy
// Size: 0x568 (Inherited: 0x30)
class UCombatRangeFinderProxy : public UObject {
public:

	char pad_30[0x8]; // 0x30(0x08)
	struct UWeaponAdapterItemRangeScope* RangeScope; // 0x38(0x08)
	char pad_40[0x128]; // 0x40(0x128)
	struct UWeaponDataComponentAdapter* DcAdapter; // 0x168(0x08)
	/*struct TScriptInterface<IGPWeaponInterface>*/char WeaponOwner[0x10]; // 0x170(0x10)
	struct UWeaponAimAssistor* FireAimAssistor; // 0x180(0x08)
	struct USkeletalMeshComponent* MeshComp; // 0x188(0x08)
	char pad_190[0x10]; // 0x190(0x10)
	struct UMaterialInstanceDynamic* RangeFinderMaterial; // 0x1a0(0x08)
	struct ARangeFinderDigitalDisplayActor* HipDigitalDisplayActor_Distance; // 0x1a8(0x08)
	struct ARangeFinderDigitalDisplayActor* HipDigitalDisplayActor_PreFalling; // 0x1b0(0x08)
	struct ARangeFinderDigitalDisplayActor* DigitalDisplayActor; // 0x1b8(0x08)
	char pad_1C0[0x40]; // 0x1c0(0x40)
	struct FScoFunctionRow ScoConfig; // 0x200(0x288)
	char pad_488[0x18]; // 0x488(0x18)
	struct TArray<struct AActor*> TraceIgnoreActors; // 0x4a0(0x10)
	struct TArray<struct UPrimitiveComponent*> TraceIgnoreComps; // 0x4b0(0x10)
	struct TArray<struct FHitResult> TraceOverlapResults; // 0x4c0(0x10)
	char pad_4D0[0x98]; // 0x4d0(0x98)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CommercializationSubsystem
// Size: 0x88 (Inherited: 0x38)
class UCommercializationSubsystem : public UWorldSubsystem {
public:

	int32_t SortOrder; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct UObject*> PersistentAssetArray; // 0x40(0x10)
	struct TArray<struct UObject*> TemporaryAssetArray; // 0x50(0x10)
	struct TArray<struct UObject*> WatchAssetArray; // 0x60(0x10)
	char pad_70[0x18]; // 0x70(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CompositedBipod
// Size: 0x598 (Inherited: 0x30)
class UCompositedBipod : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	float TickCheckBipodDeployTime; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FPartBipodConfig BipodConfig; // 0x48(0x228)
	struct UWeaponAdapterItemBase* DCAdapterItem; // 0x270(0x08)
	struct UWeaponDataComponentAdapter* DcAdapter; // 0x278(0x08)
	char pad_280[0x120]; // 0x280(0x120)
	/*struct TScriptInterface<IGPWeaponInterface>*/char WeaponOwner[0x10]; // 0x3a0(0x10)
	char pad_3B0[0x18]; // 0x3b0(0x18)
	struct UGPWeaponPartBipodAnimInstance* AnimInstance; // 0x3c8(0x08)
	struct TWeakObjectPtr<struct AGPCharacter> CacheCharacter; // 0x3d0(0x08)
	struct TWeakObjectPtr<struct UGPAnimProxyComponent> CacheCharacterAnimProxy; // 0x3d8(0x08)
	struct TArray<struct UObject*> AssetCache; // 0x3e0(0x10)
	char pad_3F0[0x160]; // 0x3f0(0x160)
	struct FTimerHandle DelaycloseTickHandle; // 0x550(0x08)
	char pad_558[0x30]; // 0x558(0x30)
	struct UBlendSpaceBase* BlendSpace; // 0x588(0x08)
	char pad_590[0x8]; // 0x590(0x08)

	void TickCheckWeaponBipodDeploy(float DeltaTime); // Function GPGameplay.CompositedBipod.TickCheckWeaponBipodDeploy // (Final|Native|Public) // @ game+0x3579ac0
	void ShowBipTip(bool isShow, bool bForceChange); // Function GPGameplay.CompositedBipod.ShowBipTip // (Final|Native|Protected) // @ game+0x35798b0
	void OnMeshLoaded(uint64_t Guid); // Function GPGameplay.CompositedBipod.OnMeshLoaded // (Final|Native|Protected) // @ game+0x3579630
	void OnDelayCloseTick(); // Function GPGameplay.CompositedBipod.OnDelayCloseTick // (Final|Native|Protected) // @ game+0x3579610
	void OnBoolPropertyChanged(char PropertyType); // Function GPGameplay.CompositedBipod.OnBoolPropertyChanged // (Final|Native|Protected) // @ game+0x3579590
	void OnAssetLoad(struct TArray<struct FSoftObjectPath> AssetRef); // Function GPGameplay.CompositedBipod.OnAssetLoad // (Final|Native|Protected) // @ game+0x3579400
	void OnAnimLoadComplete(struct FSoftObjectPath& AssetPath); // Function GPGameplay.CompositedBipod.OnAnimLoadComplete // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x3579320
	bool IsTraceResultSucceed(); // Function GPGameplay.CompositedBipod.IsTraceResultSucceed // (Final|Native|Public) // @ game+0x3579230
	void DelayApplyDynamicAttribute(); // Function GPGameplay.CompositedBipod.DelayApplyDynamicAttribute // (Final|Native|Public) // @ game+0x3578a20
	void CheckCanWeaponBipodDeployByBox(float DeltaTime); // Function GPGameplay.CompositedBipod.CheckCanWeaponBipodDeployByBox // (Final|Native|Public) // @ game+0x3578980
	void CheckCanWeaponBipodDeploy(); // Function GPGameplay.CompositedBipod.CheckCanWeaponBipodDeploy // (Final|Native|Public) // @ game+0x3578960
	bool CanPlayCharacterAnim(); // Function GPGameplay.CompositedBipod.CanPlayCharacterAnim // (Final|Native|Protected) // @ game+0x35788d0
	void ApplyDynamicAttribute(bool Apply); // Function GPGameplay.CompositedBipod.ApplyDynamicAttribute // (Final|Native|Public) // @ game+0x3578840
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CompositedFlashLight
// Size: 0x440 (Inherited: 0x30)
class UCompositedFlashLight : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	float NomralFlashLightTraceInterval; // 0x40(0x04)
	enum class ECollisionChannel NomralFlashLight_TraceChannel; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float PowerFlashLightTraceInterval; // 0x48(0x04)
	enum class ECollisionChannel PowerFlashLight_TraceChannel; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	struct UWeaponAdapterItemBase* DCAdapterItem; // 0x50(0x08)
	struct UWeaponDataComponentAdapter* DcAdapter; // 0x58(0x08)
	char pad_60[0x210]; // 0x60(0x210)
	/*struct TScriptInterface<IGPWeaponInterface>*/char WeaponOwner[0x10]; // 0x270(0x10)
	char pad_280[0x70]; // 0x280(0x70)
	struct UTextureLightProfile* FlashLightIESTexture; // 0x2f0(0x08)
	struct USpotLightComponent* LightSpotComp; // 0x2f8(0x08)
	struct UMaterialInstanceDynamic* LFM_CullLight; // 0x300(0x08)
	struct UStaticMeshComponent* LightBeamPlane; // 0x308(0x08)
	struct UMaterialInstanceDynamic* Mat_NormalFlashLight; // 0x310(0x08)
	struct AActor* PowerFlashActor; // 0x318(0x08)
	struct UArrowComponent* ArrowComp; // 0x320(0x08)
	struct USpotLightComponent* PowerFlashLightSpot; // 0x328(0x08)
	struct UMaterialInstanceDynamic* Mat_LansFlare; // 0x330(0x08)
	struct UTextureLightProfile* PowerFlashIESTexture; // 0x338(0x08)
	char pad_340[0xd0]; // 0x340(0xd0)
	struct TArray<struct AActor*> TraceIgnoreActors; // 0x410(0x10)
	struct TArray<struct UPrimitiveComponent*> TraceIgnoreComps; // 0x420(0x10)
	struct TArray<struct FHitResult> TraceOverlapResults; // 0x430(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CompositedLaser
// Size: 0x510 (Inherited: 0x30)
class UCompositedLaser : public UObject {
public:

	char pad_30[0x20]; // 0x30(0x20)
	struct FVector LaserFlare_DefScale; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UStaticMeshComponent* LaserFlare_SMC; // 0x60(0x08)
	struct UWeaponAdapterItemBase* DCAdapterItem; // 0x68(0x08)
	struct UWeaponDataComponentAdapter* DcAdapter; // 0x70(0x08)
	/*struct TScriptInterface<IGPWeaponInterface>*/char WeaponOwner[0x10]; // 0x78(0x10)
	char pad_88[0x278]; // 0x88(0x278)
	struct FLaserItemFx LaserItemFx; // 0x300(0x58)
	struct FLaserItemMesh LaserItemMesh; // 0x358(0x50)
	char pad_3A8[0x128]; // 0x3a8(0x128)
	struct TArray<struct AActor*> TraceIgnoreActors; // 0x4d0(0x10)
	struct TArray<struct UPrimitiveComponent*> TraceIgnoreComps; // 0x4e0(0x10)
	struct TArray<struct FHitResult> TraceOverlapResults; // 0x4f0(0x10)
	char pad_500[0x10]; // 0x500(0x10)

	void OnMeshLoaded(uint64_t Guid); // Function GPGameplay.CompositedLaser.OnMeshLoaded // (Final|Native|Public) // @ game+0x357f350
	void OnLaserFlareMeshLoaded(struct FSoftObjectPath& ObjectPath); // Function GPGameplay.CompositedLaser.OnLaserFlareMeshLoaded // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x357f270
	void OnLaserFlareMatLoaded(struct FSoftObjectPath& ObjectPath); // Function GPGameplay.CompositedLaser.OnLaserFlareMatLoaded // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x357f190
	void EnableLaserFlare(bool bEnable); // Function GPGameplay.CompositedLaser.EnableLaserFlare // (Final|Native|Protected) // @ game+0x357ee40
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponLaser_Haavk
// Size: 0x3a8 (Inherited: 0x100)
class UWeaponLaser_Haavk : public UActorComponent {
public:

	struct UFXResourceContainerComponent* LineFXComp; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)
	struct UFXResourceContainerComponent* PointFXComp; // 0x110(0x08)
	char pad_118[0x8]; // 0x118(0x08)
	struct UFXResourceContainerComponent* MossFXComp; // 0x120(0x08)
	char pad_128[0x8]; // 0x128(0x08)
	struct UFXResourceContainerComponent* DamageFXComp; // 0x130(0x08)
	char pad_138[0x8]; // 0x138(0x08)
	struct UFXResourceContainerComponent* DestoryFXComp; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)
	struct TArray<struct AActor*> TraceIgnoreActors; // 0x150(0x10)
	struct TArray<struct UPrimitiveComponent*> TraceIgnoreComps; // 0x160(0x10)
	struct TArray<struct FHitResult> TraceOverlapResults; // 0x170(0x10)
	float LaserPointOffset; // 0x180(0x04)
	char pad_184[0x8c]; // 0x184(0x8c)
	float BaseEyeHeight; // 0x210(0x04)
	enum class EHaavkTurnType TurnType; // 0x214(0x01)
	bool bIsClockwise; // 0x215(0x01)
	char pad_216[0x2]; // 0x216(0x02)
	float LaunchTime; // 0x218(0x04)
	float DelayTime_Fire; // 0x21c(0x04)
	struct FName MossResourceId; // 0x220(0x08)
	struct FName MossResourceId_AttackMode; // 0x228(0x08)
	struct FName LaserLineId; // 0x230(0x08)
	struct FName DamageResourceId; // 0x238(0x08)
	struct FName DestoryResourceId; // 0x240(0x08)
	struct UGPAudioEventAsset* LaunchAudio; // 0x248(0x08)
	struct UGPAudioEventAsset* FirstLaserAudio; // 0x250(0x08)
	struct UGPAudioEventAsset* DestoryAudio; // 0x258(0x08)
	struct UGPAudioEventAsset* TurnAudio; // 0x260(0x08)
	struct UGPAudioEventAsset* StopTrunAudio; // 0x268(0x08)
	struct UGPAudioEventAsset* AimAudio; // 0x270(0x08)
	struct UGPAudioEventAsset* StopAimAudio; // 0x278(0x08)
	struct UAnimSequenceBase* LaunchAnim; // 0x280(0x08)
	bool bIsAttackMode; // 0x288(0x01)
	bool bChangeDamageSkeletal; // 0x289(0x01)
	bool bFirstAim; // 0x28a(0x01)
	char pad_28B[0x1]; // 0x28b(0x01)
	float FirstAim_DelayTime; // 0x28c(0x04)
	bool bIsLaunch; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float AOAimingPitch; // 0x294(0x04)
	float AOAimingYaw; // 0x298(0x04)
	char pad_29C[0x10c]; // 0x29c(0x10c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageGlobalConfig
// Size: 0x48 (Inherited: 0x40)
class UDamageGlobalConfig : public UDeveloperSettings {
public:

	float MaxBodyArmorReduceRate; // 0x40(0x04)
	float MaxHelmentReduceRate; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageMakerInterface
// Size: 0x30 (Inherited: 0x30)
class UDamageMakerInterface : public UInterface {
public:


	void SetSourceVehicleId(int32_t InSourceVehicleId); // Function GPGameplay.DamageMakerInterface.SetSourceVehicleId // (Native|Public) // @ game+0x357f640
	void PostDamageMakerApplyDamage(bool& bIsServer, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageMakerInterface.PostDamageMakerApplyDamage // (Native|Public|HasOutParms) // @ game+0x357f520
	void OnProcessBulletPointHitAction(struct FRequestPointHitActionParam& RequestPointHitParam); // Function GPGameplay.DamageMakerInterface.OnProcessBulletPointHitAction // (Native|Public|HasOutParms) // @ game+0x357f3d0
	void OnBulletPointHitActionFaild(struct FPointHitActionResult& HitActionFaild); // Function GPGameplay.DamageMakerInterface.OnBulletPointHitActionFaild // (Native|Public|HasOutParms) // @ game+0x357f100
	enum class EWeaponItemType GetWeaponItemType(struct UObject* ActorObject); // Function GPGameplay.DamageMakerInterface.GetWeaponItemType // (Native|Public) // @ game+0x357efd0
	uint64_t GetUin(); // Function GPGameplay.DamageMakerInterface.GetUin // (Native|Public|Const) // @ game+0x357efa0
	int32_t GetSourceVehicleId(); // Function GPGameplay.DamageMakerInterface.GetSourceVehicleId // (Native|Public) // @ game+0x357ef70
	enum class EDamageActorType GetActorType(struct UObject* ActorObject); // Function GPGameplay.DamageMakerInterface.GetActorType // (Native|Public) // @ game+0x357eed0
	bool DamageMakerShouldIgnoreDamage(struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageMakerInterface.DamageMakerShouldIgnoreDamage // (Native|Public|HasOutParms) // @ game+0x357ecb0
	void DamageMakerModifyDamage(struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageMakerInterface.DamageMakerModifyDamage // (Native|Public|HasOutParms) // @ game+0x357eb20
	uint64_t DamageMakerGetId(); // Function GPGameplay.DamageMakerInterface.DamageMakerGetId // (Native|Public) // @ game+0x174a650
	uint64_t DamageMakerGetGId(); // Function GPGameplay.DamageMakerInterface.DamageMakerGetGId // (Native|Public) // @ game+0x174a500
	void DamageMakerClientPreview(struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageMakerInterface.DamageMakerClientPreview // (Native|Public|HasOutParms) // @ game+0x357ea50
	void DamageMakerApplyDamage(bool& bIsServer, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageMakerInterface.DamageMakerApplyDamage // (Native|Public|HasOutParms) // @ game+0x357e930
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageStateRecordMgr
// Size: 0x4b8 (Inherited: 0x378)
class ADamageStateRecordMgr : public ALevelSubsystem {
public:

	char pad_378[0xf0]; // 0x378(0xf0)
	struct TMap<enum class EDamageStateRecordType, struct UDamageStateRecorder*> Recorders; // 0x468(0x50)

	struct UDamageStateRecorder* NewRecorder(enum class EDamageStateRecordType InArg); // Function GPGameplay.DamageStateRecordMgr.NewRecorder // (Final|Native|Protected) // @ game+0x357f070
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageSystemImpl
// Size: 0xb0 (Inherited: 0x38)
class UDamageSystemImpl : public UWorldSubsystem {
public:

	char pad_38[0x8]; // 0x38(0x08)
	/*struct FMulticastInlineDelegate*/char OnPostMakeDamageDelegate[0x10]; // 0x40(0x10)
	/*struct FMulticastInlineDelegate*/char OnBeforeMakeDamageDelegate[0x10]; // 0x50(0x10)
	/*struct FMulticastInlineDelegate*/char OnRecvPointHitFaildDelegate[0x10]; // 0x60(0x10)
	/*struct FMulticastInlineDelegate*/char OnPostMakeRadialDamageDelegate[0x10]; // 0x70(0x10)
	char pad_80[0x8]; // 0x80(0x08)
	struct UGPGameDamageRecord* DamageRecord; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
	struct TArray<struct FPointHitActionResult> PointHitActionFaildResults; // 0x98(0x10)
	int32_t RequestFireHitCnt; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)

	void MakeRadialDamageBuffBP(/*struct TScriptInterface<IDamageMakerInterface> DamageMaker, struct AActor* MakerInstigator, struct FHitResult& HitResult, int64_t& AttakerValueId, struct TArray<struct AActor*>& IgnoreActors, int32_t& HitId, struct FMakeDamageParams& Params, int32_t BuffId*/); // Function GPGameplay.DamageSystemImpl.MakeRadialDamageBuffBP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3585450
	void MakeRadialDamageBP(/*struct TScriptInterface<IDamageMakerInterface> DamageMaker, struct AActor* MakerInstigator, struct FHitResult& HitResult, int64_t& AttakerValueId, struct TArray<struct AActor*>& IgnoreActors, int32_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemImpl.MakeRadialDamageBP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35850c0
	void MakePointDamageBPSimple(/*struct TScriptInterface<IDamageMakerInterface> DamageMaker, struct AActor* MakerInstigator, struct AActor* DamageTaker, struct FHitResult& HitResult, int64_t& AttakerValueId, int32_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemImpl.MakePointDamageBPSimple // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35849f0
	void MakePointDamageBP(/*struct TScriptInterface<IDamageMakerInterface> DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface>& DamageTaker, struct FHitResult& HitResult, int64_t& AttakerValueId, int32_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemImpl.MakePointDamageBP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35846a0
	void MakePhysicalDamageBP2(/*struct TScriptInterface<IDamageMakerInterface> DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface> DamageTaker, struct FHitResult& HitResult, int64_t& AttakerValueId, int32_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemImpl.MakePhysicalDamageBP2 // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3583b80
	void MakePhysicalDamageBP(/*struct TScriptInterface<IDamageMakerInterface> DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface>& DamageTaker, struct FHitResult& HitResult, int64_t& AttakerValueId, int32_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemImpl.MakePhysicalDamageBP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3583ee0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageSystemInterface
// Size: 0x30 (Inherited: 0x30)
class UDamageSystemInterface : public UInterface {
public:


	void Shutdown(struct UWorld* World); // Function GPGameplay.DamageSystemInterface.Shutdown // (Native|Public) // @ game+0x89f700
	void ShouldIgnoreDamageTrace(/*struct FHitResult& HitResult, struct TScriptInterface<IDamageMakerInterface> Maker, bool& bOutShouldIgnoreComponent, bool& bOutShouldIgnoreActor*/); // Function GPGameplay.DamageSystemInterface.ShouldIgnoreDamageTrace // (Native|Public|HasOutParms) // @ game+0x3586340
	void Reset(struct UWorld* World); // Function GPGameplay.DamageSystemInterface.Reset // (Native|Public) // @ game+0x89f670
	void RequestPointHitAction(struct FRequestPointHitActionParam& HitActionParam); // Function GPGameplay.DamageSystemInterface.RequestPointHitAction // (Native|Public|HasOutParms) // @ game+0x3585fe0
	void OnServerReceiveMakeDamageRequest(struct AActor* ChannelActor, struct TArray<struct FDamageResultInfo>& DamageResults); // Function GPGameplay.DamageSystemInterface.OnServerReceiveMakeDamageRequest // (Native|Public|HasOutParms) // @ game+0x3585d90
	void OnServerReceiveHitActionRequest(struct AActor* ChannelActor, struct FRequestPointHitActionParam RequsetHitActionParam); // Function GPGameplay.DamageSystemInterface.OnServerReceiveHitActionRequest // (Native|Public) // @ game+0x3585bf0
	void OnClientReceiveApplyDamageRequest(struct AActor* ChannelActor, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageSystemInterface.OnClientReceiveApplyDamageRequest // (Native|Public|HasOutParms) // @ game+0x3585ae0
	void OnClientNotifyFaildHitAction(struct AActor* ChannelActor, struct AActor* DamageMakerActor, struct FPointHitActionResult S2CRequestPointHitActionFaild); // Function GPGameplay.DamageSystemInterface.OnClientNotifyFaildHitAction // (Native|Public) // @ game+0x35859c0
	void OnClientNotifyApplyHitAction(struct AActor* ChannelActor, struct FRequestPointHitActionParam RequsetHitActionParam); // Function GPGameplay.DamageSystemInterface.OnClientNotifyApplyHitAction // (Native|Public) // @ game+0x3585820
	void MakeRadialDamage(/*struct TScriptInterface<IDamageMakerInterface>& DamageMaker, struct AActor* MakerInstigator, struct FHitResult& HitResult, uint64_t& AttakerValueId, struct TArray<struct AActor*>& IgnoreActors, uint16_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemInterface.MakeRadialDamage // (Native|Public|HasOutParms) // @ game+0x3584d30
	struct FDamageResultInfo MakePointDamage(/*struct TScriptInterface<IDamageMakerInterface>& DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface>& DamageTaker, struct FHitResult& HitResult, uint64_t& AttakerValueId, uint64_t& HitId, struct FMakeDamageParams& Params, struct FRequestPointHitActionParam& HitActionParam*/); // Function GPGameplay.DamageSystemInterface.MakePointDamage // (Native|Public|HasOutParms) // @ game+0x3584230
	void MakePhysicalDamage(/*struct TScriptInterface<IDamageMakerInterface>& DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface>& DamageTaker, struct FHitResult& HitResult, uint64_t& AttakerValueId, uint16_t& HitId, struct FMakeDamageParams& Params*/); // Function GPGameplay.DamageSystemInterface.MakePhysicalDamage // (Native|Public|HasOutParms) // @ game+0x3583820
	void MakeCustomPhyscialDamage(/*struct TScriptInterface<IDamageMakerInterface>& DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface>& DamageTaker, struct FDamageResultInfo DamageResultInfo*/); // Function GPGameplay.DamageSystemInterface.MakeCustomPhyscialDamage // (Native|Public|HasOutParms) // @ game+0x3583650
	void MakeBuffDamage(/*struct TScriptInterface<IDamageMakerInterface>& DamageMaker, struct AActor* MakerInstigator, struct TScriptInterface<IDamageTakerInterface>& DamageTaker, uint64_t& AttakerValueId, struct FMakeBuffDamageParams& Params*/); // Function GPGameplay.DamageSystemInterface.MakeBuffDamage // (Native|Public|HasOutParms) // @ game+0x3583430
	bool IsDebug(); // Function GPGameplay.DamageSystemInterface.IsDebug // (Native|Public) // @ game+0x1749dd0
	void Init(struct UWorld* World); // Function GPGameplay.DamageSystemInterface.Init // (Native|Public) // @ game+0x89f540
	void GetPostMakeRadialDamageDelegate(); // Function GPGameplay.DamageSystemInterface.GetPostMakeRadialDamageDelegate // (Native|Public) // @ game+0x3583000
	void GetPostMakeDamageDelegate(); // Function GPGameplay.DamageSystemInterface.GetPostMakeDamageDelegate // (Native|Public) // @ game+0x3582fc0
	void GetBeforeMakeDamageDelegate(); // Function GPGameplay.DamageSystemInterface.GetBeforeMakeDamageDelegate // (Native|Public) // @ game+0x89f500
	bool CaculateDamage(struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageSystemInterface.CaculateDamage // (Native|Public|HasOutParms) // @ game+0x3582700
	void ApplyRadialDamageBlockRate(struct FDamageSourceInfo& SourceInfo, bool& bBlock, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageSystemInterface.ApplyRadialDamageBlockRate // (Native|Public|HasOutParms) // @ game+0x3582510
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageSystemUtil
// Size: 0x30 (Inherited: 0x30)
class UDamageSystemUtil : public UObject {
public:


	bool STATIC_IsWeaponDamage(struct FDamageSourceInfo& SourceInfo); // Function GPGameplay.DamageSystemUtil.IsWeaponDamage // (Final|Native|Static|Private|HasOutParms|BlueprintCallable) // @ game+0x3583330
	enum class EWeaponItemType STATIC_GetWeaponType(struct FDamageSourceInfo& SourceInfo); // Function GPGameplay.DamageSystemUtil.GetWeaponType // (Final|Native|Static|Private|HasOutParms|BlueprintCallable) // @ game+0x3583190
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageTakerInterface
// Size: 0x30 (Inherited: 0x30)
class UDamageTakerInterface : public UInterface {
public:


	bool ShouldIgnoreDamage(enum class EDamageGameState DamageGameState); // Function GPGameplay.DamageTakerInterface.ShouldIgnoreDamage // (Native|Public) // @ game+0x35862b0
	void SelectFirstHitResultsForExplodeDamage(struct TArray<struct FHitResult>& InHitResults, struct FHitResult& OutHitResult); // Function GPGameplay.DamageTakerInterface.SelectFirstHitResultsForExplodeDamage // (Native|Public|HasOutParms) // @ game+0x3586130
	void OnDamageTakerApplyDamageBP(bool bIsServer, struct FDamageResultInfo DamageResult); // Function GPGameplay.DamageTakerInterface.OnDamageTakerApplyDamageBP // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	bool IsDamageableComponent(struct UPrimitiveComponent* Component); // Function GPGameplay.DamageTakerInterface.IsDamageableComponent // (Native|Public) // @ game+0x3583290
	bool IgnoreDamageOnPrematch(); // Function GPGameplay.DamageTakerInterface.IgnoreDamageOnPrematch // (Native|Public) // @ game+0x174a970
	uint64_t GetUin(); // Function GPGameplay.DamageTakerInterface.GetUin // (Native|Public|Const) // @ game+0x3583160
	void GetRadialDamageSamplePoint(struct TArray<struct FRadialSamplePoint>& OutSamplePoint, enum class EDamageExplodeBlockCheckType ExplodeBlockCheckType); // Function GPGameplay.DamageTakerInterface.GetRadialDamageSamplePoint // (Native|Public|HasOutParms) // @ game+0x3583040
	char GetLivingStatus(); // Function GPGameplay.DamageTakerInterface.GetLivingStatus // (Native|Public) // @ game+0x1755340
	float GetDamageTakerInterestExtend(); // Function GPGameplay.DamageTakerInterface.GetDamageTakerInterestExtend // (Native|Public) // @ game+0x1755080
	void GetComponentsRadialDamageSamplePoint(struct UPrimitiveComponent* Component, int32_t BodyIndex, struct TArray<struct FRadialSamplePoint>& OutSamplePoint); // Function GPGameplay.DamageTakerInterface.GetComponentsRadialDamageSamplePoint // (Native|Public|HasOutParms) // @ game+0x3582e70
	enum class EDamageActorType GetActorType(struct UObject* ActorObject); // Function GPGameplay.DamageTakerInterface.GetActorType // (Native|Public) // @ game+0x357eed0
	bool DamageTakerShouldIgnoreDamage(struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageTakerInterface.DamageTakerShouldIgnoreDamage // (Native|Public|HasOutParms) // @ game+0x3582ce0
	void DamageTakerModifyDamage(struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageTakerInterface.DamageTakerModifyDamage // (Native|Public|HasOutParms) // @ game+0x3582b50
	void DamageTakerClientPreview(struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageTakerInterface.DamageTakerClientPreview // (Native|Public|HasOutParms) // @ game+0x3582a80
	void DamageTakerApplyDamageEffect(bool& bIsServer, struct FDamageResultInfo& DamageResult); // Function GPGameplay.DamageTakerInterface.DamageTakerApplyDamageEffect // (Native|Public|HasOutParms) // @ game+0x3582960
	void BeforeDamageTakerApplyDamageEffect(bool& bIsServer, struct FDamageResultInfo& InOutDamageResult); // Function GPGameplay.DamageTakerInterface.BeforeDamageTakerApplyDamageEffect // (Native|Public|HasOutParms) // @ game+0x357f520
	void AfterDamageTakerApplyDamageEffect(bool& bIsServer, struct FDamageResultInfo& InOutDamageResult); // Function GPGameplay.DamageTakerInterface.AfterDamageTakerApplyDamageEffect // (Native|Public|HasOutParms) // @ game+0x35823f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageVaildateDataComponent
// Size: 0x128 (Inherited: 0x100)
class UDamageVaildateDataComponent : public UActorComponent {
public:

	int32_t MaxCachePosition; // 0x100(0x04)
	char pad_104[0x14]; // 0x104(0x14)
	struct AGPCharacter* CHARACTER; // 0x118(0x08)
	char pad_120[0x8]; // 0x120(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateDebugActor
// Size: 0x378 (Inherited: 0x378)
class ADamageValidateDebugActor : public AActor {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateDebugComponent
// Size: 0x100 (Inherited: 0x100)
class UDamageValidateDebugComponent : public UActorComponent {
public:


	void ClientDebugLagRpc(float ClientServerTime, struct AActor* CHARACTER); // Function GPGameplay.DamageValidateDebugComponent.ClientDebugLagRpc // (Net|Native|Event|Public|NetServer) // @ game+0x3582890
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateDebugToolView
// Size: 0x3a0 (Inherited: 0x388)
class UDamageValidateDebugToolView : public UBaseUIView {
public:

	struct UComboBoxString* DebugActorCmd; // 0x388(0x08)
	struct UEditableTextBox* DebugActorTime; // 0x390(0x08)
	struct UButton* ProcessDebugButton; // 0x398(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateSystemDataTableManager
// Size: 0x98 (Inherited: 0x38)
class UDamageValidateSystemDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x60]; // 0x38(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateChararcterBoxDataTableManager
// Size: 0x40 (Inherited: 0x38)
class UDamageValidateChararcterBoxDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateSystemImpl
// Size: 0x1f8 (Inherited: 0x38)
class UDamageValidateSystemImpl : public UWorldSubsystem {
public:

	char pad_38[0x110]; // 0x38(0x110)
	struct TMap<uint64_t, struct FPlayerDamageValidateStat> PlayerDamageValidateStats; // 0x148(0x50)
	struct TMap<uint64_t, struct FDamageValidateStat> DamageValidateStats; // 0x198(0x50)
	struct TArray<struct UClass*> RuleClasses; // 0x1e8(0x10)

	void OnRuleClassLoaded(struct FSoftObjectPath& SoftObjectPath); // Function GPGameplay.DamageValidateSystemImpl.OnRuleClassLoaded // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x358d6d0
	void OnActorSpawnedCallback(struct AActor* SpawnedActor); // Function GPGameplay.DamageValidateSystemImpl.OnActorSpawnedCallback // (Final|Native|Public) // @ game+0x358d5d0
	void CollectStatInfo(uint64_t RuleId, enum class EDamageValidateResult Result); // Function GPGameplay.DamageValidateSystemImpl.CollectStatInfo // (Final|Native|Protected) // @ game+0x358c680
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DamageValidateSystemInterface
// Size: 0x30 (Inherited: 0x30)
class UDamageValidateSystemInterface : public UInterface {
public:


	struct FPointHitActionResult ValidateHitAction(enum class EDamageValidateType ValidateType, struct FRequestPointHitActionParam& RequestParam, struct AActor* ChannelActor); // Function GPGameplay.DamageValidateSystemInterface.ValidateHitAction // (Native|Public|HasOutParms) // @ game+0x358db50
	void Shutdown(struct UWorld* World); // Function GPGameplay.DamageValidateSystemInterface.Shutdown // (Native|Public) // @ game+0x89f700
	void SetEnable(bool bEnable); // Function GPGameplay.DamageValidateSystemInterface.SetEnable // (Native|Public) // @ game+0x358d9a0
	void SetDebug(bool bDebug); // Function GPGameplay.DamageValidateSystemInterface.SetDebug // (Native|Public) // @ game+0x358d910
	void Reset(struct UWorld* World); // Function GPGameplay.DamageValidateSystemInterface.Reset // (Native|Public) // @ game+0x89f670
	bool IsEnable(); // Function GPGameplay.DamageValidateSystemInterface.IsEnable // (Native|Public) // @ game+0x174e640
	bool IsDebug(); // Function GPGameplay.DamageValidateSystemInterface.IsDebug // (Native|Public) // @ game+0x92e3d0
	void Init(struct UWorld* World); // Function GPGameplay.DamageValidateSystemInterface.Init // (Native|Public) // @ game+0x89f540
	struct ADamageStateRecordMgr* GetDamageStateRecordMgr(); // Function GPGameplay.DamageValidateSystemInterface.GetDamageStateRecordMgr // (Native|Public) // @ game+0x358d360
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DataTableConstrainManager
// Size: 0x40 (Inherited: 0x38)
class UDataTableConstrainManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x8]; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DataTableChecker
// Size: 0x30 (Inherited: 0x30)
class UDataTableChecker : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DFLensFlareComponent
// Size: 0x5e0 (Inherited: 0x560)
class UDFLensFlareComponent : public UPrimitiveComponent {
public:

	bool EnableEffect; // 0x560(0x01)
	bool IsDirectionalLight_C; // 0x561(0x01)
	bool IsAdjustParametersInEditor; // 0x562(0x01)
	char pad_563[0x1]; // 0x563(0x01)
	float Intensity_C; // 0x564(0x04)
	struct UTexture2D* HaloTexture_C; // 0x568(0x08)
	float CircleStart_C; // 0x570(0x04)
	float CircleStartFeather_C; // 0x574(0x04)
	float CircleWidth_C; // 0x578(0x04)
	float CircleEndFeather_C; // 0x57c(0x04)
	float CircleOffSet_C; // 0x580(0x04)
	float Scale_C; // 0x584(0x04)
	struct UMaterialInterface* MI_LensFlare_C; // 0x588(0x08)
	struct UArrowComponent* LF_Arrow_C; // 0x590(0x08)
	float SizeScale_C; // 0x598(0x04)
	float DotCompareValue_C; // 0x59c(0x04)
	float HaloVisiableDistance_C; // 0x5a0(0x04)
	char pad_5A4[0x24]; // 0x5a4(0x24)
	struct UMaterialInstanceDynamic* MILensFlareHalo_C; // 0x5c8(0x08)
	char pad_5D0[0x10]; // 0x5d0(0x10)

	void UpdateLensFlareParam(); // Function GPGameplay.DFLensFlareComponent.UpdateLensFlareParam // (Final|Native|Public) // @ game+0x358dab0
	void TickLensFlare(float DeltaTime); // Function GPGameplay.DFLensFlareComponent.TickLensFlare // (Final|Native|Public) // @ game+0x358da30
	bool IsInScreen_C(float X, float Y); // Function GPGameplay.DFLensFlareComponent.IsInScreen_C // (Final|Native|Public) // @ game+0x358d500
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DFReplayNetConnection
// Size: 0x1f40 (Inherited: 0x1df0)
class UDFReplayNetConnection : public UDemoNetConnection {
public:

	char pad_1DF0[0x150]; // 0x1df0(0x150)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DFReplayNetDriver
// Size: 0x1158 (Inherited: 0x1118)
class UDFReplayNetDriver : public UDemoNetDriver {
public:

	char pad_1118[0x40]; // 0x1118(0x40)

	void UpdateLoadingInProtocolReplay(int32_t Percentage); // Function GPGameplay.DFReplayNetDriver.UpdateLoadingInProtocolReplay // (Final|Native|Protected) // @ game+0x358dad0
	void OnReplayStarted(struct UDemoNetDriver* ReplayDriver); // Function GPGameplay.DFReplayNetDriver.OnReplayStarted // (Final|Native|Protected) // @ game+0x358d650
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DrawHelperSystem
// Size: 0x388 (Inherited: 0x378)
class ADrawHelperSystem : public ALevelSubsystem {
public:

	struct TArray<struct UActorComponent*> DebugLineBatchers; // 0x378(0x10)

	struct ADrawHelperSystem* STATIC_GetDrawHelper(struct UObject* WorldContext); // Function GPGameplay.DrawHelperSystem.GetDrawHelper // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x358d390
	void FlushAll(); // Function GPGameplay.DrawHelperSystem.FlushAll // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0xbcb880
	void Flush(int32_t Group); // Function GPGameplay.DrawHelperSystem.Flush // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x358d2d0
	void DrawString(struct FVector TextLocation, struct FString Text, struct FColor Color, float Duration); // Function GPGameplay.DrawHelperSystem.DrawString // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x358d150
	void DrawPoint(struct FVector Position, struct FLinearColor Color, float PointSize, char DepthPriority, float LifeTime, int32_t Group); // Function GPGameplay.DrawHelperSystem.DrawPoint // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x358cf60
	void DrawMesh(struct TArray<struct FVector> Verts, struct TArray<int32_t> Indices, struct FColor Color, char DepthPriority, float LifeTime, int32_t Group); // Function GPGameplay.DrawHelperSystem.DrawMesh // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x358cd30
	void DrawLine(struct FVector Start, struct FVector End, struct FLinearColor Color, char DepthPriority, float Thickness, float LifeTime, int32_t Group); // Function GPGameplay.DrawHelperSystem.DrawLine // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x358cb30
	void DrawDirectionalArrow(struct FMatrix ArrowToWorld, struct FColor InColor, float Length, float ArrowSize, char DepthPriority, int32_t Group); // Function GPGameplay.DrawHelperSystem.DrawDirectionalArrow // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x358c940
	void DrawBox(struct FBox Box, struct FTransform Xform, struct FColor Color, char DepthPriority, float LifeTime, int32_t Group); // Function GPGameplay.DrawHelperSystem.DrawBox // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x358c740
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DSPVS
// Size: 0x118 (Inherited: 0x38)
class UDSPVS : public UWorldSubsystem {
public:

	char pad_38[0x18]; // 0x38(0x18)
	struct TMap<struct UNetConnection*, struct FDPVSConnectionInfo> Connections; // 0x50(0x50)
	struct TArray<struct AIntCharacter*> Characters; // 0xa0(0x10)
	struct TArray<struct FDPVSActorInfo> CharactersInfo; // 0xb0(0x10)
	struct TMap<struct AIntCharacter*, int32_t> CharacterToIndex; // 0xc0(0x50)
	char pad_110[0x8]; // 0x110(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.DynamicUObjectRoot
// Size: 0x430 (Inherited: 0x378)
class ADynamicUObjectRoot : public AActor {
public:

	char pad_378[0xb8]; // 0x378(0xb8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.EMPTakerInterface
// Size: 0x30 (Inherited: 0x30)
class UEMPTakerInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponFiringAnimManager
// Size: 0x48 (Inherited: 0x38)
class UWeaponFiringAnimManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponFiringAnimSingleManager
// Size: 0x48 (Inherited: 0x38)
class UWeaponFiringAnimSingleManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.FlashLightCanvasActor
// Size: 0x3f8 (Inherited: 0x378)
class AFlashLightCanvasActor : public AActor {
public:

	float FlashLightDuration; // 0x378(0x04)
	float ClearCanvasSpeed; // 0x37c(0x04)
	float RT_Resolution; // 0x380(0x04)
	float PowerFlashNearBrushSize; // 0x384(0x04)
	float PowerFlashFarBrushSize; // 0x388(0x04)
	float PowerFlashBrushAlphe; // 0x38c(0x04)
	float PowerFlashBrushScale; // 0x390(0x04)
	float PowerFlashFadingSpeed; // 0x394(0x04)
	float MobilePowerFlashCurveValue; // 0x398(0x04)
	struct FName PowerFlashCanvasEFX; // 0x39c(0x08)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct UMaterialInterface* MatEraser; // 0x3a8(0x08)
	struct UMaterialInterface* MatBrush; // 0x3b0(0x08)
	struct UMaterialParameterCollection* MatParameter; // 0x3b8(0x08)
	struct UTexture* Brush_Tex; // 0x3c0(0x08)
	float TriggerDrawBrushStartTime; // 0x3c8(0x04)
	float RestoreCanvasContentPercent; // 0x3cc(0x04)
	bool TriggerDrawBrush; // 0x3d0(0x01)
	bool TriggerBeingFlashedEffect; // 0x3d1(0x01)
	char pad_3D2[0x2]; // 0x3d2(0x02)
	int32_t TriggerBrushOpacityCount; // 0x3d4(0x04)
	struct UTextureRenderTarget2D* rt2D; // 0x3d8(0x08)
	struct UMaterialInstanceDynamic* Mat_EraserDynamic; // 0x3e0(0x08)
	struct UMaterialInstanceDynamic* Mat_BrushDynamic; // 0x3e8(0x08)
	struct UMaterialInstanceDynamic* MobileMat_BrushDynamic; // 0x3f0(0x08)

	bool RestoreFlashLightCanvasContent(float DeltaTime); // Function GPGameplay.FlashLightCanvasActor.RestoreFlashLightCanvasContent // (Final|Native|Protected) // @ game+0x35971b0
	bool GetTextureRenderTarget2D(struct UTextureRenderTarget2D* rt2D); // Function GPGameplay.FlashLightCanvasActor.GetTextureRenderTarget2D // (Final|Native|Protected) // @ game+0x3595ae0
	bool CalculatePowerFlashScreenPosition(struct AGPCharacter* CHARACTER, struct FVector WorldPos, float Alpha); // Function GPGameplay.FlashLightCanvasActor.CalculatePowerFlashScreenPosition // (Final|Native|Public|HasDefaults) // @ game+0x3591160
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.FlashLightInterface
// Size: 0x30 (Inherited: 0x30)
class UFlashLightInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.FullScreenQuadComponent
// Size: 0x800 (Inherited: 0x7f0)
class UFullScreenQuadComponent : public UStaticMeshComponent {
public:

	char pad_7F0[0x10]; // 0x7f0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.FuncMaskMaterialComponent
// Size: 0x170 (Inherited: 0x100)
class UFuncMaskMaterialComponent : public UActorComponent {
public:

	char pad_100[0x50]; // 0x100(0x50)
	/*struct TScriptInterface<IWeaponLogInterface>*/char WeaponLogInterface[0x10]; // 0x150(0x10)
	struct AWeaponBase* WeaponOwner; // 0x160(0x08)
	char pad_168[0x8]; // 0x168(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GameplayBlueprintHelper
// Size: 0x30 (Inherited: 0x30)
class UGameplayBlueprintHelper : public UBlueprintFunctionLibrary {
public:


	struct FVector2D STATIC_TransformWorldLocToScreenOvalLoc(struct UObject* WorldContextObject, struct FVector4 In_TargetWorldLoc, struct UWidget* In_ParentCanvas, bool& Out_bOffScreen, struct FVector2D& Out_FactorXY, float SafeRatio); // Function GPGameplay.GameplayBlueprintHelper.TransformWorldLocToScreenOvalLoc // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x3597690
	void STATIC_ToggleFourFingersConsole(bool bOpen); // Function GPGameplay.GameplayBlueprintHelper.ToggleFourFingersConsole // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3597610
	void STATIC_ShowAILabHUD(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.ShowAILabHUD // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35975a0
	void STATIC_SetIsRelicateDynamicActors(struct UObject* WorldContext, bool bEnable); // Function GPGameplay.GameplayBlueprintHelper.SetIsRelicateDynamicActors // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35974e0
	void STATIC_SetHideCursorDuringCapture(struct AActor* Context, bool Hide); // Function GPGameplay.GameplayBlueprintHelper.SetHideCursorDuringCapture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3597420
	bool STATIC_SetAnimMontageSlotName(struct UAnimMontage* InMontage, struct FName NewSlotName); // Function GPGameplay.GameplayBlueprintHelper.SetAnimMontageSlotName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3597360
	void STATIC_SetActorInitialized(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.SetActorInitialized // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35972f0
	void STATIC_SendCharacterFSMGlobalEvent(struct ACHARACTER* CHARACTER, struct FGameplayTag EventTag); // Function GPGameplay.GameplayBlueprintHelper.SendCharacterFSMGlobalEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3597240
	void STATIC_RemoveComponentFromActor(struct AActor* Target, struct UActorComponent* Component); // Function GPGameplay.GameplayBlueprintHelper.RemoveComponentFromActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3597100
	void STATIC_RecycleActorFromPool(struct UObject* WorldContextObject, struct AActor* ActorInstance); // Function GPGameplay.GameplayBlueprintHelper.RecycleActorFromPool // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3597050
	struct TArray<int32_t> STATIC_RandomPickUniqueNumbersInRange(int32_t RangeMin, int32_t RangeMax, int32_t PickSize); // Function GPGameplay.GameplayBlueprintHelper.RandomPickUniqueNumbersInRange // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596f00
	bool STATIC_ProjectPoint(struct UObject* WorldContext, struct FVector Point, struct FVector& NavPoint); // Function GPGameplay.GameplayBlueprintHelper.ProjectPoint // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3596de0
	void STATIC_OnAllLevelLoaded(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.OnAllLevelLoaded // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596d70
	void STATIC_NotifyServerLevelVisible(struct UObject* WorldContextObject, struct FName LevelName, bool bVisible); // Function GPGameplay.GameplayBlueprintHelper.NotifyServerLevelVisible // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596c70
	struct UObject* STATIC_NewObjectByClass(struct UObject* ObjectOwner, struct UClass* objectClass); // Function GPGameplay.GameplayBlueprintHelper.NewObjectByClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596bb0
	bool STATIC_LineTestDeformableActor(struct UObject* WorldContext, struct FVector& ZeroBasedLineStart, struct FVector& ZeroBasedLineEnd, float& HitDistance); // Function GPGameplay.GameplayBlueprintHelper.LineTestDeformableActor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3596a40
	bool STATIC_IsValidPlayerUIN(struct FGPPlayerUIN Uin); // Function GPGameplay.GameplayBlueprintHelper.IsValidPlayerUIN // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35969c0
	bool STATIC_IsValidGEHandle(struct FActiveGameplayEffectHandle Handle); // Function GPGameplay.GameplayBlueprintHelper.IsValidGEHandle // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596940
	bool STATIC_IsUnderFPP(struct AActor* Target); // Function GPGameplay.GameplayBlueprintHelper.IsUnderFPP // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35968c0
	bool STATIC_IsStandalone(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.IsStandalone // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596840
	bool STATIC_IsServer(struct UObject* WorldContextObject, bool bIncludeStandalone); // Function GPGameplay.GameplayBlueprintHelper.IsServer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596780
	bool STATIC_IsReplayRecording(struct UObject* WorldContext); // Function GPGameplay.GameplayBlueprintHelper.IsReplayRecording // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596700
	bool STATIC_IsReplayPlaying(struct UObject* WorldContext); // Function GPGameplay.GameplayBlueprintHelper.IsReplayPlaying // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596680
	bool STATIC_IsRegionOverseas(); // Function GPGameplay.GameplayBlueprintHelper.IsRegionOverseas // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596650
	bool STATIC_IsRegionCN(); // Function GPGameplay.GameplayBlueprintHelper.IsRegionCN // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596620
	bool STATIC_IsOwnByLocalPlayer(struct AActor* Target); // Function GPGameplay.GameplayBlueprintHelper.IsOwnByLocalPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35965a0
	bool STATIC_IsLocalPlayerFPPMode(struct ACHARACTER* Char); // Function GPGameplay.GameplayBlueprintHelper.IsLocalPlayerFPPMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596520
	bool STATIC_IsLocalPlayer(struct ACHARACTER* Char); // Function GPGameplay.GameplayBlueprintHelper.IsLocalPlayer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35964a0
	bool STATIC_IsGameEnd(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.IsGameEnd // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596420
	bool STATIC_IsEditor(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.IsEditor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35963a0
	bool STATIC_IsDefaultUnderFPP(struct AActor* Target); // Function GPGameplay.GameplayBlueprintHelper.IsDefaultUnderFPP // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596320
	bool STATIC_IsClient(struct UObject* WorldContextObject, bool bIncludeStandalone); // Function GPGameplay.GameplayBlueprintHelper.IsClient // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596260
	bool STATIC_IsBuildRegionGlobal(); // Function GPGameplay.GameplayBlueprintHelper.IsBuildRegionGlobal // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596230
	bool STATIC_IsBuildRegionGA(); // Function GPGameplay.GameplayBlueprintHelper.IsBuildRegionGA // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596200
	bool STATIC_IsBuildRegionCN(); // Function GPGameplay.GameplayBlueprintHelper.IsBuildRegionCN // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35961d0
	bool STATIC_IsAbilityActive(struct UGameplayAbility* InAbility); // Function GPGameplay.GameplayBlueprintHelper.IsAbilityActive // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3596130
	void STATIC_InvalidateGEHandle(struct FActiveGameplayEffectHandle& Handle); // Function GPGameplay.GameplayBlueprintHelper.InvalidateGEHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x35960a0
	bool STATIC_HasLocalPlayer(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.HasLocalPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3596020
	bool STATIC_HasDSAgent(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.HasDSAgent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3595fa0
	void STATIC_GPPrintString(struct UObject* WorldContextObject, struct FString inString, bool bPrintToScreen, bool bPrintToLog, struct FLinearColor TextColor, float Duration); // Function GPGameplay.GameplayBlueprintHelper.GPPrintString // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35934d0
	void STATIC_GPDrawDebugSphere(struct UObject* WorldContextObject, struct FVector Center, float radius, int32_t Segments, struct FLinearColor LineColor, float Duration, float Thickness); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugSphere // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35932c0
	void STATIC_GPDrawDebugPoint(struct UObject* WorldContextObject, struct FVector Position, float size, struct FLinearColor PointColor, float Duration); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugPoint // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3593130
	void STATIC_GPDrawDebugLine(struct UObject* WorldContextObject, struct FVector LineStart, struct FVector LineEnd, struct FLinearColor LineColor, float Duration, float Thickness); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugLine // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3592f50
	void STATIC_GPDrawDebugCylinder(struct UObject* WorldContextObject, struct FVector Start, struct FVector End, float radius, int32_t Segments, struct FLinearColor LineColor, float Duration, float Thickness); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugCylinder // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3592d00
	void STATIC_GPDrawDebugCircle(struct UObject* WorldContextObject, struct FVector Center, float radius, int32_t NumSegments, struct FLinearColor LineColor, float Duration, float Thickness, struct FVector YAxis, struct FVector ZAxis, bool bDrawAxis); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugCircle // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3592a20
	void STATIC_GPDrawDebugBox(struct UObject* WorldContextObject, struct FVector Center, struct FVector Extent, struct FLinearColor LineColor, struct FRotator Rotation, float Duration, float Thickness); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugBox // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3592800
	void STATIC_GPDrawDebugArrow(struct UObject* WorldContextObject, struct FVector LineStart, struct FVector LineEnd, float ArrowSize, struct FLinearColor LineColor, float Duration, float Thickness); // Function GPGameplay.GameplayBlueprintHelper.GPDrawDebugArrow // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35925e0
	void STATIC_GotoMap(struct UObject* WorldContext, struct FString URL); // Function GPGameplay.GameplayBlueprintHelper.GotoMap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3595e50
	bool STATIC_GetUseMouseForTouch(); // Function GPGameplay.GameplayBlueprintHelper.GetUseMouseForTouch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595e20
	struct FGPPlayerUIN STATIC_GetUinByPC(struct AGPPlayerController* GPPc); // Function GPGameplay.GameplayBlueprintHelper.GetUinByPC // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595d90
	struct FGPPlayerUIN STATIC_GetUinByChar(struct AGPCharacter* GPCh); // Function GPGameplay.GameplayBlueprintHelper.GetUinByChar // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595d00
	struct FGPPlayerUIN STATIC_GetUin(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetUin // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595c70
	int32_t STATIC_GetTotalPlayerCount(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetTotalPlayerCount // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3595bf0
	int32_t STATIC_GetTotalAlivePlayerCount(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetTotalAlivePlayerCount // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3595b70
	float STATIC_GetServerTimeSeconds(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetServerTimeSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595a50
	struct AGPPlayerState* STATIC_GetPlayerStateByUin(struct UObject* WorldContext, struct FGPPlayerUIN Uin); // Function GPGameplay.GameplayBlueprintHelper.GetPlayerStateByUin // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595990
	struct AGPPlayerController* STATIC_GetPlayerPcByUin(struct UObject* WorldContext, struct FGPPlayerUIN Uin); // Function GPGameplay.GameplayBlueprintHelper.GetPlayerPcByUin // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35958d0
	struct AGPPlayerController* STATIC_GetPlayerControllerByUin(struct UObject* WorldContext, struct FGPPlayerUIN Uin); // Function GPGameplay.GameplayBlueprintHelper.GetPlayerControllerByUin // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595810
	struct APlayerController* STATIC_GetPlayerController(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetPlayerController // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3595790
	struct AGPCharacter* STATIC_GetPlayerChByUin(struct UObject* WorldContext, struct FGPPlayerUIN Uin); // Function GPGameplay.GameplayBlueprintHelper.GetPlayerChByUin // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35956d0
	struct FString STATIC_GetNow(); // Function GPGameplay.GameplayBlueprintHelper.GetNow // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3595650
	struct AGPCharacter* STATIC_GetNearestAlivedPlayerCh(struct UObject* WorldContextObject, struct FVector& OrginLoc); // Function GPGameplay.GameplayBlueprintHelper.GetNearestAlivedPlayerCh // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x3595580
	bool STATIC_GetNavPathLength(struct UObject* WorldContext, struct FVector StartPos, struct FVector EndPos, float& PathLen); // Function GPGameplay.GameplayBlueprintHelper.GetNavPathLength // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3595410
	float STATIC_GetMeshScreenRatio(struct USkeletalMeshComponent* MeshComp); // Function GPGameplay.GameplayBlueprintHelper.GetMeshScreenRatio // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3595380
	struct FString STATIC_GetMarkingCharacterVoiceConfigByMarkingChatType(int32_t InMarkingChatType, bool bIsRespond); // Function GPGameplay.GameplayBlueprintHelper.GetMarkingCharacterVoiceConfigByMarkingChatType // (Final|Native|Static|Public) // @ game+0x3595270
	struct FVector STATIC_GetLowestDirectionAroundActor(struct AActor* TargetActor, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, struct TArray<struct AActor*>& ActorsToIgnore, float DirOffset, float TraceHeight, bool bShowDebug); // Function GPGameplay.GameplayBlueprintHelper.GetLowestDirectionAroundActor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3595000
	struct FGPPlayerUIN STATIC_GetLocalUin(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalUin // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594f70
	struct AGPSafeHouseCharacter* STATIC_GetLocalSHCharacter(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalSHCharacter // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594ef0
	struct AGPPlayerState* STATIC_GetLocalGPPlayerState(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalGPPlayerState // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594e70
	struct AGPPlayerController* STATIC_GetLocalGPPlayerController(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalGPPlayerController // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594df0
	struct AGPCharacter* STATIC_GetLocalGPCharacter(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalGPCharacter // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594d70
	struct AGPPlayerState* STATIC_GetLocalFocusCharacterPlayerState(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalFocusCharacterPlayerState // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594cf0
	struct ACharacterBase* STATIC_GetLocalFocusCharacterBase(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalFocusCharacterBase // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594c70
	bool STATIC_GetLocalCharacterCameraLocationAndFordward(struct UObject* WorldContextObject, struct FVector& Location, struct FVector& Forward); // Function GPGameplay.GameplayBlueprintHelper.GetLocalCharacterCameraLocationAndFordward // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x3594b40
	struct AActor* STATIC_GetLocalActor(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetLocalActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594ac0
	bool STATIC_GetLocal1PCharacterCameraLocationAndFordward(struct UObject* WorldContextObject, struct FVector& Location, struct FVector& Forward); // Function GPGameplay.GameplayBlueprintHelper.GetLocal1PCharacterCameraLocationAndFordward // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x3594990
	struct AGPPlayerState* STATIC_GetGPPlayerState(struct AGPPlayerController* GPPc); // Function GPGameplay.GameplayBlueprintHelper.GetGPPlayerState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594910
	struct AGPGameState* STATIC_GetGPGameState(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetGPGameState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594890
	struct FName STATIC_GetGPGameDifficulty(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetGPGameDifficulty // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594800
	struct AGPPlayerController* STATIC_GetGPController(struct AGPCharacter* GPCh); // Function GPGameplay.GameplayBlueprintHelper.GetGPController // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594780
	struct AGPCharacter* STATIC_GetGPCharacter(struct AGPPlayerController* GPPc); // Function GPGameplay.GameplayBlueprintHelper.GetGPCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594700
	float STATIC_GetDistanceFormLocalCharacter(struct AActor* Actor); // Function GPGameplay.GameplayBlueprintHelper.GetDistanceFormLocalCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594670
	struct UObject* STATIC_GetDefaultSingleton(struct UObject* WorldContextObject, struct UClass* Class, bool bCreate, struct UClass* RegClass); // Function GPGameplay.GameplayBlueprintHelper.GetDefaultSingleton // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594530
	int64_t STATIC_GetDateNowBySeconds(); // Function GPGameplay.GameplayBlueprintHelper.GetDateNowBySeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594500
	int64_t STATIC_GetDateNowByMilliseconds(); // Function GPGameplay.GameplayBlueprintHelper.GetDateNowByMilliseconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x35944d0
	bool STATIC_GetCurrentWeaponIsZooming(struct AGPCharacterBase* Char); // Function GPGameplay.GameplayBlueprintHelper.GetCurrentWeaponIsZooming // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594450
	struct UActorComponent* STATIC_GetComponentByName(struct AActor* OwnerActor, struct UClass* ComponentClass, struct FString FindName); // Function GPGameplay.GameplayBlueprintHelper.GetComponentByName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594310
	enum class EChracterPoseType STATIC_GetCharacterCurrentBasePoseByFracture(struct ACHARACTER* Char); // Function GPGameplay.GameplayBlueprintHelper.GetCharacterCurrentBasePoseByFracture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594290
	enum class EChracterPoseType STATIC_GetCharacterCurrentBasePose(struct ACHARACTER* Char, bool UseArmFracture); // Function GPGameplay.GameplayBlueprintHelper.GetCharacterCurrentBasePose // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35941d0
	struct ACharacterBase* STATIC_GetCharacterBase(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetCharacterBase // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3594150
	enum class EChracterPoseType STATIC_GetCharacterAnimBasePose(struct ACHARACTER* Char); // Function GPGameplay.GameplayBlueprintHelper.GetCharacterAnimBasePose // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35940d0
	struct UObject* STATIC_GetCDO(struct UClass* Class); // Function GPGameplay.GameplayBlueprintHelper.GetCDO // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3593f70
	int32_t STATIC_GetCampPlayerCount(struct UObject* WorldContextObject, int32_t Camp); // Function GPGameplay.GameplayBlueprintHelper.GetCampPlayerCount // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3594010
	struct FVector STATIC_GetBoneWorldLocation(struct USkinnedMeshComponent* MeshComp, struct FName BoneName); // Function GPGameplay.GameplayBlueprintHelper.GetBoneWorldLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3593ea0
	struct UAbilitySystemComponent* STATIC_GetASC(struct UObject* Target); // Function GPGameplay.GameplayBlueprintHelper.GetASC // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3593880
	struct FName STATIC_GetAnimMontageSlotName(struct UAnimMontage* InMontage); // Function GPGameplay.GameplayBlueprintHelper.GetAnimMontageSlotName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3593c40
	bool STATIC_GetAnimItemTypeIsFPP(enum class EWeaponAnimItemType InItemType); // Function GPGameplay.GameplayBlueprintHelper.GetAnimItemTypeIsFPP // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3593bc0
	enum class EWeaponAnimItemType STATIC_GetAnimItemType(enum class EChracterPoseType InPoseType, bool bIsFPP); // Function GPGameplay.GameplayBlueprintHelper.GetAnimItemType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3593b00
	bool STATIC_GetAnimationCurve(struct UAnimSequence* inAnimSeq, struct FName CurveName, struct TArray<float>& Times, struct TArray<float>& Values); // Function GPGameplay.GameplayBlueprintHelper.GetAnimationCurve // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x3593cd0
	struct AGPCharacter* STATIC_GetAnAlivedPlayerCh(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.GetAnAlivedPlayerCh // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3593a80
	struct AActor* STATIC_GetAimTarget(struct UObject* WorldContextObject, float& Distance); // Function GPGameplay.GameplayBlueprintHelper.GetAimTarget // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x35939c0
	struct AActor* STATIC_GetAimNearestTarget(struct UObject* WorldContextObject, float& Distance); // Function GPGameplay.GameplayBlueprintHelper.GetAimNearestTarget // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x3593900
	struct TArray<struct FVector> STATIC_GenerateBrunchOfPoint(struct UObject* WorldContextObject, int32_t Num, struct FVector postion); // Function GPGameplay.GameplayBlueprintHelper.GenerateBrunchOfPoint // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35936d0
	int64_t STATIC_FStringToInt64(struct UObject* WorldContext, struct FString str); // Function GPGameplay.GameplayBlueprintHelper.FStringToInt64 // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3591cb0
	struct UActorComponent* STATIC_FindPlayerComponent(struct UClass* Class, struct UObject* WorldContextObject, struct AGPPlayerController* PC); // Function GPGameplay.GameplayBlueprintHelper.FindPlayerComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35924f0
	bool STATIC_FindDeltaAngleDegreesAndDirection(float A1, float A2, float& AngleOut); // Function GPGameplay.GameplayBlueprintHelper.FindDeltaAngleDegreesAndDirection // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x35923e0
	struct UActorComponent* STATIC_FindComponentByClass(struct AActor* OwnerActor, struct UClass* CompClass); // Function GPGameplay.GameplayBlueprintHelper.FindComponentByClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3592320
	void STATIC_FindCapsureInfoFromPhysicsBody(struct USkeletalMeshComponent* SkeletalMesh, struct FName TargetBone, bool& ret, struct FVector& Center, float& HalfHeight, float& radius, struct FRotator& Rotation); // Function GPGameplay.GameplayBlueprintHelper.FindCapsureInfoFromPhysicsBody // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x35920d0
	struct FString STATIC_FindAllCollisionHighPoint(struct ACHARACTER* Target); // Function GPGameplay.GameplayBlueprintHelper.FindAllCollisionHighPoint // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3592000
	struct FHitResult STATIC_FindAimingTarget(struct ACHARACTER* CharacterDoingAiming, float MaxDectDistance); // Function GPGameplay.GameplayBlueprintHelper.FindAimingTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3591ed0
	struct UActorComponent* STATIC_FindActorDataComponent(struct UClass* Class, struct AActor* Target); // Function GPGameplay.GameplayBlueprintHelper.FindActorDataComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3591e10
	bool STATIC_DoesCurveExist(struct UAnimSequence* inAnimSeq, struct FName CurveName); // Function GPGameplay.GameplayBlueprintHelper.DoesCurveExist // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3591bf0
	void STATIC_DFMOpenLevelSimple(struct UObject* WorldContextObject, struct FName LevelName, bool bAbsolute, struct FString Options); // Function GPGameplay.GameplayBlueprintHelper.DFMOpenLevelSimple // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3591950
	void STATIC_DFMOpenLevel(struct UObject* WorldContextObject, struct FName LevelName, bool bAbsolute, struct FString Options); // Function GPGameplay.GameplayBlueprintHelper.DFMOpenLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3591780
	struct FString STATIC_DebugPlayerController(struct UObject* WorldContextObject); // Function GPGameplay.GameplayBlueprintHelper.DebugPlayerController // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3591b20
	struct UMaterialInstanceDynamic* STATIC_CreateMaterialInstanceDynamic(struct UMaterialInterface* ParentMaterial, struct UObject* InOuter); // Function GPGameplay.GameplayBlueprintHelper.CreateMaterialInstanceDynamic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35916c0
	bool STATIC_CheckTargetLocationIsInViewport2(struct UObject* WorldContext, struct FVector InTargetLocation); // Function GPGameplay.GameplayBlueprintHelper.CheckTargetLocationIsInViewport2 // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3591520
	bool STATIC_CheckTargetLocationIsInViewport(struct UObject* WorldContext, struct FVector InTargetLocation); // Function GPGameplay.GameplayBlueprintHelper.CheckTargetLocationIsInViewport // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35915f0
	bool STATIC_CheckIfLocInCircle(struct UWidget* CheckWidget, struct FVector2D Loc); // Function GPGameplay.GameplayBlueprintHelper.CheckIfLocInCircle // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3591460
	bool STATIC_CheckIfInCircle(struct UWidget* CheckWidget, struct FGeometry MyGeometry, struct FPointerEvent& InTouchEvent); // Function GPGameplay.GameplayBlueprintHelper.CheckIfInCircle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x3591270
	float STATIC_CalculateHorAngle(struct FVector VectorA, struct FVector VectorB); // Function GPGameplay.GameplayBlueprintHelper.CalculateHorAngle // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3591080
	float STATIC_CalculateAngle(struct FVector VectorA, struct FVector VectorB); // Function GPGameplay.GameplayBlueprintHelper.CalculateAngle // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x3590fa0
	float STATIC_CalcOffsetLoc(float StartLoc, float InterSpace, int32_t Count, int32_t TotalCount); // Function GPGameplay.GameplayBlueprintHelper.CalcOffsetLoc // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3590e60
	bool STATIC_CalcObjectsDiff(struct TArray<struct UObject*>& NewList, struct TArray<struct UObject*>& OldList, struct TArray<struct UObject*>& Additions, struct TArray<struct UObject*>& Removes); // Function GPGameplay.GameplayBlueprintHelper.CalcObjectsDiff // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3590be0
	enum class EDirection STATIC_CalcDirectionAndAngle(struct AActor* inActor, struct FVector& InVector, float& OutAngle); // Function GPGameplay.GameplayBlueprintHelper.CalcDirectionAndAngle // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x3590ac0
	enum class EDirection STATIC_CalcDirection(struct AActor* inActor, struct FVector& InVector); // Function GPGameplay.GameplayBlueprintHelper.CalcDirection // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x35909f0
	bool STATIC_ApplyNewMainWeaponScale(struct AGPCharacterBase* WeaponOwner, float NewScale); // Function GPGameplay.GameplayBlueprintHelper.ApplyNewMainWeaponScale // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3590930
	struct UActorComponent* STATIC_AddComponentToActorV2(struct AActor* Target, struct UClass* CompClass, struct USceneComponent* AttachTo); // Function GPGameplay.GameplayBlueprintHelper.AddComponentToActorV2 // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3590840
	struct UActorComponent* STATIC_AddComponentToActor(struct AActor* Target, struct UClass* CompClass, struct USceneComponent* AttachTo, bool bUseExsist); // Function GPGameplay.GameplayBlueprintHelper.AddComponentToActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3590710
	struct AActor* STATIC_AcquireActorFromPool(struct UObject* WorldContextObject, struct UClass* ActorClass, struct FTransform& SpawnTransform, enum class ESpawnActorCollisionHandlingMethod CollisionHandlingOverride, struct AActor* Owner); // Function GPGameplay.GameplayBlueprintHelper.AcquireActorFromPool // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3590490
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GameRuleSubsystemCollection
// Size: 0x110 (Inherited: 0x38)
class UGameRuleSubsystemCollection : public UWorldSubsystem {
public:

	char pad_38[0xd8]; // 0x38(0xd8)

	void OnWorldSettingsReady(struct AGPWorldSettings* InGPWorldSettings); // Function GPGameplay.GameRuleSubsystemCollection.OnWorldSettingsReady // (Final|Native|Protected) // @ game+0x359b5e0
	void OnGameRuleDeactive(enum class EGameRuleType InGameRule); // Function GPGameplay.GameRuleSubsystemCollection.OnGameRuleDeactive // (Final|Native|Protected) // @ game+0x359b080
	void OnGameRuleActive(enum class EGameRuleType InGameRule); // Function GPGameplay.GameRuleSubsystemCollection.OnGameRuleActive // (Final|Native|Protected) // @ game+0x359b000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilityDetectorEffectSubsystem
// Size: 0x48 (Inherited: 0x38)
class UGPAbilityDetectorEffectSubsystem : public UWorldSubsystem {
public:

	struct TArray<struct AGPCharacter*> Characters; // 0x38(0x10)

	struct UGPAbilityDetectorEffectSubsystem* STATIC_Get(struct UObject* WorldContext); // Function GPGameplay.GPAbilityDetectorEffectSubsystem.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x359a3d0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilityEntityFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
class UGPAbilityEntityFunctionLibrary : public UBlueprintFunctionLibrary {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilityGameStateComponent
// Size: 0x248 (Inherited: 0x100)
class UGPAbilityGameStateComponent : public UActorComponent {
public:

	char pad_100[0x20]; // 0x100(0x20)
	struct TMap<int32_t, struct FSkillDataRow> SkillDataRowMap; // 0x120(0x50)
	struct TMap<int32_t, struct FSkillConflictRow> ConflictRowMap; // 0x170(0x50)
	struct TArray<int32_t> RowKeys; // 0x1c0(0x10)
	struct FAbilityShareMemoryPool AbilityShareMemoryPool; // 0x1d0(0x50)
	struct UAbilityEntityManager* EntityMgr; // 0x220(0x08)
	struct TArray<struct UObject*> AbilitySystems; // 0x228(0x10)
	/*struct FMulticastInlineDelegate*/char OnAbilityEntityTemplateLoad[0x10]; // 0x238(0x10)

	struct AGPAbilityLogicTemplate* TryGetAbilityEntityTemplate(int32_t SkillId); // Function GPGameplay.GPAbilityGameStateComponent.TryGetAbilityEntityTemplate // (Native|Public) // @ game+0x359bfe0
	struct UObject* GetSystemObj(enum class EDFMAbilityLogicType Type); // Function GPGameplay.GPAbilityGameStateComponent.GetSystemObj // (Final|Native|Public) // @ game+0x359a9d0
	struct FSkillDataRow GetRowConfigFromDataTable(int32_t ID); // Function GPGameplay.GPAbilityGameStateComponent.GetRowConfigFromDataTable // (Final|Native|Public) // @ game+0x359a680
	struct FSkillConflictRow GetConflictRowConfigFromDataTable(int32_t ID); // Function GPGameplay.GPAbilityGameStateComponent.GetConflictRowConfigFromDataTable // (Final|Native|Public) // @ game+0x359a490
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AbilitySerilizeUtils
// Size: 0x30 (Inherited: 0x30)
class UAbilitySerilizeUtils : public UBlueprintFunctionLibrary {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilityInstance
// Size: 0x40 (Inherited: 0x30)
class UGPAbilityInstance : public UObject {
public:

	int32_t SkillId; // 0x30(0x04)
	int32_t SkillEntityID; // 0x34(0x04)
	int32_t SkillEntityIndex; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	enum class ESkillUIState GetSkillUIState(); // Function GPGameplay.GPAbilityInstance.GetSkillUIState // (Native|Public) // @ game+0x129b480
	struct FSkillUIInfo GetSkillUIInfo(); // Function GPGameplay.GPAbilityInstance.GetSkillUIInfo // (Native|Public) // @ game+0x359a7b0
	enum class ESkillItemUsingType GetActivated(); // Function GPGameplay.GPAbilityInstance.GetActivated // (Native|Public) // @ game+0x129b4b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilityLogicTemplate
// Size: 0x460 (Inherited: 0x378)
class AGPAbilityLogicTemplate : public AActor {
public:

	char pad_378[0x4]; // 0x378(0x04)
	int32_t SkillId; // 0x37c(0x04)
	bool bCollected; // 0x380(0x01)
	char pad_381[0x17]; // 0x381(0x17)
	struct TWeakObjectPtr<struct UGPAbilityGameStateComponent> AbilityGSComponent; // 0x398(0x08)
	bool DebugNode; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	struct TArray<struct FName> OverrideParams; // 0x3a8(0x10)
	struct TMap<struct FName, enum class EAbilityStateFlag> LogicFlags; // 0x3b8(0x50)
	struct TMap<struct FName, enum class EAbilityNodeExcuteType> LogicExcuteType; // 0x408(0x50)
	bool ClientCreateNodeFromRepData; // 0x458(0x01)
	bool bClientOptimizeAutoPlayCallBluePrint; // 0x459(0x01)
	bool bClientCallAutoPlay; // 0x45a(0x01)
	char pad_45B[0x5]; // 0x45b(0x05)

	void RemoveFromCharacter(int32_t SkillEntityIndex); // Function GPGameplay.GPAbilityLogicTemplate.RemoveFromCharacter // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void OnCharacterReborn(int32_t SkillEntityIndex); // Function GPGameplay.GPAbilityLogicTemplate.OnCharacterReborn // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void BP_GiveSameSkill(int32_t SkillEntityIndex); // Function GPGameplay.GPAbilityLogicTemplate.BP_GiveSameSkill // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	void AutoPlay(int32_t SkillEntityIndex); // Function GPGameplay.GPAbilityLogicTemplate.AutoPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilitySharedEffectComponent
// Size: 0x140 (Inherited: 0x100)
class UGPAbilitySharedEffectComponent : public UActorComponent {
public:

	char pad_100[0x10]; // 0x100(0x10)
	struct TArray<enum class EPerkSharedEffectSource> Effects; // 0x110(0x10)
	struct TArray<enum class EPerkSharedEffectSource> Applyed; // 0x120(0x10)
	char pad_130[0x10]; // 0x130(0x10)

	void OnHealthChange(struct AActor* Owner, int32_t CurrentValue, int32_t MaxValue); // Function GPGameplay.GPAbilitySharedEffectComponent.OnHealthChange // (Final|Native|Public) // @ game+0x359f4c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilitySupportPackBullet
// Size: 0x3e0 (Inherited: 0x378)
class AGPAbilitySupportPackBullet : public AActor {
public:

	struct FVector StartOffset; // 0x378(0x0c)
	struct FName StartSocket; // 0x384(0x08)
	float StartHeightOffset; // 0x38c(0x04)
	struct FVector EndOffset; // 0x390(0x0c)
	float Speed; // 0x39c(0x04)
	float MaxTime; // 0x3a0(0x04)
	struct FRotator RotateSpeed; // 0x3a4(0x0c)
	float CurveStrength; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct TWeakObjectPtr<struct AActor> Target; // 0x3b8(0x08)
	char pad_3C0[0x20]; // 0x3c0(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAbilityUtil
// Size: 0x30 (Inherited: 0x30)
class UGPAbilityUtil : public UBlueprintFunctionLibrary {
public:


	void STATIC_ReleasePreLoadUI(struct UObject* World, struct FName PanelConfigName); // Function GPGameplay.GPAbilityUtil.ReleasePreLoadUI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x359f9e0
	void STATIC_PushDataFlow(struct AActor* Target, struct FSkillDataFlowRecordItem DataFlowItem, bool bUseTimingWheel); // Function GPGameplay.GPAbilityUtil.PushDataFlow // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x359f890
	void STATIC_PreLoadUI(struct UObject* World, struct FName PanelConfigName); // Function GPGameplay.GPAbilityUtil.PreLoadUI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x359f7e0
	bool STATIC_IsMPMode(struct UObject* WorldContextObject); // Function GPGameplay.GPAbilityUtil.IsMPMode // (Final|Native|Static|Public) // @ game+0x359f440
	void STATIC_AbilityShowUI(struct UObject* World, struct FName PanelConfigName); // Function GPGameplay.GPAbilityUtil.AbilityShowUI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x359f210
	void STATIC_AbilityHideUI(struct UObject* World, struct FName PanelConfigName); // Function GPGameplay.GPAbilityUtil.AbilityHideUI // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x359f160
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPActionSequenceComponent
// Size: 0x120 (Inherited: 0x100)
class UGPActionSequenceComponent : public UActorComponent {
public:

	struct AGPCharacterBase* GPOwner; // 0x100(0x08)
	char pad_108[0x18]; // 0x108(0x18)

	void OnOwnerCharacterReborn(); // Function GPGameplay.GPActionSequenceComponent.OnOwnerCharacterReborn // (Final|Native|Protected) // @ game+0x359f7c0
	void OnOwnerCharacterDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function GPGameplay.GPActionSequenceComponent.OnOwnerCharacterDied // (Final|Native|Protected) // @ game+0x359f5c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPActorAntiPlacementInterface
// Size: 0x30 (Inherited: 0x30)
class UGPActorAntiPlacementInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAdvancedTickingComponent
// Size: 0x2b0 (Inherited: 0x100)
class UGPAdvancedTickingComponent : public UActorComponent {
public:

	struct FGPAdvancedTickingComponentPrePhysicsTickFunction PrePhysicsComponentTick; // 0x100(0x68)
	struct FGPAdvancedTickingComponentDuringPhysicsTickFunction DuringPhysicsComponentTick; // 0x168(0x68)
	struct FGPAdvancedTickingComponentPostPhysicsTickFunction PostPhysicsComponentTick; // 0x1d0(0x68)
	struct FGPAdvancedTickingComponentPostUpdateWorkTickFunction PostUpdateWorkComponentTick; // 0x238(0x68)
	char bCanPlayerTick : 1; // 0x2a0(0x01)
	char bCanCameraTick : 1; // 0x2a0(0x01)
	char bCanMovementTick : 1; // 0x2a0(0x01)
	char pad_2A0_3 : 5; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct AGPCharacterBase* GPOwner; // 0x2a8(0x08)

	void OnOwnerCharacterReborn(); // Function GPGameplay.GPAdvancedTickingComponent.OnOwnerCharacterReborn // (Final|Native|Protected) // @ game+0x88f4d0
	void OnOwnerCharacterDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function GPGameplay.GPAdvancedTickingComponent.OnOwnerCharacterDied // (Final|Native|Protected) // @ game+0x359f6c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAIAnimProxyComponent
// Size: 0x3f0 (Inherited: 0x100)
class UGPAIAnimProxyComponent : public UActorComponent {
public:

	char pad_100[0x9c]; // 0x100(0x9c)
	bool bUse3CHandPose; // 0x19c(0x01)
	bool bInAIHelicopterSpawner; // 0x19d(0x01)
	char pad_19E[0x2]; // 0x19e(0x02)
	struct TMap<enum class EAnimHitPart, struct FName> HitAnims; // 0x1a0(0x50)
	struct TMap<enum class EAnimHitPart, struct FName> CrouchHitAnims; // 0x1f0(0x50)
	bool bUseSimpleHitAnim; // 0x240(0x01)
	char pad_241[0x3]; // 0x241(0x03)
	struct FName SimpleHitAnim; // 0x244(0x08)
	char pad_24C[0xa1]; // 0x24c(0xa1)
	bool bAlwaysForbidBasicAO; // 0x2ed(0x01)
	char pad_2EE[0x2]; // 0x2ee(0x02)
	float AOYawMin; // 0x2f0(0x04)
	float AOYawMax; // 0x2f4(0x04)
	float AOPitchMin; // 0x2f8(0x04)
	float AOPitchMax; // 0x2fc(0x04)
	float AORotationSpeed; // 0x300(0x04)
	bool bAlwaysForbidLeftHandIK; // 0x304(0x01)
	bool bAlwaysForbidRightHandIK; // 0x305(0x01)
	bool bAlwaysForbidFootPredictIK; // 0x306(0x01)
	char pad_307[0x1]; // 0x307(0x01)
	float MaxPlayRateExtend; // 0x308(0x04)
	float MinPlayRateShrink; // 0x30c(0x04)
	struct FName LocomotionAdditiveAnimName; // 0x310(0x08)
	bool bAlwaysForbidWeaponAdditive; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct UAnimSequence* BasicLocomotionAnim; // 0x320(0x08)
	struct UAnimSequence* AdditiveLocomotionAnim; // 0x328(0x08)
	struct UAnimMontage* RootMotionMontage; // 0x330(0x08)
	struct UAnimSequence* LocoAdditiveAnim; // 0x338(0x08)
	struct UAimOffsetBlendSpace* AimOffsetAnim; // 0x340(0x08)
	struct UAnimSequence* ExtraAdditiveLocomotionAnim; // 0x348(0x08)
	char pad_350[0x8]; // 0x350(0x08)
	struct UAnimSequenceBase* ActionAnim; // 0x358(0x08)
	char pad_360[0xd]; // 0x360(0x0d)
	bool bSceneWeaponFiring; // 0x36d(0x01)
	char pad_36E[0x2]; // 0x36e(0x02)
	struct UAnimSequence* OverrideLocomotionAnim; // 0x370(0x08)
	float LocoAnimBlendTime; // 0x378(0x04)
	uint32_t RootMotionBlendIterNum; // 0x37c(0x04)
	struct TArray<struct FRootMotionAnimBlendInfo> RootMotionAnimBlendCache; // 0x380(0x10)
	char pad_390[0x50]; // 0x390(0x50)
	struct UAnimInstance* AnimInstance; // 0x3e0(0x08)
	char pad_3E8[0x8]; // 0x3e8(0x08)

	void ForceLocomotionAnim(struct UAnimSequence* Anim); // Function GPGameplay.GPAIAnimProxyComponent.ForceLocomotionAnim // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0xbd8930
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAIController
// Size: 0x4d8 (Inherited: 0x480)
class AGPAIController : public AAIController {
public:

	int32_t LastShotIndex; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct TMap<int32_t, struct FVector> BulletRotatorMap; // 0x488(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAIDataComponentAnim
// Size: 0x170 (Inherited: 0x100)
class UGPAIDataComponentAnim : public UActorComponent {
public:

	struct FName AiAnimPosRowName; // 0x100(0x08)
	bool bOverrideWeaponAnimation; // 0x108(0x01)
	char pad_109[0x3]; // 0x109(0x03)
	struct FName DeathConfigName; // 0x10c(0x08)
	char pad_114[0xc]; // 0x114(0x0c)
	struct TArray<struct UObject*> RecordLocalAnimationList; // 0x120(0x10)
	char pad_130[0x20]; // 0x130(0x20)
	struct UGPAnimProxyBaseComponent* CharacterAnimProxyComponent; // 0x150(0x08)
	char pad_158[0x8]; // 0x158(0x08)
	struct TArray<struct FDeathAnimConfigWithDirRange> DeathAnims; // 0x160(0x10)

	void OnOwnerCharacterReborn(); // Function GPGameplay.GPAIDataComponentAnim.OnOwnerCharacterReborn // (Final|Native|Public) // @ game+0x88f4d0
	void OnOwnerCharacterDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function GPGameplay.GPAIDataComponentAnim.OnOwnerCharacterDied // (Final|Native|Public) // @ game+0x35a3820
	struct FName GetDeathAnimByPart(enum class ECharacterPart Part, float SourceYaw); // Function GPGameplay.GPAIDataComponentAnim.GetDeathAnimByPart // (Final|Native|Public|BlueprintCallable) // @ game+0x35a31c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAlarmTower
// Size: 0x470 (Inherited: 0x378)
class AGPAlarmTower : public AActor {
public:

	char pad_378[0x8]; // 0x378(0x08)
	struct FName BoneFXName; // 0x380(0x08)
	struct FVector FXRelativePos; // 0x388(0x0c)
	char pad_394[0x4]; // 0x394(0x04)
	struct UParticleSystemComponent* AlarmEffect; // 0x398(0x08)
	struct UParticleSystem* AlarmParticle; // 0x3a0(0x08)
	struct FLinearColor AlarmColor; // 0x3a8(0x10)
	struct FLinearColor NormalColor; // 0x3b8(0x10)
	struct FLinearColor DetructColor; // 0x3c8(0x10)
	float TimerInterval; // 0x3d8(0x04)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct UCurveFloat* SizeCurve; // 0x3e0(0x08)
	float AlarmInterval; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct UAsyncStaticMeshComponent* AsyncStaticMesh; // 0x3f0(0x08)
	/*struct FMulticastInlineDelegate*/char AlarmBroadcast[0x10]; // 0x3f8(0x10)
	bool IsDestruct; // 0x408(0x01)
	bool IsAlarm; // 0x409(0x01)
	char pad_40A[0x16]; // 0x40a(0x16)
	struct TMap<uint32_t, struct TWeakObjectPtr<struct AGPCharacter>> Enemies; // 0x420(0x50)

	void ServerSetDestruct(bool Destruct); // Function GPGameplay.GPAlarmTower.ServerSetDestruct // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1cb00e0
	void ServerDoAlarm(); // Function GPGameplay.GPAlarmTower.ServerDoAlarm // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0xc37ab0
	void ServerCancelAlarm(); // Function GPGameplay.GPAlarmTower.ServerCancelAlarm // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0xbcb8c0
	void RemoveEnemy(struct AGPCharacter* CHARACTER); // Function GPGameplay.GPAlarmTower.RemoveEnemy // (Final|Native|Public|BlueprintCallable) // @ game+0x35a39f0
	bool IsAlarming(); // Function GPGameplay.GPAlarmTower.IsAlarming // (Final|Native|Public|BlueprintCallable) // @ game+0x35a37e0
	void DoAlarm(); // Function GPGameplay.GPAlarmTower.DoAlarm // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0xc37770
	void DestructAlarm(); // Function GPGameplay.GPAlarmTower.DestructAlarm // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0xbcc1a0
	void ChangeEffect(struct FLinearColor Color); // Function GPGameplay.GPAlarmTower.ChangeEffect // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults|BlueprintCallable) // @ game+0x35a2c30
	void CancelAlarm(); // Function GPGameplay.GPAlarmTower.CancelAlarm // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0xbd5ba0
	bool BP_IsDestruct(); // Function GPGameplay.GPAlarmTower.BP_IsDestruct // (Native|Event|Public|BlueprintEvent) // @ game+0x35a2c00
	void AddEnemy(struct AGPCharacter* CHARACTER); // Function GPGameplay.GPAlarmTower.AddEnemy // (Final|Native|Public|BlueprintCallable) // @ game+0x35a2b80
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CharacterAnimDataObjectSingleton
// Size: 0xb8 (Inherited: 0x30)
class UCharacterAnimDataObjectSingleton : public UObject {
public:

	char pad_30[0x10]; // 0x30(0x10)
	struct FAnimDataManager AnimDataManager; // 0x40(0x50)
	struct UDataTable* AnimDataTablePtr; // 0x90(0x08)
	struct TArray<struct UObject*> RecordCommonAnimObjArray; // 0x98(0x10)
	char pad_A8[0x10]; // 0xa8(0x10)

	void OnAnimLoadCompleted(struct FSoftObjectPath& AssetRef); // Function GPGameplay.CharacterAnimDataObjectSingleton.OnAnimLoadCompleted // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x35a8030
	struct UAnimationAsset* GetTacticalActionAnim(struct FName AnimName, bool bIsFPP, enum class EAnimTacticalActionType TacticalActionType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetTacticalActionAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7f20
	struct UAnimationAsset* GetRaiseWatchAnim(struct FName AnimName, bool bIsFPP, enum class EAnimRaiseWatchType RaiseWatchType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetRaiseWatchAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7c90
	struct UAnimationAsset* GetParachuteAnim(struct FName AnimName, bool bIsFPP, enum class EAnimParachuteType ParachuteType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetParachuteAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7b80
	struct UAnimationAsset* GetMarkingAnim(struct FName AnimName, bool bIsFPP, enum class EAnimMarkingType MarkingType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetMarkingAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7a70
	struct UAnimationAsset* GetKnockbackyAnim(struct FName AnimName, bool bIsFPP, enum class EAnimKnockbackType KnockbackType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetKnockbackyAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7960
	struct UAnimationAsset* GetFirefightingAnim(struct FName AnimName, bool bIsFPP, enum class EAnimFirefightingType FirefightingType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetFirefightingAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7850
	struct UAnimationAsset* GetCustomAnim(struct FName AnimName, bool bIsFPP); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetCustomAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7780
	struct UAnimationAsset* GetClimbLadderAnim(struct FName AnimName, bool bIsFPP, enum class EAnimClimbLadderType ClimbLadderType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetClimbLadderAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7670
	struct UAnimationAsset* GetCarryBodyAnim(struct FName AnimName, bool bIsFPP, enum class EAnimCarryBodyType CarryBodyAnimType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetCarryBodyAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7560
	struct UAnimationAsset* GetBunkerAnim(struct FName AnimName, bool bIsFPP, enum class EAnimBunkerType BunkerTyep); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetBunkerAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7450
	struct UAnimationAsset* GetApplySprayAnim(struct FName AnimName, bool bIsFPP, enum class EAnimApplySprayType ApplySprayType); // Function GPGameplay.CharacterAnimDataObjectSingleton.GetApplySprayAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x35a7340
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimFragmentComponent
// Size: 0x120 (Inherited: 0x100)
class UGPAnimFragmentComponent : public UActorComponent {
public:

	char pad_100[0x20]; // 0x100(0x20)

	void StickOnGround(float Delay); // Function GPGameplay.GPAnimFragmentComponent.StickOnGround // (Final|Native|Public|BlueprintCallable) // @ game+0x35a81a0
	void SetAcceleration(struct FVector Acceleration); // Function GPGameplay.GPAnimFragmentComponent.SetAcceleration // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x35a8110
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.IntroVehicleAIAnimInstance
// Size: 0xa10 (Inherited: 0x280)
class UIntroVehicleAIAnimInstance : public UAnimInstance {
public:

	struct FIntroVehicleAIAnimInstanceProxy LocalProxy; // 0x280(0x790)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimInstance_PlayerIK
// Size: 0x9e0 (Inherited: 0x280)
class UGPAnimInstance_PlayerIK : public UAnimInstance {
public:

	struct FGPAnimInstanceProxy_PlayerIK AnimInstanceProxy; // 0x280(0x750)
	struct AGPCharacter* OwnerPawn; // 0x9d0(0x08)
	struct UGPCameraModeComponent* CameraModeComponent; // 0x9d8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimNotifyEventToggle
// Size: 0x48 (Inherited: 0x40)
class UGPAnimNotifyEventToggle : public UAnimNotify {
public:

	enum class EGPEventToggleState ToggleState; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimBreak
// Size: 0x40 (Inherited: 0x40)
class UGPAnimBreak : public UAnimNotify {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimNotifyLogicalBreak
// Size: 0x48 (Inherited: 0x40)
class UGPAnimNotifyLogicalBreak : public UAnimNotify {
public:

	enum class EGPAnimNotifyLogicalBreakType BreakType; // 0x40(0x01)
	bool bNotifyLeftWeapon; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimSprintBreakGetWeapon
// Size: 0x38 (Inherited: 0x38)
class UGPAnimSprintBreakGetWeapon : public UAnimNotifyState {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimThrowMag
// Size: 0x40 (Inherited: 0x38)
class UGPAnimThrowMag : public UAnimNotifyState {
public:

	float Speed; // 0x38(0x04)
	float AddSpeedZ; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimTryAddAmmoPoint
// Size: 0x40 (Inherited: 0x40)
class UGPAnimTryAddAmmoPoint : public UAnimNotify {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPSkillMeshVisiblePoint
// Size: 0x50 (Inherited: 0x40)
class UGPSkillMeshVisiblePoint : public UAnimNotify {
public:

	int32_t SkillId; // 0x40(0x04)
	struct FName MeshName; // 0x44(0x08)
	bool MeshVisible; // 0x4c(0x01)
	bool bWorkd; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnyActionBreakRushMontage
// Size: 0x40 (Inherited: 0x38)
class UGPAnyActionBreakRushMontage : public UAnimNotifyState {
public:

	float InBlendOutTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPUpdateAvatarMeshMaterialMontage
// Size: 0x78 (Inherited: 0x38)
class UGPUpdateAvatarMeshMaterialMontage : public UAnimNotifyState {
public:

	struct FName CurveNameUpdateA; // 0x38(0x08)
	struct FName CurveNameUpdateX; // 0x40(0x08)
	struct FName CurveNameUpdateY; // 0x48(0x08)
	struct FName CurveNameUpdateZ; // 0x50(0x08)
	struct FName VectorParamName; // 0x58(0x08)
	struct FName MeshName; // 0x60(0x08)
	struct FName AvatarID; // 0x68(0x08)
	char pad_70[0x8]; // 0x70(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPLockAbilityByMontange
// Size: 0x80 (Inherited: 0x38)
class UGPLockAbilityByMontange : public UAnimNotifyState {
public:

	struct TArray<enum class ECharacterSkillAbilityMask> LockAbilitys; // 0x38(0x10)
	struct TArray<enum class ECharacterSkillAbilityMask> UnLockAbilitys; // 0x48(0x10)
	struct TArray<enum class ECharacterStateMask> LockStateAbilitys; // 0x58(0x10)
	struct TArray<enum class ECharacterStateMask> UnLockStateAbilitys; // 0x68(0x10)
	bool ReleaseLock; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimAttachWeapon
// Size: 0x50 (Inherited: 0x40)
class UGPAnimAttachWeapon : public UAnimNotify {
public:

	bool bApplyToFirstWeapon; // 0x40(0x01)
	bool bResetWeaponAttach; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	struct FName AttachSocketName; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimOperationInterrupt
// Size: 0x40 (Inherited: 0x38)
class UGPAnimOperationInterrupt : public UAnimNotifyState {
public:

	enum class EGPAnimOperationInterruptType InterruptType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimNotifyLeftWeaponFire
// Size: 0x48 (Inherited: 0x40)
class UGPAnimNotifyLeftWeaponFire : public UAnimNotify {
public:

	enum class EGPAnimNotifyLogicalBreakType BreakType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimNotifyStateFireBreak
// Size: 0x40 (Inherited: 0x38)
class UGPAnimNotifyStateFireBreak : public UAnimNotifyState {
public:

	bool bNotifyLeftWeapon; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimProxyInterface
// Size: 0x30 (Inherited: 0x30)
class UGPAnimProxyInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAnimTrigger
// Size: 0x3e0 (Inherited: 0x3c0)
class AGPAnimTrigger : public AGPTriggerBase {
public:

	struct TArray<struct AActor*> AnimActors; // 0x3c0(0x10)
	bool bAnimLoop; // 0x3d0(0x01)
	char pad_3D1[0x3]; // 0x3d1(0x03)
	float TriggerDelay; // 0x3d4(0x04)
	char pad_3D8[0x8]; // 0x3d8(0x08)

	void PlayAnim(struct AActor* AnimActor); // Function GPGameplay.GPAnimTrigger.PlayAnim // (Native|Event|Protected|BlueprintEvent) // @ game+0xbcbbd0
	void OnTriggerDelayTimer(); // Function GPGameplay.GPAnimTrigger.OnTriggerDelayTimer // (Final|Native|Protected) // @ game+0x35b6eb0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAttributeGlobal
// Size: 0x88 (Inherited: 0x38)
class UGPAttributeGlobal : public UGameInstanceSubsystem {
public:

	struct FSoftObjectPath GlobalAttributeSetDefaultsTableName; // 0x38(0x18)
	struct TArray<struct FSoftObjectPath> GlobalAttributeSetDefaultsTableNames; // 0x50(0x10)
	struct TArray<struct UCurveTable*> GlobalAttributeDefaultsTables; // 0x60(0x10)
	char pad_70[0x18]; // 0x70(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAttributeSetDamageFigure
// Size: 0x110 (Inherited: 0x50)
class UGPAttributeSetDamageFigure : public UGPAttributeSetBase {
public:

	struct FGameplayAttributeData DamageAddition; // 0x50(0x10)
	struct FGameplayAttributeData SourceMultiple; // 0x60(0x10)
	struct FGameplayAttributeData SourceAddition; // 0x70(0x10)
	struct FGameplayAttributeData EquipAddition; // 0x80(0x10)
	struct FGameplayAttributeData WeaknessRate; // 0x90(0x10)
	struct FGameplayAttributeData CritAddition; // 0xa0(0x10)
	struct FGameplayAttributeData WeaponCrit; // 0xb0(0x10)
	struct FGameplayAttributeData WeaponVendorCrit; // 0xc0(0x10)
	struct FGameplayAttributeData TargetReduction; // 0xd0(0x10)
	struct FGameplayAttributeData TargetResistance; // 0xe0(0x10)
	struct FGameplayAttributeData TargetMultiple; // 0xf0(0x10)
	struct FGameplayAttributeData DamageDefence; // 0x100(0x10)

	void OnRep_WeaponVendorCrit(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_WeaponVendorCrit // (Final|Native|Protected|HasOutParms) // @ game+0x35b6d60
	void OnRep_WeaponCrit(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_WeaponCrit // (Final|Native|Protected|HasOutParms) // @ game+0x35b6cc0
	void OnRep_WeaknessRate(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_WeaknessRate // (Final|Native|Protected|HasOutParms) // @ game+0x35b6c20
	void OnRep_TargetResistance(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_TargetResistance // (Final|Native|Protected|HasOutParms) // @ game+0x35b6ad0
	void OnRep_TargetReduction(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_TargetReduction // (Final|Native|Protected|HasOutParms) // @ game+0x35b6a30
	void OnRep_TargetMultiple(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_TargetMultiple // (Final|Native|Protected|HasOutParms) // @ game+0x35b6990
	void OnRep_SourceMultiple(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_SourceMultiple // (Final|Native|Protected|HasOutParms) // @ game+0x35b68d0
	void OnRep_SourceAddition(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_SourceAddition // (Final|Native|Protected|HasOutParms) // @ game+0x35b6830
	void OnRep_EquipAddition(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_EquipAddition // (Final|Native|Protected|HasOutParms) // @ game+0x35b5710
	void OnRep_DamageDefence(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_DamageDefence // (Final|Native|Protected|HasOutParms) // @ game+0x35b55c0
	void OnRep_DamageAddition(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_DamageAddition // (Final|Native|Protected|HasOutParms) // @ game+0x35b5520
	void OnRep_CritAddition(struct FGameplayAttributeData& OldData); // Function GPGameplay.GPAttributeSetDamageFigure.OnRep_CritAddition // (Final|Native|Protected|HasOutParms) // @ game+0x35b5480
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAudioControllerComponent
// Size: 0x240 (Inherited: 0x100)
class UGPAudioControllerComponent : public UActorComponent {
public:

	float TickInterval; // 0x100(0x04)
	int32_t TransitionFootstepNum; // 0x104(0x04)
	float TransitionAllowance; // 0x108(0x04)
	float RTPCEnemyNumberUpdateInterval; // 0x10c(0x04)
	float RTPCEnemyNumberRelevantRadius; // 0x110(0x04)
	float RTPCFireNumberUpdateInterval; // 0x114(0x04)
	float RTPCFireNumberRelevantRadius; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct TArray<struct FFakeFootstepRecord> FakeFootstepRecordArray; // 0x120(0x10)
	char pad_130[0x110]; // 0x130(0x110)

	void NotifyCharacterPlayFootstepWithAnim(struct AGPCharacter* InCharacter); // Function GPGameplay.GPAudioControllerComponent.NotifyCharacterPlayFootstepWithAnim // (Final|Native|Public) // @ game+0x35b98b0
	struct FName GetWaterRTPCName(); // Function GPGameplay.GPAudioControllerComponent.GetWaterRTPCName // (Final|Native|Public) // @ game+0x35b9890
	enum class EGPAudioFootSoundType GetLandedSoundType(float FallHeight); // Function GPGameplay.GPAudioControllerComponent.GetLandedSoundType // (Final|Native|Public) // @ game+0x35b9800
	enum class EFakeFootstepStatus GetFakeFootstepStatus(struct AGPCharacter* InCharacter); // Function GPGameplay.GPAudioControllerComponent.GetFakeFootstepStatus // (Final|Native|Public) // @ game+0x35b9770
	void ClientPlayLandedFootstep(struct AActor* inActor, float FallHeight); // Function GPGameplay.GPAudioControllerComponent.ClientPlayLandedFootstep // (Net|Native|Event|NetMulticast|Public) // @ game+0x35b96a0
	void ClientPlayJumpFootstep(struct AActor* inActor); // Function GPGameplay.GPAudioControllerComponent.ClientPlayJumpFootstep // (Net|Native|Event|NetMulticast|Public) // @ game+0xbd8ba0
	float ClampWaterRTPCValue(float InDepth); // Function GPGameplay.GPAudioControllerComponent.ClampWaterRTPCValue // (Final|Native|Public) // @ game+0x35b9610
	bool CheckUseFakeFootstep(struct AGPCharacter* InCharacter); // Function GPGameplay.GPAudioControllerComponent.CheckUseFakeFootstep // (Final|Native|Public) // @ game+0x35b9580
	bool CheckSatisfiedFootstepInterval(struct AGPCharacter* InCharacter, float CurrentTime, float TimeScalar); // Function GPGameplay.GPAudioControllerComponent.CheckSatisfiedFootstepInterval // (Final|Native|Public) // @ game+0x35b9480
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAudioSubtitleSystem
// Size: 0x3d8 (Inherited: 0x378)
class AGPAudioSubtitleSystem : public AActor {
public:

	char pad_378[0x18]; // 0x378(0x18)
	/*struct FMulticastInlineDelegate*/char OnNewSubtitleEnqueueEvent[0x10]; // 0x390(0x10)
	/*struct FMulticastInlineDelegate*/char OnStopCurrentAudioEvent[0x10]; // 0x3a0(0x10)
	struct UDataTable* QuestNoticeDataTable; // 0x3b0(0x08)
	struct UDataTable* AIDialogDataTable; // 0x3b8(0x08)
	char pad_3C0[0x18]; // 0x3c0(0x18)

	void ServerPlaySubtitle(struct FText Subtilte, struct UGPAudioEventAsset* AudioEvent, enum class ESubtitlePriorityType PriorityType, enum class ESubtitleHudType HUDType, struct AActor* SpeakerActor, float SubtitleDuration); // Function GPGameplay.GPAudioSubtitleSystem.ServerPlaySubtitle // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x35bf020
	void ServerAddAudioSubtitle(struct FName SubtitleKey, enum class ESubtitlePriorityType PriorityType, enum class ESubtitleHudType HUDType, struct AActor* SpeakerActor, float SubtitleDuration); // Function GPGameplay.GPAudioSubtitleSystem.ServerAddAudioSubtitle // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x35beea0
	struct FAudioSubtitleInfo GetPendingQueueTop(); // Function GPGameplay.GPAudioSubtitleSystem.GetPendingQueueTop // (Final|Native|Public|BlueprintCallable) // @ game+0x35be500
	int32_t GetPendingQueueLength(); // Function GPGameplay.GPAudioSubtitleSystem.GetPendingQueueLength // (Final|Native|Public|BlueprintCallable) // @ game+0x35be4e0
	struct AGPAudioSubtitleSystem* STATIC_GetAudioSubtitleSystem(struct UObject* WorldContextObject); // Function GPGameplay.GPAudioSubtitleSystem.GetAudioSubtitleSystem // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35be0d0
	void ClientPlaySubtitle(struct FText Subtilte, struct UGPAudioEventAsset* AudioEvent, enum class ESubtitlePriorityType PriorityType, enum class ESubtitleHudType HUDType, struct AActor* SpeakerActor, float SubtitleDuration); // Function GPGameplay.GPAudioSubtitleSystem.ClientPlaySubtitle // (Net|Native|Event|Public|NetClient) // @ game+0x35bd930
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPBattleFieldSystemConfigDataAsset
// Size: 0x70 (Inherited: 0x30)
class UGPBattleFieldSystemConfigDataAsset : public UObject {
public:

	bool IsSpectateUnderFPP; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<struct UClass*> RadarActorClassFilter; // 0x38(0x10)
	struct UClass* SpectatingCameraActorClass; // 0x48(0x08)
	struct FSoftClassPath ReplayListViewSoftClass; // 0x50(0x18)
	struct UCurveFloat* AmbientLightFOVDistanceOffsetCurve; // 0x68(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPBattleFieldSystem
// Size: 0x260 (Inherited: 0x38)
class UGPBattleFieldSystem : public UWorldSubsystem {
public:

	char pad_38[0x8]; // 0x38(0x08)
	struct UGPBattleFieldSystemConfigDataAsset* DefaultBattleFieldConfig; // 0x40(0x08)
	bool IsSpectateUnderFPP; // 0x48(0x01)
	bool HasLocalPlayer; // 0x49(0x01)
	bool HasLocalPawn; // 0x4a(0x01)
	bool HasLocalFocusPlayerPawn; // 0x4b(0x01)
	bool HasLocalFocusActor; // 0x4c(0x01)
	bool HasLocalFocusGPCharacter; // 0x4d(0x01)
	bool bIsLiveSpectating; // 0x4e(0x01)
	bool bIsSpectatingAI; // 0x4f(0x01)
	bool bIsSpectatingAILabAI; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	int32_t bIsBeingSpectating; // 0x54(0x04)
	bool bIsOBFreeCamera; // 0x58(0x01)
	bool bIsInObserverMode; // 0x59(0x01)
	char pad_5A[0x6]; // 0x5a(0x06)
	struct TArray<struct FSpectatorBriefInfo> AllPlayerBriefInfo; // 0x60(0x10)
	struct TArray<struct FSpectatorBriefInfo> AllAIBriefInfo; // 0x70(0x10)
	struct TArray<struct FSpectatorBriefInfo> AllNPCBriefInfo; // 0x80(0x10)
	struct AGPNetworkPlayerController* LocalPlayerController; // 0x90(0x08)
	struct AGPCharacterBase* LocalPlayerPawn; // 0x98(0x08)
	struct AGPCharacterBase* LocalFocusPlayerPawn; // 0xa0(0x08)
	char pad_A8[0x8]; // 0xa8(0x08)
	struct AActor* LocalFocusActor; // 0xb0(0x08)
	struct AGPCharacterBase* LocalFocusGPCharacter; // 0xb8(0x08)
	char pad_C0[0x28]; // 0xc0(0x28)
	struct TArray<struct AActor*> CurrentRadarActors; // 0xe8(0x10)
	struct TArray<struct AGPCharacterBase*> CurrentRadarCharacter; // 0xf8(0x10)
	struct TArray<struct AGPCharacterBase*> CurrentClientAICharacters; // 0x108(0x10)
	struct TArray<struct AGPCharacterBase*> CurrentClientAllCharacters; // 0x118(0x10)
	struct TArray<struct AGPCharacterBase*> CurrentClientPlayerCharacters; // 0x128(0x10)
	struct TMap<int64_t, struct AGPCharacterBase*> CurrentClientAllCharacterMap; // 0x138(0x50)
	struct TMap<int64_t, struct AGPPlayerState*> CurrentClientAllPSMap; // 0x188(0x50)
	float RTPCEnemyNumberUpdateInterval; // 0x1d8(0x04)
	float RTPCEnemyNumberRelevantRadius; // 0x1dc(0x04)
	char pad_1E0[0x4]; // 0x1e0(0x04)
	int32_t RTPCEnemyNumberValue; // 0x1e4(0x04)
	char pad_1E8[0x8]; // 0x1e8(0x08)
	struct AGPGameMode* CurrentGameMode; // 0x1f0(0x08)
	struct TArray<struct FServerPlayerFullDataInfo> PlayerFullData; // 0x1f8(0x10)
	struct TArray<struct FServerPlayerFullDataInfo> AIFullData; // 0x208(0x10)
	struct ACameraActor* GodLikeCameraActor; // 0x218(0x08)
	char pad_220[0x10]; // 0x220(0x10)
	struct TArray<struct FClientAdjustPositionInfo> ClientAdjustPositionInfos; // 0x230(0x10)
	struct UNZSkyBoxComponent* SkyBoxComponent; // 0x240(0x08)
	char pad_248[0x8]; // 0x248(0x08)
	struct TArray<struct AActor*> SpectatingRelevantActorList; // 0x250(0x10)

	void UpdateSpectWeaponInfoFlag(struct AGPNetworkPlayerController* Player, bool bReplicate); // Function GPGameplay.GPBattleFieldSystem.UpdateSpectWeaponInfoFlag // (Final|Native|Public) // @ game+0x35bff90
	void UpdateSpectWeaponInfo(struct AGPNetworkPlayerController* Player, struct AActor* NewViewTarget); // Function GPGameplay.GPBattleFieldSystem.UpdateSpectWeaponInfo // (Final|Native|Public) // @ game+0x35bfed0
	void UpdateSpectMemberInfo(struct AGPNetworkPlayerController* Player, struct AActor* NewViewTarget); // Function GPGameplay.GPBattleFieldSystem.UpdateSpectMemberInfo // (Final|Native|Public) // @ game+0x35bfe10
	void UnRegisterSpectatingRelevantActor(struct AActor* inActor); // Function GPGameplay.GPBattleFieldSystem.UnRegisterSpectatingRelevantActor // (Final|Native|Public) // @ game+0x35bfc80
	void TryLeaveLiveSpectateMode(struct AGPNetworkPlayerController* Player); // Function GPGameplay.GPBattleFieldSystem.TryLeaveLiveSpectateMode // (Final|Native|Public|BlueprintCallable) // @ game+0x35bfbe0
	void TryLeaveAISpectateMode(struct AGPNetworkPlayerController* Player); // Function GPGameplay.GPBattleFieldSystem.TryLeaveAISpectateMode // (Final|Native|Public|BlueprintCallable) // @ game+0x35bfb60
	void TryEnterLiveSpectateMode(struct AGPNetworkPlayerController* Player); // Function GPGameplay.GPBattleFieldSystem.TryEnterLiveSpectateMode // (Final|Native|Public|BlueprintCallable) // @ game+0x35bfae0
	void TryEnterAISpectateMode(struct AGPNetworkPlayerController* Player); // Function GPGameplay.GPBattleFieldSystem.TryEnterAISpectateMode // (Final|Native|Public|BlueprintCallable) // @ game+0x35bfa60
	void SpectateActor(struct AGPNetworkPlayerController* Player, struct AActor* NewViewTarget, float BlendTime, enum class EViewTargetBlendFunction BlendFunc, float BlendExp, bool bLockOutgoing); // Function GPGameplay.GPBattleFieldSystem.SpectateActor // (Final|Native|Public|BlueprintCallable) // @ game+0x35bf8a0
	void SetLocalFocusActor(struct AGPNetworkPlayerController* Player, struct AActor* NewViewTarget, float BlendTime, enum class EViewTargetBlendFunction BlendFunc, float BlendExp, bool bLockOutgoing); // Function GPGameplay.GPBattleFieldSystem.SetLocalFocusActor // (Final|Native|Public|BlueprintCallable) // @ game+0x35bf380
	void ResetToLocalPlayerPawn(struct AGPNetworkPlayerController* Player); // Function GPGameplay.GPBattleFieldSystem.ResetToLocalPlayerPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x35bee20
	void RegisterSpectatingRelevantActor(struct AActor* inActor); // Function GPGameplay.GPBattleFieldSystem.RegisterSpectatingRelevantActor // (Final|Native|Public) // @ game+0x35beda0
	void RefreshSpectMemberInfo(struct AGPNetworkPlayerController* Player); // Function GPGameplay.GPBattleFieldSystem.RefreshSpectMemberInfo // (Final|Native|Public) // @ game+0x35bed20
	void NotifySpectatingRelevantActor(); // Function GPGameplay.GPBattleFieldSystem.NotifySpectatingRelevantActor // (Final|Native|Protected) // @ game+0x35beb60
	bool LiveSpectateSpectificTargetUin(struct AGPNetworkPlayerController* Player, uint64_t TargetUin); // Function GPGameplay.GPBattleFieldSystem.LiveSpectateSpectificTargetUin // (Final|Native|Public) // @ game+0x35beaa0
	bool LiveSpectateSpectificTargetNetGUID(struct AGPNetworkPlayerController* Player, uint32_t TargetNetGUID); // Function GPGameplay.GPBattleFieldSystem.LiveSpectateSpectificTargetNetGUID // (Final|Native|Public) // @ game+0x35be9e0
	bool LiveSpectateSpectificTarget(struct AGPNetworkPlayerController* Player, struct AActor* Target); // Function GPGameplay.GPBattleFieldSystem.LiveSpectateSpectificTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x35be920
	bool LiveSpectateNext(struct AGPNetworkPlayerController* Player, bool nextTarget); // Function GPGameplay.GPBattleFieldSystem.LiveSpectateNext // (Final|Native|Public|BlueprintCallable) // @ game+0x35be860
	bool LiveSpectateLikeGod(struct AGPNetworkPlayerController* Player, float TargetHeight, bool useSpectificPoint, struct FVector TargetPoint); // Function GPGameplay.GPBattleFieldSystem.LiveSpectateLikeGod // (Final|Native|Public|HasDefaults) // @ game+0x35be6e0
	bool LiveSpectateAINext(struct AGPNetworkPlayerController* Player, bool nextTarget); // Function GPGameplay.GPBattleFieldSystem.LiveSpectateAINext // (Final|Native|Public|BlueprintCallable) // @ game+0x35be620
	int64_t GetCurrentLocalPlayerUin(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalPlayerUin // (Final|Native|Public|BlueprintCallable) // @ game+0x35be290
	int32_t GetCurrentLocalPlayerTeamID(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalPlayerTeamID // (Final|Native|Public|BlueprintCallable) // @ game+0x35be260
	struct AGPCharacterBase* GetCurrentLocalPlayerPawn(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalPlayerPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x35be240
	struct UGPPlayerInput* GetCurrentLocalPlayerInput(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalPlayerInput // (Final|Native|Public|BlueprintCallable) // @ game+0x35be210
	int32_t GetCurrentLocalPlayerInnerTeamIndex(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalPlayerInnerTeamIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x35be1e0
	struct AGPNetworkPlayerController* GetCurrentLocalPlayerController(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalPlayerController // (Final|Native|Public|BlueprintCallable) // @ game+0x35be1c0
	struct AGPCharacterBase* GetCurrentLocalFocusPlayerPawn(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalFocusPlayerPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x89b010
	struct AGPCharacterBase* GetCurrentLocalFocusGPCharacter(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalFocusGPCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x35be1a0
	struct AActor* GetCurrentLocalFocusActor(); // Function GPGameplay.GPBattleFieldSystem.GetCurrentLocalFocusActor // (Final|Native|Public|BlueprintCallable) // @ game+0x35be180
	struct UGPBattleFieldSystem* STATIC_Get(struct UObject* WorldContextObject); // Function GPGameplay.GPBattleFieldSystem.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35bde80
	struct AActor* FilterLocalFocusActorFromViewTarget(struct AGPNetworkPlayerController* InPlayerController, struct AGPCharacterBase* InPlayerPawn, struct AActor* InViewTarget); // Function GPGameplay.GPBattleFieldSystem.FilterLocalFocusActorFromViewTarget // (Native|Public|BlueprintCallable) // @ game+0x35bdd70
	struct AActor* FilterLocalFocusActorFromPlayer(struct AGPNetworkPlayerController* InPlayerController, struct AGPCharacterBase* InPlayerPawn); // Function GPGameplay.GPBattleFieldSystem.FilterLocalFocusActorFromPlayer // (Native|Public|BlueprintCallable) // @ game+0x35bdca0
	void ClientTestSpectateTargetActor(struct AActor* Target); // Function GPGameplay.GPBattleFieldSystem.ClientTestSpectateTargetActor // (Final|Native|Public|BlueprintCallable) // @ game+0x35bdb50
	void ClientTestResetSpectate(); // Function GPGameplay.GPBattleFieldSystem.ClientTestResetSpectate // (Final|Native|Public|BlueprintCallable) // @ game+0x35bdb30
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCameraComponent
// Size: 0xc20 (Inherited: 0xc10)
class UGPCameraComponent : public UCameraComponent {
public:

	char bUseGlobalControlRotation : 1; // 0xc10(0x01)
	char pad_C10_1 : 7; // 0xc10(0x01)
	char pad_C11[0xf]; // 0xc11(0x0f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCampInfoUtil
// Size: 0x30 (Inherited: 0x30)
class UGPCampInfoUtil : public UObject {
public:


	void STATIC_ServerSetCampTypeAndTeamID(struct AActor* Source, enum class ECampType CampType, int32_t TeamId); // Function GPGameplay.GPCampInfoUtil.ServerSetCampTypeAndTeamID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35c8cc0
	bool STATIC_IsTeammate(struct AActor* Source, struct AActor* Target); // Function GPGameplay.GPCampInfoUtil.IsTeammate // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35c66e0
	bool STATIC_IsNeutralCamp(struct AActor* Source); // Function GPGameplay.GPCampInfoUtil.IsNeutralCamp // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35c65a0
	bool STATIC_GetTeamInfoByTeamId(struct UObject* WorldContext, int32_t TeamId, struct FTeamInfo& InTeamInfo); // Function GPGameplay.GPCampInfoUtil.GetTeamInfoByTeamId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x35c5f00
	bool STATIC_GetTeamInfo(struct AActor* Source, struct FTeamInfo& InTeamInfo); // Function GPGameplay.GPCampInfoUtil.GetTeamInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x35c5d80
	int32_t STATIC_GetTeamID(struct AActor* Source); // Function GPGameplay.GPCampInfoUtil.GetTeamID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35c5d00
	enum class ECampType STATIC_GetCampType(struct AActor* Source); // Function GPGameplay.GPCampInfoUtil.GetCampType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35c5480
	bool STATIC_GetCampInfo(struct AActor* Source, struct FCampInfo& InCampInfo); // Function GPGameplay.GPCampInfoUtil.GetCampInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x35c52e0
	void STATIC_GatherCampMembers(struct AActor* Source, struct TArray<struct FTeamMemberInfo>& members); // Function GPGameplay.GPCampInfoUtil.GatherCampMembers // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x35c50c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCapsuleComponent
// Size: 0x590 (Inherited: 0x588)
class UGPCapsuleComponent : public UCapsuleComponent {
public:

	bool NotUpdateOverlapsWhenCollisionSettingsChanged; // 0x588(0x01)
	char pad_589[0x7]; // 0x589(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterAudioConfig
// Size: 0x90 (Inherited: 0x38)
class UGPCharacterAudioConfig : public UWorldSubsystem {
public:

	struct TMap<int64_t, struct UDataTable*> ExpertVoiceDataTable; // 0x38(0x50)
	char pad_88[0x8]; // 0x88(0x08)

	struct UDataTable* GetExpertVoiceDataTable(int64_t ExpertId); // Function GPGameplay.GPCharacterAudioConfig.GetExpertVoiceDataTable // (Final|Native|Public|BlueprintCallable) // @ game+0x35d0c40
	struct UGPCharacterAudioConfig* STATIC_Get(struct UObject* WorldContextObject); // Function GPGameplay.GPCharacterAudioConfig.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d0800
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterAudioProxy
// Size: 0x30 (Inherited: 0x30)
class UGPCharacterAudioProxy : public UBlueprintFunctionLibrary {
public:


	void STATIC_WantRandomCharacterSpeak(struct UObject* WorldContext, struct FString AudioTypeString); // Function GPGameplay.GPCharacterAudioProxy.WantRandomCharacterSpeak // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d8520
	void STATIC_WantCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPCharacterAudioProxy.WantCharacterSpeak // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d83d0
	void STATIC_UpdateNextTriggerAICrackTime(struct AActor* inActor); // Function GPGameplay.GPCharacterAudioProxy.UpdateNextTriggerAICrackTime // (Final|Native|Static|Public) // @ game+0x35d82c0
	void STATIC_StopCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPCharacterAudioProxy.StopCharacterSpeak // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d76c0
	void STATIC_SetLastFootstepPlayTime(struct AGPCharacter* InCharacter, float InTime); // Function GPGameplay.GPCharacterAudioProxy.SetLastFootstepPlayTime // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d6d70
	void STATIC_ServerWantCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPCharacterAudioProxy.ServerWantCharacterSpeak // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d6600
	void STATIC_ServerStopCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPCharacterAudioProxy.ServerStopCharacterSpeak // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d64b0
	void STATIC_ServerPlayLandedFootstep(struct AActor* inActor, float FallHeight); // Function GPGameplay.GPCharacterAudioProxy.ServerPlayLandedFootstep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d60f0
	void STATIC_ServerPlayJumpFootstep(struct AActor* inActor); // Function GPGameplay.GPCharacterAudioProxy.ServerPlayJumpFootstep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d6080
	void STATIC_ScaleWeaponFireAttenuationScale(struct AGPCharacter* TargetCharacter, float AttenuationScalar); // Function GPGameplay.GPCharacterAudioProxy.ScaleWeaponFireAttenuationScale // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d5910
	void STATIC_ScaleCrouchFootsteps(struct AGPCharacter* TargetCharacter, bool bScale, float AttenuationScalar, float VolumeScalar); // Function GPGameplay.GPCharacterAudioProxy.ScaleCrouchFootsteps // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d57d0
	void STATIC_RequestOutdoorObstruction(struct AGPCharacterBase* InCharacter, enum class EGPAudioBlueprintType InReason, float LastTime); // Function GPGameplay.GPCharacterAudioProxy.RequestOutdoorObstruction // (Final|Native|Static|Public) // @ game+0x35d56e0
	void STATIC_RequestFakeFootstep(struct AGPCharacter* InCharacter, enum class EFakeFootstepReason InReason, bool bRequest); // Function GPGameplay.GPCharacterAudioProxy.RequestFakeFootstep // (Final|Native|Static|Public) // @ game+0x35d55e0
	void STATIC_RegisterCharacterVOService(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.RegisterCharacterVOService // (Final|Native|Static|Public) // @ game+0x35d5550
	void STATIC_PlayFPPFootStep(struct AActor* inActor, bool bIsLeftFootstep); // Function GPGameplay.GPCharacterAudioProxy.PlayFPPFootStep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d3770
	void STATIC_PlayFootstep(struct AActor* inActor, enum class EGPAudioFootSoundType AudioType, struct UPhysicalMaterial* PhysMat, struct UPhysicalMaterialAudioDataAsset* BindConfig, bool bForceUseAudioType); // Function GPGameplay.GPCharacterAudioProxy.PlayFootstep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d3db0
	void STATIC_PlayCharacterTurningAudio(struct AGPCharacterBase* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.PlayCharacterTurningAudio // (Final|Native|Static|Public) // @ game+0x35d3430
	void STATIC_PlayAutonomousLandedFootstep(struct AGPCharacter* InCharacter, float FallHeight, bool bIsFallHigh); // Function GPGameplay.GPCharacterAudioProxy.PlayAutonomousLandedFootstep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d3330
	void STATIC_PlayAutonomousJumpFootstep(struct AGPCharacter* InCharacter, bool bIsJumpHigh); // Function GPGameplay.GPCharacterAudioProxy.PlayAutonomousJumpFootstep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d3270
	void STATIC_NotifySoundVisualizationWithNoRealActor(struct UObject* WorldContext, enum class ESoundVisualizationType EventType, struct FVector SoundLocation); // Function GPGameplay.GPCharacterAudioProxy.NotifySoundVisualizationWithNoRealActor // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35d2c80
	void STATIC_NotifySoundVisualizationWithAudioTypeName(struct AActor* SourceActor, struct AActor* ActorToBlame, struct FName& AudioTypeName, struct FVector SoundLocation); // Function GPGameplay.GPCharacterAudioProxy.NotifySoundVisualizationWithAudioTypeName // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x35d2b20
	void STATIC_NotifySoundVisualizationWithAudioTypeEnum(struct AActor* SourceActor, struct AActor* ActorToBlame, enum class EGPAudioBlueprintType EType, struct FVector SoundLocation); // Function GPGameplay.GPCharacterAudioProxy.NotifySoundVisualizationWithAudioTypeEnum // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35d29e0
	void STATIC_NotifySoundVisualization(struct AActor* SourceActor, struct AActor* ActorToBlame, enum class ESoundVisualizationType EventType, struct FVector SoundLocation); // Function GPGameplay.GPCharacterAudioProxy.NotifySoundVisualization // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35d28a0
	void STATIC_NotifyFootStepSoundVisualization(struct AActor* SourceActor, struct AActor* ActorToBlame, enum class EGPAudioFootSoundType FootSoundType, struct FVector SoundLocation); // Function GPGameplay.GPCharacterAudioProxy.NotifyFootStepSoundVisualization // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x35d26e0
	void STATIC_NotifyCharacterPlayFootstepWithAnim(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.NotifyCharacterPlayFootstepWithAnim // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d2670
	void STATIC_NotifyCharacterAnimLODChanged(struct AGPCharacter* InCharacter, int32_t NewLOD); // Function GPGameplay.GPCharacterAudioProxy.NotifyCharacterAnimLODChanged // (Final|Native|Static|Public) // @ game+0x35d25c0
	void STATIC_LocalCharacterStateAudioChanged(struct AGPCharacter* LocalCharacter, enum class EStateAudioEventType StateAudioType, bool bEnterState); // Function GPGameplay.GPCharacterAudioProxy.LocalCharacterStateAudioChanged // (Final|Native|Static|Public) // @ game+0x35d2190
	bool STATIC_GetUseSoftCoverBushAudio(); // Function GPGameplay.GPCharacterAudioProxy.GetUseSoftCoverBushAudio // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d1470
	float STATIC_GetRandomFlybyTriggerCD(struct AActor* inActor); // Function GPGameplay.GPCharacterAudioProxy.GetRandomFlybyTriggerCD // (Final|Native|Static|Public) // @ game+0x35d1180
	float STATIC_GetLastFootstepPlayTime(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.GetLastFootstepPlayTime // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d10c0
	enum class EGPAudioFootSoundType STATIC_GetLandedSoundType(struct AActor* inActor, float FallHeight); // Function GPGameplay.GPCharacterAudioProxy.GetLandedSoundType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d1000
	bool STATIC_GetIsInWater(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.GetIsInWater // (Final|Native|Static|Public) // @ game+0x35d0f80
	enum class EFakeFootstepStatus STATIC_GetFakeFootstepStatus(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.GetFakeFootstepStatus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d0cd0
	bool STATIC_GetEnableFootstepLog(); // Function GPGameplay.GPCharacterAudioProxy.GetEnableFootstepLog // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35d0c10
	float STATIC_GetCharacterVelocity(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.GetCharacterVelocity // (Final|Native|Static|Public) // @ game+0x35d0af0
	struct FVector STATIC_GetCharacterLocation(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.GetCharacterLocation // (Final|Native|Static|Public|HasDefaults) // @ game+0x35d0a60
	void STATIC_DeregisterCharacterVOService(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.DeregisterCharacterVOService // (Final|Native|Static|Public) // @ game+0x35d0440
	bool STATIC_CheckUseFakeFootstep(struct AGPCharacter* InCharacter); // Function GPGameplay.GPCharacterAudioProxy.CheckUseFakeFootstep // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35cff90
	bool STATIC_CheckSatisfiedFootstepIntervalWithState(struct AGPCharacter* InCharacter, float CurrentTime); // Function GPGameplay.GPCharacterAudioProxy.CheckSatisfiedFootstepIntervalWithState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35cfed0
	bool STATIC_CheckSatisfiedFootstepInterval(struct AGPCharacter* InCharacter, float CurrentTime, float TimeScalar); // Function GPGameplay.GPCharacterAudioProxy.CheckSatisfiedFootstepInterval // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35cfde0
	bool STATIC_CheckCurrentTimeCanTriggerAICrack(struct AActor* inActor); // Function GPGameplay.GPCharacterAudioProxy.CheckCurrentTimeCanTriggerAICrack // (Final|Native|Static|Public) // @ game+0x35cfd60
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterBubbleComponent
// Size: 0x198 (Inherited: 0x100)
class UGPCharacterBubbleComponent : public UActorComponent {
public:

	char bInLowAmmo : 1; // 0x100(0x01)
	char bInLowHealth : 1; // 0x100(0x01)
	char bIsDead : 1; // 0x100(0x01)
	char pad_100_3 : 5; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float LowHealthPercent; // 0x104(0x04)
	float LowAmmoPercent; // 0x108(0x04)
	float BubbleShowRange; // 0x10c(0x04)
	char pad_110[0x10]; // 0x110(0x10)
	struct TWeakObjectPtr<struct AGPMarkerManager> MarkerManager; // 0x120(0x08)
	struct TWeakObjectPtr<struct AGPCharacter> LocalChar; // 0x128(0x08)
	/*struct TSoftObjectPtr<AGPCharacter>*/char ClientLockTarget[0x28]; // 0x130(0x28)
	/*struct TSoftObjectPtr<AGPCharacter>*/char LockTarget[0x28]; // 0x158(0x28)
	bool bRecived; // 0x180(0x01)
	bool bUsed; // 0x181(0x01)
	char pad_182[0x2]; // 0x182(0x02)
	int32_t LastAddAmmo; // 0x184(0x04)
	struct UClass* Bullet; // 0x188(0x08)
	char pad_190[0x8]; // 0x190(0x08)

	void OnRep_StateChange(); // Function GPGameplay.GPCharacterBubbleComponent.OnRep_StateChange // (Final|Native|Public) // @ game+0x35dbe70
	void OnRep_DeadStateChange(); // Function GPGameplay.GPCharacterBubbleComponent.OnRep_DeadStateChange // (Final|Native|Public) // @ game+0x35dbe50
	void OnHealthChange(struct AActor* Owner, int32_t CurrentValue, int32_t MaxValue); // Function GPGameplay.GPCharacterBubbleComponent.OnHealthChange // (Final|Native|Public) // @ game+0x35dbd50
	void OnCharacterAmmoCountChange(struct AWeaponBase* Weapon, float WeaponAmmoCount, float CarryWeaponAmmoCount); // Function GPGameplay.GPCharacterBubbleComponent.OnCharacterAmmoCountChange // (Final|Native|Public) // @ game+0x35dbc50
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterCarryComponent
// Size: 0x100 (Inherited: 0x100)
class UGPCharacterCarryComponent : public UActorComponent {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterCommonInterface
// Size: 0x30 (Inherited: 0x30)
class UGPCharacterCommonInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterMovementSpeedBaselineDataAsset
// Size: 0xc0 (Inherited: 0x38)
class UGPCharacterMovementSpeedBaselineDataAsset : public UDataAsset {
public:

	struct FString Description; // 0x38(0x10)
	float StandStrafeSpeedScale; // 0x48(0x04)
	float StandBackwardSpeedScale; // 0x4c(0x04)
	float StandSilentWalkStrafeSpeedScale; // 0x50(0x04)
	float StandSilentWalkBackwardSpeedScale; // 0x54(0x04)
	float CrouchRunStrafeSpeedScale; // 0x58(0x04)
	float CrouchRunBackwardSpeedScale; // 0x5c(0x04)
	float CrouchSilentWalkStrafeSpeedScale; // 0x60(0x04)
	float CrouchSilentWalkBackwardSpeedScale; // 0x64(0x04)
	float ProneStrafeSpeedScale; // 0x68(0x04)
	float ProneBackwardSpeedScale; // 0x6c(0x04)
	float StandSprintSpeedMax; // 0x70(0x04)
	float StandMoveSpeedMax; // 0x74(0x04)
	float StandMoveSpeedMin; // 0x78(0x04)
	float CrouchMoveSpeedMax; // 0x7c(0x04)
	float CrouchMoveSpeedMin; // 0x80(0x04)
	float ProneMoveSpeedMax; // 0x84(0x04)
	float ProneMoveSpeedMin; // 0x88(0x04)
	float FallMoveSpeedMax; // 0x8c(0x04)
	float FallMoveSpeedMin; // 0x90(0x04)
	float WeakBasicSpeed; // 0x94(0x04)
	float LeisureSpeed; // 0x98(0x04)
	float AlertSpeed; // 0x9c(0x04)
	float AlertTrottSpeed; // 0xa0(0x04)
	float StandHalfSquatWalkSpeed; // 0xa4(0x04)
	float StandHalfSquatWalkStrafeSpeedScale; // 0xa8(0x04)
	float StandHalfSquatWalkBackwardSpeedScale; // 0xac(0x04)
	float CrouchHalfSquatWalkSpeed; // 0xb0(0x04)
	float CrouchHalfSquatWalkStrafeSpeedScale; // 0xb4(0x04)
	float CrouchHalfSquatWalkBackwardSpeedScale; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPAICharacterMovementSpeedDataAsset
// Size: 0x88 (Inherited: 0x38)
class UGPAICharacterMovementSpeedDataAsset : public UDataAsset {
public:

	float LeisurePatrolSpeed; // 0x38(0x04)
	float AlertWalkSpeed; // 0x3c(0x04)
	float AlertWalkLeftwardSpeed; // 0x40(0x04)
	float AlertWalkRightwardSpeed; // 0x44(0x04)
	float AlertWalkBackwardSpeed; // 0x48(0x04)
	float AlertTrottSpeed; // 0x4c(0x04)
	float AlertSprintSpeed; // 0x50(0x04)
	float FightCrouchSpeed; // 0x54(0x04)
	float FightCrouchLeftwardSpeed; // 0x58(0x04)
	float FightCrouchRightwardSpeed; // 0x5c(0x04)
	float FightCrouchBackwardSpeed; // 0x60(0x04)
	float FightWalkSpeed; // 0x64(0x04)
	float FightWalkLeftwardSpeed; // 0x68(0x04)
	float FightWalkRightwardSpeed; // 0x6c(0x04)
	float FightWalkBackwardSpeed; // 0x70(0x04)
	float FightRunSpeed; // 0x74(0x04)
	float FightRunLeftwardSpeed; // 0x78(0x04)
	float FightRunRightwardSpeed; // 0x7c(0x04)
	float FightRunBackwardSpeed; // 0x80(0x04)
	float FightSprintSpeed; // 0x84(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterMovementLimitDataAsset
// Size: 0x48 (Inherited: 0x38)
class UGPCharacterMovementLimitDataAsset : public UDataAsset {
public:

	float SpeedLimitFactor; // 0x38(0x04)
	bool DisabledStandSilentWalk; // 0x3c(0x01)
	bool DisabledStandRun; // 0x3d(0x01)
	bool DisabledStandSprint; // 0x3e(0x01)
	bool DisabledCrouchSilentWalk; // 0x3f(0x01)
	bool DisabledCrouchRun; // 0x40(0x01)
	bool DisabledProneSilentWalk; // 0x41(0x01)
	bool DisabledProneRun; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterDetectEffectComponent
// Size: 0x108 (Inherited: 0x100)
class UGPCharacterDetectEffectComponent : public UActorComponent {
public:

	bool bShowMarker; // 0x100(0x01)
	bool bInMarkerLst; // 0x101(0x01)
	char pad_102[0x6]; // 0x102(0x06)

	void SupportPackSim(struct AActor* From, struct AActor* To); // Function GPGameplay.GPCharacterDetectEffectComponent.SupportPackSim // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x35dfd20
	void SetDetectMarkerEnable(bool bEnable); // Function GPGameplay.GPCharacterDetectEffectComponent.SetDetectMarkerEnable // (Final|Native|Public) // @ game+0x35df710
	void SetDetectLstEnable(bool bEnable); // Function GPGameplay.GPCharacterDetectEffectComponent.SetDetectLstEnable // (Final|Native|Public) // @ game+0x35df680
	void OnRep_bShowMarker(); // Function GPGameplay.GPCharacterDetectEffectComponent.OnRep_bShowMarker // (Final|Native|Public) // @ game+0x35df460
	void OnRep_bInMarkerLst(); // Function GPGameplay.GPCharacterDetectEffectComponent.OnRep_bInMarkerLst // (Final|Native|Public) // @ game+0x35df440
	void ClientSetDetectLstEnable(bool bEnable); // Function GPGameplay.GPCharacterDetectEffectComponent.ClientSetDetectLstEnable // (Final|Native|Public) // @ game+0x35de210
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterMovementConfig
// Size: 0x68 (Inherited: 0x30)
class UGPCharacterMovementConfig : public UObject {
public:

	bool DsUseClientPassObstacleType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float TimeToAdjustWhenCollisionBetweenCS; // 0x34(0x04)
	float DsMaxAllowedDirectMoveAdjustSpeed; // 0x38(0x04)
	float DsMaxAllowedDirectSetAdjustFrequency; // 0x3c(0x04)
	float DsMaxAllowedDirectSetAdjustSpeed; // 0x40(0x04)
	float DsMaxAllowedDirectSetAdjustDistance; // 0x44(0x04)
	bool DsAllowDirectUseClientLocation; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct TArray<uint64_t> PlayerWhiteList; // 0x50(0x10)
	bool DsTrustClientLocationAfterPhys; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterSkillInterface
// Size: 0x30 (Inherited: 0x30)
class UGPCharacterSkillInterface : public UInterface {
public:


	void SetSkillControlActor(struct AActor* Actor); // Function GPGameplay.GPCharacterSkillInterface.SetSkillControlActor // (Native|Public) // @ game+0x89f670
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterVehicleInterface
// Size: 0x30 (Inherited: 0x30)
class UGPCharacterVehicleInterface : public UInterface {
public:


	void StartBoom(); // Function GPGameplay.GPCharacterVehicleInterface.StartBoom // (Native|Public) // @ game+0x174a9e0
	void SetStingerMissileCanLock(bool can); // Function GPGameplay.GPCharacterVehicleInterface.SetStingerMissileCanLock // (Native|Public) // @ game+0x174b2d0
	void SetAbilityOffControlledVehicle(struct AActor* Actor); // Function GPGameplay.GPCharacterVehicleInterface.SetAbilityOffControlledVehicle // (Native|Public) // @ game+0x92e650
	void SetAbilityControlledVehicle(struct AActor* Actor); // Function GPGameplay.GPCharacterVehicleInterface.SetAbilityControlledVehicle // (Native|Public) // @ game+0x89f670
	void RetriveItems(); // Function GPGameplay.GPCharacterVehicleInterface.RetriveItems // (Native|Public) // @ game+0x174af80
	bool IsVehicleOperate(); // Function GPGameplay.GPCharacterVehicleInterface.IsVehicleOperate // (Native|Public) // @ game+0x17614f0
	bool IsVehicleDestroy(); // Function GPGameplay.GPCharacterVehicleInterface.IsVehicleDestroy // (Native|Public) // @ game+0x174ea60
	bool IsOperateControlledVehicle(); // Function GPGameplay.GPCharacterVehicleInterface.IsOperateControlledVehicle // (Native|Public) // @ game+0x174e640
	bool IsAbilityControlledVehicle(); // Function GPGameplay.GPCharacterVehicleInterface.IsAbilityControlledVehicle // (Native|Public) // @ game+0x92e3d0
	bool GetStingerMissileCanLock(); // Function GPGameplay.GPCharacterVehicleInterface.GetStingerMissileCanLock // (Native|Public) // @ game+0x1755340
	void GetOffAbilityVehicle(); // Function GPGameplay.GPCharacterVehicleInterface.GetOffAbilityVehicle // (Native|Public) // @ game+0x174a9a0
	int32_t GetCharacterPlayerId(); // Function GPGameplay.GPCharacterVehicleInterface.GetCharacterPlayerId // (Native|Public) // @ game+0x35e3e40
	struct AActor* GetAbilityOffControlledVehicle(); // Function GPGameplay.GPCharacterVehicleInterface.GetAbilityOffControlledVehicle // (Native|Public) // @ game+0x174a5a0
	struct AActor* GetAbilityControlledVehicle(); // Function GPGameplay.GPCharacterVehicleInterface.GetAbilityControlledVehicle // (Native|Public) // @ game+0xaa1400
	void CureVehicle(); // Function GPGameplay.GPCharacterVehicleInterface.CureVehicle // (Native|Public) // @ game+0x174aa00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterVoiceComponent
// Size: 0x1e0 (Inherited: 0x100)
class UGPCharacterVoiceComponent : public UActorComponent {
public:

	struct TMap<enum class EStateAudioEventType, struct FCharacterStateAudioEventConfig> StateAudioEventConfigMap; // 0x100(0x50)
	char pad_150[0x14]; // 0x150(0x14)
	int32_t SprintBreathFootstepInterval; // 0x164(0x04)
	int32_t CrouchBreathFootstepInterval; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct FString PlayerStateGroupName; // 0x170(0x10)
	char pad_180[0x10]; // 0x180(0x10)
	struct AGPCharacter* GPCharacter; // 0x190(0x08)
	char pad_198[0x30]; // 0x198(0x30)
	struct TArray<struct UGPAudioEventAsset*> AudioAssetCache; // 0x1c8(0x10)
	char pad_1D8[0x8]; // 0x1d8(0x08)

	void WantCharacterSpeakWithName(struct FString AudioTypeString); // Function GPGameplay.GPCharacterVoiceComponent.WantCharacterSpeakWithName // (Final|Native|Public|BlueprintCallable) // @ game+0x35e5ac0
	void WantCharacterSpeak(enum class ECharacterAudioType AudioType); // Function GPGameplay.GPCharacterVoiceComponent.WantCharacterSpeak // (Final|Native|Public|BlueprintCallable) // @ game+0x35e5a40
	void StopCharacterSpeakWithName(struct FString AudioTypeString); // Function GPGameplay.GPCharacterVoiceComponent.StopCharacterSpeakWithName // (Final|Native|Public|BlueprintCallable) // @ game+0x35e5ac0
	void StopCharacterSpeak(enum class ECharacterAudioType AudioType); // Function GPGameplay.GPCharacterVoiceComponent.StopCharacterSpeak // (Final|Native|Public|BlueprintCallable) // @ game+0x35e5a40
	void OnHeroIdChanged(uint64_t HeroID); // Function GPGameplay.GPCharacterVoiceComponent.OnHeroIdChanged // (Final|Native|Public) // @ game+0x2279c80
	void OnAvatarIdChanged(uint64_t AvatarID); // Function GPGameplay.GPCharacterVoiceComponent.OnAvatarIdChanged // (Final|Native|Public) // @ game+0x35e4440
	void CharacterStateAudioChanged(enum class EStateAudioEventType StateAudioType, bool bEnterState); // Function GPGameplay.GPCharacterVoiceComponent.CharacterStateAudioChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x35e3970
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCheatManager
// Size: 0x80 (Inherited: 0x80)
class UGPCheatManager : public UCheatManager {
public:


	void ShowSceneDebug(); // Function GPGameplay.GPCheatManager.ShowSceneDebug // (Final|Exec|Native|Public) // @ game+0x35e5a20
	void RelativeTeleport(struct FVector Disp); // Function GPGameplay.GPCheatManager.RelativeTeleport // (Final|Exec|Native|Public|HasDefaults) // @ game+0x35e55d0
	void PlayTwoHandedGesture(struct FName ResId); // Function GPGameplay.GPCheatManager.PlayTwoHandedGesture // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e4d50
	void PlayOneHandedGesture(struct FName ResId); // Function GPGameplay.GPCheatManager.PlayOneHandedGesture // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e4cd0
	void PlayCharacterVoice(struct FName ResId); // Function GPGameplay.GPCheatManager.PlayCharacterVoice // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e4c50
	void NextDebugTargetAI(); // Function GPGameplay.GPCheatManager.NextDebugTargetAI // (Final|Exec|Native|Public) // @ game+0x35e4320
	void GiveWeaponByRec(int64_t RecID, int32_t EquipPosition); // Function GPGameplay.GPCheatManager.GiveWeaponByRec // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e4070
	void GiveWeapon(int64_t PresetId, int32_t EquipPosition); // Function GPGameplay.GPCheatManager.GiveWeapon // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e3fb0
	void EnableDamageValidation(bool bEnable, bool bDebug); // Function GPGameplay.GPCheatManager.EnableDamageValidation // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e3c60
	void ApplySpray(struct FName ResId); // Function GPGameplay.GPCheatManager.ApplySpray // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x35e38f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPClientSeamlessTravel
// Size: 0x1a8 (Inherited: 0x38)
class UGPClientSeamlessTravel : public UGameInstanceSubsystem {
public:

	char pad_38[0x140]; // 0x38(0x140)
	struct UClass* NextLSConfig; // 0x178(0x08)
	char pad_180[0x28]; // 0x180(0x28)

	void WaitStreamingComplete(struct UObject* WorldContext); // Function GPGameplay.GPClientSeamlessTravel.WaitStreamingComplete // (Final|Native|Protected) // @ game+0x35e5eb0
	void SwitchToDSClientPlayerInner(struct UObject* WorldContext); // Function GPGameplay.GPClientSeamlessTravel.SwitchToDSClientPlayerInner // (Final|Native|Protected) // @ game+0x35e5c60
	void SwitchToDSClientPlayer(struct UObject* WorldContext); // Function GPGameplay.GPClientSeamlessTravel.SwitchToDSClientPlayer // (Final|Native|Protected) // @ game+0x35e5be0
	void OnPostLeaveGameFlow(enum class EGameFlowStageType InGameFlowStage); // Function GPGameplay.GPClientSeamlessTravel.OnPostLeaveGameFlow // (Final|Native|Protected) // @ game+0x35e4b30
	void OnPostEnterGameFlow(enum class EGameFlowStageType InGameFlowStage); // Function GPGameplay.GPClientSeamlessTravel.OnPostEnterGameFlow // (Final|Native|Protected) // @ game+0x35e4ab0
	void OnPostConnectDS(struct UNetConnection* InNetConnection); // Function GPGameplay.GPClientSeamlessTravel.OnPostConnectDS // (Final|Native|Protected) // @ game+0x35e4a30
	void OnNetDriverShutdown(struct UNetDriver* NetDriver); // Function GPGameplay.GPClientSeamlessTravel.OnNetDriverShutdown // (Final|Native|Protected) // @ game+0x35e48d0
	void OnDSConnected(struct UNetConnection* InNetConnection); // Function GPGameplay.GPClientSeamlessTravel.OnDSConnected // (Final|Native|Protected) // @ game+0x35e4620
	void OnActorSpawned(struct AActor* NewActor); // Function GPGameplay.GPClientSeamlessTravel.OnActorSpawned // (Final|Native|Protected) // @ game+0x35e43c0
	void OnActorChannelSpawnNewPC(struct APlayerController* NewPC); // Function GPGameplay.GPClientSeamlessTravel.OnActorChannelSpawnNewPC // (Final|Native|Protected) // @ game+0x35e4340
	bool STATIC_IsInSeamlessTravel(); // Function GPGameplay.GPClientSeamlessTravel.IsInSeamlessTravel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35e4260
	struct UGPClientSeamlessTravel* STATIC_Get(struct UWorld* WordContext); // Function GPGameplay.GPClientSeamlessTravel.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35e3dc0
	void ClassAddSeamlessFlag(struct UClass* InClass, enum class ESeamlessFlag InFlag); // Function GPGameplay.GPClientSeamlessTravel.ClassAddSeamlessFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x35e3a40
	void ActorAddSeamlessFlag(struct AActor* inActor, enum class ESeamlessFlag InFlag); // Function GPGameplay.GPClientSeamlessTravel.ActorAddSeamlessFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x35e3830
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPComBoardComponent
// Size: 0x530 (Inherited: 0x100)
class UGPComBoardComponent : public UActorComponent {
public:

	char pad_100[0x10]; // 0x100(0x10)
	struct FGPLocomotionJumpInfo JumpInfo; // 0x110(0x30)
	struct UCapsuleComponent* ProneCapsuleCollisionComponent; // 0x140(0x08)
	struct UCurveFloat* StandToProneSpeedAddCurve; // 0x148(0x08)
	char LeanPeekAnimTypeValueRep; // 0x150(0x01)
	char pad_151[0xf]; // 0x151(0x0f)
	struct FGPZiplineInfo ZiplineInfo; // 0x160(0xa0)
	struct FGPZiplineActorInfo ZiplineActorInfo; // 0x200(0xc0)
	struct FGPZiplineActorInfo ServerZiplineActorInfo; // 0x2c0(0xc0)
	struct FGPZiplineSimulatedInfo ZiplineSimulatedInfo; // 0x380(0x40)
	struct AZiplineDraftGear* DraftGearActor; // 0x3c0(0x08)
	float ValidationDistance; // 0x3c8(0x04)
	char pad_3CC[0x1c]; // 0x3cc(0x1c)
	struct FGPRadarCheckParams RadarCheckParams; // 0x3e8(0x18)
	char pad_400[0x4]; // 0x400(0x04)
	bool bHideMySelf; // 0x404(0x01)
	char pad_405[0x3]; // 0x405(0x03)
	struct TArray<uint32_t> HiddenCharacterGUIDs; // 0x408(0x10)
	char pad_418[0x10]; // 0x418(0x10)
	bool bTouchBush; // 0x428(0x01)
	bool bBehindSoftCover; // 0x429(0x01)
	char pad_42A[0x6]; // 0x42a(0x06)
	struct FResourceCommercializationItem ZoyaSwarmsAnim; // 0x430(0x100)

	void UpdateSimulatedZiplineInfo(struct FGPZiplineSimulatedInfo InSimulatedInfo); // Function GPGameplay.GPComBoardComponent.UpdateSimulatedZiplineInfo // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x35e5df0
	void SyncZiplineInfoToClient(struct FGPZiplineActorInfo InZiplineInfo); // Function GPGameplay.GPComBoardComponent.SyncZiplineInfoToClient // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x35e5ce0
	void ServerGetOnZipline(struct FGPZiplineActorInfo InZiplineInfo); // Function GPGameplay.GPComBoardComponent.ServerGetOnZipline // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x35e5890
	void ServerGetOffZipline(enum class EEndZiplineReason EndZiplineReason); // Function GPGameplay.GPComBoardComponent.ServerGetOffZipline // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x35e5810
	void SendClientMovedLengthToServer(float ClientMovedLength, struct FVector ServerLocation); // Function GPGameplay.GPComBoardComponent.SendClientMovedLengthToServer // (Net|Native|Event|Public|NetServer|HasDefaults) // @ game+0x35e5660
	void ReactivateZipline(); // Function GPGameplay.GPComBoardComponent.ReactivateZipline // (Final|Native|Public) // @ game+0x35e54c0
	void Radar_GetAllTypeActorsWithinDistance(struct UClass* ActorType, float Distance, struct TArray<struct AActor*>& OutActorArray); // Function GPGameplay.GPComBoardComponent.Radar_GetAllTypeActorsWithinDistance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35e5370
	void Radar_GetAllCharactersWithinDistance(float Distance, struct TArray<struct ACHARACTER*>& OutCharacterArray); // Function GPGameplay.GPComBoardComponent.Radar_GetAllCharactersWithinDistance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35e5250
	void Radar_CheckIsInViewport(struct AActor* inActor, bool& bInViewport, struct FVector2D& ViewportPosition, bool bForceUpdate); // Function GPGameplay.GPComBoardComponent.Radar_CheckIsInViewport // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x35e50e0
	void Radar_CheckCharacterVisibility(struct ACHARACTER* InCharacter, bool& bIsVisible, struct TArray<struct AActor*>& IgnoreActors, bool bForceUpdate); // Function GPGameplay.GPComBoardComponent.Radar_CheckCharacterVisibility // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35e4f20
	void Radar_CheckActorVisibility(struct AActor* inActor, bool& bIsVisible, bool bForceUpdate); // Function GPGameplay.GPComBoardComponent.Radar_CheckActorVisibility // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x35e4e10
	void ProcessZiplineExit(); // Function GPGameplay.GPComBoardComponent.ProcessZiplineExit // (Final|Native|Public) // @ game+0x35e4df0
	void ProcessZiplineCooldown(); // Function GPGameplay.GPComBoardComponent.ProcessZiplineCooldown // (Final|Native|Public) // @ game+0x35e4dd0
	void OnRep_TouchBushChanged(); // Function GPGameplay.GPComBoardComponent.OnRep_TouchBushChanged // (Final|Native|Public) // @ game+0x35e4c30
	void OnRep_SoftCoverStatusChanged(); // Function GPGameplay.GPComBoardComponent.OnRep_SoftCoverStatusChanged // (Final|Native|Public) // @ game+0x35e4c10
	void OnRep_ReceiveServerZiplineInfo(); // Function GPGameplay.GPComBoardComponent.OnRep_ReceiveServerZiplineInfo // (Final|Native|Public) // @ game+0x17621d0
	void OnRep_HideMyselfFromOthers(); // Function GPGameplay.GPComBoardComponent.OnRep_HideMyselfFromOthers // (Final|Native|Public) // @ game+0x35e4bf0
	void OnRep_HiddenCharacterGUIDs(); // Function GPGameplay.GPComBoardComponent.OnRep_HiddenCharacterGUIDs // (Final|Native|Public) // @ game+0x35e4bd0
	void OnCharacterLanded(float FallHeight, bool bIsFallHigh); // Function GPGameplay.GPComBoardComponent.OnCharacterLanded // (Final|Native|Public) // @ game+0x35e4550
	void OnCharacterJump(bool bIsJumpHigh); // Function GPGameplay.GPComBoardComponent.OnCharacterJump // (Final|Native|Public) // @ game+0x35e44c0
	bool IsMovableActor(struct AActor* Actor); // Function GPGameplay.GPComBoardComponent.IsMovableActor // (Native|Public) // @ game+0x35e4280
	bool IsDynamicObstacleActor(struct AActor* Actor); // Function GPGameplay.GPComBoardComponent.IsDynamicObstacleActor // (Native|Public) // @ game+0x35e41c0
	void HideMySelfFromOthers(bool bHide); // Function GPGameplay.GPComBoardComponent.HideMySelfFromOthers // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x35e4130
	void GMHideMySelfFromOthers(bool bHide); // Function GPGameplay.GPComBoardComponent.GMHideMySelfFromOthers // (Final|Native|Public|BlueprintCallable) // @ game+0x35e3d30
	void Client2ServerLeanPeekTypeValue(char PeekValue); // Function GPGameplay.GPComBoardComponent.Client2ServerLeanPeekTypeValue // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x35e3be0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCommercializationComponent
// Size: 0x478 (Inherited: 0x100)
class UGPCommercializationComponent : public UActorComponent {
public:

	struct FSoftObjectPath DefaultVoiceImage; // 0x100(0x18)
	struct FCommercializationWatchRow CachedWatchRow; // 0x118(0xc0)
	struct UMeshComponent* CachedWatchMeshComp; // 0x1d8(0x08)
	char pad_1E0[0x8]; // 0x1e0(0x08)
	struct FName LookWatchId; // 0x1e8(0x08)
	struct FName SkillMeshName; // 0x1f0(0x08)
	struct TArray<struct FCommercializationItemInfo> CommercializationItems; // 0x1f8(0x10)
	struct TMap<uint64_t, char> HeroItemMap; // 0x208(0x50)
	struct FName GeneralResourceId; // 0x258(0x08)
	char pad_260[0x4]; // 0x260(0x04)
	float DetectionLength; // 0x264(0x04)
	/*struct TSoftObjectPtr<UMaterialInstance>*/char SprayStatic[0x28]; // 0x268(0x28)
	/*struct TSoftObjectPtr<UMaterialInstance>*/char SprayDynamic[0x28]; // 0x290(0x28)
	struct FSprayPaint SprayPaint; // 0x2b8(0xe8)
	struct FSprayConfig SprayConfig; // 0x3a0(0x34)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct TMap<enum class ECommercializationResourceRarity, struct FDecalSizeSetting> DecalSizeSettings; // 0x3d8(0x50)
	struct TMap<struct FName, struct FShuffleList> ShuffleConfig; // 0x428(0x50)

	void Server2ClientsApplySpray(struct FSprayInfo SprayInfo); // Function GPGameplay.GPCommercializationComponent.Server2ClientsApplySpray // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x35e5730
	void RecordEmoteUsageData(int32_t ActionType, uint64_t ResourceId, uint32_t Rarity); // Function GPGameplay.GPCommercializationComponent.RecordEmoteUsageData // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x35e54e0
	void OnRep_CommercializationItems(); // Function GPGameplay.GPCommercializationComponent.OnRep_CommercializationItems // (Final|Native|Public) // @ game+0x35e4bb0
	void OnPossessedBy(); // Function GPGameplay.GPCommercializationComponent.OnPossessedBy // (Native|Public) // @ game+0x35e4a10
	void OnPlayerHeroIdChanged(uint64_t Uin, uint64_t HeroID); // Function GPGameplay.GPCommercializationComponent.OnPlayerHeroIdChanged // (Final|Native|Public) // @ game+0x35e4950
	void OnKillInfoNotify(struct TArray<struct FKillInfo>& NewAddKillInfo); // Function GPGameplay.GPCommercializationComponent.OnKillInfoNotify // (Final|Native|Public|HasOutParms) // @ game+0x35e46e0
	void OnItemsUpdated(); // Function GPGameplay.GPCommercializationComponent.OnItemsUpdated // (Final|Native|Public|BlueprintCallable) // @ game+0x35e46c0
	void OnEnterIrisSafeHouse(); // Function GPGameplay.GPCommercializationComponent.OnEnterIrisSafeHouse // (Final|Native|Public) // @ game+0x35e46a0
	void Client2ServerApplySpray(struct FSprayInfo SprayInfo); // Function GPGameplay.GPCommercializationComponent.Client2ServerApplySpray // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x35e3b00
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCommercializationItem
// Size: 0x4d0 (Inherited: 0x378)
class AGPCommercializationItem : public AActor {
public:

	char pad_378[0x10]; // 0x378(0x10)
	struct USkeletalMeshComponent* FPPMeshComp; // 0x388(0x08)
	struct USkeletalMeshComponent* TPPMeshComp; // 0x390(0x08)
	char pad_398[0x138]; // 0x398(0x138)

	void OnSprayPaintLoadCompleted(struct TArray<struct FSoftObjectPath> Paths); // Function GPGameplay.GPCommercializationItem.OnSprayPaintLoadCompleted // (Final|Native|Public) // @ game+0x35f11c0
	void OnItemLoadCompleted(struct TArray<struct FSoftObjectPath> Paths); // Function GPGameplay.GPCommercializationItem.OnItemLoadCompleted // (Final|Native|Public) // @ game+0x35f1030
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPControlInputInterface
// Size: 0x30 (Inherited: 0x30)
class UGPControlInputInterface : public UInterface {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPControllerAudioComponent
// Size: 0x200 (Inherited: 0x100)
class UGPControllerAudioComponent : public UActorComponent {
public:

	struct TMap<uint32_t, struct FCharacterSpeakStatus> CharacterSpeakStatusMap; // 0x100(0x50)
	char pad_150[0x28]; // 0x150(0x28)
	struct AGPPlayerController* OwnerController; // 0x178(0x08)
	char pad_180[0x1c]; // 0x180(0x1c)
	struct FName RadioRTPCName; // 0x19c(0x08)
	float TickVOInterval; // 0x1a4(0x04)
	float TickVOIntervalFor3P; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct TMap<uint32_t, struct FGPClippedWeaponFakeEventRecord> PlayerFakeEventRecords; // 0x1b0(0x50)

	void WantCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPControllerAudioComponent.WantCharacterSpeak // (Final|Native|Public) // @ game+0x35f23e0
	void StopCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPControllerAudioComponent.StopCharacterSpeak // (Final|Native|Public) // @ game+0x35f2150
	void ServerWantCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPControllerAudioComponent.ServerWantCharacterSpeak // (Final|Native|Public) // @ game+0x35f1c60
	void ServerStopPlayerVoice(uint32_t CharacterGUID, struct FString AudioTypeString); // Function GPGameplay.GPControllerAudioComponent.ServerStopPlayerVoice // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x35f1b60
	void ServerStopCharacterSpeak(struct AGPCharacter* InCharacter, struct FString AudioTypeString); // Function GPGameplay.GPControllerAudioComponent.ServerStopCharacterSpeak // (Final|Native|Public) // @ game+0x35f1a00
	void ServerRequestRegisterCharacterVOService(uint32_t CharacterGUID, uint64_t CharacterUin, uint64_t HeroID); // Function GPGameplay.GPControllerAudioComponent.ServerRequestRegisterCharacterVOService // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x35f1900
	void ServerRequestDeregisterCharacterVOService(uint32_t CharacterGUID); // Function GPGameplay.GPControllerAudioComponent.ServerRequestDeregisterCharacterVOService // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x35f1870
	void ServerRegisterCharacterVOService(struct AGPCharacter* InCharacter); // Function GPGameplay.GPControllerAudioComponent.ServerRegisterCharacterVOService // (Final|Native|Public) // @ game+0x35f17f0
	void ServerPlayPlayerVoice(uint32_t CharacterGUID, struct FString AudioTypeString, int32_t RandomIndex); // Function GPGameplay.GPControllerAudioComponent.ServerPlayPlayerVoice // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x35f16b0
	void ServerDeregisterCharacterVOService(struct AGPCharacter* InCharacter); // Function GPGameplay.GPControllerAudioComponent.ServerDeregisterCharacterVOService // (Final|Native|Public) // @ game+0x35f1630
	void OnTimerTriggered(uint32_t CharacterGUID); // Function GPGameplay.GPControllerAudioComponent.OnTimerTriggered // (Final|Native|Protected) // @ game+0x35f1350
	bool GetEnableCharacterVOService(); // Function GPGameplay.GPControllerAudioComponent.GetEnableCharacterVOService // (Final|Native|Protected) // @ game+0x35ef550
	void ClientWantRandomCharacterSpeak(struct FString AudioTypeString); // Function GPGameplay.GPControllerAudioComponent.ClientWantRandomCharacterSpeak // (Final|Native|Public) // @ game+0x35ef020
	void ClientStopPlayerVoice(uint32_t CharacterGUID, struct FString AudioTypeString, bool bRequestFromServer); // Function GPGameplay.GPControllerAudioComponent.ClientStopPlayerVoice // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x35eeed0
	void ClientRegisterCharacterVOService(struct AGPCharacter* InCharacter); // Function GPGameplay.GPControllerAudioComponent.ClientRegisterCharacterVOService // (Final|Native|Public) // @ game+0x35eee50
	void ClientPlayPlayerVoice(uint32_t CharacterGUID, uint64_t CharacterUin, uint64_t HeroID, struct FString AudioTypeString, bool bRequestFromServer, bool bTeammateWithListener, int32_t RandomIndex); // Function GPGameplay.GPControllerAudioComponent.ClientPlayPlayerVoice // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x35eec10
	void ClientDeregisterCharacterVOService(struct AGPCharacter* InCharacter); // Function GPGameplay.GPControllerAudioComponent.ClientDeregisterCharacterVOService // (Final|Native|Public) // @ game+0x35eeb90
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsDataTableManager
// Size: 0xa0 (Inherited: 0x38)
class UPartsDataTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x68]; // 0x38(0x68)

	struct FPartsDataRow GetPartDataRow(uint64_t ItemID, struct UObject* WorldContextObject); // Function GPGameplay.PartsDataTableManager.GetPartDataRow // (Final|Native|Public) // @ game+0x35eff20
	struct TArray<int64_t> GetAllPendantPartIDs(); // Function GPGameplay.PartsDataTableManager.GetAllPendantPartIDs // (Final|Native|Public) // @ game+0x35ef3a0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsRuleTableManager
// Size: 0xe8 (Inherited: 0x38)
class UPartsRuleTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0xb0]; // 0x38(0xb0)

	void GetRuleRows(uint32_t RuleId, struct TArray<struct FPartsRuleRow>& OutRuleList); // Function GPGameplay.PartsRuleTableManager.GetRuleRows // (Final|Native|Public|HasOutParms) // @ game+0x35f0630
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GunPresetTableManager
// Size: 0xb0 (Inherited: 0x38)
class UGunPresetTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x48]; // 0x38(0x48)
	uint64_t MaxItemID; // 0x80(0x08)
	struct TArray<struct FString> AllGunNames; // 0x88(0x10)
	char pad_98[0x18]; // 0x98(0x18)

	bool UpdateGunID(struct FText NewID, uint64_t OldID); // Function GPGameplay.GunPresetTableManager.UpdateGunID // (Final|Native|Public) // @ game+0x35f22b0
	void SortKey(); // Function GPGameplay.GunPresetTableManager.SortKey // (Final|Native|Public) // @ game+0x35f2130
	void SetRecPart(struct FText NewRec, uint64_t PresetId); // Function GPGameplay.GunPresetTableManager.SetRecPart // (Final|Native|Public) // @ game+0x35f1fb0
	void SetGunName(struct FText NewName, int32_t GunIndx, uint64_t PresetId); // Function GPGameplay.GunPresetTableManager.SetGunName // (Final|Native|Public) // @ game+0x35f1e40
	void RemoveRowByPresetId(uint64_t PresetId); // Function GPGameplay.GunPresetTableManager.RemoveRowByPresetId // (Final|Native|Public) // @ game+0x35f1510
	void RemoveRow(int32_t GunIndx, uint64_t PresetId); // Function GPGameplay.GunPresetTableManager.RemoveRow // (Final|Native|Public) // @ game+0x35f1450
	struct TArray<struct FGunPresetRow> GetGunsByWeaponId(uint64_t WeaponID); // Function GPGameplay.GunPresetTableManager.GetGunsByWeaponId // (Final|Native|Public) // @ game+0x35efcd0
	struct FGunPresetRow GetGunByItemId(uint64_t ItemID); // Function GPGameplay.GunPresetTableManager.GetGunByItemId // (Final|Native|Public) // @ game+0x35efc10
	struct FGunPresetRow GetGunByIndex(int32_t GunIndex); // Function GPGameplay.GunPresetTableManager.GetGunByIndex // (Final|Native|Public) // @ game+0x35efb50
	int32_t AddRow(struct FGunPresetRow NewRow); // Function GPGameplay.GunPresetTableManager.AddRow // (Final|Native|Public) // @ game+0x35ee6f0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GunPreviewTableManager
// Size: 0x50 (Inherited: 0x38)
class UGunPreviewTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x18]; // 0x38(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.MagazineDropTableManager
// Size: 0x1a0 (Inherited: 0x38)
class UMagazineDropTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x168]; // 0x38(0x168)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GunDescTableManager
// Size: 0x58 (Inherited: 0x38)
class UGunDescTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x20]; // 0x38(0x20)

	void SortKey(); // Function GPGameplay.GunDescTableManager.SortKey // (Final|Native|Public) // @ game+0x35f2110
	void RemoveRows(uint64_t DescId); // Function GPGameplay.GunDescTableManager.RemoveRows // (Final|Native|Public) // @ game+0x35f1590
	void AddRow(struct FGunDescRow& Row); // Function GPGameplay.GunDescTableManager.AddRow // (Final|Native|Public|HasOutParms) // @ game+0x35ee5b0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartSocketTableManager
// Size: 0x108 (Inherited: 0x38)
class UPartSocketTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0xd0]; // 0x38(0xd0)

	uint32_t GetSocketIdByName(struct FName& SocketName); // Function GPGameplay.PartSocketTableManager.GetSocketIdByName // (Final|Native|Public|HasOutParms) // @ game+0x35f0940
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.RecFunctionTableManager
// Size: 0x200 (Inherited: 0x38)
class URecFunctionTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x1c8]; // 0x38(0x1c8)

	bool HasVirtualPart(uint64_t RecID, uint32_t ParentSocketId, uint64_t& OutItemId); // Function GPGameplay.RecFunctionTableManager.HasVirtualPart // (Final|Native|Public|HasOutParms) // @ game+0x35f09e0
	struct TArray<struct FRecFunctionRow> GetSameSerieList(uint32_t SerieId); // Function GPGameplay.RecFunctionTableManager.GetSameSerieList // (Final|Native|Public) // @ game+0x35f0760
	struct FRecFunctionRow GetRow(uint64_t FunctionId); // Function GPGameplay.RecFunctionTableManager.GetRow // (Final|Native|Public) // @ game+0x35f0290
	uint64_t GetFunctionIdByPresetID(uint64_t DefaultPresetID, uint64_t MPDefaultPresetID); // Function GPGameplay.RecFunctionTableManager.GetFunctionIdByPresetID // (Final|Native|Public) // @ game+0x35efa90
	struct URecFunctionTableManager* STATIC_Get(); // Function GPGameplay.RecFunctionTableManager.Get // (Final|Native|Static|Public) // @ game+0x35ef370
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.CrosshairPresetTableManager
// Size: 0x48 (Inherited: 0x38)
class UCrosshairPresetTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.ScoFunctionTableManager
// Size: 0x50 (Inherited: 0x38)
class UScoFunctionTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x18]; // 0x38(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsFunctionTableManager
// Size: 0x140 (Inherited: 0x38)
class UPartsFunctionTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x108]; // 0x38(0x108)

	bool STATIC_IsLazy(); // Function GPGameplay.PartsFunctionTableManager.IsLazy // (Final|Native|Static|Public) // @ game+0x35f0b20
	void BPGetFuncRows(uint64_t FuncId, struct TArray<struct FPartsFunctionRow>& OutFuncList); // Function GPGameplay.PartsFunctionTableManager.BPGetFuncRows // (Final|Native|Public|HasOutParms) // @ game+0x35ee970
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsAnimFunctionTableManager
// Size: 0x50 (Inherited: 0x38)
class UPartsAnimFunctionTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x18]; // 0x38(0x18)

	void GetFuncRows(uint64_t FuncId, struct TArray<struct FPartsAnimFunctionRow>& OutFuncList); // Function GPGameplay.PartsAnimFunctionTableManager.GetFuncRows // (Final|Native|Public|HasOutParms) // @ game+0x35ef7e0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsFunctionGroupTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsFunctionGroupTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsTextureSizeTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsTextureSizeTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsMergeableTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsMergeableTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.RTIConfigTableManager
// Size: 0x50 (Inherited: 0x38)
class URTIConfigTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x18]; // 0x38(0x18)

	void AddRow(struct FRTIConfigRow NewRow); // Function GPGameplay.RTIConfigTableManager.AddRow // (Final|Native|Public) // @ game+0x35ee850
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsUIAnimTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsUIAnimTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsFxFunctionTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsFxFunctionTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsClassConfigTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsClassConfigTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsSeriesTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsSeriesTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponExtraModleTableManager
// Size: 0xa0 (Inherited: 0x38)
class UWeaponExtraModleTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x68]; // 0x38(0x68)

	void GetExtraModelRowsByRecId(uint64_t RecID, struct TArray<struct FWeaponExtraModelRow>& OutRows); // Function GPGameplay.WeaponExtraModleTableManager.GetExtraModelRowsByRecId // (Final|Native|Public|HasOutParms) // @ game+0x35ef580
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GunPresetBoundsTableManager
// Size: 0x50 (Inherited: 0x38)
class UGunPresetBoundsTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x18]; // 0x38(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsStyleTableManager
// Size: 0x98 (Inherited: 0x38)
class UPartsStyleTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x60]; // 0x38(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsAppearnceTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartsAppearnceTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartsMeshSocketNameInfoManager
// Size: 0x48 (Inherited: 0x38)
class UPartsMeshSocketNameInfoManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	struct FWeaponPartsSkeletalMeshSocketNameInfo GetRowByItemId(uint64_t ItemID, uint64_t SkinApperanceId); // Function GPGameplay.PartsMeshSocketNameInfoManager.GetRowByItemId // (Final|Native|Public) // @ game+0x35f0450
	struct FName GetRootBoneName(uint64_t ItemID, uint64_t SkinApperanceId, enum class EWeaponPartMeshType MeshType); // Function GPGameplay.PartsMeshSocketNameInfoManager.GetRootBoneName // (Final|Native|Public) // @ game+0x35f0180
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.AttackAdapterFunctionManager
// Size: 0x48 (Inherited: 0x38)
class UAttackAdapterFunctionManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	struct FAttackerInfo GetAttackerInfo(uint64_t ItemID, int32_t CurrentDurability); // Function GPGameplay.AttackAdapterFunctionManager.GetAttackerInfo // (Final|Native|Public) // @ game+0x35ef480
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponSkinDataManager
// Size: 0x48 (Inherited: 0x38)
class UWeaponSkinDataManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponFancyColorSkinManager
// Size: 0x48 (Inherited: 0x38)
class UWeaponFancyColorSkinManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponSkinAppearanceManager
// Size: 0x48 (Inherited: 0x38)
class UWeaponSkinAppearanceManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.MeleeWeaponSkinManager
// Size: 0x48 (Inherited: 0x38)
class UMeleeWeaponSkinManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.WeaponVoidPartsTableManager
// Size: 0x98 (Inherited: 0x38)
class UWeaponVoidPartsTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x60]; // 0x38(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.TuneFunctionTableManager
// Size: 0x58 (Inherited: 0x38)
class UTuneFunctionTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)
	struct TArray<struct UObject*> CacheObjects; // 0x48(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.TunePartFunctionLocIDTableManager
// Size: 0x48 (Inherited: 0x38)
class UTunePartFunctionLocIDTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.SilencerVolumeScaleRowManager
// Size: 0x48 (Inherited: 0x38)
class USilencerVolumeScaleRowManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GunsmithPartFixTransformRowManager
// Size: 0x48 (Inherited: 0x38)
class UGunsmithPartFixTransformRowManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.SuggestionPresetTableManager
// Size: 0x48 (Inherited: 0x38)
class USuggestionPresetTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.PartSocketsUIAudioTableManager
// Size: 0x48 (Inherited: 0x38)
class UPartSocketsUIAudioTableManager : public UDataTableSystemManagerBase {
public:

	char pad_38[0x10]; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPDemoNetConnection
// Size: 0x1f38 (Inherited: 0x1df0)
class UGPDemoNetConnection : public UDemoNetConnection {
public:

	char pad_1DF0[0x148]; // 0x1df0(0x148)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPDemoNetDriver
// Size: 0x1140 (Inherited: 0x1118)
class UGPDemoNetDriver : public UDemoNetDriver {
public:

	struct AMovementReplicationActor* MovementReplicationActor; // 0x1118(0x08)
	char pad_1120[0x20]; // 0x1120(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPDestructibleComponent
// Size: 0x400 (Inherited: 0x100)
class UGPDestructibleComponent : public UGPPhysicsSimulatableComponent {
public:

	struct TArray<struct FNPCHitMontageSectionName> HitMontageSectionNameArray; // 0x100(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyPlayHitMontage[0x10]; // 0x110(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyPlayDestructionBegin[0x10]; // 0x120(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyPlayDestructionEnd[0x10]; // 0x130(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyPlayDestructionPhysicsSimulation[0x10]; // 0x140(0x10)
	char pad_150[0x10]; // 0x150(0x10)
	float DebrisLifeTime; // 0x160(0x04)
	/*enum class EDestructLoadMode*/char LoadMode[0x1]; // 0x164(0x01)
	char pad_165[0x3]; // 0x165(0x03)
	/*struct TSoftObjectPtr<UStaticMesh>*/char PreBreakStaticMesh[0x28]; // 0x168(0x28)
	/*struct TSoftObjectPtr<USkeletalMesh>*/char PreBreakSkeletalMesh[0x28]; // 0x190(0x28)
	/*enum class EDestructPriorityType*/char PhysicsPriorityType[0x1]; // 0x1b8(0x01)
	/*enum class EDestructPhysicsType*/char PhysicsType[0x1]; // 0x1b9(0x01)
	/*enum class EDestructPhysicsSimulateType*/char PhysicsSimualteType[0x1]; // 0x1ba(0x01)
	char pad_1BB[0x1]; // 0x1bb(0x01)
	float DelayPlayPhysicsTime; // 0x1bc(0x04)
	float MaxPhysicsBlendTimer; // 0x1c0(0x04)
	float RigidBodyMass; // 0x1c4(0x04)
	float ImpulseStrength; // 0x1c8(0x04)
	float ImpulseRadius; // 0x1cc(0x04)
	/*struct TSoftObjectPtr<UParticleSystem>*/char BreakableParticlePath[0x28]; // 0x1d0(0x28)
	/*struct TSoftObjectPtr<UParticleSystem>*/char BreakableParticlePath_Mobile[0x28]; // 0x1f8(0x28)
	/*struct TSoftObjectPtr<UParticleSystem>*/char BreakableParticlePath_HD[0x28]; // 0x220(0x28)
	struct FName BreakableParticleFXID; // 0x248(0x08)
	float ParticleSpawnRate; // 0x250(0x04)
	bool ParticleSpawnAtDesrtuctBoundCenter; // 0x254(0x01)
	char pad_255[0x3]; // 0x255(0x03)
	struct FName ParticleSpawnRateParamName; // 0x258(0x08)
	struct FVector ParticleBoxVector; // 0x260(0x0c)
	struct FVector ParticleBoxVectorLow; // 0x26c(0x0c)
	struct FName ParticleBoxAreaParamName; // 0x278(0x08)
	struct FVector BPOriginScale; // 0x280(0x0c)
	struct FVector FinalScaleFactor; // 0x28c(0x0c)
	bool bUseScale; // 0x298(0x01)
	char pad_299[0x1]; // 0x299(0x01)
	bool bUseRotate; // 0x29a(0x01)
	char pad_29B[0x1]; // 0x29b(0x01)
	struct FVector RotateRate; // 0x29c(0x0c)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char BreakableSoundPath[0x28]; // 0x2a8(0x28)
	struct UGPAudioEventAsset* CachedBreakableSound; // 0x2d0(0x08)
	/*enum class EDestructPriorityType*/char AnimationPriorityType[0x1]; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	/*struct TSoftObjectPtr<USkeletalMesh>*/char BreakableMeshPath[0x28]; // 0x2e0(0x28)
	struct UClass* BreakableAnimInstance; // 0x308(0x08)
	/*enum class EDestructAnimForwardType*/char AnimDirForwardType[0x1]; // 0x310(0x01)
	bool bIsEnableAnimationMultiDirectionBlend; // 0x311(0x01)
	char pad_312[0x2]; // 0x312(0x02)
	float MaxMulDirAnimationBlendTimer; // 0x314(0x04)
	/*struct TSoftObjectPtr<UAnimationAsset>*/char BreakableAnimPath[0x28]; // 0x318(0x28)
	/*struct TArray<struct FDestructAnimationInfo>*/char BreakableOverideAnimPath[0x10]; // 0x340(0x10)
	bool bIsPlayHitAnim; // 0x350(0x01)
	char pad_351[0x7]; // 0x351(0x07)
	struct UGPSkeletalMeshComponent* NewSkeletalMeshComponent; // 0x358(0x08)
	struct UStaticMeshComponent* NewStaticMeshComponent; // 0x360(0x08)
	char pad_368[0x98]; // 0x368(0x98)

	bool ShouldEnableSimulatePhysics(); // Function GPGameplay.GPDestructibleComponent.ShouldEnableSimulatePhysics // (Final|Native|Protected) // @ game+0x35f20e0
	void SetDestructionState(/*enum class EDestructState NewState*/); // Function GPGameplay.GPDestructibleComponent.SetDestructionState // (Final|Native|Public|BlueprintCallable) // @ game+0x35f1dc0
	void ResetDestruction(); // Function GPGameplay.GPDestructibleComponent.ResetDestruction // (Final|Native|Public|BlueprintCallable) // @ game+0x35f1610
	void PlayHitAnimation(float HealthRate); // Function GPGameplay.GPDestructibleComponent.PlayHitAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x35f13d0
	void OnDestructionTimeOut(); // Function GPGameplay.GPDestructibleComponent.OnDestructionTimeOut // (Final|Native|Protected) // @ game+0x35f1010
	void OnDebrisOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function GPGameplay.GPDestructibleComponent.OnDebrisOverlap // (Final|Native|Protected|HasOutParms) // @ game+0x35f0e10
	void OnDebrisCollide(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function GPGameplay.GPDestructibleComponent.OnDebrisCollide // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x35f0c40
	void OnBeforeSimulatePhysics(); // Function GPGameplay.GPDestructibleComponent.OnBeforeSimulatePhysics // (Final|Native|Protected) // @ game+0x35a3800
	void OnAnimationEnd(); // Function GPGameplay.GPDestructibleComponent.OnAnimationEnd // (Final|Native|Protected) // @ game+0x35f0c20
	bool IsSkeletalMeshBelongToComponent(struct USkeletalMeshComponent* USkeletalMeshComp); // Function GPGameplay.GPDestructibleComponent.IsSkeletalMeshBelongToComponent // (Final|Native|Public) // @ game+0x35f0b80
	bool IsNeedSimulateRootBone(); // Function GPGameplay.GPDestructibleComponent.IsNeedSimulateRootBone // (Final|Native|Protected) // @ game+0x35f0b50
	bool IsAlreadyDestruct(); // Function GPGameplay.GPDestructibleComponent.IsAlreadyDestruct // (Final|Native|Public|BlueprintCallable) // @ game+0x35f0af0
	bool EarlyOutPhysicsSimulationIfCan(); // Function GPGameplay.GPDestructibleComponent.EarlyOutPhysicsSimulationIfCan // (Final|Native|Public|BlueprintCallable) // @ game+0x35ef340
	void EarlyOutDestruction(); // Function GPGameplay.GPDestructibleComponent.EarlyOutDestruction // (Final|Native|Public|BlueprintCallable) // @ game+0x35ef320
	bool EarlyOutAnimationIfCan(); // Function GPGameplay.GPDestructibleComponent.EarlyOutAnimationIfCan // (Final|Native|Public|BlueprintCallable) // @ game+0x35ef2f0
	void DestructByDir(struct FTransform RelativeTransform, struct FVector& InHitLocation, struct FVector& InHitNormal); // Function GPGameplay.GPDestructibleComponent.DestructByDir // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x35ef160
	void Destruct(); // Function GPGameplay.GPDestructibleComponent.Destruct // (Final|Native|Public|BlueprintCallable) // @ game+0x35ef140
	void BeginPreLoadAsset(); // Function GPGameplay.GPDestructibleComponent.BeginPreLoadAsset // (Final|Native|Public|BlueprintCallable) // @ game+0x35eeb70
	void BeginPreBreakState(); // Function GPGameplay.GPDestructibleComponent.BeginPreBreakState // (Final|Native|Public|BlueprintCallable) // @ game+0x35eeb50
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPDialogSyncActionLib
// Size: 0x30 (Inherited: 0x30)
class UGPDialogSyncActionLib : public UBlueprintFunctionLibrary {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPDialogSubsystem
// Size: 0x3b0 (Inherited: 0x378)
class AGPDialogSubsystem : public ALevelSubsystem {
public:

	/*struct FMulticastInlineDelegate*/char AddDialogActionDelegate[0x10]; // 0x378(0x10)
	/*struct FMulticastInlineDelegate*/char DialogEndDelegate[0x10]; // 0x388(0x10)
	struct AActor* CurrentDialogActor; // 0x398(0x08)
	struct TArray<struct UGPDialogAsyncActionBase*> DialogActions; // 0x3a0(0x10)

	void StartDialog(struct FString DialogID, struct AActor* DialogActor); // Function GPGameplay.GPDialogSubsystem.StartDialog // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7790
	struct AGPDialogSubsystem* STATIC_Get(struct UObject* WorldContextObject); // Function GPGameplay.GPDialogSubsystem.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35f6d90
	void EndCurrentDialog(); // Function GPGameplay.GPDialogSubsystem.EndCurrentDialog // (Final|Native|Public|BlueprintCallable) // @ game+0x35f69d0
	void BP_StartDialog(struct FString DialogID); // Function GPGameplay.GPDialogSubsystem.BP_StartDialog // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BP_OnAddDialogAction(struct UGPDialogAsyncActionBase* DialogAction); // Function GPGameplay.GPDialogSubsystem.BP_OnAddDialogAction // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BP_EndCurrentDialog(); // Function GPGameplay.GPDialogSubsystem.BP_EndCurrentDialog // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPEmitterWithAudio
// Size: 0x3d8 (Inherited: 0x3c8)
class AGPEmitterWithAudio : public AEmitter {
public:

	struct UGPAudioEventAsset* ParticleSystemActivateAudio; // 0x3c8(0x08)
	struct UGPAudioEventAsset* ParticleSystemDeactivateAudio; // 0x3d0(0x08)

	void BP_OnPartcleSystemDeactivate(); // Function GPGameplay.GPEmitterWithAudio.BP_OnPartcleSystemDeactivate // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	void BP_OnPartcleSystemActivate(); // Function GPGameplay.GPEmitterWithAudio.BP_OnPartcleSystemActivate // (Event|Public|BlueprintEvent) // @ game+0x7ed88c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPExplosionEffectComponent
// Size: 0x190 (Inherited: 0x100)
class UGPExplosionEffectComponent : public UActorComponent {
public:

	bool bShouldPlayEffect; // 0x100(0x01)
	bool bShouldPlayerEffectLastState; // 0x101(0x01)
	bool bEnableFalloff; // 0x102(0x01)
	char pad_103[0x5]; // 0x103(0x05)
	struct FString PostEffectName; // 0x108(0x10)
	struct TMap<enum class EExplosionType, struct FExplosionTypeInfo> ExplosionInfoMap; // 0x118(0x50)
	struct UClass* CameraShakeType; // 0x168(0x08)
	float OuterDistance; // 0x170(0x04)
	float TotalTime; // 0x174(0x04)
	float RemainTime; // 0x178(0x04)
	float Intensity; // 0x17c(0x04)
	float CurrentIntensity; // 0x180(0x04)
	float MaxIntensity; // 0x184(0x04)
	char pad_188[0x8]; // 0x188(0x08)

	void PlayRadialBlurEffect(float InIntensity, bool bShouldPlay); // Function GPGameplay.GPExplosionEffectComponent.PlayRadialBlurEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7290
	void PlayExplosionEffect(enum class EExplosionType ExplosionType, struct FVector ExplosionLocation); // Function GPGameplay.GPExplosionEffectComponent.PlayExplosionEffect // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x35f71c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFightStateComponent
// Size: 0x118 (Inherited: 0x100)
class UGPFightStateComponent : public UActorComponent {
public:

	enum class EGPCharacterFightStateType CurrentFightStateType; // 0x100(0x01)
	enum class EGPAIMotionType CurrentMotionType; // 0x101(0x01)
	char pad_102[0x2]; // 0x102(0x02)
	int32_t StandbyAnimID; // 0x104(0x04)
	enum class EGPCharacterLeisureMoveType LeisureMoveType; // 0x108(0x01)
	enum class EGPCharacterAlertStateType CurrentAlertState; // 0x109(0x01)
	enum class EGPCharacterInCoverPoseType CurrentInCoverState; // 0x10a(0x01)
	bool bCanUseSpecialLeisureMovement; // 0x10b(0x01)
	enum class EAILeisureMovementType LeisureMovementType; // 0x10c(0x01)
	char pad_10D[0x1]; // 0x10d(0x01)
	enum class EGPCharacterFightStateType CurrentMotionFightState; // 0x10e(0x01)
	char pad_10F[0x9]; // 0x10f(0x09)

	void SetState(enum class EGPCharacterFightStateType StateType); // Function GPGameplay.GPFightStateComponent.SetState // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7710
	void SetPlayerToLeisureState(bool bEnable); // Function GPGameplay.GPFightStateComponent.SetPlayerToLeisureState // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7680
	void SetMotionType(enum class EGPAIMotionType NewMotionType); // Function GPGameplay.GPFightStateComponent.SetMotionType // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7600
	void SetLeisureMoveType(enum class EGPCharacterLeisureMoveType moveType); // Function GPGameplay.GPFightStateComponent.SetLeisureMoveType // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7580
	void SetInCoverState(enum class EGPCharacterInCoverPoseType StateType); // Function GPGameplay.GPFightStateComponent.SetInCoverState // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7500
	void SetAlertState(enum class EGPCharacterAlertStateType StateType); // Function GPGameplay.GPFightStateComponent.SetAlertState // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7480
	void ServerReplicatePlayerInCutSceneStateType(enum class EGPCharacterFightStateType StetaType); // Function GPGameplay.GPFightStateComponent.ServerReplicatePlayerInCutSceneStateType // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x35f73e0
	void OnRep_FightState(); // Function GPGameplay.GPFightStateComponent.OnRep_FightState // (Final|Native|Public) // @ game+0x35f71a0
	enum class EGPCharacterMoveDirStateType GetMoveDirState(); // Function GPGameplay.GPFightStateComponent.GetMoveDirState // (Final|Native|Public|BlueprintCallable) // @ game+0x35f7170
	enum class EGPAICharaLocomotionType STATIC_GetLocomotionType(enum class EGPCharacterFightStateType FightState, enum class EGPCharacterAlertStateType AlertState, enum class EGPCharacterInCoverPoseType InCoverState, bool bIsCrouch, bool bIsHalfSquat, bool bIsSprint); // Function GPGameplay.GPFightStateComponent.GetLocomotionType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35f6fb0
	enum class EGPAIMotionType GetCurrentMotionType(); // Function GPGameplay.GPFightStateComponent.GetCurrentMotionType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6f90
	enum class EGPCharacterFightStateType GetCurrentMotionFightState(); // Function GPGameplay.GPFightStateComponent.GetCurrentMotionFightState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6f70
	enum class EGPAICharaLocomotionType GetCurrentLocomotionType(); // Function GPGameplay.GPFightStateComponent.GetCurrentLocomotionType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6f40
	enum class EGPCharacterFightStateType GetCurrentFightStateType(); // Function GPGameplay.GPFightStateComponent.GetCurrentFightStateType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6f20
	enum class EGPAICharaLocomotionType STATIC_GetAICurrentLocomotionType(struct AGPCharacter* AIChara); // Function GPGameplay.GPFightStateComponent.GetAICurrentLocomotionType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x35f6e10
	bool EnableProneRotator(); // Function GPGameplay.GPFightStateComponent.EnableProneRotator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f69a0
	bool EnableAdditiveGunPos(); // Function GPGameplay.GPFightStateComponent.EnableAdditiveGunPos // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6970
	bool CanSpotTurn(); // Function GPGameplay.GPFightStateComponent.CanSpotTurn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6940
	bool CanSpeaking(); // Function GPGameplay.GPFightStateComponent.CanSpeaking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6910
	bool CanGunShooting(); // Function GPGameplay.GPFightStateComponent.CanGunShooting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f68d0
	bool CanChangeClip(); // Function GPGameplay.GPFightStateComponent.CanChangeClip // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f68a0
	bool CanAimTarget(); // Function GPGameplay.GPFightStateComponent.CanAimTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x35f6870
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFootIKInstance
// Size: 0xa60 (Inherited: 0x280)
class UGPFootIKInstance : public UAnimInstance {
public:

	struct FGPFootIKInstanceProxy LocalProxy; // 0x280(0x7e0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.ForkDSLogic
// Size: 0x3e8 (Inherited: 0x3d8)
class UForkDSLogic : public UDSLogicBase {
public:

	char pad_3D8[0x10]; // 0x3d8(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFSMConduitInstance
// Size: 0xe0 (Inherited: 0xd8)
class UGPFSMConduitInstance : public USMConduitInstance {
public:

	struct UGPFSMInstance* FSMOwner; // 0xd8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFSMSkillTaskBase
// Size: 0x50 (Inherited: 0x38)
class UGPFSMSkillTaskBase : public UBlueprintAsyncActionBase {
public:

	struct UGPFSMStateInstance* StateInstance; // 0x38(0x08)
	struct UGPFSMInstance* FSMOwner; // 0x40(0x08)
	struct UGPBlackboardComponent* BlackBoard; // 0x48(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFSMLightStateInstance
// Size: 0xf0 (Inherited: 0xd0)
class UGPFSMLightStateInstance : public USMStateInstance {
public:

	struct UGPFSMInstance* FSMOwner; // 0xd0(0x08)
	char pad_D8[0x10]; // 0xd8(0x10)
	enum class EFSMCharacterState CurCharacterState; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFSMStateMachineInstance
// Size: 0x4d0 (Inherited: 0xd8)
class UGPFSMStateMachineInstance : public USMStateMachineInstance {
public:

	struct UGPFSMInstance* FSMOwner; // 0xd8(0x08)
	struct UGPBlackboardComponent* BlackBoard; // 0xe0(0x08)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_Timeout[0x10]; // 0xe8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_StartSprint[0x10]; // 0xf8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndSprintToStop[0x10]; // 0x108(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndSprintToMoving[0x10]; // 0x118(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_Finish[0x10]; // 0x128(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_NormalToADS[0x10]; // 0x138(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_AdsToNormal[0x10]; // 0x148(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_BeginVault[0x10]; // 0x158(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndVault[0x10]; // 0x168(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_BeginOperate[0x10]; // 0x178(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndOperate[0x10]; // 0x188(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_CancelOperate[0x10]; // 0x198(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_BeginZipline[0x10]; // 0x1a8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndZipline[0x10]; // 0x1b8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_CancelZipline[0x10]; // 0x1c8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_ToLooting[0x10]; // 0x1d8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_ToReborn[0x10]; // 0x1e8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_BuffFinish[0x10]; // 0x1f8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Cast[0x10]; // 0x208(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Charged[0x10]; // 0x218(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Charging[0x10]; // 0x228(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Restored[0x10]; // 0x238(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_SpawnObjectFinish[0x10]; // 0x248(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Terminate[0x10]; // 0x258(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Ultimate[0x10]; // 0x268(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_NormalBreak[0x10]; // 0x278(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Timeout[0x10]; // 0x288(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Break[0x10]; // 0x298(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_BeginCharging[0x10]; // 0x2a8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_BeginCooling[0x10]; // 0x2b8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_BeginPreparing[0x10]; // 0x2c8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_EndPrepare[0x10]; // 0x2d8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_CancelPrepare[0x10]; // 0x2e8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Yes[0x10]; // 0x2f8(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_No[0x10]; // 0x308(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_SkillEnerngyChange[0x10]; // 0x318(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Failed[0x10]; // 0x328(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_EnergyChanged[0x10]; // 0x338(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Death[0x10]; // 0x348(0x10)
	/*struct FMulticastInlineDelegate*/char SkillEvent_Uncharged[0x10]; // 0x358(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_BeginRelaxIdle[0x10]; // 0x368(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndRelaxIdle[0x10]; // 0x378(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_ToLeftLean[0x10]; // 0x388(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_ToRightLean[0x10]; // 0x398(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndLean[0x10]; // 0x3a8(0x10)
	/*struct FMulticastInlineDelegate*/char GpfsmTransitionEvent_EndClimbLadder[0x10]; // 0x3b8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_CarryBodyGetOnVehicle[0x10]; // 0x3c8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_CarryBodyGetOffVehicle[0x10]; // 0x3d8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_BeginBeHit[0x10]; // 0x3e8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndBeHit[0x10]; // 0x3f8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_CancelBeHit[0x10]; // 0x408(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_StartAutoDriveVehicle[0x10]; // 0x418(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_CancelAutoDriveVehicle[0x10]; // 0x428(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_GetOnFlyBase[0x10]; // 0x438(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_GetOffFlyBase[0x10]; // 0x448(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_BeginUseSkill[0x10]; // 0x458(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndUseSkill[0x10]; // 0x468(0x10)
	/*struct FMulticastInlineDelegate*/char GpfsmTransitionEvent_BeginAssassinate[0x10]; // 0x478(0x10)
	/*struct FMulticastInlineDelegate*/char GpfsmTransitionEvent_EndAssassinate[0x10]; // 0x488(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_SkillToSkillADS[0x10]; // 0x498(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_SkillADSToSkill[0x10]; // 0x4a8(0x10)
	/*struct FMulticastInlineDelegate*/char GPFSMTransitionEvent_EndRescue[0x10]; // 0x4b8(0x10)
	enum class EFSMCharacterState CurCharacterState; // 0x4c8(0x01)
	char pad_4C9[0x7]; // 0x4c9(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFSMLightStateMachineInstance
// Size: 0xf0 (Inherited: 0xd8)
class UGPFSMLightStateMachineInstance : public USMStateMachineInstance {
public:

	struct UGPFSMInstance* FSMOwner; // 0xd8(0x08)
	struct UGPBlackboardComponent* BlackBoard; // 0xe0(0x08)
	enum class EFSMCharacterState CurCharacterState; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFSMTransitionInstance
// Size: 0xb8 (Inherited: 0xb0)
class UGPFSMTransitionInstance : public USMTransitionInstance {
public:

	struct UGPFSMInstance* FSMOwner; // 0xb0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPFXProxyActor
// Size: 0x478 (Inherited: 0x458)
class AGPFXProxyActor : public AFXProxyActor {
public:

	struct FSoftObjectPath GPAudioEventAsset; // 0x458(0x18)
	struct UGameAkComponent* GameAkComponent; // 0x470(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameDamageRecord
// Size: 0x180 (Inherited: 0x30)
class UGPGameDamageRecord : public UObject {
public:

	char pad_30[0x150]; // 0x30(0x150)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameEngine
// Size: 0x1030 (Inherited: 0xfb0)
class UGPGameEngine : public UGameEngine {
public:

	struct UClass* ReconnectionSystemClass; // 0xfb0(0x08)
	struct FSoftClassPath ReconnectionSystemClassName; // 0xfb8(0x18)
	struct UClass* ReconnectionSystemConfigClass; // 0xfd0(0x08)
	struct FSoftClassPath ReconnectionSystemConfigClassName; // 0xfd8(0x18)
	char pad_FF0[0x40]; // 0xff0(0x40)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameModeSettingSubsystem
// Size: 0x3d0 (Inherited: 0x378)
class AGPGameModeSettingSubsystem : public ALevelSubsystem {
public:

	struct FGPGameModeLogicConfig LogicConfig; // 0x378(0x30)
	struct UClass* GPEffectTriggerClass; // 0x3a8(0x08)
	struct FGPGameModeMissionConfig MissionConfig; // 0x3b0(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameplayConfigComponent
// Size: 0x470 (Inherited: 0x100)
class UGPGameplayConfigComponent : public UActorComponent {
public:

	struct AGPCharacter* CharacterOwner; // 0x100(0x08)
	struct FAbilityKnockbackSettingConfig KnockbackSettingConfig; // 0x108(0x88)
	int32_t ServerRushCheckSkill; // 0x190(0x04)
	float C302FallingHeight; // 0x194(0x04)
	struct TArray<int32_t> C302FallingBuff; // 0x198(0x10)
	struct TArray<int32_t> C302FallBuff; // 0x1a8(0x10)
	struct TArray<int32_t> C302PassiveBuff; // 0x1b8(0x10)
	float C302PassiveBuffCD; // 0x1c8(0x04)
	float C302FallBuffHegith; // 0x1cc(0x04)
	float C302PassiveBuffCDTime; // 0x1d0(0x04)
	float FallingDamgeCheckHeight; // 0x1d4(0x04)
	float FallingDamgeCheckHeight1; // 0x1d8(0x04)
	float FallingDamgeCheckHeight2; // 0x1dc(0x04)
	struct TArray<enum class ECharacterStateMask> C4PreFireForbid; // 0x1e0(0x10)
	struct TArray<enum class ECharacterStateMask> C4FireForbid; // 0x1f0(0x10)
	bool C4Forbid_OnlyClient; // 0x200(0x01)
	bool SkillForbit_OnlyClient; // 0x201(0x01)
	char pad_202[0x6]; // 0x202(0x06)
	struct TArray<enum class EFSMCharacterState> ResetFallingStates; // 0x208(0x10)
	float SOLKnockDownAssitTime; // 0x218(0x04)
	char pad_21C[0x4]; // 0x21c(0x04)
	struct TArray<struct FName> FPPSkillMeshNames; // 0x220(0x10)
	struct TArray<struct FName> TPPSkillMeshNames; // 0x230(0x10)
	struct FName SkillPanelName; // 0x240(0x08)
	struct FName KnockBackEnermyVoice; // 0x248(0x08)
	struct FName RushVoice; // 0x250(0x08)
	float RushVoiceTimeX; // 0x258(0x04)
	float RushVoiceTimeY; // 0x25c(0x04)
	struct TArray<int32_t> BattleFiledSupportSkills; // 0x260(0x10)
	struct TArray<int32_t> FastResuceFromDead; // 0x270(0x10)
	float MaxRushHeight; // 0x280(0x04)
	float JumpMaxRushHeight; // 0x284(0x04)
	struct TArray<enum class ECharacterStateMask> CommonLockAbilitys; // 0x288(0x10)
	struct TArray<enum class ECharacterStateMask> SkillRTTCommonUnLockAbilitys; // 0x298(0x10)
	int32_t Rep3pExcuteNum; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct TArray<int32_t> CanSlidingTackleHeroList; // 0x2b0(0x10)
	int64_t GoldC301ID; // 0x2c0(0x08)
	bool bSkillUsePreload; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct UGPAudioEventAsset* StartAudio; // 0x2d0(0x08)
	struct UGPAudioEventAsset* EndAudio; // 0x2d8(0x08)
	struct UGPAudioEventAsset* CdAudio; // 0x2e0(0x08)
	struct UGPAudioEventAsset* FaildAudio; // 0x2e8(0x08)
	bool bInitAudio; // 0x2f0(0x01)
	char pad_2F1[0x7]; // 0x2f1(0x07)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char StartAudioEvent[0x28]; // 0x2f8(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char EndAudioEvent[0x28]; // 0x320(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char CDDoneAudioEvent[0x28]; // 0x348(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char FaildAudioEvent[0x28]; // 0x370(0x28)
	bool StingerUseThirdWeapon; // 0x398(0x01)
	bool StingerUseCameraDir; // 0x399(0x01)
	char pad_39A[0x2]; // 0x39a(0x02)
	int32_t StingerWeaponType; // 0x39c(0x04)
	int32_t StingerLockTryTime; // 0x3a0(0x04)
	bool StingerOnlyCheckAmmo; // 0x3a4(0x01)
	bool DSStingerChecker; // 0x3a5(0x01)
	bool StingerCheckDir; // 0x3a6(0x01)
	char pad_3A7[0x1]; // 0x3a7(0x01)
	int64_t StingerCheckType; // 0x3a8(0x08)
	int64_t StingerCheckTypeValue; // 0x3b0(0x08)
	bool AttachMeshAddToRoot; // 0x3b8(0x01)
	char pad_3B9[0x3]; // 0x3b9(0x03)
	struct FLinearColor AmmoColorFirst; // 0x3bc(0x10)
	struct FLinearColor AmmoColorSecond; // 0x3cc(0x10)
	struct FLinearColor AmmoColorThird; // 0x3dc(0x10)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct TMap<int32_t, struct FFastRescueResouce> ExpertFastRescueResouce; // 0x3f0(0x50)
	struct TArray<int32_t> ExpertRecoverHealthRescue; // 0x440(0x10)
	bool bServerUnEquipSkillWeapon; // 0x450(0x01)
	bool bClientUnEquipSkillWeapon; // 0x451(0x01)
	char pad_452[0x6]; // 0x452(0x06)
	struct TArray<enum class EGPWeaponInnerEvent> PreFireLockEvent; // 0x458(0x10)
	float LongJumpTime; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameplayDelegates
// Size: 0x16c0 (Inherited: 0x38)
class UGPGameplayDelegates : public UWorldSubsystem {
public:

	/*struct FMulticastInlineDelegate*/char OnClientSelfDied[0x10]; // 0x38(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientSelfReborn[0x10]; // 0x48(0x10)
	char pad_58[0x30]; // 0x58(0x30)
	/*struct FMulticastInlineDelegate*/char OnClientOBTeamItemCheckStatusChanged[0x10]; // 0x88(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientCharacterLiveStatusChanged[0x10]; // 0x98(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientAICharacterBorn[0x10]; // 0xa8(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientAICharacterDied[0x10]; // 0xb8(0x10)
	/*struct FMulticastInlineDelegate*/char OnSeamlessEnterMapOpen[0x10]; // 0xc8(0x10)
	/*struct FMulticastInlineDelegate*/char OnSeamlessEnterMapClose[0x10]; // 0xd8(0x10)
	/*struct FMulticastInlineDelegate*/char OnSeamlessEnterComplete[0x10]; // 0xe8(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientReceiveWeaponStoreItemsInArmBag[0x10]; // 0xf8(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientReceiveWeaponStore[0x10]; // 0x108(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientReceiveWeaponPresetStore[0x10]; // 0x118(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientReceiveSwitchWeaponPreset[0x10]; // 0x128(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientReceiveSwitchWeaponItemResult[0x10]; // 0x138(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientReceiveInGameUnlockWeapon[0x10]; // 0x148(0x10)
	/*struct FMulticastInlineDelegate*/char OnCharacterDyingToBeDeadBox[0x10]; // 0x158(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerControllerShiftKeyPressed[0x10]; // 0x168(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerControllerSwithCameraMode[0x10]; // 0x178(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerControllerSwitchZoomState[0x10]; // 0x188(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerControllerSwitchOpenSight[0x10]; // 0x198(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerControllerCancelAimState[0x10]; // 0x1a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnAddSubtitle[0x10]; // 0x1b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRemoveSubtitle[0x10]; // 0x1c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnShowSubtitle[0x10]; // 0x1d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnHideSubtitle[0x10]; // 0x1e8(0x10)
	char pad_1F8[0x10]; // 0x1f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientBattleRankScoreChange[0x10]; // 0x208(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientBattleRankLevelChange[0x10]; // 0x218(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerControllerWeaponReload[0x10]; // 0x228(0x10)
	char pad_238[0x40]; // 0x238(0x40)
	/*struct FMulticastInlineDelegate*/char OnLocalPlayerBasePoseStatusChanged[0x10]; // 0x278(0x10)
	char pad_288[0x20]; // 0x288(0x20)
	/*struct FMulticastInlineDelegate*/char OnAutonomousOrServerJumpStatusChanged[0x10]; // 0x2a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnAutonomousOrServerIsMovingChanged[0x10]; // 0x2b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnAutonomousOrServerFirstFiringEvent[0x10]; // 0x2c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnAutonomousOrServerAimStatusEvent[0x10]; // 0x2d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnAutonomousOrServerBasePoseStatusChanged[0x10]; // 0x2e8(0x10)
	char pad_2F8[0x80]; // 0x2f8(0x80)
	/*struct FMulticastInlineDelegate*/char OnPlayerArmedForceChanged[0x10]; // 0x378(0x10)
	/*struct FMulticastInlineDelegate*/char OnSkillEntityAdded[0x10]; // 0x388(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerHeroIdChanged[0x10]; // 0x398(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerBagIdChanged[0x10]; // 0x3a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientPlayerHeroIDChanged[0x10]; // 0x3b8(0x10)
	char pad_3C8[0x280]; // 0x3c8(0x280)
	/*struct FMulticastInlineDelegate*/char OnWeaponPostFire[0x10]; // 0x648(0x10)
	char pad_658[0x228]; // 0x658(0x228)
	/*struct FMulticastInlineDelegate*/char GetLuaQuestData[0x10]; // 0x880(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientLocalPlayerHPChangedSignature[0x10]; // 0x890(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientLocalPlayerMaxHPChangedSignature[0x10]; // 0x8a0(0x10)
	char pad_8B0[0x50]; // 0x8b0(0x50)
	/*struct FMulticastInlineDelegate*/char OnServerGMGotoComplete[0x10]; // 0x900(0x10)
	char pad_910[0xa0]; // 0x910(0xa0)
	/*struct FMulticastInlineDelegate*/char RefreshKillerMarkView[0x10]; // 0x9b0(0x10)
	/*struct FMulticastInlineDelegate*/char OnAbilityInteractEvent[0x10]; // 0x9c0(0x10)
	/*struct FMulticastInlineDelegate*/char OnCampReplicate[0x10]; // 0x9d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnForcesIdReplicate[0x10]; // 0x9e0(0x10)
	/*struct FMulticastInlineDelegate*/char OnLocalPSReplicate[0x10]; // 0x9f0(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientEnemyCharacterBeginFire[0x10]; // 0xa00(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientWeaponBeginFireNtf[0x10]; // 0xa10(0x10)
	/*struct FMulticastInlineDelegate*/char OnAbilityVehicleOperate[0x10]; // 0xa20(0x10)
	/*struct FMulticastInlineDelegate*/char GPPlayerAbilityCast[0x10]; // 0xa30(0x10)
	/*struct FMulticastInlineDelegate*/char GPPlayerAbilityCastFailed[0x10]; // 0xa40(0x10)
	/*struct FMulticastInlineDelegate*/char OnUseSkill[0x10]; // 0xa50(0x10)
	/*struct FMulticastInlineDelegate*/char OnSkillChargingDone[0x10]; // 0xa60(0x10)
	char pad_A70[0x18]; // 0xa70(0x18)
	/*struct FMulticastInlineDelegate*/char OnCharacterSubFire[0x10]; // 0xa88(0x10)
	/*struct FMulticastInlineDelegate*/char OnCharacterNormalFire[0x10]; // 0xa98(0x10)
	/*struct FMulticastInlineDelegate*/char OnDetectorBigMapClose[0x10]; // 0xaa8(0x10)
	/*struct FMulticastInlineDelegate*/char StaminaNotEnoughFlushDelegate[0x10]; // 0xab8(0x10)
	/*struct FMulticastInlineDelegate*/char ViewportClientFocusStatusChange[0x10]; // 0xac8(0x10)
	/*struct FMulticastInlineDelegate*/char ViewportClientActiveStatusChange[0x10]; // 0xad8(0x10)
	/*struct FMulticastInlineDelegate*/char JoystickModeChangeDelegate[0x10]; // 0xae8(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyZiplineCooldown[0x10]; // 0xaf8(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyZiplineAvailable[0x10]; // 0xb08(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCanUseZipline[0x10]; // 0xb18(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCanCarryBody[0x10]; // 0xb28(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCanUseParachute[0x10]; // 0xb38(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCanPullOutArrow[0x10]; // 0xb48(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCanFirefighting[0x10]; // 0xb58(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyZoyaSwarms[0x10]; // 0xb68(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyJumpImageChange[0x10]; // 0xb78(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCrouchImageChange[0x10]; // 0xb88(0x10)
	/*struct FMulticastInlineDelegate*/char OnSwitchTacticalEquip[0x10]; // 0xb98(0x10)
	/*struct FMulticastInlineDelegate*/char OnOpenPowerFlash[0x10]; // 0xba8(0x10)
	/*struct FMulticastInlineDelegate*/char OnRepInventoryItem[0x10]; // 0xbb8(0x10)
	/*struct FMulticastInlineDelegate*/char OnBipTipShow[0x10]; // 0xbc8(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyPowerFlashState[0x10]; // 0xbd8(0x10)
	/*struct FMulticastInlineDelegate*/char OnShowTacticalEquipDetailPanel[0x10]; // 0xbe8(0x10)
	/*struct FDelegate*/char NotifyToAddMarker[0x10]; // 0xbf8(0x10)
	/*struct FDelegate*/char NotifyToRemoveMarker[0x10]; // 0xc08(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyAddUnitMarking[0x10]; // 0xc18(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyRemoveUnitMarking[0x10]; // 0xc28(0x10)
	/*struct FMulticastInlineDelegate*/char OnCharacterHitOthers[0x10]; // 0xc38(0x10)
	/*struct FMulticastInlineDelegate*/char OnSkillWeaponSlotUpdated[0x10]; // 0xc48(0x10)
	/*struct FMulticastInlineDelegate*/char OnDetectorMarkerEffectApplyWithType[0x10]; // 0xc58(0x10)
	/*struct FMulticastInlineDelegate*/char OnDetectorMarkerShow[0x10]; // 0xc68(0x10)
	/*struct FMulticastInlineDelegate*/char OnAbilitySpawnActorCreated[0x10]; // 0xc78(0x10)
	/*struct FMulticastInlineDelegate*/char OnAbilitySpawnActorTrigger[0x10]; // 0xc88(0x10)
	char pad_C98[0x70]; // 0xc98(0x70)
	/*struct FMulticastInlineDelegate*/char OnSkillApplyAssaultEffect[0x10]; // 0xd08(0x10)
	char pad_D18[0x58]; // 0xd18(0x58)
	/*struct FMulticastInlineDelegate*/char OnSkillBPEvent[0x10]; // 0xd70(0x10)
	char pad_D80[0xa8]; // 0xd80(0xa8)
	/*struct FMulticastInlineDelegate*/char OnChargeGunStateChange[0x10]; // 0xe28(0x10)
	/*struct FMulticastInlineDelegate*/char OnBowSetStateChange[0x10]; // 0xe38(0x10)
	/*struct FMulticastInlineDelegate*/char OnThrowBlockingStateChange[0x10]; // 0xe48(0x10)
	char pad_E58[0x48]; // 0xe58(0x48)
	/*struct FMulticastInlineDelegate*/char OnBowCancelChargingBtnClicked[0x10]; // 0xea0(0x10)
	/*struct FMulticastInlineDelegate*/char OnC202TracingEnemyViewHide[0x10]; // 0xeb0(0x10)
	/*struct FMulticastInlineDelegate*/char OnC202UpdateBeTracingLevel[0x10]; // 0xec0(0x10)
	/*struct FMulticastInlineDelegate*/char OnLocalPlaySilentMoveStateChanged[0x10]; // 0xed0(0x10)
	char pad_EE0[0x30]; // 0xee0(0x30)
	/*struct FDelegate*/char NotifyToAddAbilityLocker[0x10]; // 0xf10(0x10)
	/*struct FDelegate*/char NotifyToRemoveAbilityLocker[0x10]; // 0xf20(0x10)
	/*struct FDelegate*/char GPSetSkillItemVisible[0x10]; // 0xf30(0x10)
	/*struct FMulticastInlineDelegate*/char OnSetSkillButtonVisible[0x10]; // 0xf40(0x10)
	/*struct FMulticastInlineDelegate*/char OnDetectorEnemyChanged[0x10]; // 0xf50(0x10)
	/*struct FMulticastInlineDelegate*/char OnUseAccessory[0x10]; // 0xf60(0x10)
	/*struct FMulticastInlineDelegate*/char BipodStatusChange[0x10]; // 0xf70(0x10)
	/*struct FMulticastInlineDelegate*/char OnKillStreak[0x10]; // 0xf80(0x10)
	/*struct FMulticastInlineDelegate*/char OnNeedAmmo[0x10]; // 0xf90(0x10)
	/*struct FMulticastInlineDelegate*/char BattleFieldRebronEstimate[0x10]; // 0xfa0(0x10)
	/*struct FMulticastInlineDelegate*/char BattleFieldReLoadAmmo[0x10]; // 0xfb0(0x10)
	/*struct FMulticastInlineDelegate*/char BattleFieldIntoSuppressedState[0x10]; // 0xfc0(0x10)
	/*struct FMulticastInlineDelegate*/char BattleFieldAimEnemy[0x10]; // 0xfd0(0x10)
	/*struct FMulticastInlineDelegate*/char BattleFieldKnockedDownHalf[0x10]; // 0xfe0(0x10)
	/*struct FMulticastInlineDelegate*/char ClimbLadderStepVoiceDelegate[0x10]; // 0xff0(0x10)
	/*struct FMulticastInlineDelegate*/char UpdateRightKeyTipsSkillData[0x10]; // 0x1000(0x10)
	/*struct FMulticastInlineDelegate*/char ClearRightKeyTipsSkillData[0x10]; // 0x1010(0x10)
	char pad_1020[0x80]; // 0x1020(0x80)
	/*struct FMulticastInlineDelegate*/char OnPlayerStateMemberInfoListUpdate[0x10]; // 0x10a0(0x10)
	char pad_10B0[0x30]; // 0x10b0(0x30)
	/*struct FMulticastInlineDelegate*/char OnPlayerStateMemberInfoListLengthChanged[0x10]; // 0x10e0(0x10)
	char pad_10F0[0x10]; // 0x10f0(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerGamePlayStateChanged[0x10]; // 0x1100(0x10)
	char pad_1110[0x90]; // 0x1110(0x90)
	/*struct FDelegate*/char OnOpenSystemSettingHDEntrance[0x10]; // 0x11a0(0x10)
	/*struct FMulticastInlineDelegate*/char OnQuestTryDisplayDialog[0x10]; // 0x11b0(0x10)
	/*struct FMulticastInlineDelegate*/char OnTryReloadDelegate[0x10]; // 0x11c0(0x10)
	/*struct FDelegate*/char DFHDActionTipsShow[0x10]; // 0x11d0(0x10)
	/*struct FDelegate*/char DFHDActionTipsClose[0x10]; // 0x11e0(0x10)
	/*struct FDelegate*/char DFHDActionTipsUpdatePressedProgress[0x10]; // 0x11f0(0x10)
	/*struct FDelegate*/char DFHDActionTipsPlayAnim[0x10]; // 0x1200(0x10)
	/*struct FDelegate*/char DFHDActionTipsStopAnim[0x10]; // 0x1210(0x10)
	/*struct FMulticastInlineDelegate*/char OnInteractorPostProcessOutline[0x10]; // 0x1220(0x10)
	/*struct FMulticastInlineDelegate*/char TryInteractKeyDown[0x10]; // 0x1230(0x10)
	char pad_1240[0x10]; // 0x1240(0x10)
	/*struct FMulticastInlineDelegate*/char OnWatchFightInputEvent[0x10]; // 0x1250(0x10)
	/*struct FMulticastInlineDelegate*/char OnClientResetSpectateEvent[0x10]; // 0x1260(0x10)
	/*struct FMulticastInlineDelegate*/char OnMarkLogicInputKey[0x10]; // 0x1270(0x10)
	/*struct FMulticastInlineDelegate*/char SubtitleSeqStartDelegate[0x10]; // 0x1280(0x10)
	/*struct FMulticastInlineDelegate*/char SubtitleSeqEndDelegate[0x10]; // 0x1290(0x10)
	/*struct FMulticastInlineDelegate*/char SubtitleStartDelegate[0x10]; // 0x12a0(0x10)
	/*struct FMulticastInlineDelegate*/char SubtitleEndDelegate[0x10]; // 0x12b0(0x10)
	/*struct FMulticastInlineDelegate*/char SubtitleSeqFinishedDelegate[0x10]; // 0x12c0(0x10)
	/*struct FMulticastInlineDelegate*/char SubtitleGroupInteractorKeyPressedDelegate[0x10]; // 0x12d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnRefreshVehicleHUD[0x10]; // 0x12e0(0x10)
	/*struct FMulticastInlineDelegate*/char OnGetOnVehicle[0x10]; // 0x12f0(0x10)
	/*struct FMulticastInlineDelegate*/char OnSwitchSeatOnVehicle[0x10]; // 0x1300(0x10)
	/*struct FMulticastInlineDelegate*/char OnGetOffVehicle[0x10]; // 0x1310(0x10)
	/*struct FMulticastInlineDelegate*/char OnVehicleBeginFire[0x10]; // 0x1320(0x10)
	/*struct FMulticastInlineDelegate*/char OnHelicopterMoveStateChange[0x10]; // 0x1330(0x10)
	/*struct FMulticastInlineDelegate*/char QuestChangeHelicopterPath[0x10]; // 0x1340(0x10)
	/*struct FMulticastInlineDelegate*/char OnAbilityIncendiaryAreaSpawned[0x10]; // 0x1350(0x10)
	char pad_1360[0x20]; // 0x1360(0x20)
	/*struct FMulticastInlineDelegate*/char GPCharacterLandedDelegate[0x10]; // 0x1380(0x10)
	/*struct FMulticastInlineDelegate*/char GPCharacterJumpDelegate[0x10]; // 0x1390(0x10)
	/*struct FMulticastInlineDelegate*/char OnServerPlayerStartSlidingTackle[0x10]; // 0x13a0(0x10)
	/*struct FMulticastInlineDelegate*/char OnServerPlayerEndSlidingTackle[0x10]; // 0x13b0(0x10)
	char pad_13C0[0xf0]; // 0x13c0(0xf0)
	/*struct FMulticastInlineDelegate*/char OnServerAllPlayerLoadLevelCompleted[0x10]; // 0x14b0(0x10)
	/*struct FMulticastInlineDelegate*/char OnHoldSmokeWallSkill[0x10]; // 0x14c0(0x10)
	/*struct FMulticastInlineDelegate*/char OnMyMaxSoundLevelChanged[0x10]; // 0x14d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnShowSkillDetail[0x10]; // 0x14e0(0x10)
	/*struct FMulticastInlineDelegate*/char OnSetSkillDetail[0x10]; // 0x14f0(0x10)
	/*struct FMulticastInlineDelegate*/char OnShowSkillProcessBarAction[0x10]; // 0x1500(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerMarkEnemy[0x10]; // 0x1510(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerItemMarkingInfoArrayChange[0x10]; // 0x1520(0x10)
	char pad_1530[0x38]; // 0x1530(0x38)
	/*struct FMulticastInlineDelegate*/char OnWeaponHudViewShowChanged[0x10]; // 0x1568(0x10)
	/*struct FMulticastInlineDelegate*/char CountDownChangedNtf[0x10]; // 0x1578(0x10)
	/*struct FMulticastInlineDelegate*/char OnDebugAILabSys[0x10]; // 0x1588(0x10)
	/*struct FMulticastInlineDelegate*/char OnPVPAIPreKick[0x10]; // 0x1598(0x10)
	/*struct FMulticastInlineDelegate*/char OnScopeZoomRateChanged[0x10]; // 0x15a8(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyScopeRouletteDisable[0x10]; // 0x15b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnIsSlopingValueChanged[0x10]; // 0x15c8(0x10)
	/*struct FMulticastInlineDelegate*/char SimulatedCameraModeChangedDel[0x10]; // 0x15d8(0x10)
	/*struct FMulticastInlineDelegate*/char NotifyCanSuperSprint[0x10]; // 0x15e8(0x10)
	char pad_15F8[0x10]; // 0x15f8(0x10)
	/*struct FMulticastInlineDelegate*/char ServerCollectionWeaponUsingTime[0x10]; // 0x1608(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerMarking[0x10]; // 0x1618(0x10)
	/*struct FMulticastInlineDelegate*/char OnPersistBubbleStateChanged[0x10]; // 0x1628(0x10)
	/*struct FMulticastInlineDelegate*/char OnGuidePopFunctionDescClosed[0x10]; // 0x1638(0x10)
	/*struct FMulticastInlineDelegate*/char OnGuideClickUIClosed[0x10]; // 0x1648(0x10)
	/*struct FMulticastInlineDelegate*/char OnSonicDirTargetChange[0x10]; // 0x1658(0x10)
	/*struct FMulticastInlineDelegate*/char OnPreviewLocationValidChanged[0x10]; // 0x1668(0x10)
	/*struct FMulticastInlineDelegate*/char OnUseFireForAimChanged[0x10]; // 0x1678(0x10)
	char pad_1688[0x38]; // 0x1688(0x38)

	struct UGPGameplayDelegates* STATIC_Get(struct UObject* WorldContext); // Function GPGameplay.GPGameplayDelegates.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3602f70
	void BroadcastSkillBPEvent(struct FName Key, struct FName Value); // Function GPGameplay.GPGameplayDelegates.BroadcastSkillBPEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x3602eb0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameplayGlobalDelegates
// Size: 0x290 (Inherited: 0x38)
class UGPGameplayGlobalDelegates : public UGameInstanceSubsystem {
public:

	/*struct FMulticastInlineDelegate*/char OnPlayerUseItemKeyDown[0x10]; // 0x38(0x10)
	/*struct FMulticastInlineDelegate*/char OnHUDHealthDamaged[0x10]; // 0x48(0x10)
	/*struct FMulticastInlineDelegate*/char OnHUDVehicleHealthDamaged[0x10]; // 0x58(0x10)
	/*struct FMulticastInlineDelegate*/char OnHUDHitFeedBack[0x10]; // 0x68(0x10)
	/*struct FMulticastInlineDelegate*/char EnginVehicleLowPower[0x10]; // 0x78(0x10)
	/*struct FMulticastInlineDelegate*/char EnginVehicleDestroy[0x10]; // 0x88(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerEnterIrisReady[0x10]; // 0x98(0x10)
	/*struct FMulticastInlineDelegate*/char OnIrisSafeHouseResetHUD[0x10]; // 0xa8(0x10)
	/*struct FMulticastInlineDelegate*/char OnIrisSafeHouseSetStarLinkVisable[0x10]; // 0xb8(0x10)
	/*struct FMulticastInlineDelegate*/char OnEnterIrisSafeHouse[0x10]; // 0xc8(0x10)
	/*struct FMulticastInlineDelegate*/char OnEnter3DSafeHouse[0x10]; // 0xd8(0x10)
	/*struct FMulticastInlineDelegate*/char OnEnterRange[0x10]; // 0xe8(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayerExitSpectateMode[0x10]; // 0xf8(0x10)
	/*struct FMulticastInlineDelegate*/char OnStartLocalFocus[0x10]; // 0x108(0x10)
	/*struct FMulticastInlineDelegate*/char OnStopLocalFocus[0x10]; // 0x118(0x10)
	/*struct FMulticastInlineDelegate*/char OnLocalPlayerPawnChanged[0x10]; // 0x128(0x10)
	/*struct FMulticastInlineDelegate*/char OnOBFreeCameraStateModify[0x10]; // 0x138(0x10)
	/*struct FMulticastInlineDelegate*/char OnRoleLoadChanged[0x10]; // 0x148(0x10)
	/*struct FMulticastInlineDelegate*/char OnRoleLoadTypeChanged[0x10]; // 0x158(0x10)
	/*struct FMulticastInlineDelegate*/char OnTurnInItemInfo[0x10]; // 0x168(0x10)
	/*struct FMulticastInlineDelegate*/char OnNpcTurnInItemInfo[0x10]; // 0x178(0x10)
	/*struct FMulticastInlineDelegate*/char OnMissionReplay[0x10]; // 0x188(0x10)
	char pad_198[0x10]; // 0x198(0x10)
	/*struct FMulticastInlineDelegate*/char OnStartReplayRecording[0x10]; // 0x1a8(0x10)
	/*struct FMulticastInlineDelegate*/char OnStopReplayRecording[0x10]; // 0x1b8(0x10)
	/*struct FMulticastInlineDelegate*/char OnLoadAllReplayFilesComplete[0x10]; // 0x1c8(0x10)
	/*struct FMulticastInlineDelegate*/char OnPlayReplay[0x10]; // 0x1d8(0x10)
	/*struct FMulticastInlineDelegate*/char OnStopReplay[0x10]; // 0x1e8(0x10)
	/*struct FMulticastInlineDelegate*/char OnNetDisconnect[0x10]; // 0x1f8(0x10)
	/*struct FMulticastInlineDelegate*/char OnNetReconnectSuccess[0x10]; // 0x208(0x10)
	/*struct FMulticastInlineDelegate*/char OnNetReconnectFail[0x10]; // 0x218(0x10)
	/*struct FMulticastInlineDelegate*/char OpenLuaRuntimeDebug[0x10]; // 0x228(0x10)
	/*struct FMulticastInlineDelegate*/char OnBroadcastPlayGameFlow[0x10]; // 0x238(0x10)
	/*struct FMulticastInlineDelegate*/char OnGPGamePlayerPostLogin[0x10]; // 0x248(0x10)
	char pad_258[0x18]; // 0x258(0x18)
	/*struct FMulticastInlineDelegate*/char OnDisplayMetricsChangedHD[0x10]; // 0x270(0x10)
	/*struct FMulticastInlineDelegate*/char OnKillcamEndShowSettlement[0x10]; // 0x280(0x10)

	struct UGPGameplayGlobalDelegates* STATIC_Get(struct UObject* WorldContext); // Function GPGameplay.GPGameplayGlobalDelegates.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3603030
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPCharacterDataAsset
// Size: 0x1f8 (Inherited: 0x38)
class UGPCharacterDataAsset : public UDataAsset {
public:

	struct FVector RescuePointL; // 0x38(0x0c)
	struct FVector RescuePointR; // 0x44(0x0c)
	struct FVector RescuePointRStandPoseSol; // 0x50(0x0c)
	struct FVector RescuePointRCrouchPoseSol; // 0x5c(0x0c)
	struct FVector RescuePointRPronePoseSol; // 0x68(0x0c)
	struct FVector RescuePointRStandPoseBat; // 0x74(0x0c)
	struct FVector RescuePointRCrouchPoseBat; // 0x80(0x0c)
	struct FVector RescuePointRPronePoseBat; // 0x8c(0x0c)
	enum class ECharacterLogicPoseType BeRescueEndToBasePose; // 0x98(0x01)
	enum class ECharacterLogicPoseType MPBeRescueEndToBasePose; // 0x99(0x01)
	enum class ECollisionChannel ProjectileCollisionChannel; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
	struct TArray<struct FPreStateRTTInfo> PreStateRTTArray; // 0xa0(0x10)
	struct TMap<char, struct FLODInfoArray> CharacterPartToLODInfoMap; // 0xb0(0x50)
	struct TMap<char, struct FLODInfoArray> AICharacterPartToLODInfoMap; // 0x100(0x50)
	struct TMap<char, struct FLODInfoArray> CharacterPartToLODInfoMap_PC; // 0x150(0x50)
	struct TMap<char, struct FLODInfoArray> AICharacterPartToLODInfoMap_PC; // 0x1a0(0x50)
	float ResetWalkingPositionCD; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameplayStatics
// Size: 0x30 (Inherited: 0x30)
class UGPGameplayStatics : public UGameplayStatics {
public:


	bool STATIC_StartLocalDS(struct FString Params); // Function GPGameplay.GPGameplayStatics.StartLocalDS // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x36088c0
	void STATIC_ShowConfirmWindowWithSingleBtn(struct UObject* ObjectContext, struct FText Texts); // Function GPGameplay.GPGameplayStatics.ShowConfirmWindowWithSingleBtn // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x36086d0
	void STATIC_ShowCommonTips(struct UObject* ObjectContext, struct FText Tips, float ShowTime, bool bPositive, bool bShowInMobile, bool bShowInHD); // Function GPGameplay.GPGameplayStatics.ShowCommonTips // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x36084b0
	void STATIC_LoadTODLevel(struct UWorld* InWorld); // Function GPGameplay.GPGameplayStatics.LoadTODLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607d90
	void STATIC_HideActiveCommonTips(struct UObject* ObjectContext); // Function GPGameplay.GPGameplayStatics.HideActiveCommonTips // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607d20
	struct FName STATIC_GetWorldName(struct UObject* ObjectContetx); // Function GPGameplay.GPGameplayStatics.GetWorldName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607c90
	struct FString STATIC_GetExecutableFilePath(); // Function GPGameplay.GPGameplayStatics.GetExecutableFilePath // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607b40
	struct APlayerController* STATIC_GetClientFirstNetPlayerController(struct UObject* ObjectContetx); // Function GPGameplay.GPGameplayStatics.GetClientFirstNetPlayerController // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607ac0
	struct FName STATIC_GetBaseWorldName(struct UObject* ObjectContetx); // Function GPGameplay.GPGameplayStatics.GetBaseWorldName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607a30
	void STATIC_GameplayGPMEndExclude(struct UWorld* InWorld, struct FString ExcludeTag); // Function GPGameplay.GPGameplayStatics.GameplayGPMEndExclude // (Final|Native|Static|Public) // @ game+0x36078c0
	void STATIC_GameplayGPMBeginExclude(struct UWorld* InWorld, struct FString ExcludeTag); // Function GPGameplay.GPGameplayStatics.GameplayGPMBeginExclude // (Final|Native|Static|Public) // @ game+0x3607770
	void STATIC_GameplayChangeFpsOPAndType(enum class ELowFpsType FpsType, enum class ELowFpsOP FpsOP); // Function GPGameplay.GPGameplayStatics.GameplayChangeFpsOPAndType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x36076c0
	void STATIC_GameplayChangeFpsOP(enum class ELowFpsOP FpsOPType); // Function GPGameplay.GPGameplayStatics.GameplayChangeFpsOP // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607650
	void STATIC_CheckPropmtForFramerateStability(struct UObject* ObjectCtx); // Function GPGameplay.GPGameplayStatics.CheckPropmtForFramerateStability // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607460
	void STATIC_AssignNextCommonTipType(struct UObject* ObjectContext, bool bPopTips, bool bPopCenter); // Function GPGameplay.GPGameplayStatics.AssignNextCommonTipType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3607350
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameRuleConfig
// Size: 0x80 (Inherited: 0x30)
class UGPGameRuleConfig : public UObject {
public:

	struct TMap<enum class EGameRuleType, struct FGPGameRuleSetting> RuleSettings; // 0x30(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameSession
// Size: 0x390 (Inherited: 0x390)
class AGPGameSession : public AGameSession {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGameUserSettings
// Size: 0x128 (Inherited: 0x128)
class UGPGameUserSettings : public UGameUserSettings {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGeneralCSRPCComponent
// Size: 0x100 (Inherited: 0x100)
class UGPGeneralCSRPCComponent : public UActorComponent {
public:


	void Call(struct AActor* Target, struct FName FuncName, struct UObject* Arg); // Function GPGameplay.GPGeneralCSRPCComponent.Call // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x360b400
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPGeneralCSRPCUtils
// Size: 0x30 (Inherited: 0x30)
class UGPGeneralCSRPCUtils : public UBlueprintFunctionLibrary {
public:


	void STATIC_Call(struct AActor* Target, struct FName FuncName, struct UObject* Arg); // Function GPGameplay.GPGeneralCSRPCUtils.Call // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x360b500
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPHandIKComponent
// Size: 0x1a0 (Inherited: 0x100)
class UGPHandIKComponent : public UActorComponent {
public:

	struct FTransform LeftHandTransform; // 0x100(0x30)
	bool bEnableLeftHandIK; // 0x130(0x01)
	char pad_131[0xf]; // 0x131(0x0f)
	struct FTransform RightHandTransform; // 0x140(0x30)
	bool bEnableRightHandIK; // 0x170(0x01)
	bool bEnableDoubleHandIK; // 0x171(0x01)
	char pad_172[0x2]; // 0x172(0x02)
	struct FName RightIKRootBone; // 0x174(0x08)
	struct FName LeftIKRootBone; // 0x17c(0x08)
	struct TWeakObjectPtr<struct AGPCharacterBase> Owner; // 0x184(0x08)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct AIKEndEffectorTarget* LeftEndEffectorTarget; // 0x190(0x08)
	struct AIKEndEffectorTarget* RightEndEffectorTarget; // 0x198(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPHandIKInstance
// Size: 0xa40 (Inherited: 0x280)
class UGPHandIKInstance : public UAnimInstance {
public:

	struct FGPHandIKInstanceProxy LocalProxy; // 0x280(0x7c0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPHitEffectComponent
// Size: 0x510 (Inherited: 0x100)
class UGPHitEffectComponent : public UActorComponent {
public:

	struct FTakeHitInfo LastTakeHitInfo; // 0x100(0xd0)
	struct FTakeHitInfo LastTakeHitInfoForShield; // 0x1d0(0xd0)
	bool bPlayShieldBrokenEffect; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct TWeakObjectPtr<struct UParticleSystemComponent> SheildPSC; // 0x2a4(0x08)
	float LowHealthThreshold; // 0x2ac(0x04)
	float DamageArmorHitFixValue; // 0x2b0(0x04)
	struct FName CameraEffectId; // 0x2b4(0x08)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct FGameplayTagContainer UseSpecialDamageRateWithAnyTags; // 0x2c0(0x20)
	float SpecialDamageRate; // 0x2e0(0x04)
	char pad_2E4[0xc]; // 0x2e4(0x0c)
	struct TArray<struct FHitPartInfo> HitPartInfoLookupTable; // 0x2f0(0x10)
	/*struct TSoftObjectPtr<UParticleSystem>*/char ShieldPS[0x28]; // 0x300(0x28)
	bool bAttachShieldEffectToTarget; // 0x328(0x01)
	char pad_329[0x3]; // 0x329(0x03)
	float ShieldEffectRadius; // 0x32c(0x04)
	struct FTransform ShieldEffectOffset; // 0x330(0x30)
	/*struct TSoftObjectPtr<UParticleSystem>*/char ShieldBreakPS[0x28]; // 0x360(0x28)
	char pad_388[0x8]; // 0x388(0x08)
	struct FTransform ShieldBreakEffectOffset; // 0x390(0x30)
	/*struct FMulticastInlineDelegate*/char OnTakeHitShield[0x10]; // 0x3c0(0x10)
	/*struct FMulticastInlineDelegate*/char OnTakeHitHealth[0x10]; // 0x3d0(0x10)
	/*struct FMulticastInlineDelegate*/char OnMulticastTakeHitHealth[0x10]; // 0x3e0(0x10)
	struct TArray<struct UClass*> GPAClass; // 0x3f0(0x10)
	float HitFlagInterval; // 0x400(0x04)
	float HitFlagCanInterrup; // 0x404(0x04)
	struct UAnimSequence* FPPHitAnim; // 0x408(0x08)
	struct UAnimSequence* TPPHitAnim; // 0x410(0x08)
	struct UAnimSequence* FPPHitHeadAnim; // 0x418(0x08)
	bool HitFlagInterrup; // 0x420(0x01)
	bool HitFlag; // 0x421(0x01)
	enum class EHitEffectType HitEffectType; // 0x422(0x01)
	char pad_423[0x1]; // 0x423(0x01)
	int32_t HitSpecPS; // 0x424(0x04)
	struct TMap<uint64_t, uint64_t> HitSpecPSMapping; // 0x428(0x50)
	bool bPlayHitAnimation; // 0x478(0x01)
	char pad_479[0x1f]; // 0x479(0x1f)
	struct UCurveFloat* EffectScaleDistanceCurve; // 0x498(0x08)
	struct AGPPlayerCameraManager* CachePlayerCameraManager; // 0x4a0(0x08)
	struct TMap<enum class EHitEffectColor, struct FLinearColor> HitEffectColorMap; // 0x4a8(0x50)
	char pad_4F8[0x18]; // 0x4f8(0x18)

	void SetHitEffectType(enum class EHitEffectType EffectType); // Function GPGameplay.GPHitEffectComponent.SetHitEffectType // (Final|Native|Public|BlueprintCallable) // @ game+0x36167f0
	void ReceiveBulletWhoosh(/*struct FHitResult& HitInfo, struct FVector& StartLocation, struct TScriptInterface<IWeaponInterface> WeaponOwner*/); // Function GPGameplay.GPHitEffectComponent.ReceiveBulletWhoosh // (Native|Public|HasOutParms|HasDefaults) // @ game+0x3616670
	void ProcessClientOnTakeHitHealthMulticast(struct AActor* TargetCharacter, float LocalDamageDone, float TotalDamageDone, struct FHitResult& HitResult, struct FGameplayTagContainer& SourceTags, struct AActor* SourceActor, struct AActor* SourceCharacter, enum class EDamageType& DamageType, enum class EHitEventType& HitEventType, int32_t ArmorLevel, uint64_t AttackerValueId); // Function GPGameplay.GPHitEffectComponent.ProcessClientOnTakeHitHealthMulticast // (Native|Public|HasOutParms) // @ game+0x3616240
	void ProcessClientOnTakeHitHealth(struct AActor* TargetCharacter, float LocalDamageDone, struct FHitResult& HitResult, struct FGameplayTagContainer& SourceTags, struct AActor* SourceActor, struct AActor* SourceCharacter, enum class EDamageType& DamageType, enum class EHitEventType& HitEventType, int32_t ArmorLevel, float HealthPercent, struct FVector MakerOwnerLocation, uint64_t AttackerValueId); // Function GPGameplay.GPHitEffectComponent.ProcessClientOnTakeHitHealth // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x3615de0
	void PlayTakeHitEffectsForShield(); // Function GPGameplay.GPHitEffectComponent.PlayTakeHitEffectsForShield // (Native|Event|Public|BlueprintEvent) // @ game+0x360c9a0
	void PlayTakeHitEffects(); // Function GPGameplay.GPHitEffectComponent.PlayTakeHitEffects // (Native|Event|Public|BlueprintEvent) // @ game+0x3615dc0
	void PlayShieldBrokenEffect(struct FVector HitPoint); // Function GPGameplay.GPHitEffectComponent.PlayShieldBrokenEffect // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0x3615d30
	void PlayHitFlagAnimation(struct FHitResult& HitResult, struct AActor* SourceCharacter, enum class EDamageType& DamageType, enum class EHitEventType HitEventType); // Function GPGameplay.GPHitEffectComponent.PlayHitFlagAnimation // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3615b90
	void OnRep_PlayTakeHitEffectsForShield(); // Function GPGameplay.GPHitEffectComponent.OnRep_PlayTakeHitEffectsForShield // (Final|Native|Public) // @ game+0x3615b70
	void OnRep_PlayTakeHitEffects(); // Function GPGameplay.GPHitEffectComponent.OnRep_PlayTakeHitEffects // (Final|Native|Public) // @ game+0x3615b50
	void OnRep_PlayShieldBrokenEffect(); // Function GPGameplay.GPHitEffectComponent.OnRep_PlayShieldBrokenEffect // (Final|Native|Public) // @ game+0x88f4d0
	void OnOwnerCharacterReborn(); // Function GPGameplay.GPHitEffectComponent.OnOwnerCharacterReborn // (Final|Native|Public) // @ game+0x36157f0
	void OnOwnerCharacterDied(struct AGPCharacterBase* CHARACTER, struct AController* Killer, struct UDamageType* DamageType); // Function GPGameplay.GPHitEffectComponent.OnOwnerCharacterDied // (Native|Public) // @ game+0x36156f0
	bool STATIC_IsWeaponHitWeakness(struct FGameplayEffectContextHandle EffectContext, struct AActor* TargetActor); // Function GPGameplay.GPHitEffectComponent.IsWeaponHitWeakness // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3615500
	struct FVector GetEffectScaleByLocalCharacter(struct FVector TargetPoint); // Function GPGameplay.GPHitEffectComponent.GetEffectScaleByLocalCharacter // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x36152b0
	struct FVector GetEffectScaleByDistance(struct FVector SourcePoint, struct FVector TargetPoint); // Function GPGameplay.GPHitEffectComponent.GetEffectScaleByDistance // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x36151b0
	void EndHitFlagAnimation(); // Function GPGameplay.GPHitEffectComponent.EndHitFlagAnimation // (Native|Public|BlueprintCallable) // @ game+0x17553a0
	void ClientOnTakeHitShield(struct AActor* TargetCharacter, float LocalDamageDone, struct FHitResult HitResult, struct FGameplayTagContainer SourceTags, struct AActor* SourceActor, struct ACHARACTER* SourceCharacter); // Function GPGameplay.GPHitEffectComponent.ClientOnTakeHitShield // (Net|Native|Event|Public|NetClient) // @ game+0x3614f40
	void ClientOnTakeHitHealthMulticast(struct AActor* TargetCharacter, float LocalDamageDone, float TotalDamageDone, struct FHitResult HitResult, struct FGameplayTagContainer SourceTags, struct AActor* SourceActor, struct AActor* SourceCharacter, enum class EDamageType DamageType, enum class EHitEventType HitEventType, int32_t ArmorLevelf); // Function GPGameplay.GPHitEffectComponent.ClientOnTakeHitHealthMulticast // (Net|Native|Event|NetMulticast|Public) // @ game+0x3614bc0
	void ClientOnTakeHitHealth(struct AActor* TargetCharacter, float LocalDamageDone, struct FHitResult HitResult, struct FGameplayTagContainer SourceTags, struct AActor* SourceActor, struct AActor* SourceCharacter, enum class EDamageType DamageType, enum class EHitEventType HitEventType, int32_t ArmorLevel, float HealthPercent); // Function GPGameplay.GPHitEffectComponent.ClientOnTakeHitHealth // (Net|Native|Event|Public|NetClient) // @ game+0x3614840
	void ClientMakeHitFeedBack(struct AActor* TargetCharacter, float LocalDamageDone, struct FHitResult HitResult, struct FGameplayTagContainer SourceTags, struct AActor* SourceActor, struct AActor* SourceCharacter, enum class EDamageType DamageType, enum class EHitEventType HitEventType, int32_t ArmorLevel, uint64_t AttackerValueId); // Function GPGameplay.GPHitEffectComponent.ClientMakeHitFeedBack // (Net|Native|Event|Public|NetClient) // @ game+0x36144c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPHotFixHelperComponent
// Size: 0x160 (Inherited: 0x100)
class UGPHotFixHelperComponent : public UActorComponent {
public:

	struct TArray<float> HotFixFloatArray; // 0x100(0x10)
	struct TArray<int32_t> HotFixIntArray; // 0x110(0x10)
	struct TArray<struct FVector> HotFixVectorArray; // 0x120(0x10)
	struct TArray<float> HotFixRepFloatArray; // 0x130(0x10)
	struct TArray<int32_t> HotFixRepIntArray; // 0x140(0x10)
	struct TArray<struct FVector> HotFixRepVectorArray; // 0x150(0x10)

	void OnRep_HotFixRepVectorArray(); // Function GPGameplay.GPHotFixHelperComponent.OnRep_HotFixRepVectorArray // (Final|Native|Public) // @ game+0x3615b30
	void OnRep_HotFixRepIntArray(); // Function GPGameplay.GPHotFixHelperComponent.OnRep_HotFixRepIntArray // (Final|Native|Public) // @ game+0x3615b10
	void OnRep_HotFixRepFloatArray(); // Function GPGameplay.GPHotFixHelperComponent.OnRep_HotFixRepFloatArray // (Final|Native|Public) // @ game+0x3615af0
	void HotFixServerToClientRPC(struct FHotFixHelperDataInfo HotFixDataInfo); // Function GPGameplay.GPHotFixHelperComponent.HotFixServerToClientRPC // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x3615430
	void HotFixClientToServerRPC(struct FHotFixHelperDataInfo HotFixDataInfo); // Function GPGameplay.GPHotFixHelperComponent.HotFixClientToServerRPC // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x3615360
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPHudDataReplicator
// Size: 0x540 (Inherited: 0x378)
class AGPHudDataReplicator : public AActor {
public:

	struct TMap<int32_t, int32_t> HudDataIndexMap; // 0x378(0x50)
	struct FGPHudDataFastArray GPHudDataFastArray; // 0x3c8(0x120)
	char pad_4E8[0x58]; // 0x4e8(0x58)

	void OnRep_GPHudFastArray(struct FGPHudDataFastArray& OldGPHudDataFastArray); // Function GPGameplay.GPHudDataReplicator.OnRep_GPHudFastArray // (Final|Native|Protected|HasOutParms) // @ game+0x36158a0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPInputInterface
// Size: 0x30 (Inherited: 0x30)
class UGPInputInterface : public UInterface {
public:


	void TurnLookUpAtRate(float Rate); // Function GPGameplay.GPInputInterface.TurnLookUpAtRate // (Native|Public) // @ game+0x1750760
	void TurnAtRate(float Rate); // Function GPGameplay.GPInputInterface.TurnAtRate // (Native|Public) // @ game+0x17507e0
	void SetMoveRight(float Value); // Function GPGameplay.GPInputInterface.SetMoveRight // (Native|Public) // @ game+0xaa3040
	void SetMoveForward(float Value); // Function GPGameplay.GPInputInterface.SetMoveForward // (Native|Public) // @ game+0x361db00
	void MoveUp(float Value); // Function GPGameplay.GPInputInterface.MoveUp // (Native|Public) // @ game+0x1750c50
	void Jump(); // Function GPGameplay.GPInputInterface.Jump // (Native|Public) // @ game+0x174a9c0
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class GPGameplay.GPInputManager
// Size: 0x630 (Inherited: 0x100)
class UGPInputManager : public UActorComponent {
public:

	char pad_100[0x20]; // 0x100(0x20)
	struct AGPPlayerController* PlayerController; // 0x120(0x08)
	char pad_128[0x230]; // 0x128(0x230)
	struct UGPInputFireLogic* InputFireLogic; // 0x358(0x08)
	struct UGPInputLeftFireLogic* InputLeftFireLogic; // 0x360(0x08)
	struct UGPWeaponInputLogic* WeaponInputLogic; // 0x368(0x08)
	struct UGPInputAimLogic* InputAimLogic; // 0x370(0x08)
	struct UGPInputMovementLogic* InputMovementLogic; // 0x378(0x08)
	struct UGPInputInteractLogic* InputInteractLogic; // 0x380(0x08)
	struct UGPInputMarkingLogic* InputMarkingLogic; // 0x388(0x08)
	struct UGPInputReloadLogic* InputReloadLogic; // 0x390(0x08)
	struct UGPInputChangeScopeLogic* InputChangeScopeLogic; // 0x398(0x08)
	char pad_3A0[0x240]; // 0x3a0(0x240)
	/*struct TSet<struct FName>*/char ActivatingRoulettes[0x50]; // 0x5e0(0x50)

	void RetriggerPressingKeyCorrInput(); // Function GPGameplay.GPInputManager.RetriggerPressingKeyCorrInput // (Native|Public) // @ game+0x361da60
	void ReleasePressing(char ReleaseType); // Function GPGameplay.GPInputManager.ReleasePressing // (Native|Public) // @ game+0x361d9e0
	void ProcessPullOutArrow(enum class EInputActionType KeyActionType); // Function GPGameplay.GPInputManager.ProcessPullOutArrow // (Native|Public) // @ game+0x361d960
	void ProcessKeyESC(); // Function GPGameplay.GPInputManager.ProcessKeyESC // (Native|Public) // @ game+0x128b6f0
	void ProcessGMToggleGhostWalk(); // Function GPGameplay.GPInputManager.ProcessGMToggleGhostWalk // (Native|Public) // @ game+0x3607f50
	void ProcessGMToggleFlyWalk(); // Function GPGameplay.GPInputManager.ProcessGMToggleFlyWalk // (Native|Public) // @ game+0x361d940
	void ProcessGMMinusSpeed100(); // Function GPGameplay.GPInputManager.ProcessGMMinusSpeed100 // (Native|Public) // @ game+0x361d920
	void ProcessGMAddSpeed100(); // Function GPGameplay.GPInputManager.ProcessGMAddSpeed100 // (Native|Public) // @ game+0x361d900
	void ProcessFirefighting(enum class EInputActionType KeyActionType); // Function GPGameplay.GPInputManager.ProcessFirefighting // (Native|Public) // @ game+0x361d880
	void ProcessCloseDeathDetail(); // Function GPGameplay.GPInputManager.ProcessCloseDeathDetail // (Native|Public) // @ game+0x128b750
	void OnThirdVehicleSkillUp(); // Function GPGameplay.GPInputManager.OnThirdVehicleSkillUp // (Final|Native|Public) // @ game+0x361d700
	void OnThirdVehicleSkillDown(); // Function GPGameplay.GPInputManager.OnThirdVehicleSkillDown // (Final|Native|Public) // @ game+0x361d6e0
	void OnSwitchChatWindow(); // Function GPGameplay.GPInputManager.OnSwitchChatWindow // (Final|Native|Public) // @ game+0x361d6c0
	void OnSecondVehicleWeaponFire(); // Function GPGameplay.GPInputManager.OnSecondVehicleWeaponFire // (Final|Native|Public) // @ game+0x361d6a0
	void OnSecondVehicleSkillUp(); // Function GPGameplay.GPInputManager.OnSecondVehicleSkillUp // (Final|Native|Public) // @ game+0x361d680
	void OnSecondVehicleSkillDown(); // Function GPGameplay.GPInputManager.OnSecondVehicleSkillDown // (Final|Native|Public) // @ game+0x361d660
	void OnMiniMapScaleChange(); // Function GPGameplay.GPInputManager.OnMiniMapScaleChange // (Final|Native|Public) // @ game+0x361d540
	void OnMapKeyUp(); // Function GPGameplay.GPInputManager.OnMapKeyUp // (Final|Native|Public) // @ game+0x361d520
	void OnMapKeyDown(); // Function GPGameplay.GPInputManager.OnMapKeyDown // (Final|Native|Public) // @ game+0x361d500
	void OnMapDigitalKey4(); // Function GPGameplay.GPInputManager.OnMapDigitalKey4 // (Final|Native|Public) // @ game+0x361d4e0
	void OnMapDigitalKey3(); // Function GPGameplay.GPInputManager.OnMapDigitalKey3 // (Final|Native|Public) // @ game+0x361d4c0
	void OnMapDigitalKey2(); // Function GPGameplay.GPInputManager.OnMapDigitalKey2 // (Final|Native|Public) // @ game+0x361d4a0
	void OnMapDigitalKey1(); // Function GPGameplay.GPInputManager.OnMapDigitalKey1 // (Final|Native|Public) // @ game+0x361d480
	void OnLockVehicleCameraRelease(); // Function GPGameplay.GPInputManager.OnLockVehicleCameraRelease // (Final|Native|Public) // @ game+0x361d460
	void OnLockVehicleCameraPress(); // Function GPGameplay.GPInputManager.OnLockVehicleCameraPress // (Final|Native|Public) // @ game+0x361d440
	void OnInputZoomUpBigMapScale(); // Function GPGameplay.GPInputManager.OnInputZoomUpBigMapScale // (Final|Native|Public) // @ game+0x361d0e0
	void OnInputZoomDownBigMapScale(); // Function GPGameplay.GPInputManager.OnInputZoomDownBigMapScale // (Final|Native|Public) // @ game+0x361d0c0
	void OnInputVehicleTrumpetReleased(); // Function GPGameplay.GPInputManager.OnInputVehicleTrumpetReleased // (Final|Native|Public) // @ game+0x361d0a0
	void OnInputVehicleTrumpet(); // Function GPGameplay.GPInputManager.OnInputVehicleTrumpet // (Final|Native|Public) // @ game+0x361d080
	void OnInputVehicleSwitchXPP(); // Function GPGameplay.GPInputManager.OnInputVehicleSwitchXPP // (Final|Native|Public) // @ game+0x361d060
	void OnInputVehicleHeadOut(); // Function GPGameplay.GPInputManager.OnInputVehicleHeadOut // (Final|Native|Public) // @ game+0x361d040
	void OnInputVehicleBrakeReleased(); // Function GPGameplay.GPInputManager.OnInputVehicleBrakeReleased // (Final|Native|Public) // @ game+0x361d020
	void OnInputVehicleBrake(); // Function GPGameplay.GPInputManager.OnInputVehicleBrake // (Final|Native|Public) // @ game+0x361d000
	void OnInputVehicleBoost(); // Function GPGameplay.GPInputManager.OnInputVehicleBoost // (Final|Native|Public) // @ game+0x361cfe0
	void OnInputVehicleAimUp(); // Function GPGameplay.GPInputManager.OnInputVehicleAimUp // (Final|Native|Public) // @ game+0x361cfc0
	void OnInputVehicleAimDown(); // Function GPGameplay.GPInputManager.OnInputVehicleAimDown // (Final|Native|Public) // @ game+0x361cfa0
	void OnInputVault(); // Function GPGameplay.GPInputManager.OnInputVault // (Final|Native|Public) // @ game+0x361cf80
	void OnInputTPPRotateCameraReleased(); // Function GPGameplay.GPInputManager.OnInputTPPRotateCameraReleased // (Final|Native|Public) // @ game+0x361cee0
	void OnInputTPPRotateCamera(); // Function GPGameplay.GPInputManager.OnInputTPPRotateCamera // (Final|Native|Public) // @ game+0x361cec0
	void OnInputToggleVoiceSpeaking(); // Function GPGameplay.GPInputManager.OnInputToggleVoiceSpeaking // (Final|Native|Public) // @ game+0x361cf60
	void OnInputToggleScoreboardReleased(); // Function GPGameplay.GPInputManager.OnInputToggleScoreboardReleased // (Final|Native|Public) // @ game+0x361cf40
	void OnInputToggleScoreboard(); // Function GPGameplay.GPInputManager.OnInputToggleScoreboard // (Final|Native|Public) // @ game+0x361cf20
	void OnInputToggleLegends(); // Function GPGameplay.GPInputManager.OnInputToggleLegends // (Final|Native|Public) // @ game+0x361cf00
	void OnInputSwitchWeapon4(); // Function GPGameplay.GPInputManager.OnInputSwitchWeapon4 // (Final|Native|Public) // @ game+0x361cea0
	void OnInputSwitchWeapon3(); // Function GPGameplay.GPInputManager.OnInputSwitchWeapon3 // (Final|Native|Public) // @ game+0x361ce80
	void OnInputSwitchWeapon2(); // Function GPGameplay.GPInputManager.OnInputSwitchWeapon2 // (Final|Native|Public) // @ game+0x361ce60
	void OnInputSwitchWeapon1(); // Function GPGameplay.GPInputManager.OnInputSwitchWeapon1 // (Final|Native|Public) // @ game+0x361ce40
	void OnInputSwitchVehicleWeapon2(); // Function GPGameplay.GPInputManager.OnInputSwitchVehicleWeapon2 // (Final|Native|Public) // @ game+0x361ce20
	void OnInputSwitchVehicleWeapon1(); // Function GPGameplay.GPInputManager.OnInputSwitchVehicleWeapon1 // (Final|Native|Public) // @ game+0x361ce00
	void OnInputSwitchToPreWeapon(); // Function GPGameplay.GPInputManager.OnInputSwitchToPreWeapon // (Final|Native|Public) // @ game+0x361cde0
	void OnInputSwitchToNextWeapon(); // Function GPGameplay.GPInputManager.OnInputSwitchToNextWeapon // (Final|Native|Public) // @ game+0x361cdc0
	void OnInputSwitchTacticalEquipmentUp(); // Function GPGameplay.GPInputManager.OnInputSwitchTacticalEquipmentUp // (Final|Native|Public) // @ game+0x361cda0
	void OnInputSwitchTacticalEquipmentDown(); // Function GPGameplay.GPInputManager.OnInputSwitchTacticalEquipmentDown // (Final|Native|Public) // @ game+0x361cd80
	void OnInputSwitchScrollVehicleWeapon2(); // Function GPGameplay.GPInputManager.OnInputSwitchScrollVehicleWeapon2 // (Final|Native|Public) // @ game+0x361cd60
	void OnInputSwitchScrollVehicleWeapon1(); // Function GPGameplay.GPInputManager.OnInputSwitchScrollVehicleWeapon1 // (Final|Native|Public) // @ game+0x361cd40
	void OnInputSkillCustom1Released(); // Function GPGameplay.GPInputManager.OnInputSkillCustom1Released // (Final|Native|Public) // @ game+0x361cd20
	void OnInputSkillCustom1Down(); // Function GPGameplay.GPInputManager.OnInputSkillCustom1Down // (Final|Native|Public) // @ game+0x361cd00
	void OnInputRouletteMedUp(); // Function GPGameplay.GPInputManager.OnInputRouletteMedUp // (Final|Native|Public) // @ game+0x361cce0
	void OnInputRouletteMedDown(); // Function GPGameplay.GPInputManager.OnInputRouletteMedDown // (Final|Native|Public) // @ game+0x361ccc0
	void OnInputRouletteLeftBtnDown(); // Function GPGameplay.GPInputManager.OnInputRouletteLeftBtnDown // (Final|Native|Public) // @ game+0x361cca0
	void OnInputRouletteEquipUp(); // Function GPGameplay.GPInputManager.OnInputRouletteEquipUp // (Final|Native|Public) // @ game+0x361cc80
	void OnInputRouletteEquipDown(); // Function GPGameplay.GPInputManager.OnInputRouletteEquipDown // (Final|Native|Public) // @ game+0x361cc60
	void OnInputRescueReleased(); // Function GPGameplay.GPInputManager.OnInputRescueReleased // (Final|Native|Public) // @ game+0x361cc40
	void OnInputRescue(); // Function GPGameplay.GPInputManager.OnInputRescue // (Final|Native|Public) // @ game+0x361cc20
	void OnInputRequestRescueReleased(); // Function GPGameplay.GPInputManager.OnInputRequestRescueReleased // (Final|Native|Public) // @ game+0x361cc00
	void OnInputRequestRescue(); // Function GPGameplay.GPInputManager.OnInputRequestRescue // (Final|Native|Public) // @ game+0x361cbe0
	void OnInputRangeToggleAnalysisPanel(); // Function GPGameplay.GPInputManager.OnInputRangeToggleAnalysisPanel // (Final|Native|Public) // @ game+0x361cbc0
	void OnInputRangeRefreshAnalysisPanel(); // Function GPGameplay.GPInputManager.OnInputRangeRefreshAnalysisPanel // (Final|Native|Public) // @ game+0x361cba0
	void OnInputRangeManageWeapon(); // Function GPGameplay.GPInputManager.OnInputRangeManageWeapon // (Final|Native|Public) // @ game+0x361cb80
	void OnInputRangeFinderDown(); // Function GPGameplay.GPInputManager.OnInputRangeFinderDown // (Final|Native|Public) // @ game+0x361cb60
	void OnInputQuickResYes(); // Function GPGameplay.GPInputManager.OnInputQuickResYes // (Final|Native|Public) // @ game+0x361cb40
	void OnInputQuickResNo(); // Function GPGameplay.GPInputManager.OnInputQuickResNo // (Final|Native|Public) // @ game+0x361cb20
	void OnInputPullOutArrowReleased(); // Function GPGameplay.GPInputManager.OnInputPullOutArrowReleased // (Final|Native|Public) // @ game+0x361cb00
	void OnInputPullOutArrowDown(); // Function GPGameplay.GPInputManager.OnInputPullOutArrowDown // (Final|Native|Public) // @ game+0x361cae0
	void OnInputOpenPowerFlash(); // Function GPGameplay.GPInputManager.OnInputOpenPowerFlash // (Final|Native|Public) // @ game+0x361cac0
	void OnInputOpenParachute(); // Function GPGameplay.GPInputManager.OnInputOpenParachute // (Final|Native|Public) // @ game+0x361caa0
	void OnInputOpenMap(); // Function GPGameplay.GPInputManager.OnInputOpenMap // (Final|Native|Public) // @ game+0x361ca80
	void OnInputMuteAll(); // Function GPGameplay.GPInputManager.OnInputMuteAll // (Final|Native|Public) // @ game+0x361ca60
	void OnInputMarkReleased(); // Function GPGameplay.GPInputManager.OnInputMarkReleased // (Final|Native|Public) // @ game+0x361ca40
	void OnInputMark(); // Function GPGameplay.GPInputManager.OnInputMark // (Final|Native|Public) // @ game+0x361ca20
	void OnInputMapLongPressSelectUp(); // Function GPGameplay.GPInputManager.OnInputMapLongPressSelectUp // (Final|Native|Public) // @ game+0x361ca00
	void OnInputMapLongPressSelectDown(); // Function GPGameplay.GPInputManager.OnInputMapLongPressSelectDown // (Final|Native|Public) // @ game+0x361c9e0
	void OnInputLootingOpenHealthTag(); // Function GPGameplay.GPInputManager.OnInputLootingOpenHealthTag // (Final|Native|Public) // @ game+0x361c9c0
	void OnInputLootingOpenBag(); // Function GPGameplay.GPInputManager.OnInputLootingOpenBag // (Final|Native|Public) // @ game+0x361c9a0
	void OnInputLocatePlayer(); // Function GPGameplay.GPInputManager.OnInputLocatePlayer // (Final|Native|Public) // @ game+0x361c980
	void OnInputLeaveVehicle(); // Function GPGameplay.GPInputManager.OnInputLeaveVehicle // (Final|Native|Public) // @ game+0x361c960
	void OnInputKeyZiplineButtonDown(); // Function GPGameplay.GPInputManager.OnInputKeyZiplineButtonDown // (Final|Native|Public) // @ game+0x361c940
	void OnInputKeyWeaponInspect(); // Function GPGameplay.GPInputManager.OnInputKeyWeaponInspect // (Final|Native|Public) // @ game+0x361c920
	void OnInputKeyWeaponBipodDeploy(); // Function GPGameplay.GPInputManager.OnInputKeyWeaponBipodDeploy // (Final|Native|Public) // @ game+0x361c900
	void OnInputKeyUnSprint(); // Function GPGameplay.GPInputManager.OnInputKeyUnSprint // (Native|Public) // @ game+0x361c8e0
	void OnInputKeyUnSilentWalk(); // Function GPGameplay.GPInputManager.OnInputKeyUnSilentWalk // (Native|Public) // @ game+0x360c9c0
	void OnInputKeyUnSideAim(); // Function GPGameplay.GPInputManager.OnInputKeyUnSideAim // (Final|Native|Public) // @ game+0x361c8c0
	void OnInputKeyUnJump(); // Function GPGameplay.GPInputManager.OnInputKeyUnJump // (Final|Native|Public) // @ game+0x361c8a0
	void OnInputKeyUnHoldBreath(); // Function GPGameplay.GPInputManager.OnInputKeyUnHoldBreath // (Final|Native|Public) // @ game+0x361c880
	void OnInputKeyUnAim(); // Function GPGameplay.GPInputManager.OnInputKeyUnAim // (Final|Native|Public) // @ game+0x361c860
	void OnInputKeyToggleRecordPanel(); // Function GPGameplay.GPInputManager.OnInputKeyToggleRecordPanel // (Final|Native|Public) // @ game+0x361c840
	void OnInputKeyToggleRecordMode(); // Function GPGameplay.GPInputManager.OnInputKeyToggleRecordMode // (Final|Native|Public) // @ game+0x361c820
	void OnInputKeyTelescope(); // Function GPGameplay.GPInputManager.OnInputKeyTelescope // (Final|Native|Public) // @ game+0x361c800
	void OnInputKeySwitchWeaponFireMode(); // Function GPGameplay.GPInputManager.OnInputKeySwitchWeaponFireMode // (Final|Native|Public) // @ game+0x361c7e0
	void OnInputKeySwitchMouseMode(); // Function GPGameplay.GPInputManager.OnInputKeySwitchMouseMode // (Final|Native|Public) // @ game+0x361c7c0
	void OnInputKeyStopFire(); // Function GPGameplay.GPInputManager.OnInputKeyStopFire // (Final|Native|Public) // @ game+0x361c7a0
	void OnInputKeyStartFire(); // Function GPGameplay.GPInputManager.OnInputKeyStartFire // (Final|Native|Public) // @ game+0x361c780
	void OnInputKeySprint(); // Function GPGameplay.GPInputManager.OnInputKeySprint // (Native|Public) // @ game+0x3615dc0
	void OnInputKeySkillButtonUp(); // Function GPGameplay.GPInputManager.OnInputKeySkillButtonUp // (Final|Native|Public) // @ game+0x361c760
	void OnInputKeySkillButtonDown(); // Function GPGameplay.GPInputManager.OnInputKeySkillButtonDown // (Final|Native|Public) // @ game+0x361c740
	void OnInputKeySilentWalk(); // Function GPGameplay.GPInputManager.OnInputKeySilentWalk // (Native|Public) // @ game+0x360c9a0
	void OnInputKeySideAim(); // Function GPGameplay.GPInputManager.OnInputKeySideAim // (Final|Native|Public) // @ game+0x361c720
	void OnInputKeyShowWeaponPanel(); // Function GPGameplay.GPInputManager.OnInputKeyShowWeaponPanel // (Final|Native|Public) // @ game+0x361c700
	void OnInputKeyShowQuestPanel(); // Function GPGameplay.GPInputManager.OnInputKeyShowQuestPanel // (Final|Native|Public) // @ game+0x361c6e0
	void OnInputKeyShowGMPanel(); // Function GPGameplay.GPInputManager.OnInputKeyShowGMPanel // (Final|Native|Public) // @ game+0x361c6c0
	void OnInputKeyShowAnimPanel(); // Function GPGameplay.GPInputManager.OnInputKeyShowAnimPanel // (Final|Native|Public) // @ game+0x361c6a0
	void OnInputKeyRightLeanPeekUp(); // Function GPGameplay.GPInputManager.OnInputKeyRightLeanPeekUp // (Final|Native|Public) // @ game+0x361c680
	void OnInputKeyRightLeanPeekDown(); // Function GPGameplay.GPInputManager.OnInputKeyRightLeanPeekDown // (Final|Native|Public) // @ game+0x361c660
	void OnInputKeyReloadUp(); // Function GPGameplay.GPInputManager.OnInputKeyReloadUp // (Final|Native|Public) // @ game+0x361c640
	void OnInputKeyReload(); // Function GPGameplay.GPInputManager.OnInputKeyReload // (Final|Native|Public) // @ game+0x361c620
	void OnInputKeyProneHoldReleased(); // Function GPGameplay.GPInputManager.OnInputKeyProneHoldReleased // (Final|Native|Public) // @ game+0x361c600
	void OnInputKeyProneHold(); // Function GPGameplay.GPInputManager.OnInputKeyProneHold // (Final|Native|Public) // @ game+0x361c5e0
	void OnInputKeyProneDown(); // Function GPGameplay.GPInputManager.OnInputKeyProneDown // (Final|Native|Public) // @ game+0x361c5c0
	void OnInputKeyObserver(); // Function GPGameplay.GPInputManager.OnInputKeyObserver // (Final|Native|Public|BlueprintCallable) // @ game+0x361c5a0
	void OnInputKeyMouseScrollUp(); // Function GPGameplay.GPInputManager.OnInputKeyMouseScrollUp // (Final|Native|Public) // @ game+0x361c580
	void OnInputKeyMouseScrollDown(); // Function GPGameplay.GPInputManager.OnInputKeyMouseScrollDown // (Final|Native|Public) // @ game+0x361c560
