
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Enum GPGameplay.EGameRuleType
enum class EGameRuleType : UINT8 {
	None = 0,
	Rule_SafeHouse = 1,
	Rule_Discovery = 4,
	Rule_PVERaid = 8,
	Rule_SOL = 16,
	Rule_Raid = 32,
	Rule_BattleField = 64,
	EGameRuleType_MAX = 65
};

// Enum GPGameplay.EModularPartNodeType
enum class EModularPartNodeType : UINT8 {
	None = 0,
	Adpater = 1,
	ExtraModel = 2,
	SkinAttach = 3,
	Pendant = 4,
	EModularPartNodeType_MAX = 5
};

// Enum GPGameplay.EWeaponAddFunction
enum class EWeaponAddFunction : UINT8 {
	EWeapAddFunc_None = 0,
	EWeapAddFunc_Zooming = 1,
	EWeapAddFunc_Silencer = 2,
	EWeapAddFunc_FlashSuppressor = 3,
	EWeapAddFunc_ClipExtent = 4,
	EWeapAddFunc_ChangeClipFaster = 5,
	EWeapAddFunc_LeftHandIK = 6,
	EWeapAddFunc_BipodUpDown = 7,
	EWeapAddFunc_FlashLight = 8,
	EWeapAddFunc_Laser = 9,
	EWeapAddFunc_PowerFlash = 10,
	EWeapAddFunc_InspectWeapon = 11,
	EWeapAddFunc_QuicklyAdapt = 12,
	EBackWeapPos_Max = 13,
	EWeaponAddFunction_MAX = 14
};

// Enum GPGameplay.EDamageValidateType
enum class EDamageValidateType : UINT8 {
	None = 0,
	HitScan = 1,
	Projectile = 2,
	MeleeHitScan = 3,
	EDamageValidateType_MAX = 4
};

// Enum GPGameplay.EDamageType
enum class EDamageType : UINT8 {
	ENone = 0,
	EDefault = 1,
	EBuffDamage = 2,
	EWeaponDamage = 3,
	EDroppedDamage = 4,
	EWeaponThrowableDamage = 5,
	EPVEVehicleExplodeDamage = 6,
	EVehicleHitDamage = 7,
	EWeaponMeleeDamage = 8,
	EFSMActionDamage = 9,
	EDebug = 10,
	EVehicleLightDamage = 11,
	EVehicleNormalDamage = 12,
	EVehicleHeavyDamage = 13,
	EAssassinateDamage = 14,
	ETieBreakerDamage = 15,
	EFixedTrackRocket = 16,
	EAbilityC401 = 17,
	EBattleFieldSupportDamage = 18,
	LandmineDamage = 19,
	EMax = 20,
	EDamageType_MAX = 21
};

// Enum GPGameplay.EDamageSystemDamageType
enum class EDamageSystemDamageType : UINT8 {
	None = 0,
	Point = 1,
	Radial = 2,
	Physics = 3,
	Buff = 4,
	EDamageSystemDamageType_MAX = 5
};

// Enum GPGameplay.EDamageValidateResult
enum class EDamageValidateResult : UINT8 {
	None = 0,
	Approve = 1,
	Ignore = 2,
	Abort = 3,
	AbortOnlyLog = 4,
	UseServer = 5,
	EDamageValidateResult_MAX = 6
};

// Enum GPGameplay.EHitDamageApplyType
enum class EHitDamageApplyType : UINT8 {
	HitDamageApplyType_Health = 0,
	HitDamageApplyType_Shield = 1,
	HitDamageApplyType_BothShieldHealth = 2,
	HitDamageApplyType_MAX = 3
};

// Enum GPGameplay.EDirection
enum class EDirection : UINT8 {
	Direction_None = 0,
	Direction_Front = 1,
	Direction_Back = 2,
	Direction_Left = 3,
	Direction_Right = 4,
	Direction_MAX = 5
};

// Enum GPGameplay.EHitGroupType
enum class EHitGroupType : UINT8 {
	HitGroupType_None = 0,
	HitGroupType_Head = 1,
	HitGroupType_Neck = 2,
	HitGroupType_LeftShoulder = 3,
	HitGroupType_RightShoulder = 4,
	HitGroupType_Chest = 5,
	HitGroupType_Stomach = 6,
	HitGroupType_Hip = 7,
	HitGroupType_LeftLeg = 8,
	HitGroupType_LeftLegLower = 9,
	HitGroupType_LeftFoot = 10,
	HitGroupType_RightLeg = 11,
	HitGroupType_RightLegLower = 12,
	HitGroupType_RightFoot = 13,
	HitGroupType_LeftArm = 14,
	HitGroupType_LeftForeArm = 15,
	HitGroupType_LeftHand = 16,
	HitGroupType_RightArm = 17,
	HitGroupType_RightForeArm = 18,
	HitGroupType_RightHand = 19,
	HitGroupType_Shield = 20,
	HitGroupType_Weapon = 21,
	HitGroupType_RightAnkle = 22,
	HitGroupType_LeftAnkle = 23,
	HitGroupType_MAX = 24
};

// Enum GPGameplay.EDeadType
enum class EDeadType : UINT8 {
	ENone = 0,
	EKilledByWeapon = 1,
	EkilledByVehicle = 2,
	EkilledBySelf = 3,
	EkilledByPoisonGas = 4,
	EkilledFallDown = 5,
	EKilledFromImpendingDeath = 6,
	EKilledFromBuff = 7,
	EKilledByGm = 8,
	EKilledFromEnvExplosion = 9,
	EKilledByVehicleWeapon = 10,
	EKilledByAssassinateDamage = 11,
	EKilledByBattleFieldSupportSkill = 12,
	EDeadType_MAX = 13
};

// Enum GPGameplay.EGPHealthShowMode
enum class EGPHealthShowMode : UINT8 {
	NeverShow = 0,
	ShowOnPoint = 1,
	AlwaysShow = 2,
	ShowBigBar = 3,
	EGPHealthShowMode_MAX = 4
};

// Enum GPGameplay.ECharacterLiveStatus
enum class ECharacterLiveStatus : UINT8 {
	ECharacterLiveStatus_None = 0,
	ECharacterLiveStatus_Alive = 1,
	ECharacterLiveStatus_Death = 2,
	ECharacterLiveStatus_ImpendingDeath = 3,
	ECharacterLiveStatus_WTF = 4,
	ECharacterLiveStatus_MAX = 5
};

// Enum GPGameplay.EGPFSMTransitionEvent
enum class EGPFSMTransitionEvent : UINT8 {
	EGPFSMTransitionEvent_Unknown = 0,
	EGPFSMTransitionEVent_WaitPlayerStart = 1,
	EGPFSMTransitionEVent_EndWaitPlayerStart = 2,
	EGPFSMTransitionEVent_EnterMPLogoutState = 3,
	EGPFSMTransitionEVent_ExitMPLogoutState = 4,
	EGPFSMTransitionEvent_Timeout = 5,
	EGPFSMTransitionEvent_StartSprint = 6,
	EGPFSMTransitionEvent_StartSuperSprint = 7,
	EGPFSMTransitionEvent_EndSprintToStop = 8,
	EGPFSMTransitionEvent_EndSprintToMoving = 9,
	EGPFSMTransitionEvent_Finish = 10,
	EGPFSMTransitionEvent_NormalToADS = 11,
	EGPFSMTransitionEvent_AdsToNormal = 12,
	EGPFSMTransitionEvent_BeginVault = 13,
	EGPFSMTransitionEvent_EndVault = 14,
	EGPFSMTransitionEvent_BeginOperate = 15,
	EGPFSMTransitionEvent_EndOperate = 16,
	EGPFSMTransitionEvent_BeginZipline = 17,
	EGPFSMTransitionEvent_EndZipline = 18,
	EGPFSMTransitionEvent_CancelZipline = 19,
	EGPFSMTransitionEvent_CancelOperate = 20,
	EGPFSMTransitionEvent_ToLooting = 21,
	EGPFSMTransitionEvent_ToReborn = 22,
	EGPFSMTransitionEvent_BeAssassinateToIampendingDeath = 23,
	ESkillEvent_BuffFinish = 24,
	ESkillEvent_Cast = 25,
	ESkillEvent_Charged = 26,
	ESkillEvent_Charging = 27,
	ESkillEvent_Restored = 28,
	ESkillEvent_SpawnObjectFinish = 29,
	ESkillEvent_Terminate = 30,
	ESkillEvent_Ultimate = 31,
	ESkillEvent_NormalBreak = 32,
	ESkillEvent_Timeout = 33,
	ESkillEvent_Break = 34,
	ESkillEvent_BeginCharging = 35,
	ESkillEvent_BeginCooling = 36,
	ESkillEvent_BeginPreparing = 37,
	ESkillEvent_EndPrepare = 38,
	ESkillEvent_CancelPrepare = 39,
	ESkillEvent_Yes = 40,
	ESkillEvent_No = 41,
	ESkillEvent_SkillEnerngyChange = 42,
	ESkillEvent_Failed = 43,
	ESkillEvent_EnergyChanged = 44,
	ESkillEvent_Death = 45,
	ESkillEvent_Uncharged = 46,
	EGPFSMTransitionEvent_BeginRelaxIdle = 47,
	EGPFSMTransitionEvent_EndRelaxIdle = 48,
	EGPFSMTransitionEvent_BeginStarApp = 49,
	EGPFSMTransitionEvent_BeginStarAppInRegName = 50,
	EGPFSMTransitionEvent_EndStarApp = 51,
	EGPFSMTransitionEvent_BeginCutScne = 52,
	EGPFSMTransitionEvent_EndCutScne = 53,
	EGPFSMTransitionEvent_ToLeftLean = 54,
	EGPFSMTransitionEvent_ToRightLean = 55,
	EGPFSMTransitionEvent_EndLean = 56,
	EGPFSMTransitionEvent_StartClimbLadder = 57,
	EGPFSMTransitionEvent_GetOffClimbLadder = 58,
	EGPFSMTransitionEvent_EndClimbLadder = 59,
	EGPFSMTransitionEvent_CarryBodyGetOnVehicle = 60,
	EGPFSMTransitionEvent_CarryBodyGetOffVehicle = 61,
	EGPFSMTransitionEvent_BeginBeHit = 62,
	EGPFSMTransitionEvent_EndBeHit = 63,
	EGPFSMTransitionEvent_CancelBeHit = 64,
	EGPFSMTransitionEvent_StartAutoDriveVehicle = 65,
	EGPFSMTransitionEvent_CancelAutoDriveVehicle = 66,
	EGPFSMTransitionEvent_GetOnFlyBase = 67,
	EGPFSMTransitionEvent_GetOffFlyBase = 68,
	EGPFSMTransitionEvent_BeginUseSkill = 69,
	EGPFSMTransitionEvent_EndUseSkill = 70,
	EGPFSMTransitionEvent_BeginLeftHandSkill = 71,
	EGPFSMTransitionEvent_EndLeftHandSkill = 72,
	EGPFSMTransitionEvent_BeginRightHandSkill = 73,
	EGPFSMTransitionEvent_EndRightHandSkill = 74,
	EGPFSMTransitionEvent_BeginDoubleHandsSkill = 75,
	EGPFSMTransitionEvent_EndDoubleHandsSkill = 76,
	EGPFSMTransitionEvent_BeginLegsSkill = 77,
	EGPFSMTransitionEvent_EndLegsSkill = 78,
	EGPFSMTransitionEvent_BeginSpecialSkill = 79,
	EGPFSMTransitionEvent_EndSpecialSkill = 80,
	EGPFSMTransitionEvent_BeginAssassinate = 81,
	EGPFSMTransitionEvent_EndAssassinate = 82,
	EGPFSMTransitionEvent_SkillToSkillADS = 83,
	EGPFSMTransitionEvent_SkillADSToSkill = 84,
	EGPFSMTransitionEvent_EndRescue = 85,
	EGPFSMTransitionEvent_StartSearchItem = 86,
	EGPFSMTransitionEvent_EndSearchItem = 87,
	EGPFSMTransitionEvent_StartWeaponInspect = 88,
	EGPFSMTransitionEvent_EndWeaponInspect = 89,
	EGPFSMTransitionEvent_StartHighValueItemInspect = 90,
	EGPFSMTransitionEvent_EndHighValueItemInspect = 91,
	EGPFSMTransitionEvent_StartWeaponBipodDeploy = 92,
	EGPFSMTransitionEvent_EndWeaponBipodDeploy = 93,
	EGPFSMTransitionEvent_StartSlidingTackle = 94,
	EGPFSMTransitionEvent_EndSlidingTackle = 95,
	EGPFSMTransitionEvent_StartCrocodileBite = 96,
	EGPFSMTransitionEvent_EndCrocodileBite = 97,
	EGPFSMTransitionEvent_StartSimpleOperate = 98,
	EGPFSMTransitionEvent_EndSimpleOperate = 99,
	EGPFSMTransitionEvent_StartSimpleOperateWithUI = 100,
	EGPFSMTransitionEvent_EndSimpleOperateWithUI = 101,
	EGPFSMTransitionEvent_StartPreciseOperate = 102,
	EGPFSMTransitionEvent_EndPreciseOperate = 103,
	EGPFSMTransitionEvent_StartPreciseOperateWithUI = 104,
	EGPFSMTransitionEvent_EndPreciseOperateWithUI = 105,
	EGPFSMTransitionEvent_StartDelayOperate = 106,
	EGPFSMTransitionEvent_EndDelayOperate = 107,
	EGPFSMTransitionEvent_StartDelayOperateWithUI = 108,
	EGPFSMTransitionEvent_EndDelayOperateWithUI = 109,
	EGPFSMTransitionEvent_EndKnockbacck = 110,
	EGPFSMTransitionEvent_StartKnockbacck = 111,
	EGPFSMTransitionEvent_StartFirefighting = 112,
	EGPFSMTransitionEvent_EndFirefighting = 113,
	EGPFSMTransitionEvent_StartMarking = 114,
	EGPFSMTransitionEvent_EndMarking = 115,
	EGPFSMTransitionEvent_StartOneHandedGesture = 116,
	EGPFSMTransitionEvent_EndOneHandedGesture = 117,
	EGPFSMTransitionEvent_StartTwoHandedGesture = 118,
	EGPFSMTransitionEvent_EndTwoHandedGesture = 119,
	EGPFSMTransitionEvent_StartApplySpray = 120,
	EGPFSMTransitionEvent_EndApplySpray = 121,
	EGPFSMTransitionEvent_StartFallHighBeHit = 122,
	EGPFSMTransitionEvent_EndFallHighBeHit = 123,
	EGPFSMTransitionEvent_SafeHouseEnterRange = 124,
	EGPFSMTransitionEvent_SafeHouseLeaveRange = 125,
	EGPFSMTransitionEvent_StartAirDropVehicle = 126,
	EGPFSMTransitionEvent_EndAirDropVehicle = 127,
	EGPFSMTransitionEvent_StartSeamlessShow = 128,
	EGPFSMTransitionEvent_EndSeamlessShow = 129,
	EGPFSMTransitionEvent_StartRankSKillOperate = 130,
	EGPFSMTransitionEvent_EndRankSKillOperate = 131,
	EGPFSMTransitionEvent_StartCommonLeftArmAnim = 132,
	EGPFSMTransitionEvent_EndCommonLeftArmAnim = 133,
	EGPFSMTransitionEvent_MAX = 134
};

// Enum GPGameplay.ECharacterFSMEventDefine
enum class ECharacterFSMEventDefine : UINT8 {
	EVENT_GPFSM_NONE = 0,
	EVENT_GPFSM_Server_ReceiveTransitionEvent = 1,
	EVENT_GPFSM_Client_MoveForward = 2,
	EVENT_GPFSM_Client_MoveRight = 3,
	EVENT_GPFSM_Client_MoveStatusChanged = 4,
	EVENT_GPFSM_Client_Turn = 5,
	EVENT_GPFSM_Client_TurnAtRate = 6,
	EVENT_GPFSM_Client_LookUp = 7,
	EVENT_GPFSM_Client_LookUpAtRate = 8,
	EVENT_GPFSM_Client_PrepareFire = 9,
	EVENT_GPFSM_Client_PrepareJump = 10,
	EVENT_GPFSM_Client_PrepareAim = 11,
	EVENT_GPFSM_Client_PrepareReload = 12,
	EVENT_GPFSM_Client_FireButtonPressed = 13,
	EVENT_GPFSM_Client_FireButtonReleased = 14,
	EVENT_GPFSM_Client_FireButtonRelease_IncludeF = 15,
	EVENT_GPFSM_Client_JumButtonPressed = 16,
	EVENT_GPFSM_Client_AimButtonPressed = 17,
	EVENT_GPFSM_Client_AimButtonReleased = 18,
	EVENT_GPFSM_Client_ReloadButtonPressed = 19,
	EVENT_GPFSM_Client_MoveButtonPressed = 20,
	EVENT_GPFSM_Client_SprintButtonPressed = 21,
	EVENT_GPFSM_Client_CrouchButtonPressed = 22,
	EVENT_GPFSM_Client_ProneButtonPressed = 23,
	EVENT_GPFSM_Client_SwitchWeaponButtonPressed = 24,
	EVENT_GPFSM_Client_ToogleCrouch = 25,
	EVENT_GPFSM_Client_ToogleProne = 26,
	EVENT_GPFSM_Client_TooglePose = 27,
	EVENT_GPFSM_Server_BeginUseItem = 28,
	EVENT_GPFSM_Server_EndUseItem = 29,
	EVENT_GPFSM_Server_CancelUseItem = 30,
	EVENT_GPFSM_Client_CancelUseItem = 31,
	EVENT_GPFSM_Client_ClientPreUseItem = 32,
	EVENT_GPFSM_Server_BeginOperate = 33,
	EVENT_GPFSM_Server_EndOperate = 34,
	EVENT_GPFSM_Server_CancelOperate = 35,
	EVENT_GPFSM_Server_TryRescue = 36,
	EVENT_GPFSM_Server_TryCancelRescue = 37,
	EVENT_GPFSM_Client_TryCancelRescue = 38,
	EVENT_GPFSM_Client_TryCancelRescueMySelf = 39,
	EVENT_GPFSM_Client_TryCancelCancelRescueMySelf = 40,
	EVENT_GPFSM_Client_BeingRescueInfoArrived = 41,
	EVENT_GPFSM_Client_BeingRescueAnimationTriggered = 42,
	EVENT_GPFSM_Client_TryCancelRescueMySelfImmediately = 43,
	EVENT_GPFSM_Client_TryCancelCancelRescueMySelfImmediately = 44,
	EVENT_GPFSM_Server_StartSprint = 45,
	EVENT_GPFSM_Server_EndSprint = 46,
	EVENT_GPFSM_Server_BeginLooting = 47,
	EVENT_GPFSM_Server_TryDriveCar = 48,
	EVENT_GPFSM_Server_TryTexiCar = 49,
	EVENT_GPFSM_Server_GetOnVehicleWhenCarryBody = 50,
	EVENT_GPFSM_Server_GetOffVehicleWhenCarryBody = 51,
	EVENT_GPFSM_Server_TryStopDrivingCar = 52,
	EVENT_GPFSM_Server_TryTexiOffCar = 53,
	EVENT_GPFSM_Client_CarInfoArrived = 54,
	EVENT_GPFSM_Client_TrySwitchSeat = 55,
	EVENT_GPFSM_Server_TrySwitchSeat = 56,
	EVENT_GPFSM_Server_TryGetOnCarWithSpecificSeat = 57,
	EVENT_GPFSM_Server_TryCarryBody = 58,
	EVENT_GPFSM_Server_TryCancelCarryBody = 59,
	EVENT_GPFSM_Server_TryDropCarryBody = 60,
	EVENT_GPFSM_Server_TryStartMonitor = 61,
	EVENT_GPFSM_Server_TryCancelMonitor = 62,
	EVENT_GPFSM_Server_TryEnterMonitor = 63,
	EVENT_GPFSM_Server_TryEnterNextMonitor = 64,
	EVENT_GPFSM_Server_TryEnterLastMonitor = 65,
	EVENT_GPFSM_Server_TryUseTelescope = 66,
	EVENT_GPFSM_Server_TryCancelTelescope = 67,
	EVENT_GPFSM_Both_ResetPassengerPosition = 68,
	EVENT_GPFSM_Server_TryUseH2HBInCar = 69,
	EVENT_GPFSM_Server_TryUseH2HBOnLand = 70,
	EVENT_GPFSM_Server_TryLeaveMachineGun = 71,
	EVENT_GPFSM_Client_JumpButtonPressed = 72,
	EVENT_GPFSM_Client_JumpButtonReleased = 73,
	EVENT_GPFSM_Client_ForceToStand = 74,
	EVENT_GPFSM_Client_UseItemInfoArrived = 75,
	EVENT_GPFSM_Client_TrumpetButtonPressed = 76,
	EVENT_GPFSM_Client_TrumpetButtonReleased = 77,
	EVENT_GPFSM_Client_WheelieButtonPressed = 78,
	EVENT_GPFSM_Client_WheelieButtonReleased = 79,
	EVENT_GPFSM_Client_StoppieButtonPressed = 80,
	EVENT_GPFSM_Client_StoppieButtonReleased = 81,
	EVENT_GPFSM_Client_TryUseStarApp = 82,
	EVENT_GPFSM_Client_TryCancelStarApp = 83,
	EVENT_GPFSM_Client_ToogleLeftLean = 84,
	EVENT_GPFSM_Client_ToogleRightLean = 85,
	EVENT_GPFSM_CancelLean = 86,
	EVENT_GPFSM_Server_StartSearchItem = 87,
	EVENT_GPFSM_Server_EndSearchItem = 88,
	EVENT_GPFSM_Server_StartWeaponInspect = 89,
	EVENT_GPFSM_Server_EndWeaponInspect = 90,
	EVENT_GPFSM_Server_StartWeaponBipodDeploy = 91,
	EVENT_GPFSM_Server_EndWeaponBipodDeploy = 92,
	EVENT_GPFSM_Client_StartWeaponBipodDeploy = 93,
	EVENT_GPFSM_Client_EndPerformAction = 94,
	EVENT_GPFSM_Server_EndPerformAction = 95,
	EVENT_GPFSM_Client_FirefightingButtonReleased = 96,
	EVENT_GPFSM_Server_KnockDownBeginBeHit = 97,
	EVENT_GPFSM_Server_KnockDownCancelBeHit = 98,
	EVENT_GPFSM_Server_ExplodeDamageBeginBeHit = 99,
	EVENT_GPFSM_Server_ExplodeDamageCancelBeHit = 100,
	EVENT_GPFSM_Server_BeginUseSkill = 101,
	EVENT_GPFSM_Server_EndUseSkill = 102,
	EVENT_GPFSM_Server_BeginLeftHandSkill = 103,
	EVENT_GPFSM_Server_EndLeftHandSkill = 104,
	EVENT_GPFSM_Server_BeginRightHandSkill = 105,
	EVENT_GPFSM_Server_EndRightHandSkill = 106,
	EVENT_GPFSM_Server_BeginDoubleHandsSkill = 107,
	EVENT_GPFSM_Server_EndDoubleHandsSkill = 108,
	EVENT_GPFSM_Server_BeginLegsSkill = 109,
	EVENT_GPFSM_Server_EndLegsSkill = 110,
	EVENT_GPFSM_Server_BeginSpecialSkill = 111,
	EVENT_GPFSM_Server_EndSpecialSkill = 112,
	EVENT_GPFSM_Server_BeginZipline = 113,
	EVENT_GPFSM_Server_EndZipline = 114,
	EVENT_GPFSM_Server_CancelZipline = 115,
	EVENT_GPFSM_Server_BeginAssassinate = 116,
	EVENT_GPFSM_Server_EndAssassinate = 117,
	EVENT_GPFSM_Server_CancelAssassinate = 118,
	EVENT_GPFSM_Server_BeingAssassinateBegin = 119,
	EVENT_GPFSM_Server_BeingAssassinateEnd = 120,
	EVENT_GPFSM_Server_BeingAssassinateBreakOff = 121,
	EVENT_GPFSM_CommandSkill = 122,
	EVENT_GPFSM_BeginPrepare = 123,
	EVENT_GPFSM_CancelPrepare = 124,
	EVENT_GPFSM_Both_TryCancelUseItem = 125,
	EVENT_GPFSM_Client_ParentAttachmentChange = 126,
	EVENT_GPFSM_Server_TryEnterRelaxIdle = 127,
	EVENT_GPFSM_Server_TryCancelRelaxIdle = 128,
	EVENT_GPFSM_Client_TryGetOutWeapon = 129,
	EVENT_GPFSM_Client_TryStartAutoDriveVehicle = 130,
	EVENT_GPFSM_Server_BeginFloating = 131,
	EVENT_GPFSM_Server_CancelFloating = 132,
	EVENT_GPFSM_Client_SkillPressed = 133,
	EVENT_GPFSM_Client_SkillReleased = 134,
	EVENT_GPFSM_Client_BeginVaultAndClimb = 135,
	EVENT_GPFSM_Client_EndVaultAndClimb = 136,
	EVENT_GPFSM_Server_BeginBeSuppressed = 137,
	EVENT_GPFSM_Server_CanceBeSuppressed = 138,
	EVENT_GPFSM_Server_BeginRaiseWatch = 139,
	EVENT_GPFSM_Server_EndRaiseWatch = 140,
	EVENT_GPFSM_Client_SafeHouseEnterRange = 141,
	EVENT_GPFSM_Client_SafeHouseLeaveRange = 142,
	EVENT_GPFSM_Server_StartAirDropVehicle = 143,
	EVENT_GPFSM_Server_EndAirDropVehicle = 144,
	EVENT_GPFSM_Server_StartRankSkillOperate = 145,
	EVENT_GPFSM_Server_EndRankSkillOperate = 146,
	EVENT_GPFSM_MAX = 147
};

// Enum GPGameplay.EBreathState
enum class EBreathState : UINT8 {
	None = 0,
	Breath = 1,
	HoldBreath = 2,
	UnHoldBreath = 3,
	EBreathState_MAX = 4
};

// Enum GPGameplay.ECharingSlot
enum class ECharingSlot : UINT8 {
	None = 0,
	ArmdedForceItem1 = 1,
	ArmdedForceItem2 = 2,
	Ability = 3,
	AbilityReady = 4,
	FlyRebotSkill = 5,
	FlyRebotHealth = 6,
	FlyRebotCharging = 7,
	BattleFieldPropSkillCD = 8,
	GuidedMissle = 9,
	SectorArtilerrate = 10,
	SectorSmoke = 11,
	RebornBeacons = 12,
	ArmdedForceItem1Ready = 13,
	ArmdedForceItem2Ready = 14,
	BattleFieldPropSkillReady = 15,
	Max = 16
};

// Enum GPGameplay.EFSMGamePlayStatusDefine
enum class EFSMGamePlayStatusDefine : UINT8 {
	GamePlayStatus_None = 0,
	GamePlayStatus_AimOn = 1,
	GamePlayStatus_Reload = 2,
	GamePlayStatus_Looting = 3,
	GamePlayStatus_Rescue = 4,
	GamePlayStatus_BeingRescue = 5,
	GamePlayStatus_ImpedingDeath = 6,
	GamePlayStatus_Prone = 7,
	GamePlayStatus_Crouch = 8,
	GamePlayStatus_float = 9,
	GamePlayStatus_MAX = 10
};

// Enum GPGameplay.EFSMCharacterState
enum class EFSMCharacterState : UINT8 {
	FSMPlayerState_None = 0,
	FSMPlayerState_AimOn = 1,
	FSMPlayerState_LeanPeek = 2,
	FSMPlayerState_Reload = 3,
	FSMPlayerState_Fire = 4,
	FSMPlayerState_WeaponInspect = 5,
	FSMPlayerState_WeaponBipodDeploy = 6,
	FSMPlayerState_Prone = 7,
	FSMPlayerState_Crouch = 8,
	FSMPlayerState_Stand = 9,
	FSMPlayerState_Sprint = 10,
	FSMPlayerState_SlidingTackle = 11,
	FSMPlayerState_SpecialMove = 12,
	FSMPlayerState_Marking = 13,
	FSMPlayerState_SearchItem = 14,
	FSMPlayerState_CarryBody = 15,
	FSMPlayerState_Rescue = 16,
	FSMPlayerState_BeingRescue = 17,
	FSMPlayerState_Interact = 18,
	FSMPlayerState_PreciseInteract = 19,
	FSMPlayerState_DelayInteract = 20,
	FSMPlayerState_GameOperate = 21,
	FSMPlayerState_Skill = 22,
	FSMPlayerState_Vehicle = 23,
	FSMPlayerState_SceneWeapon = 24,
	FSMPlayerState_UseItem = 25,
	FSMPlayerState_Firefighting = 26,
	FSMPlayerState_HighValueItemInspect = 27,
	FSMPlayerState_BeHit = 28,
	FSMPlayerState_ImpedingDeath = 29,
	FSMPlayerState_Death = 30,
	FSMPlayerState_CutScene = 31,
	FSMPlayerState_Assassinate = 32,
	FSMPlayerState_OneHandedGesture = 33,
	FSMPlayerState_TwoHandedGesture = 34,
	FSMPlayerState_ApplySpray = 35,
	FSMPlayerState_CommonLeftArmAnim = 36,
	FSMPlayerState_WaitStart = 37,
	FSMPlayerState_QuitGame = 38,
	FSMPlayerState_MAX = 39
};

// Enum GPGameplay.ESubtitleSequenceType
enum class ESubtitleSequenceType : UINT8 {
	None = 0,
	Subtitle_Raid1 = 1,
	Subtitle_Raid2 = 2,
	Subtitle_SafeHouse = 3,
	Subtitle_SOLEvent = 4,
	Subtitle_SOLQuest = 5,
	Subtitle_AI = 6,
	Subtitle_Intro = 7,
	Subtitle_CutScene = 8,
	Subtitle_BreakthroughThink = 9,
	ESubtitleSequenceType_MAX = 10
};

// Enum GPGameplay.ESlotButton
enum class ESlotButton : UINT8 {
	SlotButton_Right = 0,
	SlotButton_Left = 1,
	SlotButton_FirePress = 2,
	SlotButton_FireRelease = 3,
	SlotButton_MAX = 4
};

// Enum GPGameplay.ESkillUISlot
enum class ESkillUISlot : UINT8 {
	UIState_NoSlot = 0,
	UIState_FireButtonLeft = 1,
	UIState_Custom = 2,
	UIState_Custom2 = 3,
	UIState_Custom3 = 4,
	UIState_Self = 5,
	UIState_QTELeft = 6,
	UIState_QTERight = 7,
	UIState_ActiveSkill = 8,
	UIState_SupportSkill = 9,
	UIState_BattleFieldPropSkill = 10,
	UIState_MAX = 11
};

// Enum GPGameplay.ESkillCDEffectType
enum class ESkillCDEffectType : UINT8 {
	SkillCDEffect_Normal = 0,
	SkillCDEffect_Support = 1,
	SkillCDEffect_MAX = 2
};

// Enum GPGameplay.ERankSkillUIState
enum class ERankSkillUIState : UINT8 {
	None = 0,
	ScoreLess = 1,
	CDing = 2,
	ToBeUsed = 3,
	ERankSkillUIState_MAX = 4
};

// Enum GPGameplay.EMarkFeature
enum class EMarkFeature : int {
	UpdateScreenPosOnce = 1,
	UpdateScreenPos = 2,
	UpdateScreenPosFromTargetActor = 4,
	UpdateScreenPosFromGivenLocation = 8,
	UpdateScreenPosByController = 16,
	UpdateScreenPosByMatrix = 32,
	UpdateScreenPosEnableTraceXYZ = 64,
	UpdateScreenPosEnableTraceXY = 128,
	Update3DDis = 1024,
	Update2DDis = 2048,
	UpdateDir = 32768,
	UpdateAimed = 1048576,
	UpdateAimedOnTarget = 2097152,
	UpdateAimedBasedOnRadialDistance = 4194304,
	UpdateHasCoverBetween = 33554432,
	UpdateHasCoverBetweenUseRayTrace = 67108864,
	UpdateSizeOnDis = 1073741824,
	EMarkFeature_MAX = 1073741825
};

// Enum GPGameplay.ECountDownPriority
enum class ECountDownPriority : UINT8 {
	None = 0,
	Contract = 1,
	Escape = 2,
	MandelBrick = 3,
	Max = 4
};

// Enum GPGameplay.EGPAbilityLockerType
enum class EGPAbilityLockerType : UINT8 {
	None = 0,
	LaserPointer = 1,
	LaserPointerReciver = 2,
	LowAmmo = 3,
	EGPAbilityLockerType_MAX = 4
};

// Enum GPGameplay.EHitEventType
enum class EHitEventType : UINT8 {
	None = 0,
	HitBody = 1,
	HitBodyWithArmor = 2,
	HitBodyWithArmorAndDamageHp = 3,
	HitHeadWithoutHelmet = 4,
	HitHelmet = 5,
	HitHelmetAndDamageHp = 6,
	HitHelmetBroken = 7,
	HitArmorBroken = 8,
	HitLowHealth = 9,
	HitBulletWhoosh = 10,
	HitBulletHitAround = 11,
	HitSuppressByBullet = 12,
	KnockDownByHitBody = 13,
	KnockDownByHitHead = 14,
	KilledByHitBody = 15,
	KilledByHitHead = 16,
	Shocked = 17,
	HitVehicle = 18,
	KillVehicle = 19,
	BreakthroughRankSkillHit = 20,
	HitShield = 21,
	HitHeavyArmor = 22,
	Stagger = 23,
	HitADS = 24,
	HitSkillActor = 25,
	EHitEventType_MAX = 26
};

// Enum GPGameplay.AttributeAdditionType
enum class AttributeAdditionType : UINT8 {
	Add_Base = 0,
	Override_Base = 1,
	InitalCover = 2,
	FinalCover = 3,
	Add = 4,
	Mult_A = 5,
	Mult_B = 6,
	Mult_C = 7,
	Mult_D = 8,
	Max = 9
};

// Enum GPGameplay.EMarkerCoordinatedType
enum class EMarkerCoordinatedType : UINT8 {
	None = 0,
	MandelBrick = 31,
	MandelBrick_MapMarked = 41,
	HighValueBox_MapMarked = 42,
	MarkingItemMarker = 51,
	EMarkerCoordinatedType_MAX = 52
};

// Enum GPGameplay.ERepairEventType
enum class ERepairEventType : UINT8 {
	RepairStop = 0,
	RepairFinished = 1,
	ERepairEventType_MAX = 2
};

// Enum GPGameplay.EStingerMissileLockingState
enum class EStingerMissileLockingState : UINT8 {
	NONE = 0,
	UNLOCK_DISTANCE = 1,
	UNLOCK_EMPTY = 2,
	CANNOTLOCK = 3,
	START_LOCKING = 4,
	COMPLETE_LOCKING = 5,
	MISSILE_ATTACK = 6,
	NAP_OF_EARTH = 7,
	EStingerMissileLockingState_MAX = 8
};

// Enum GPGameplay.ECurveBlendOption_BCOnly
enum class ECurveBlendOption_BCOnly : UINT8 {
	Override = 0,
	MaxValue = 1,
	Additive = 2,
	ECurveBlendOption_MAX = 3
};

// Enum GPGameplay.EGPPlayParticleEffectRole
enum class EGPPlayParticleEffectRole : UINT8 {
	ROLE_1PAnd3P = 0,
	ROLE_1P = 1,
	ROLE_3P = 2,
	ROLE_MAX = 3
};

// Enum GPGameplay.EClimbLadderNotifySettingType
enum class EClimbLadderNotifySettingType : UINT8 {
	EClimbLadderNotifySettingType_NONE = 0,
	EClimbLadderNotifySettingType_BreakPoint = 1,
	EClimbLadderNotifySettingType_MAX = 2
};

// Enum GPGameplay.EVaultNotifySettingType
enum class EVaultNotifySettingType : UINT8 {
	EVaultNotifySettingType_NONE = 0,
	EVaultNotifySettingType_StartPoint = 1,
	EVaultNotifySettingType_HandTouchPoint = 2,
	EVaultNotifySettingType_BeginVaultPoint = 3,
	EVaultNotifySettingType_EndVaultPoint = 4,
	EVaultNotifySettingType_LandPoint = 5,
	EVaultNotifySettingType_EndPoint = 6,
	EVaultNotifySettingType_BreakPoint = 7,
	EVaultNotifySettingType_HideWeapon = 8,
	EVaultNotifySettingType_ShowWeapon = 9,
	EVaultNotifySettingType_FallingPoint = 10,
	EVaultNotifySettingType_BeforeBreakPoint = 11,
	EVaultNotifySettingType_MAX = 12
};

// Enum GPGameplay.EAnimNotifyStateIKBlend
enum class EAnimNotifyStateIKBlend : UINT8 {
	None = 0,
	ChangeClip = 1,
	Vault = 2,
	Max = 3
};

// Enum GPGameplay.EDamageExplodeBlockCheckType
enum class EDamageExplodeBlockCheckType : UINT8 {
	Low = 0,
	High = 1,
	EDamageExplodeBlockCheckType_MAX = 2
};

// Enum GPGameplay.EGPDamageFeature
enum class EGPDamageFeature : UINT8 {
	None = 0,
	SOL = 1,
	EGPDamageFeature_MAX = 2
};

// Enum GPGameplay.EGPDamageMode
enum class EGPDamageMode : UINT8 {
	Default = 0,
	GameMode01 = 1,
	GameMode02 = 2,
	GameMode03 = 3,
	GameMode04 = 4,
	EGPDamageMode_MAX = 5
};

// Enum GPGameplay.EAttributeEffectMainTag
enum class EAttributeEffectMainTag : UINT8 {
	Default = 0,
	Damage = 1,
	Buff = 2,
	System = 3,
	Equipment = 4,
	Max = 5
};

// Enum GPGameplay.EAttributeEffectInstanceType
enum class EAttributeEffectInstanceType : UINT8 {
	None = 0,
	Damage = 1,
	Buff = 2,
	ItemHealth = 3,
	EAttributeEffectInstanceType_MAX = 4
};

// Enum GPGameplay.EPlayerQuitMatchReason
enum class EPlayerQuitMatchReason : UINT8 {
	ENone = 0,
	EEndMatch = 1,
	ESvrForceKick = 2,
	EClientReqQuit = 3,
	EPlayerQuitMatchReason_MAX = 4
};

// Enum GPGameplay.EPlayerEndMatchReason
enum class EPlayerEndMatchReason : UINT8 {
	EPlayerEndMatch_Success = 0,
	EPlayerEndMatch_Killed = 1,
	EPlayerEndMatch_TimeLimit = 2,
	EPlayerEndMatch_MAX = 3
};

// Enum GPGameplay.EBulletHitActionType
enum class EBulletHitActionType : UINT8 {
	None = 0,
	Damage = 1,
	Buff = 2,
	Custom = 3,
	EBulletHitActionType_MAX = 4
};

// Enum GPGameplay.ECampType
enum class ECampType : UINT8 {
	BF_DeltaCamp0 = 0,
	BF_DeltaCamp1 = 1,
	SOL_DeltaPMC = 101,
	SOL_DarkTide = 102,
	SOL_Hudson = 103,
	Raid_DeltaPMC = 104,
	Raid_DarkTide = 105,
	Raid_Hudson = 106,
	BF_Hudson = 109,
	SafeHouse_Player = 110,
	SafeHouse_NPC = 111,
	SafeHouse_RangeTarget = 112,
	Vehicle = 112,
	Neutral = 113,
	SOL_ContractPlayer = 5,
	SOL_BossTeam = 107,
	Max = 255
};

// Enum GPGameplay.ECharacterSnatshotSubPose
enum class ECharacterSnatshotSubPose : UINT8 {
	Center = 0,
	Left = 1,
	Right = 2,
	Max = 3
};

// Enum GPGameplay.ECharacterSnatshotBasePose
enum class ECharacterSnatshotBasePose : UINT8 {
	None = 0,
	Stand = 1,
	Crouch = 2,
	Prone = 3,
	InVehicle = 4,
	InSceneWeapon = 5,
	ImpendingDeath = 6,
	Knockback = 7,
	SlidingTackle = 8,
	Vaulting = 9,
	Climb = 10,
	Zipline = 11,
	BeingAssassinate = 12,
	Max = 13
};

// Enum GPGameplay.EHaavkTurnType
enum class EHaavkTurnType : UINT8 {
	LeftAndRight = 0,
	Circle = 1,
	EHaavkTurnType_MAX = 2
};

// Enum GPGameplay.EDamageStateRecordType
enum class EDamageStateRecordType : UINT8 {
	Default = 0,
	Character = 1,
	GeneralGun = 2,
	Melee = 3,
	Vehicle = 4,
	Door = 5,
	EDamageStateRecordType_MAX = 6
};

// Enum GPGameplay.EDamageGameState
enum class EDamageGameState : UINT8 {
	None = 0,
	Prematch = 1,
	InGame = 2,
	EndGame = 3,
	EDamageGameState_MAX = 4
};

// Enum GPGameplay.EDamageUnitType
enum class EDamageUnitType : UINT8 {
	Actor = 0,
	Component = 1,
	EDamageUnitType_MAX = 2
};

// Enum GPGameplay.EDamageActorType
enum class EDamageActorType : UINT8 {
	None = 0,
	PlayerCharacter = 1,
	AICharacter = 2,
	Vehicle = 3,
	Weapon = 4,
	World = 5,
	BreakablePawn = 6,
	Others = 7,
	EDamageActorType_MAX = 8
};

// Enum GPGameplay.EDamageModifyType
enum class EDamageModifyType : UINT8 {
	Add = 0,
	Mult = 1,
	Override = 2,
	EDamageModifyType_MAX = 3
};

// Enum GPGameplay.EGPDamageEnableType
enum class EGPDamageEnableType : UINT8 {
	Default = 0,
	Enable = 1,
	Disable = 2,
	EnableWithEnemy = 3,
	EGPDamageEnableType_MAX = 4
};

// Enum GPGameplay.EDamageChannel
enum class EDamageChannel : UINT8 {
	Default = 0,
	HP = 1,
	ArmorDamage = 2,
	HealthDamage = 3,
	Max = 4
};

// Enum GPGameplay.EWeaponFireValidateFaildReason
enum class EWeaponFireValidateFaildReason : UINT8 {
	None = 0,
	CharacterOwnerNull = 1,
	CharacterDied = 2,
	CharacterImpendingDeath = 3,
	CharacterCantFire = 4,
	WeaponInactive = 5,
	WeaponNotFiringState = 6,
	WeaponNoAmmo = 7,
	FireIntervalError = 8,
	FireIdInvalid = 9,
	FireTimeInvalid = 10,
	LogicFireTimeInvalid = 11,
	EWeaponFireValidateFaildReason_MAX = 12
};

// Enum GPGameplay.EDataTableConstrainType
enum class EDataTableConstrainType : UINT8 {
	Unique = 0,
	ForeignKey = 1,
	EDataTableConstrainType_MAX = 2
};

// Enum GPGameplay.EEMPType
enum class EEMPType : UINT8 {
	EMP = 0,
	DataKnife = 1,
	EEMPType_MAX = 2
};

// Enum GPGameplay.EFiringAnimMode
enum class EFiringAnimMode : UINT8 {
	Single = 0,
	Continue = 1,
	EFiringAnimMode_MAX = 2
};

// Enum GPGameplay.EFiringAnimBlendOutMode
enum class EFiringAnimBlendOutMode : UINT8 {
	ForceEnd = 0,
	ContinueAnim = 1,
	BlendOut = 2,
	EFiringAnimBlendOutMode_MAX = 3
};

// Enum GPGameplay.EFiringAnimDim
enum class EFiringAnimDim : UINT8 {
	Dim_Trans_Forward = 0,
	Dim_Trans_Right = 1,
	Dim_Trans_Up = 2,
	Dim_Rot_Pitch = 3,
	Dim_Rot_Yaw = 4,
	Dim_Rot_Roll = 5,
	Dim_Num = 6,
	Dim_MAX = 7
};

// Enum GPGameplay.EDFMAbilityEndReason
enum class EDFMAbilityEndReason : UINT8 {
	NormalEnd = 0,
	UnNormalEnd = 1,
	Die = 2,
	RemoveFromCharacter = 3,
	CastFaild = 4,
	PlayMontageFaild = 5,
	EDFMAbilityEndReason_MAX = 6
};

// Enum GPGameplay.EDFMAbilityLogicType
enum class EDFMAbilityLogicType : UINT8 {
	Default = 0,
	EnterState = 1,
	LeaveState = 2,
	PlayMontage = 3,
	PlayMontageInstance = 4,
	KeepActor = 5,
	SpawnActor = 6,
	Function = 7,
	WeaponProjectileActor = 8,
	ProjectileActor = 9,
	Buff = 10,
	LogicTypeMax = 11,
	EDFMAbilityLogicType_MAX = 12
};

// Enum GPGameplay.EAnimState
enum class EAnimState : UINT8 {
	Stand = 0,
	Crouch = 1,
	Prone = 2,
	Sprint = 3,
	Jump = 4,
	Dead = 5,
	Vault = 6,
	Zipline = 7,
	Rescue = 8,
	Throw = 9,
	Reload = 10,
	Medical = 11,
	Moving = 12,
	ImpendingDeath = 13,
	Max = 32
};

// Enum GPGameplay.EAnimKnockbackType
enum class EAnimKnockbackType : UINT8 {
	Knockback = 0,
	EAnimKnockbackType_MAX = 1
};

// Enum GPGameplay.EAnimCarryBodyType
enum class EAnimCarryBodyType : UINT8 {
	CarryCharacter = 0,
	CarryBox = 1,
	EAnimCarryBodyType_MAX = 2
};

// Enum GPGameplay.EAnimApplySprayType
enum class EAnimApplySprayType : UINT8 {
	ApplySpray = 0,
	EAnimApplySprayType_MAX = 1
};

// Enum GPGameplay.EAnimMarkingType
enum class EAnimMarkingType : UINT8 {
	Marking = 0,
	EAnimMarkingType_MAX = 1
};

// Enum GPGameplay.EAnimFirefightingType
enum class EAnimFirefightingType : UINT8 {
	Firefighting = 0,
	ZoyaSwarms = 1,
	EAnimFirefightingType_MAX = 2
};

// Enum GPGameplay.EAnimRaiseWatchType
enum class EAnimRaiseWatchType : UINT8 {
	RaiseWatch = 0,
	EAnimRaiseWatchType_MAX = 1
};

// Enum GPGameplay.EAnimHitPart
enum class EAnimHitPart : UINT8 {
	None = 0,
	Head = 1,
	UpperBody = 2,
	LeftLeg = 3,
	RightLeg = 4,
	EAnimHitPart_MAX = 5
};

// Enum GPGameplay.EAnimParachuteType
enum class EAnimParachuteType : UINT8 {
	Parachute = 0,
	Glide = 1,
	EAnimParachuteType_MAX = 2
};

// Enum GPGameplay.EAnimClimbLadderType
enum class EAnimClimbLadderType : UINT8 {
	ClimbLadder = 0,
	EAnimClimbLadderType_MAX = 1
};

// Enum GPGameplay.EAnimBunkerType
enum class EAnimBunkerType : UINT8 {
	NoWeapon = 0,
	EAnimBunkerType_MAX = 1
};

// Enum GPGameplay.EAnimTacticalActionType
enum class EAnimTacticalActionType : UINT8 {
	TacticalAction = 0,
	EAnimTacticalActionType_MAX = 1
};

// Enum GPGameplay.EAnimVehicleSeatPos
enum class EAnimVehicleSeatPos : UINT8 {
	Seat_FL = 0,
	Seat_FR = 1,
	Seat_BL = 2,
	Seat_BR = 3,
	Seat_BL02 = 4,
	Seat_BR02 = 5,
	Seat_BL03 = 6,
	Seat_BR03 = 7,
	Seat_MachineGun = 8,
	Seat_MAX = 9
};

// Enum GPGameplay.EAnimLoadPriority
enum class EAnimLoadPriority : UINT8 {
	Low = 0,
	Medium = 50,
	High = 100,
	SuperHigh = 200,
	EAnimLoadPriority_MAX = 201
};

// Enum GPGameplay.EGPEventToggleState
enum class EGPEventToggleState : UINT8 {
	TURN_ON = 6,
	TURN_OFF = 7,
	TURN_MAX = 8
};

// Enum GPGameplay.EGPAnimOperationInterruptType
enum class EGPAnimOperationInterruptType : UINT8 {
	Default = 0,
	Interrupt_SwitchWeapon = 1,
	Interrupt_Reload = 2,
	EGPAnimOperationInterruptType_MAX = 3
};

// Enum GPGameplay.EGPAnimNotifyLogicalBreakType
enum class EGPAnimNotifyLogicalBreakType : UINT8 {
	Default = 0,
	LogicReload_Complete = 1,
	Reload_Ready = 5,
	EventToggle_TurnOn = 6,
	EventToggle_TurnOff = 7,
	Fire_Break = 8,
	Equip_Break = 9,
	Fire_Break_End = 10,
	Do_Fire = 11,
	EnableSprint_ThrowableWeapon = 12,
	Show_PreviewLine = 13,
	Throwable_HideMesh = 14,
	Throwable_ShowMesh = 15,
	Throwable_Unlock = 16,
	EGPAnimNotifyLogicalBreakType_MAX = 17
};

// Enum GPGameplay.ERetargetConfig
enum class ERetargetConfig : UINT8 {
	ERetargetConfig_Normal = 0,
	ERetargetConfig_FPP = 1,
	ERetargetConfig_MAX = 2
};

// Enum GPGameplay.EWeaponLeanAimType
enum class EWeaponLeanAimType : UINT8 {
	EWeapLeanAimType_Center = 0,
	EWeapLeanAimType_Left = 1,
	EWeapLeanAimType_Right = 2,
	EWeapLeanAimType_MAX = 3
};

// Enum GPGameplay.ELocomotionTransitionType
enum class ELocomotionTransitionType : UINT8 {
	LocomotionTransitionType_None = 0,
	LocomotionTransitionType_IdleToWalking = 1,
	LocomotionTransitionType_IdleToRunning = 2,
	LocomotionTransitionType_IdleToFastRunning = 3,
	LocomotionTransitionType_RunningToFastRunning = 4,
	LocomotionTransitionType_WalkingToIdle = 5,
	LocomotionTransitionType_RunningToIdle = 6,
	LocomotionTransitionType_FastRunningToIdle = 7,
	LocomotionTransitionType_Pivot_Walking = 8,
	LocomotionTransitionType_Pivot_Running = 9,
	LocomotionTransitionType_Pivot_FastRunning = 10,
	LocomotionTransitionType_MAX = 11
};

// Enum GPGameplay.EAssasinateAnimType
enum class EAssasinateAnimType : UINT8 {
	Stand = 1,
	Impending = 2,
	Prone = 4,
	EAssasinateAnimType_MAX = 5
};

// Enum GPGameplay.ESmallActionTrigger
enum class ESmallActionTrigger : UINT8 {
	EStill2NotStill = 1,
	ENotStil2Still = 2,
	EFiring2NotFiring = 4,
	EFasterMove2Walk = 8,
	EJumping2Land = 16,
	EStand2Crouch = 32,
	ECrouch2Stand = 64,
	ESmallActionTrigger_MAX = 65
};

// Enum GPGameplay.ESmallActionState
enum class ESmallActionState : UINT8 {
	EStill = 0,
	EHorizonRotate = 1,
	EVerticalRotate = 2,
	EMove = 3,
	EFiring = 4,
	ENoFiring = 5,
	EWalk = 6,
	ERun = 7,
	ESprint = 8,
	EAiring = 9,
	ELanding = 10,
	EStand = 11,
	ECrouch = 12,
	EZooming = 13,
	EMax = 14,
	ESmallActionState_MAX = 15
};

// Enum GPGameplay.ESpringStatusType
enum class ESpringStatusType : UINT8 {
	ESpringStatus_Default = 0,
	ESpringStatus_Aim = 1,
	ESpringStatus_Crouch = 2,
	ESpringStatus_NumMax = 3,
	ESpringStatus_MAX = 4
};

// Enum GPGameplay.EFPPCameraRotationCalcType
enum class EFPPCameraRotationCalcType : UINT8 {
	EJointBoneAddValue = 0,
	EFPPCameraBoneAutoBlend = 1,
	EFPPCameraBone = 2,
	EFPPCameraRotationCalcType_MAX = 3
};

// Enum GPGameplay.EMotionGear
enum class EMotionGear : UINT8 {
	EMotionGear_Walk = 0,
	EMotionGear_Run = 1,
	EMotionGear_Sprint = 2,
	EMotionGear_SuperSprint = 3,
	EMotionGear_MAX = 4
};

// Enum GPGameplay.EAnimationPlayType
enum class EAnimationPlayType : UINT8 {
	AnimPlayType_None = 0,
	AnimPlayType_FullBody = 1,
	AnimPlayType_FullBodyBeforeAO = 2,
	AnimPlayType_FullBodyWithIK = 3,
	AnimPlayType_FullBodyNoMoving = 4,
	AnimPlayType_FullBodyWhenProne = 5,
	AnimPlayType_UpperBody = 6,
	AnimPlayType_UpperBodyWithIK = 7,
	AnimPlayType_UpperBodyGroupAimWithIK = 8,
	AnimPlayType_LowerBody = 9,
	AnimPlayType_FPPAnimSlot = 10,
	AnimPlayType_UpperBodyWithForceIdle = 11,
	AnimPlayType_FullBodyTakeHit = 12,
	AnimPlayType_FullBodyDeath = 13,
	AnimPlayType_LeftArm = 14,
	AnimPlayType_LeftArmBeforeAO = 15,
	AnimPlayType_RightArm = 16,
	AnimPlayType_LeftRightArm = 17,
	AnimPlayType_LeftArmMirrorByRightArm = 18,
	AnimPlayType_RightArmMirrorByLeftArm = 19,
	AnimPlayType_MirrorAnimBlend = 20,
	AnimPlayType_TurnAnim = 21,
	AnimPlayType_DefaultFullBodyMovingUpperBody = 22,
	AnimPlayType_DefaultFullBodyMovingUpperBodyWithIK = 23,
	AnimPlayType_FullBodyRescue = 24,
	AnimPlayType_InVehicle = 25,
	AnimPlayType_InVehicleBeforeDrive = 26,
	AnimPlayType_MachineGun = 27,
	AnimPlayType_FullBodyCarryBody = 28,
	AnimPlayType_FullBodyAllOverride = 29,
	AnimPlayType_UpperArms = 30,
	AnimPlayType_DefaultUpperBodyMovingUpperArms = 31,
	AnimPlayType_LocomotionFullBodyRushWithIK = 32,
	AnimPlayType_MAX = 33
};

// Enum GPGameplay.EEquipmentPart
enum class EEquipmentPart : UINT8 {
	None = 0,
	TopOfHead = 1,
	Neck = 2,
	Ear = 3,
	Eye = 4,
	Jaw = 5,
	Thorax = 6,
	LeftArm = 7,
	RightArm = 8,
	LeftLeg = 9,
	RightLeg = 10,
	Max = 11
};

// Enum GPGameplay.ECharacterPart
enum class ECharacterPart : UINT8 {
	None = 0,
	Head = 1,
	Thorax = 2,
	Abdomen = 3,
	RightArm = 4,
	LeftArm = 5,
	RightLeg = 6,
	LeftLeg = 7,
	FullBody = 8,
	ECharacterPart_MAX = 9
};

// Enum GPGameplay.EInstantGEType
enum class EInstantGEType : UINT8 {
	None = 0,
	InstantAddHP = 1,
	FixFracture = 2,
	FixBleeding = 3,
	EInstantGEType_MAX = 4
};

// Enum GPGameplay.EHeadEquipmentPartType
enum class EHeadEquipmentPartType : UINT8 {
	HeadTop = 0,
	Eye = 1,
	Face = 2,
	Ear = 3,
	Max = 4
};

// Enum GPGameplay.EEquipmentType
enum class EEquipmentType : UINT8 {
	None = 0,
	Helmet = 1,
	Headset = 2,
	FaceMask = 3,
	Armband = 4,
	BreastPlate = 5,
	Glasses = 6,
	ChestHanging = 7,
	Bag = 8,
	SafeBox = 9,
	Tool = 10,
	Shoes = 11,
	KeyChain = 12,
	Max = 13
};

// Enum GPGameplay.EWeaponBuff
enum class EWeaponBuff : UINT8 {
	None = 0,
	Max = 1
};

// Enum GPGameplay.EFootstepStateType
enum class EFootstepStateType : UINT8 {
	Default = 0,
	Walk = 1,
	Run = 2,
	Sprint = 3,
	CrouchMove = 4,
	CrouchRun = 5,
	ProneMove = 6,
	ProneRun = 7,
	EFootstepStateType_MAX = 8
};

// Enum GPGameplay.EFakeFootstepReason
enum class EFakeFootstepReason : UINT8 {
	LowAnimLOD = 0,
	PVSCut = 1,
	LossNotify = 2,
	EFakeFootstepReason_MAX = 3
};

// Enum GPGameplay.EFakeFootstepStatus
enum class EFakeFootstepStatus : UINT8 {
	Simulating = 0,
	InTransition = 1,
	PendingRemove = 2,
	EFakeFootstepStatus_MAX = 3
};

// Enum GPGameplay.ESubtitleHudType
enum class ESubtitleHudType : UINT8 {
	None = 0,
	OnlyText = 1,
	TextWithBlackBG = 2,
	ESubtitleHudType_MAX = 3
};

// Enum GPGameplay.ESubtitlePriorityType
enum class ESubtitlePriorityType : UINT8 {
	None = 0,
	QuestNotice_P1 = 1,
	QuestNotice_P2 = 2,
	QuestNotice_P3 = 3,
	AIDialog_P1 = 4,
	AIDialog_P2 = 5,
	AIDialog_P3 = 6,
	ESubtitlePriorityType_MAX = 7
};

// Enum GPGameplay.EGPCharacterCameraModeType
enum class EGPCharacterCameraModeType : UINT8 {
	ECameraMode_None = 0,
	ECameraMode_FPP = 1,
	ECameraMode_TPP = 2,
	ECameraMode_MAX = 3
};

// Enum GPGameplay.EGPCharacterCameraModeReason
enum class EGPCharacterCameraModeReason : UINT8 {
	ECameraModeReason_VehicleLiveSpectating = 0,
	ECameraModeReason_RebornEffect = 1,
	ECameraModeReason_Redeploy = 2,
	ECameraModeReason_GamePlay = 3,
	ECameraModeReason_UserXppChange = 4,
	ECameraModeReason_Vehicle = 5,
	ECameraModeReason_GamePlayLow = 6,
	ECameraModeReason_MAX = 7
};

// Enum GPGameplay.EStateAudioEventType
enum class EStateAudioEventType : UINT8 {
	None = 0,
	NormalState = 1,
	LowHealth = 2,
	PendingDeath = 3,
	HoldBreath = 4,
	MP_ExitBoundary = 5,
	MP_EnterDeploy = 6,
	Suppressed = 7,
	EStateAudioEventType_MAX = 8
};

// Enum GPGameplay.ECharacterAudioListener
enum class ECharacterAudioListener : UINT8 {
	NoNeeds = 0,
	Myself = 1,
	Teammate = 2,
	CampmateButNotTeammate = 3,
	Enemy = 4,
	ECharacterAudioListener_MAX = 5
};

// Enum GPGameplay.ECharacterAudioPlayMode
enum class ECharacterAudioPlayMode : UINT8 {
	OneShot = 0,
	Loop = 1,
	State = 2,
	ECharacterAudioPlayMode_MAX = 3
};

// Enum GPGameplay.ECharacterAudioType
enum class ECharacterAudioType : UINT8 {
	Pending = 0,
	Breath_Sprint = 1,
	Breath_Tired = 2,
	Breath_Recover = 3,
	Breath_Dying = 4,
	Breath_Injured_Heavy = 5,
	Breath_Injured_Light = 6,
	Breath_CloseMouth = 7,
	Reaction_Die = 8,
	Reaction_Pain = 9,
	Reaction_Bleeding = 10,
	Reaction_ArmBroken = 11,
	Reaction_LegBroken = 12,
	Reaction_BodyBroken = 13,
	Reaction_Yell = 14,
	Reaction_Hit = 15,
	Reaction_Healed = 16,
	State_Default = 17,
	State_Injured = 18,
	Ability_VO1 = 19,
	Ability_VO2 = 20,
	Ability_VO3 = 21,
	Ability_VO4 = 22,
	Ability_VO5 = 23,
	Ability_VO6 = 24,
	Ability_VO7 = 25,
	Ability_VO8 = 26,
	Ability_VO9 = 27,
	Ability_VO10 = 28,
	Ability_VO11 = 29,
	Ability_VO12 = 30,
	Ability_VO13 = 31,
	Ability_VO14 = 32,
	Ability_VO15 = 33,
	Ability_VO16 = 34,
	Ability_VO17 = 35,
	Ability_VO18 = 36,
	Ability_VO19 = 37,
	Ability_VO20 = 38,
	PassiveTrigger = 39,
	UltimateSmokePropUse = 40,
	UltimateSmokePropFinished = 41,
	PropEliminate = 42,
	PropAssist = 43,
	UltimateFullyCharged = 44,
	UltimateUse = 45,
	UltimateOngoing = 46,
	UltimateEliminate = 47,
	UltimateEliminateAssist = 48,
	UltimateCure = 49,
	UltimateFullyCharged401 = 50,
	UltimateUse401 = 51,
	UltimateOngoing401 = 52,
	UltimateHit401 = 53,
	UltimateAssist401 = 54,
	Begin_Throw_Throwables = 55,
	EnterSmoke_Cough = 56,
	Enemy_Explosive_Nearby = 57,
	CQB_FullyCharged = 58,
	CQB_UseSkill = 59,
	CQB_Kill = 60,
	CQB_KillAssist = 61,
	PassiveTrigger_C201 = 62,
	PropUse_C201ElectricBow = 63,
	PropHit_C201ElectricBow = 64,
	PropAssist_C201ElectricBow = 65,
	PropEliminate_C201ElectricBow = 66,
	UltimateFullyCharged_C201ProxSensorBow = 67,
	UltimateUse_C201ProxSensorBow = 68,
	UltimateOngoing_C201ProxSensorBow = 69,
	UltimateEliminate_C201ProxSensorBow = 70,
	UltimateAssist_C201ProxSensorBow = 71,
	UltimateHit_C201ProxSensorBow = 72,
	PropUse_C301Launcer = 73,
	PropHit_C301Launcer = 74,
	PropAssist_C301Launcer = 75,
	PropEliminate_C301Launcer = 76,
	Passive_Trigger_Throw = 77,
	Prop_Hit_Mine = 78,
	Prop_Use_Mine = 79,
	Prop_Eliminate_Mine = 80,
	Prop_UseSupportSmoke = 81,
	Prop_UseAssultSmoke = 82,
	Prop_StartHoldBreath = 83,
	Prop_EndHoldBreath = 84,
	Prop_StartUnHoldBreath = 85,
	NONE = 86,
	NumMax = 87,
	ECharacterAudioType_MAX = 88
};

// Enum GPGameplay.EBuffRemovedReason
enum class EBuffRemovedReason : UINT8 {
	ENormal = 0,
	EDead = 1,
	EBuffRemovedReason_MAX = 2
};

// Enum GPGameplay.EGPCharacterHiddenReason
enum class EGPCharacterHiddenReason : UINT8 {
	EGPCharacterHidden_WaitSOLStart = 0,
	EGPCharacterHidden_SOLFinishGame = 1,
	EGPCharacterHidden_MPFinishGame = 2,
	EGPCharacterHidden_MPDeathViewOther = 3,
	EGPCharacterHidden_Vehicle = 4,
	EGPCharacterHidden_VehicleCarryBody = 5,
	EGPCharacterHidden_DeathShowDeadBox = 6,
	EGPCharacterHidden_IsOfflineCharacter = 7,
	EGPCharacterHidden_MAX = 8
};

// Enum GPGameplay.ECharacterQTEStateRight
enum class ECharacterQTEStateRight : UINT8 {
	QTERight_None = 0,
	QTERight_MineActivate = 1,
	QTERight_SelfCure = 2,
	QTERight_Assassinate = 4,
	QTERight_Rescue = 8,
	QTERight_MAX = 9
};

// Enum GPGameplay.ECharacterQTEStateLeft
enum class ECharacterQTEStateLeft : UINT8 {
	QTELeft_None = 0,
	QTELeft_MineRecycle = 1,
	QTELeft_Carry = 2,
	QTELeft_MAX = 3
};

// Enum GPGameplay.EHeroResourceState
enum class EHeroResourceState : UINT8 {
	AS_Init = 0,
	AS_Invalid = 1,
	AS_Loading = 2,
	AS_Loaded = 3,
	AS_MAX = 4
};

// Enum GPGameplay.ECollisionState
enum class ECollisionState : UINT8 {
	None = 0,
	Sol_DefaultSpawn = 1,
	Sol_ImpendingDeath = 2,
	Sol_CarryBody = 3,
	Sol_BeAssassinate = 4,
	Sol_Dying = 5,
	Sol_MatchOver = 6,
	Breakthrough_DefaultSpawn = 7,
	Breakthrough_ImpendingDeath = 8,
	Breakthrough_CarryBody = 9,
	Breakthrough_BeAssassinate = 10,
	Breakthrough_Dying = 11,
	Breakthrough_MatchOver = 12,
	Prone_Default = 13,
	Prone_Prone = 14,
	Prone_ImpendingDeath_Sol = 15,
	Prone_ImpendingDeath_Breakthrough = 16,
	Prone_BeCarry = 17,
	Prone_BeAssassinate = 18,
	Prone_Dying = 19,
	ECollisionState_MAX = 20
};

// Enum GPGameplay.EProcessInputCompReason
enum class EProcessInputCompReason : UINT8 {
	EProcessInputReason_WatchingCCTV = 1,
	EProcessInputReason_WeaponAssembler = 2,
	EProcessInputReason_HALLDISPLAY = 4,
	EProcessInputReason_MAX = 5
};

// Enum GPGameplay.EAICharacterTag
enum class EAICharacterTag : UINT8 {
	EAICharacterTag_None = 0,
	EAICharacterTag_Elite = 1,
	EAICharacterTag_Civilian = 2,
	EAICharacterTag_Sniper = 3,
	EAICharacterTag_Shield = 4,
	EAICharacterTag_HeavyArmor = 5,
	EAICharacterTag_Paratrooper = 6,
	EAICharacterTag_Melee = 7,
	EAICharacterTag_Firebat = 8,
	EAICharacterTag_RPG = 9,
	EAICharacterTag_Boss = 10,
	EAICharacterTag_BoyBand = 11,
	EAICharacterTag_Crocodile = 12,
	EAICharacterTag_NonHuman = 13,
	EAICharacterTag_MAX = 14
};

// Enum GPGameplay.EStateInterruptReason
enum class EStateInterruptReason : UINT8 {
	Lean = 0,
	Sliding = 1,
	NotStandPose = 2,
	ForbidReasonMax = 3,
	EStateInterruptReason_MAX = 4
};

// Enum GPGameplay.EOverrideMovementType
enum class EOverrideMovementType : UINT8 {
	EOperateMovementType_NoMove = 0,
	EOperateMovementType_Walk = 1,
	EOperateMovementType_Run = 2,
	EOperateMovementType_Sprint = 3,
	EOperateMovementType_None = 4,
	EOperateMovementType_MAX = 5
};

// Enum GPGameplay.EOperateMovementType
enum class EOperateMovementType : UINT8 {
	EOperateMovementType_None = 0,
	EOperateMovementType_NoMove = 1,
	EOperateMovementType_NormalRun = 2,
	EOperateMovementType_NoMoveAndNoBasePoseSwitch = 3,
	EOperateMovementType_MAX = 4
};

// Enum GPGameplay.EFSMForbidReason
enum class EFSMForbidReason : UINT8 {
	EFR_Default = 0,
	EFR_Sprint = 1,
	EFR_Vault = 2,
	EFR_Reload = 3,
	EFR_Jump = 4,
	EFR_ProneFire = 5,
	EFR_FreeLook = 6,
	EFR_ImpendingDeath = 7,
	EFR_Operate = 8,
	EFR_Aim = 9,
	EFR_QuickThrow = 10,
	EFR_Prone = 11,
	EFR_Fire = 12,
	EFR_Sequence = 13,
	EFR_Vehicle = 14,
	EFR_Burden = 15,
	EFR_Death = 16,
	EFR_ClimbLadder = 17,
	EFR_WeaponState = 18,
	EFR_UseTelescope = 19,
	EFR_Monitor = 20,
	EFR_RelaxIde = 21,
	EFR_CutScene = 22,
	EFR_BeHit = 23,
	EFR_UseStarApp = 24,
	EFR_SceneWeapon = 25,
	EFR_StaminaLow = 26,
	EFR_OnFlyBase = 27,
	EFR_Assassinate = 28,
	EFR_BeAssassinate = 29,
	EFR_UsingSkill = 30,
	EFR_SearchItem = 31,
	EFR_FallHigh = 32,
	EFR_UseZipline = 33,
	EFR_Parachute = 34,
	EFR_SlidingTackle = 35,
	EFR_TutorialRotate = 36,
	EFR_TutorialMove = 37,
	EFR_TutorialShoot = 38,
	EFR_InSafeHouse = 39,
	EFR_OpenInteractUI = 40,
	EFR_RaiseWatch = 41,
	EFR_PreViewActor = 42,
	EFR_FireModePlacement = 43,
	EFR_WeaponInspect = 44,
	EFR_HighValueItemInspect = 45,
	EFR_WeaponBipodDeploy = 46,
	EFR_BowArrow = 47,
	EFR_SkillRTT = 48,
	EFR_SkillFireRTT = 49,
	EFR_ClientPreStateRTT = 50,
	EFR_WaitingStart = 51,
	EFR_SeamlessShow = 52,
	EFR_Firefighting = 53,
	EFR_ApplySpray = 54,
	EFR_OneHandedGesture = 55,
	EFR_TwoHandedGesture = 56,
	EFR_UsingDoubleHandsSkill = 57,
	EFR_UsingRightHandSkill = 58,
	EFR_UsingLeftHandSkill = 59,
	EFR_UsingLegsSkill = 60,
	EFR_UsingSpecialSkill = 61,
	EFR_Knockback = 62,
	EFR_WeaponPreFire = 63,
	EFR_WeaponFire = 64,
	EFR_Rescue = 65,
	EFR_RushMoveEnd = 66,
	EFR_UsingDoubleHandsSkillAction = 67,
	EFR_UsingRightHandSkillAction = 68,
	EFR_UsingLeftHandSkillAction = 69,
	EFR_UsingLegsSkillAction = 70,
	EFR_UsingSpecialSkillAction = 71,
	EFR_OpenBag = 72,
	EFR_Lean = 73,
	EFR_VehicleLockCamera = 74,
	EFR_PlayingMedia = 75,
	EFR_Reborn = 76,
	ForbidReasonMAX = 77,
	EFSMForbidReason_MAX = 78
};

// Enum GPGameplay.ECharacterStateMask
enum class ECharacterStateMask : UINT8 {
	None = 0,
	CanMove = 1,
	CanRotate = 2,
	CanCharacterRotate = 3,
	CanCrouch = 4,
	CanProne = 5,
	CanJump = 6,
	CanVault = 7,
	CanReload = 8,
	CanAimOn = 9,
	CanAimOff = 10,
	CanSwitchWeapon = 11,
	CanFire = 12,
	CanAutoChangeClip = 13,
	CanWeaponInspect = 14,
	CanHighValueItemInspect = 15,
	CanWeaponBolt = 16,
	CanWeaponBipodDeploy = 17,
	CanSkillSwtichWeapon = 18,
	CanDiscardOrEquipWeapon = 19,
	CanUseMachineGun = 20,
	CanUseItem = 21,
	CanOperate = 22,
	DisableWhitelistOperate = 23,
	CanLooting = 24,
	CanDetectInteractor = 25,
	CanDetectRescue = 26,
	CanUserChangeXPP = 27,
	CanSwitchHelmetMask = 28,
	PauseSwitchHelmetMask = 29,
	CanDrive = 30,
	CanPlayTacticalAction = 31,
	CanClimbLadder = 32,
	CanUseTelescope = 33,
	CanChangeWeaponMode = 34,
	CanShowInteractUI = 35,
	CanLean = 36,
	CanBeHit = 37,
	CanUseSkill = 38,
	CanAssassinate = 39,
	CanCarrybody = 40,
	CanParachute = 41,
	CanSlidingTackle = 42,
	CanUseZipline = 43,
	CanPlayMarkingAnim = 44,
	CanFirefighting = 45,
	CanApplySpray = 46,
	CanPlayOneHandedGesture = 47,
	CanPlayTwoHandedGesture = 48,
	CanNotBlockFriend = 49,
	CanStandUp = 50,
	CanProneMove = 51,
	CanProneStandUp = 52,
	CanSprint = 53,
	CanBeBreakByOtherSkill = 54,
	CanUseSpecialSkill = 55,
	CanUseLeftHandSkill = 56,
	CanUseRightHandSkill = 57,
	CanUseLegSkill = 58,
	CanSkillWeaponFire = 59,
	CanNormalWeaponFire = 60,
	CanReloadLogic = 61,
	CanRaiseWatch = 62,
	All = 63,
	ECharacterStateMask_MAX = 64
};

// Enum GPGameplay.EForbidMoveReason
enum class EForbidMoveReason : UINT8 {
	VaultAndClimb = 0,
	AbilityForbidMove = 1,
	InteractForbidMove = 2,
	InteractTrackerForbidMove = 3,
	HUDForbidMove = 4,
	SettlementForbidMove = 5,
	FSM = 6,
	TransitionMove = 7,
	ForbidMoveReasonNum = 8,
	EForbidMoveReason_MAX = 9
};

// Enum GPGameplay.EMovementFailureReason
enum class EMovementFailureReason : UINT8 {
	MovementFailureReason_None = 0,
	MovementFailureReason_AlreadyInState = 1,
	MovementFailureReason_NotSupport = 2,
	MovementFailureReason_TooFrequent = 3,
	MovementFailureReason_SimulatingPhysics = 4,
	MovementFailureReason_Swimming = 5,
	MovementFailureReason_UsingItem = 6,
	MovementFailureReason_InWeakStatus = 7,
	MovementFailureReason_NotPassCollisionTest = 8,
	MovementFailureReason_TouchWaterVolume = 9,
	MovementFailureReason_IsInKeepPreFireState = 10,
	MovementFailureReason_CanNotStandNow = 11,
	MovementFailureReason_CanNotProneNow = 12,
	MovementFailureReason_Falling = 13,
	MovementFailureReason_MAX = 14
};

// Enum GPGameplay.EPlayerScoreReturnType
enum class EPlayerScoreReturnType : UINT8 {
	PlayerScoreReturnType_None = 0,
	PlayerScoreReturnType_RebornFlag = 1,
	PlayerScoreReturnType_Rescue = 2,
	PlayerScoreReturnType_DriveVehicle = 3,
	PlayerScoreReturnType_TeamLastOneRedeploy = 4,
	PlayerScoreReturnType_MAX = 5
};

// Enum GPGameplay.EPlayerLeanType
enum class EPlayerLeanType : UINT8 {
	PlayerLeanType_NotLean = 0,
	PlayerLeanType_LeftLean = 1,
	PlayerLeanType_RightLean = 2,
	PlayerLeanType_Toggle = 16,
	PlayerLeanType_MAX = 17
};

// Enum GPGameplay.ESwimImmediateAudioType
enum class ESwimImmediateAudioType : UINT8 {
	SwimImmediateAudioType_None = 0,
	SwimImmediateAudioType_Human = 1,
	SwimImmediateAudioType_Vehicle = 2,
	SwimImmediateAudioType_MAX = 3
};

// Enum GPGameplay.ESwimStateAudioType
enum class ESwimStateAudioType : UINT8 {
	SwimStateAudioType_None = 0,
	SwimStateAudioType_AboveWater = 1,
	SwimStateAudioType_BelowWater = 2,
	SwimStateAudioType_MAX = 3
};

// Enum GPGameplay.EStaminaExclusiveChangeType
enum class EStaminaExclusiveChangeType : UINT8 {
	EStaminaExclusiveChange_Normal = 0,
	EStaminaExclusiveChange_Sprint = 1,
	EStaminaExclusiveChange_StandRun = 2,
	EStaminaExclusiveChange_SuperSprint = 3,
	EStaminaExclusiveChange_MAX = 4
};

// Enum GPGameplay.EStaminaIndependentChangeType
enum class EStaminaIndependentChangeType : UINT8 {
	EStaminaIndependentChange_None = 0,
	EStaminaIndependentChange_Jump = 1,
	EStaminaIndependentChange_Vault_One = 2,
	EStaminaIndependentChange_Vault_Two = 3,
	EStaminaIndependentChange_Vault_Three = 4,
	EStaminaIndependentChange_Vault_Four = 5,
	EStaminaIndependentChange_SlideTackle = 6,
	EStaminaIndependentChange_StandToProne = 7,
	EStaminaIndependentChange_StandToCrouch = 8,
	EStaminaIndependentChange_CrouchToStand = 9,
	EStaminaIndependentChange_CrouchToProne = 10,
	EStaminaIndependentChange_ProneToCrouch = 11,
	EStaminaIndependentChange_ProneToStand = 12,
	EStaminaIndependentChange_SkillAssaultAward = 13,
	EStaminaIndependentChange_SkillAssaultStart = 14,
	EStaminaIndependentChange_MAX = 15
};

// Enum GPGameplay.ECampNum
enum class ECampNum : UINT8 {
	ECamp_None = 0,
	ECamp_Player = 1,
	ECamp_PlayerEnemy = 2,
	ECamp_Custom1 = 3,
	ECamp_MAX = 4
};

// Enum GPGameplay.ECharacterGender
enum class ECharacterGender : UINT8 {
	CharacterGender_Male = 0,
	CharacterGender_Female = 1,
	CharacterGender_MAX = 2
};

// Enum GPGameplay.ECharacterDamagePartsName
enum class ECharacterDamagePartsName : UINT8 {
	None = 0,
	Leg = 1,
	LegUpper = 2,
	Arm = 3,
	ArmUpper = 4,
	Head = 5,
	Thorx = 6,
	ThorxUpper = 7,
	ECharacterDamagePartsName_MAX = 8
};

// Enum GPGameplay.ESetCharacterPositionAndRep2ClientReason
enum class ESetCharacterPositionAndRep2ClientReason : UINT8 {
	ENone = 0,
	ERedeploy = 1,
	ERaidResetHasVechile = 2,
	ESetCharacterPositionAndRep2ClientReason_MAX = 3
};

// Enum GPGameplay.ERedeployStateFuture
enum class ERedeployStateFuture : UINT8 {
	Idle = 0,
	Start = 1,
	FallDown = 2,
	TurnCameraToEnemy = 3,
	FovZoomOut = 4,
	KillerMark = 5,
	FovZoomIn = 6,
	TurnCameraToSelf = 7,
	Rescue = 8,
	Rising = 9,
	HighView = 10,
	WaitLoadCollision = 11,
	WaitPreMatch = 12,
	Landing = 13,
	RedeployEnd = 14,
	ERedeployStateFuture_MAX = 15
};

// Enum GPGameplay.ECharacterBaseState
enum class ECharacterBaseState : UINT8 {
	NormalFight = 0,
	SafeHouse = 1,
	ECharacterBaseState_MAX = 2
};

// Enum GPGameplay.VerifyClientMoveResult
enum class VerifyClientMoveResult : UINT8 {
	Invalid = 0,
	Success = 1,
	SuccessCustomMove = 2,
	Fail_Block = 3,
	Fail_Mode = 4,
	Fail_Velocity = 5,
	Fail_JumpCount = 6,
	Fail_ZAxis = 7,
	Fail_MaxJumpHeight = 8,
	Fail_VelocityZ = 9,
	Fail_Distance = 10,
	VerifyClientMoveResult_MAX = 11
};

// Enum GPGameplay.EGPPlayerMoveMode
enum class EGPPlayerMoveMode : UINT8 {
	None = 0,
	StandStill = 1,
	Walk = 2,
	Run = 3,
	Sprint = 4,
	EGPPlayerMoveMode_MAX = 5
};

// Enum GPGameplay.EGPCustomMovementType
enum class EGPCustomMovementType : UINT8 {
	GPCustomMovementType_None = 0,
	GPCustomMovementType_Vaulting = 1,
	GPCustomMovementType_Climbing = 2,
	GPCustomMovementType_Repel = 3,
	GPCustomMovementType_GrapplingHook = 4,
	GPCustomMovementType_ClimbingLadder = 5,
	GPCustomMovementType_StackClimb = 6,
	GPCustomMovementType_SlidingTackle = 7,
	GPCustomMovementType_ClassicTransfromReplicate = 8,
	GPCustomMovementType_Parachute = 9,
	GPCustomMovementType_Assassinate = 10,
	GPCustomMovementType_Zipline = 11,
	GPCustomMovementType_PlayerParachute = 12,
	GPCustomMovementType_Gliding = 13,
	GPCustomMovementType_Interactor = 14,
	GPCustomMovementType_Pushed = 15,
	GPCustomMovementType_Rescue = 16,
	GPCustomMovementType_BeingRescue = 17,
	GPCustomMovementType_TransitionToSequence = 18,
	GPCustomMovementType_Rush = 19,
	GPCustomMovementType_KnockBack = 20,
	GPCustomMovementType_CrocodileBite = 21,
	GPCustomMovementType_BeAssassinate = 22,
	GPCustomMovementType_MAX = 23
};

// Enum GPGameplay.EGPMoveDebug
enum class EGPMoveDebug : UINT8 {
	GPMoveDebug_None = 0,
	GPMoveDebug_Prone = 1,
	GPMoveDebug_Penetration = 2,
	GPMoveDebug_MoveAlong = 3,
	GPMoveDebug_ResetWalkingPosition = 4,
	GPMoveDebug_DrawServerPhysicCheck = 5,
	GPMoveDebug_MAX = 6
};

// Enum GPGameplay.EGPMovementType
enum class EGPMovementType : UINT8 {
	MovementType_None = 0,
	MovementType_Walk = 1,
	MovementType_Fall = 2,
	MovementType_Swim = 3,
	MovementType_Fly = 4,
	MovementType_Sprint = 5,
	MovementType_SilentWalk = 6,
	MovementType_HalfSquatWalk = 7,
	MovementType_MAX = 8
};

// Enum GPGameplay.EAbilityVehicleDestroyReason
enum class EAbilityVehicleDestroyReason : UINT8 {
	Boom = 0,
	EmptyHealth = 1,
	OwnerDie = 2,
	RetrieveItems = 3,
	Power = 4,
	EAbilityVehicleDestroyReason_MAX = 5
};

// Enum GPGameplay.EAudioEventType
enum class EAudioEventType : UINT8 {
	None = 0,
	StandToCrouch = 1,
	StandToProne = 2,
	CrouchToStand = 3,
	CrouchToProne = 4,
	ProneToStand = 5,
	ProneToCrouch = 6,
	ClimbLadderUp = 7,
	EAudioEventType_MAX = 8
};

// Enum GPGameplay.EGPAnimAssetType
enum class EGPAnimAssetType : UINT8 {
	None = 0,
	AssassinateStand = 1,
	BeAssassinateStand = 2,
	AssassinateProne = 3,
	BeAssassinateProne = 4,
	AssassinateImpendingDeath = 5,
	BeAssassinateImpendingDeath = 6,
	EGPAnimAssetType_MAX = 7
};

// Enum GPGameplay.ECharacterState
enum class ECharacterState : UINT8 {
	CharacterState_None = 0,
	CharacterState_Stand = 1,
	CharacterState_Crouch = 2,
	CharacterState_Prone = 3,
	CharacterState_SilentWalk = 4,
	CharacterState_Zipline = 5,
	CharacterState_Peek = 6,
	CharacterState_Jump = 7,
	CharacterState_Firing = 8,
	CharacterState_Zooming = 9,
	CharacterState_Reload = 10,
	CharacterState_SwitchWeapon = 11,
	CharacterState_Inspect = 12,
	CharacterState_Skill = 13,
	CharacterState_SprayPaint = 14,
	CharacterState_HandGesture = 15,
	CharacterState_LookWatch = 16,
	CharacterState_GetKill = 17,
	CharacterState_MAX = 18
};

// Enum GPGameplay.EItemCondition
enum class EItemCondition : UINT8 {
	ItemCondition_None = 0,
	ItemCondition_Empty = 1,
	ItemCondition_CannotUse = 2,
	ItemCondition_NoSpace = 3,
	ItemCondition_MAX = 4
};

// Enum GPGameplay.EItemType
enum class EItemType : UINT8 {
	None = 0,
	Spray = 1,
	Voice = 2,
	OneHandedGesture = 3,
	TwoHandedGesture = 4,
	Emote = 5,
	EItemType_MAX = 6
};

// Enum GPGameplay.EDestructAnimForwardType
enum class EDestructAnimForwardType : UINT8 {
	Forward = 0,
	Right = 1,
	Up = 2,
	NegativeForward = 3,
	NegativeRight = 4,
	NegativeUp = 5,
	EDestructAnimForwardType_MAX = 6
};

// Enum GPGameplay.EDestructPriorityType
enum class EDestructPriorityType : UINT8 {
	ENormalPriority = 0,
	EHighPriority = 1,
	EDestructPriorityType_MAX = 2
};

// Enum GPGameplay.EDestructPhysicsSimulateType
enum class EDestructPhysicsSimulateType : UINT8 {
	EAnimNodePhysics = 0,
	EGobalPhysics = 1,
	EAsyncPhysics = 2,
	EDestructPhysicsSimulateType_MAX = 3
};

// Enum GPGameplay.EDestructPhysicsType
enum class EDestructPhysicsType : UINT8 {
	ENoPhysics = 0,
	ESimulateWithAnimationSequence = 1,
	ESimulateWithDelay = 2,
	ESimulateImmediateWithForce = 3,
	ESimulateImmediateWithForceInRadius = 4,
	EDestructPhysicsType_MAX = 5
};

// Enum GPGameplay.EDestructState
enum class EDestructState : UINT8 {
	ENotDestructed = 0,
	EDamaged = 1,
	EDestroying = 2,
	EDestructed = 3,
	EDestructState_MAX = 4
};

// Enum GPGameplay.EDestructLoadMode
enum class EDestructLoadMode : UINT8 {
	AsyncLoadWhenTrigger = 0,
	AsyncLoadWhenBeginPlay = 1,
	SyncLoad = 2,
	EDestructLoadMode_MAX = 3
};

// Enum GPGameplay.EAIAdditiveBehavior
enum class EAIAdditiveBehavior : UINT8 {
	None = 0,
	AimTarget = 1,
	GunShooting = 2,
	ChangeClip = 3,
	Speaking = 4,
	SpotTurn = 5,
	ProneRotator = 6,
	AdditiveGunPos = 7,
	MAX = 8
};

// Enum GPGameplay.EAILeisureMovementType
enum class EAILeisureMovementType : UINT8 {
	DefualtType = 0,
	SpecialType01 = 1,
	SpecialType02 = 2,
	TYPE_MAX = 3,
	EAILeisureMovementType_MAX = 4
};

// Enum GPGameplay.EGPCharacterMoveDirStateType
enum class EGPCharacterMoveDirStateType : UINT8 {
	Forward = 0,
	Backward = 1,
	Horizontal = 2,
	EGPCharacterMoveDirStateType_MAX = 3
};

// Enum GPGameplay.EGPCharacterInCoverPoseType
enum class EGPCharacterInCoverPoseType : UINT8 {
	None = 0,
	LeftLow = 1,
	RightLow = 2,
	EGPCharacterInCoverPoseType_MAX = 3
};

// Enum GPGameplay.EGPCharacterPoseStateType
enum class EGPCharacterPoseStateType : UINT8 {
	Stand = 0,
	Crouch = 1,
	Prone = 2,
	Sprint = 3,
	Trott = 4,
	EGPCharacterPoseStateType_MAX = 5
};

// Enum GPGameplay.EGPCharacterAlertStateType
enum class EGPCharacterAlertStateType : UINT8 {
	Normal = 0,
	TrottMove = 1,
	Sight = 2,
	EGPCharacterAlertStateType_MAX = 3
};

// Enum GPGameplay.EGPCharacterLeisureMoveType
enum class EGPCharacterLeisureMoveType : UINT8 {
	LeisureMoveType0 = 0,
	LeisureMoveType1 = 1,
	LeisureMoveType2 = 2,
	EGPCharacterLeisureMoveType_MAX = 3
};

// Enum GPGameplay.EGPAICharaLocomotionType
enum class EGPAICharaLocomotionType : UINT8 {
	None = 0,
	Leisure_Patrol = 1,
	Alert_Trot = 2,
	Alert_Walk = 3,
	Alert_Crouch = 4,
	Alert_InLeftCover = 5,
	Alert_InRightCover = 6,
	Alert_Sprint = 7,
	Fight_Crouch = 8,
	Fight_Walk = 9,
	Fight_Run = 10,
	Fight_Sprint = 11,
	Fight_InCoverLeft = 12,
	Fight_InCoverRight = 13,
	EGPAICharaLocomotionType_MAX = 14
};

// Enum GPGameplay.EGPAIMotionType
enum class EGPAIMotionType : UINT8 {
	None = 0,
	Walk = 1,
	Run = 2,
	Sprint = 3,
	Crouch = 4,
	Prone = 5,
	Swim = 6,
	EGPAIMotionType_MAX = 7
};

// Enum GPGameplay.EGPCharacterFightStateType
enum class EGPCharacterFightStateType : UINT8 {
	Fighting = 0,
	Leisure = 1,
	Alert = 2,
	EGPCharacterFightStateType_MAX = 3
};

// Enum GPGameplay.ECharacterGlobalEventDefine
enum class ECharacterGlobalEventDefine : UINT8 {
	ECharacterGlobalEventD_None = 0,
	ECharacterGlobalEvent_ToHandingM2HB = 1,
	ECharacterGlobalEvent_WTF = 2,
	ECharacterGlobalEventDefine_MAX = 3
};

// Enum GPGameplay.EGPFSMNetworkIdentityType
enum class EGPFSMNetworkIdentityType : UINT8 {
	GPFSM_None = 0,
	GPFSM_OnlyServer = 1,
	GPFSM_OnlyClient = 2,
	GPFSM_OnlyAutonomous = 3,
	GPFSM_OnlySimulate = 4,
	GPFSM_BothServerAndAutonomous = 5,
	GPFSM_BothClientAndServer = 6,
	GPFSM_MAX = 7
};

// Enum GPGameplay.EResetWalkingPositionType
enum class EResetWalkingPositionType : UINT8 {
	None = 0,
	PreCheckSuccess = 1,
	Success = 2,
	Fail_CD = 3,
	Fail_NotStuckInGeometry = 4,
	Fail_CheckFail = 5,
	Fail_Disable = 6,
	EResetWalkingPositionType_MAX = 7
};

// Enum GPGameplay.EEndZiplineReason
enum class EEndZiplineReason : UINT8 {
	Arrive = 0,
	Collision = 1,
	Jump = 2,
	Cancel = 3,
	None = 4,
	EEndZiplineReason_MAX = 5
};

// Enum GPGameplay.EBaseTLogDataType
enum class EBaseTLogDataType : UINT8 {
	ENone = 0,
	EServerBegin = 1,
	EDamage = 2,
	EBeDamaged = 3,
	EKillInfo = 4,
	EPropChange = 5,
	EHPGained = 6,
	EServerEnd = 7,
	EClientBegin = 8,
	EBigMapOperate = 9,
	EClientEnd = 10,
	EBaseTLogDataType_MAX = 11
};

// Enum GPGameplay.ELastHitPosition
enum class ELastHitPosition : UINT8 {
	Head = 0,
	Chest = 1,
	Stomach = 2,
	LeftArm = 3,
	RightArm = 4,
	LeftLeg = 5,
	RightLeg = 6,
	None = 99,
	ELastHitPosition_MAX = 100
};

// Enum GPGameplay.ESpecialWeaponMatch
enum class ESpecialWeaponMatch : UINT8 {
	None = 0,
	Sniper = 1,
	ColdArms = 2,
	Richx3 = 3,
	Pistol = 4,
	Shotgun = 5,
	Drug = 6,
	AbilityItem = 7,
	ESpecialWeaponMatch_MAX = 8
};

// Enum GPGameplay.EGameplayType
enum class EGameplayType : UINT8 {
	EGameplayType_None = 0,
	EGameplayType_Normal = 1,
	EGameplayType_BFA = 2,
	EGameplayType_BTT = 3,
	EGameplayType_Max = 4
};

// Enum GPGameplay.EGameTeamMemberCountType
enum class EGameTeamMemberCountType : UINT8 {
	EGameTeamMemberCountType_None = 0,
	EGameTeamMemberCountType_2 = 1,
	EGameTeamMemberCountType_3 = 2,
	EGameTeamMemberCountType_5 = 4,
	EGameTeamMemberCountType_6 = 5,
	EGameRoomType_Max = 6,
	EGameTeamMemberCountType_MAX = 7
};

// Enum GPGameplay.EGameRoomType
enum class EGameRoomType : UINT8 {
	EGameRoomType_None = 0,
	EGameRoomType_Normal = 1,
	EGameRoomType_Rank = 2,
	EGameRoomType_Custom = 3,
	EGameRoomType_Max = 4
};

// Enum GPGameplay.EHitEffectType
enum class EHitEffectType : UINT8 {
	HitEffectType_None = 0,
	HitEffectType_Animation = 1,
	HitEffectType_Physx = 2,
	HitEffectType_MAX = 3
};

// Enum GPGameplay.EHitDirection
enum class EHitDirection : UINT8 {
	HitDirection_None = 0,
	HitDirection_Front = 1,
	HitDirection_Back = 2,
	HitDirection_Left = 3,
	HitDirection_Right = 4,
	HitDirection_MAX = 5
};

// Enum GPGameplay.EInputDisableReason
enum class EInputDisableReason : UINT8 {
	HUD_EmptyWhiteListBlockAll = 0,
	HUD_NotInWhiteList = 1,
	HUD_InBlackList = 2,
	MainStage = 3,
	PlayMode = 4,
	Dynamic = 5,
	EInputDisableReason_MAX = 6
};

// Enum GPGameplay.EInputActionType
enum class EInputActionType : UINT8 {
	EInputAction_None = 0,
	EInputAction_LeftFireBtnDown = 1,
	EInputAction_LeftFireBtnUp = 2,
	EInputAction_RightFireBtnDown = 3,
	EInputAction_RightFireBtnUp = 4,
	EInputAction_MoveForwardBtnDown = 5,
	EInputAction_MoveForwardBtnUp = 6,
	EInputAction_MoveBackwardBtnDown = 7,
	EInputAction_MoveBackwardBtnUp = 8,
	EInputAction_MoveLeftBtnDown = 9,
	EInputAction_MoveLeftBtnUp = 10,
	EInputAction_MoveRightBtnDown = 11,
	EInputAction_MoveRightBtnUp = 12,
	EInputAction_MoveUpBtnDown = 13,
	EInputAction_MoveUpBtnUp = 14,
	EInputAction_MoveDownBtnDown = 15,
	EInputAction_MoveDownBtnUp = 16,
	EInputAction_MoveRollLeftBtnDown = 17,
	EInputAction_MoveRollLeftBtnUp = 18,
	EInputAction_MoveRollRightBtnDown = 19,
	EInputAction_MoveRollRightBtnUp = 20,
	EInputAction_AirThrottleUpBtnDown = 21,
	EInputAction_AirThrottleUpBtnUp = 22,
	EInputAction_AirThrottleDownBtnDown = 23,
	EInputAction_AirThrottleDownBtnUp = 24,
	EInputAction_AirRollLeftBtnDown = 25,
	EInputAction_AirRollLeftBtnUp = 26,
	EInputAction_AirRollRightBtnDown = 27,
	EInputAction_AirRollRightBtnUp = 28,
	EInputAction_AirPitchUpBtnDown = 29,
	EInputAction_AirPitchUpBtnUp = 30,
	EInputAction_AirPitchDownBtnDown = 31,
	EInputAction_AirPitchDownBtnUp = 32,
	EInputAction_AirYawLeftBtnDown = 33,
	EInputAction_AirYawLeftBtnUp = 34,
	EInputAction_AirYawRightBtnDown = 35,
	EInputAction_AirYawRightBtnUp = 36,
	EInputAction_JumpAndVaultBtnDown = 37,
	EInputAction_JumpAndVaultBtnUp = 38,
	EInputAction_JumpBtnDown = 39,
	EInputAction_JumpBtnUp = 40,
	EInputAction_VaultBtnDown = 41,
	EInputAction_CrouchBtnDown = 42,
	EInputAction_CrouchHoldBtnDown = 43,
	EInputAction_CrouchHoldBtnUp = 44,
	EInputAction_ProneBtnDown = 45,
	EInputAction_ProneHoldBtnDown = 46,
	EInputAction_ProneHoldBtnUp = 47,
	EInputAction_SprintBtnDown = 48,
	EInputAction_SprintBtnUp = 49,
	EInputAction_SilentWalkBtnDown = 50,
	EInputAction_SilentWalkBtnUp = 51,
	EInputAction_PersistMoveBtnDown = 52,
	EInputAction_PersistMoveBtnUp = 53,
	EInputAction_AimBtnDown = 54,
	EInputAction_SideAimBtnDown = 55,
	EInputAction_AimBtnUp = 56,
	EInputAction_SideAimBtnUp = 57,
	EInputAction_ChangeSightBtnDown = 58,
	EInputAction_HoldBreathBtnDown = 59,
	EInputAction_HoldBreathBtnUp = 60,
	EInputAction_ReloadBtnDown = 61,
	EInputAction_ReloadBtnUp = 62,
	EInputAction_SwitchWeaponFireModeBtnDown = 63,
	EInputAction_AbilityDetailBtnUp = 64,
	EInputAction_AbilityDetailBtnDown = 65,
	EInputAction_SkillButtonBtnDown = 66,
	EInputAction_SkillButtonBtnUp = 67,
	EInputAction_AbilityItemBtnDown = 68,
	EInputAction_AbilityItemBtnUp = 69,
	EInputAction_AbilityItemSecondBtnDown = 70,
	EInputAction_AbilityItemSecondBtnUp = 71,
	EInputAction_AbilityTestSpawnBtnDown = 72,
	EInputAction_SkillCustom1BtnDown = 73,
	EInputAction_SkillCustom1BtnUp = 74,
	EInputAction_BattleFieldPropSkillBtnDown = 75,
	EInputAction_BattleFieldPropSkillBtnUp = 76,
	EInputAction_TelescopeBtnDown = 77,
	EInputAction_ChangeXPPBtnDown = 78,
	EInputAction_LeftPeekBtnDown = 79,
	EInputAction_LeftPeekBtnUp = 80,
	EInputAction_RightPeekBtnDown = 81,
	EInputAction_RightPeekBtnUp = 82,
	EInputAction_AssassinateBtnDown = 83,
	EInputAction_AssassinateBtnUp = 84,
	EInputAction_MedicalSyringeBtnDown = 85,
	EInputAction_ZiplineBtnDown = 86,
	EInputAction_RescueBtnDown = 87,
	EInputAction_RescueBtnUp = 88,
	EInputAction_CarryBodyBtnDown = 89,
	EInputAction_DropCarryBodyBtnDown = 90,
	EInputAction_InspectWeaponBtnDown = 91,
	EInputAction_WeaponBipodDeployBtnDown = 92,
	EInputAction_ParachuteBtnDown = 93,
	EInputAction_MarkingBtnDown = 94,
	EInputAction_MarkingBtnUp = 95,
	EInputAction_CommercializationBtnDown = 96,
	EInputAction_CommercializationBtnUp = 97,
	EInputAction_SwitchMouseModeBtnDown = 98,
	EInputAction_SprintKeyboardBtnDown = 99,
	EInputAction_SprintKeyboardBtnUp = 100,
	EInputAction_SilentWalkKeyboardBtnDown = 101,
	EInputAction_SilentWalkKeyboardBtnUp = 102,
	EInputAction_SwitchWeapon1BtnDown = 103,
	EInputAction_SwitchWeapon2BtnDown = 104,
	EInputAction_SwitchWeapon3BtnDown = 105,
	EInputAction_SwitchWeapon4BtnDown = 106,
	EInputAction_SwitchToPreWeaponBtnDown = 107,
	EInputAction_SwitchToNextWeaponBtnDown = 108,
	EInputAction_InteractBtnDown = 109,
	EInputAction_InteractBtnUp = 110,
	EInputAction_Interact2BtnDown = 111,
	EInputAction_Interact2BtnUp = 112,
	EInputAction_MouseScrollUpBtnDown = 113,
	EInputAction_MouseScrollDownBtnDown = 114,
	EInputAction_SwitchTacticalEquipmentBtnUp = 115,
	EInputAction_SwitchTacticalEquipmentBtnDown = 116,
	EInputAction_LootingOpenBagBtnDown = 117,
	EInputAction_LootingOpenHealthTabBtnDown = 118,
	EInputAction_ToggleScoreboardBtnDown = 119,
	EInputAction_ToggleScoreboardBtnUp = 120,
	EInputAction_QuickResYesBtnDown = 121,
	EInputAction_QuickResNoBtnDown = 122,
	EInputAction_ParachuteOpenKeyboardBtnDown = 123,
	EInputAction_ParachuteCloseKeyboardBtnDown = 124,
	EInputAction_PowerFlashOpenKeyboardBtnDown = 125,
	EInputAction_RangeFinderBtnDown = 126,
	EInputAction_OpenMapBtnDown = 127,
	EInputAction_ZoomUpBigMapScaleBtnDown = 128,
	EInputAction_ZoomDownBigMapScaleBtnDown = 129,
	EInputAction_MapLongPressSelectBtnUp = 130,
	EInputAction_MapLongPressSelectBtnDown = 131,
	EInputAction_MapDigitalKey1BtnDown = 132,
	EInputAction_MapDigitalKey2BtnDown = 133,
	EInputAction_MapDigitalKey3BtnDown = 134,
	EInputAction_MapDigitalKey4BtnDown = 135,
	EInputAction_MapKeyUpBtnDown = 136,
	EInputAction_MapKeyDownBtnDown = 137,
	EInputAction_ESCBtnDown = 138,
	EInputAction_CloseDeathDetailBtnDown = 139,
	EInputAction_HideHUDBtnDown = 140,
	EInputAction_ToggleVoiceSpeakingBtnDown = 141,
	EInputAction_KeepVoiceSpeakingBtnDown = 142,
	EInputAction_KeepVoiceSpeakingBtnUp = 143,
	EInputAction_MuteAllBtnDown = 144,
	EInputAction_ChatWindowBtnDown = 145,
	EInputAction_ChangeFOVBtnDown = 146,
	EInputAction_ChangeFovBtnUp = 147,
	EInputAction_TPPRotateCameraBtnDown = 148,
	EInputAction_TPPRotateCameraBtnUp = 149,
	EInputAction_RequestRescueBtnDown = 150,
	EInputAction_RequestRescueBtnUp = 151,
	EInputAction_AbandonRescueBtnDown = 152,
	EInputAction_AbandonRescueBtnUp = 153,
	EInputAction_RouletteLeftBtnDown = 154,
	EInputAction_RouletteMedBtnDown = 155,
	EInputAction_RouletteEquipBtnDown = 156,
	EInputAction_RouletteMedBtnUp = 157,
	EInputAction_RouletteEquipBtnUp = 158,
	EInputAction_CancelRouletteBtnDown = 159,
	EInputAction_ArtillerySupportBtnDown = 160,
	EInputAction_ArtillerySupportBtnUp = 161,
	EInputAction_LocatePlayerBtnDown = 162,
	EInputAction_ToggleLegendsBtnDown = 163,
	EInputAction_VehicleBoostBtnDown = 164,
	EInputAction_VehicleBrakeBtnDown = 165,
	EInputAction_VehicleBrakeBtnUp = 166,
	EInputAction_ChangeVehicleSeat1BtnDown = 167,
	EInputAction_ChangeVehicleSeat2BtnDown = 168,
	EInputAction_ChangeVehicleSeat3BtnDown = 169,
	EInputAction_ChangeVehicleSeat4BtnDown = 170,
	EInputAction_ChangeVehicleSeat5BtnDown = 171,
	EInputAction_ChangeVehicleSeat6BtnDown = 172,
	EInputAction_FirstVehicleSkillBtnDown = 173,
	EInputAction_FirstVehicleSkillBtnUp = 174,
	EInputAction_SecondVehicleSkillBtnDown = 175,
	EInputAction_SecondVehicleSkillBtnUp = 176,
	EInputAction_ThirdVehicleSkillBtnDown = 177,
	EInputAction_ThirdVehicleSkillBtnUp = 178,
	EInputAction_FourthVehicleSkillBtnDown = 179,
	EInputAction_FourthVehicleSkillBtnUp = 180,
	EInputAction_SecondVehicleWeaponFireBtnDown = 181,
	EInputAction_VehicleHeadOutBtnDown = 182,
	EInputAction_VehicleTrumpetBtnDown = 183,
	EInputAction_VehicleTrumpetBtnUp = 184,
	EInputAction_VehicleSwitchXPPBtnDown = 185,
	EInputAction_LeaveVehicleBtnDown = 186,
	EInputAction_LockVehicleCameraBtnDown = 187,
	EInputAction_LockVehicleCameraBtnUp = 188,
	EInputAction_VehicleAimBtnDown = 189,
	EInputAction_VehicleAimBtnUp = 190,
	EInputAction_ToggleWeaponDebugPanelBtnDown = 191,
	EInputAction_GMToggleGhostWalk = 192,
	EInputAction_GMToggleFlyWalk = 193,
	EInputAction_GMAddSpeed100 = 194,
	EInputAction_GMMinusSpeed100 = 195,
	EInputAction_OBCameraSpeedUpBtnDown = 196,
	EInputAction_OBCameraSpeedDownBtnDown = 197,
	EInputAction_OBC_ShowHidePanelBtnDown = 198,
	EInputAction_OBC_CatchMoveRoutePointBtnDown = 199,
	EInputAction_OBC_GenerateMoveRouteBtnDown = 200,
	EInputAction_OBC_ClearMoveRouteBtnDown = 201,
	EInputAction_OBC_CatchFaceRoutePointBtnDown = 202,
	EInputAction_OBC_GenerateFaceRouteBtnDown = 203,
	EInputAction_OBC_ClearFaceRouteBtnDown = 204,
	EInputAction_OBC_ShowHideRouteDebugViewBtnDown = 205,
	EInputAction_OBC_StartMoveCameraBtnDown = 206,
	EInputAction_OBC_UpdateFocusPointBtnDown = 207,
	EInputAction_OBC_LeftBtnClickBtnDown = 208,
	EInputAction_OBC_RightBtnClickBtnDown = 209,
	EInputAction_OBC_SwitchToFreeCameraBtnDown = 210,
	EInputAction_OBC_PrevTeamBtnDown = 211,
	EInputAction_OBC_NextTeamBtnDown = 212,
	EInputAction_OBC_ShowTeamInfoBtnDown = 213,
	EInputAction_OBC_ShowOutLineEffectBtnDown = 214,
	EInputAction_OBC_ShowPlayerMarkerBtnDown = 215,
	EInputAction_WatchFightChangeTargetBtnDown = 216,
	EInputAction_WatchFightExitBtnDown = 217,
	EInputAction_WatchFightReportVoiceBtnDown = 218,
	EInputAction_WatchFightReportBtnDown = 219,
	EInputAction_WatchFightPlayerCardBtnDown = 220,
	EInputAction_WatchFightDeathDetailInfoBtnDown = 221,
	EInputAction_WatchKillCamReplayBtnDown = 222,
	EInputAction_SwitchVehicleWeapon1BtnDown = 223,
	EInputAction_SwitchVehicleWeapon2BtnDown = 224,
	EInputAction_FreeLookaroundModeBtnDown = 225,
	EInputAction_FreeLookaroundModeBtnUp = 226,
	EInputAction_MiniMapScaleChangeBtnDown = 227,
	EInputAction_RangeManageWeaponBtnDown = 228,
	EInputAction_RangeToggleAnalysisPanelBtnDown = 229,
	EInputAction_RangeRefreshAnalysisPanelBtnDown = 230,
	EInputAction_SuperSprintBtnDown = 231,
	EInputAction_SuperSprintBtnUp = 232,
	EInputAction_FirefightingBtnDown = 233,
	EInputAction_FirefightingBtnUp = 234,
	EInputAction_PullOutArrowBtnDown = 235,
	EInputAction_PullOutArrowBtnUp = 236,
	EInputAction_SwitchScrollVehicleWeapon1BtnDown = 237,
	EInputAction_SwitchScrollVehicleWeapon2BtnDown = 238,
	EInputAction_Exit3DSafeHouseBtnDown = 239,
	EInputAction_NumMax = 240,
	EInputAction_MAX = 241
};

// Enum GPGameplay.EBagTabType
enum class EBagTabType : UINT8 {
	EBagTab_Character = 0,
	EBagTab_Health = 1,
	EBagTab_MAX = 2
};

// Enum GPGameplay.EInputAxisType
enum class EInputAxisType : UINT8 {
	EInputAxis_None = 0,
	EInputAxis_TurnAtRate = 1,
	EInputAxis_LookUpAtRate = 2,
	EInputAxis_MoveForward = 3,
	EInputAxis_MoveRight = 4,
	EInputAxis_MoveUp = 5,
	EInputAxis_MoveRoll = 6,
	EInputAxis_AirThrottle = 7,
	EInputAxis_AirPitch = 8,
	EInputAxis_AirRoll = 9,
	EInputAxis_AirYaw = 10,
	EInputAxis_NumMax = 11,
	EInputAxis_MAX = 12
};

// Enum GPGameplay.EKnockbackFromType
enum class EKnockbackFromType : UINT8 {
	None = 0,
	RankSkill_GuidMissle = 1,
	EKnockbackFromType_MAX = 2
};

// Enum GPGameplay.EKnockBackState
enum class EKnockBackState : UINT8 {
	KnockBackState_Undefine = 0,
	KnockBackState_Fly = 1,
	KnockBackState_Fall = 2,
	KnockBackState_GetUp = 3,
	KnockBackState_MAX = 4
};

// Enum GPGameplay.EGPMarkerColorType
enum class EGPMarkerColorType : UINT8 {
	None = 0,
	LocationMarkerEnemyColor = 1,
	EGPMarkerColorType_MAX = 2
};

// Enum GPGameplay.ELowAmmoBubbleSourceType
enum class ELowAmmoBubbleSourceType : UINT8 {
	None = 0,
	AmmoPack = 1,
	ELowAmmoBubbleSourceType_MAX = 2
};

// Enum GPGameplay.ELowHealthBubbleSourceType
enum class ELowHealthBubbleSourceType : UINT8 {
	None = 0,
	HealthPack = 1,
	ELowHealthBubbleSourceType_MAX = 2
};

// Enum GPGameplay.EAutoShowBubbleSourceType
enum class EAutoShowBubbleSourceType : UINT8 {
	None = 0,
	SupportPack = 1,
	SupportBox = 2,
	MedicalGun = 3,
	EAutoShowBubbleSourceType_MAX = 4
};

// Enum GPGameplay.EMarkingChatType
enum class EMarkingChatType : UINT8 {
	Default = 0,
	Location_Normal = 1,
	Location_Enemy = 2,
	Location_Attack = 3,
	Location_Defend = 4,
	Location_BeCareful = 5,
	Item_CommonItem = 6,
	Item_LootingItem = 7,
	Item_Container = 8,
	Item_DyingTeammate = 9,
	Item_DeadBody = 10,
	Item_Weapon = 11,
	Item_EngineerSonicTrap = 12,
	Item_Vehicle = 13,
	Item_TacticalEquip = 14,
	Item_PendingDeathCharacter = 15,
	Item_SectorAnchor = 16,
	Item_MandelBrickInteractor = 17,
	Item_MandelBrickDecipherDevice = 18,
	CancelMarking = 19,
	ReplyRescue = 20,
	Evacuation = 21,
	SafeBox = 22,
	MandelBrick = 23,
	DecipherStation = 24,
	CallForHelp = 25,
	COUNT = 26,
	EMarkingChatType_MAX = 27
};

// Enum GPGameplay.EMarkingItemType
enum class EMarkingItemType : UINT8 {
	None = 0,
	CommonItem = 1,
	LootingItem = 2,
	Container = 3,
	DyingTeammate = 4,
	DeadBody = 5,
	Weapon = 6,
	EngineerSonicTrap = 7,
	Vehicle = 8,
	TacticalEquip = 9,
	PendingDeathCharacter = 10,
	SectorAnchor = 11,
	MandelBrickInteractor = 12,
	MandelBrickDecipherDevice = 13,
	COUNT = 14,
	EMarkingItemType_MAX = 15
};

// Enum GPGameplay.EMarkingLocationType
enum class EMarkingLocationType : UINT8 {
	None = 0,
	NormalLocation = 1,
	Enemy = 2,
	Attack = 3,
	Defend = 4,
	BeCareful = 5,
	COUNT = 6,
	EMarkingLocationType_MAX = 7
};

// Enum GPGameplay.EGameMarkFeature
enum class EGameMarkFeature : UINT8 {
	UpdateDistance = 1,
	UpdateHasCoverBetween = 2,
	UpdateHasAimed = 4,
	UpdateHasAimedByCircle = 8,
	UpdateScaleWithDistance = 16,
	EGameMarkFeature_MAX = 17
};

// Enum GPGameplay.EInteractorMarkerType
enum class EInteractorMarkerType : UINT8 {
	None = 0,
	Interactor_SceneAmmoBox = 1,
	EInteractorMarkerType_MAX = 2
};

// Enum GPGameplay.EMarkingMarkerType
enum class EMarkingMarkerType : UINT8 {
	None = 0,
	PlayerMarker_Location = 1,
	PlayerMarker_Item = 2,
	EMarkingMarkerType_MAX = 3
};

// Enum GPGameplay.EMapMarkerType
enum class EMapMarkerType : UINT8 {
	None = 0,
	MapMarkerNormal = 1,
	Chat_Normal = 2,
	Chat_Item = 3,
	MapMarkerPlayerExit = 4,
	MapMarkerPlayerExitTrigger = 5,
	MapMarkerDoor = 6,
	MapMarkerQuest = 7,
	MapMarkerPOI = 8,
	MapMarkerShopStation = 9,
	MapMarkerHighValueBox = 10,
	MapMarkerContractQuest = 11,
	MapMarkerContractObjection = 12,
	MapMarkerWeaponBlueprintStation = 13,
	MapMarkerSectorAnchor = 14,
	MapMarkerScouter = 15,
	MapMarkerIronGauze = 16,
	EMapMarkerType_MAX = 17
};

// Enum GPGameplay.EQuestMarkerMarkerType
enum class EQuestMarkerMarkerType : UINT8 {
	None = 0,
	Arrive = 1,
	Destroy = 2,
	Protect = 3,
	ProtectWithHP = 4,
	Arrive_Optional = 5,
	Destroy_Optional = 6,
	Protect_Optional = 7,
	ProtectWithHP_Optional = 8,
	NPCTalk = 9,
	TargetTrack = 10,
	NPCTrigger = 11,
	RPGTrack = 12,
	Vehicle = 13,
	Hostage = 14,
	MarkerNarrow = 15,
	AmmoBox = 16,
	EliteAI = 17,
	InteractiveReading = 18,
	InteractGame = 19,
	Raid_ValkyrieVehicle = 20,
	NPCTeamMate = 21,
	SOLContractKill = 22,
	SOLContractArrive = 23,
	SOLContractInteract = 24,
	SOLContractManning = 25,
	SOLMissionKill = 26,
	SOLMissionArrive = 27,
	SOLMissionInteract = 28,
	EQuestMarkerMarkerType_MAX = 29
};

// Enum GPGameplay.ESOLGameModeMarkerType
enum class ESOLGameModeMarkerType : UINT8 {
	None = 0,
	DoorMarker = 1,
	CountDownReleaseMarker = 2,
	ESOLGameModeMarkerType_MAX = 3
};

// Enum GPGameplay.EBattleFieldGameModeMarkerType
enum class EBattleFieldGameModeMarkerType : UINT8 {
	None = 0,
	SectorAnchorMarker = 1,
	TransferMarker = 2,
	SupportSkillMarker = 3,
	BattleFieldCampSectorMarker = 4,
	EBattleFieldGameModeMarkerType_MAX = 5
};

// Enum GPGameplay.ETacticalEquipmentMarkerType
enum class ETacticalEquipmentMarkerType : UINT8 {
	None = 0,
	CommonTacticalEquipmentMarker = 1,
	RebornFlagMarker = 2,
	VehicleRebornFlagMarker = 3,
	AmmoBoxMarker = 4,
	SonicTrapMarker = 5,
	GunnerRobotMarker = 6,
	HealBoxMarker = 7,
	ADSMarker = 8,
	RecoveryMarker = 9,
	DeadBodyAmmoBoxMarker = 10,
	ThrowBlocking = 11,
	SceneAmmoBoxMarker = 12,
	StingMissleMarker = 13,
	SupportWeaponMarker = 14,
	LaserPointerMarker = 15,
	LaserPointerReciverMarker = 16,
	Detector = 17,
	RankSkillRebornFlagMarker = 18,
	SupportPackTargetMarker = 19,
	AutiTankMine = 20,
	ClaymoreMine = 21,
	ETacticalEquipmentMarkerType_MAX = 22
};

// Enum GPGameplay.EVehicleMarkerType
enum class EVehicleMarkerType : UINT8 {
	None = 0,
	CommonVehicleMarker = 1,
	EVehicleMarkerType_MAX = 2
};

// Enum GPGameplay.ESceneWeaponMarkerType
enum class ESceneWeaponMarkerType : UINT8 {
	None = 0,
	CommonSceneWeaponMarker = 1,
	FixedWeaponAAMarker = 2,
	FixedWeaponMachineGunMarker = 3,
	FixedWeaponShoreMarker = 4,
	ESceneWeaponMarkerType_MAX = 5
};

// Enum GPGameplay.EEnemyCharacterMarkerType
enum class EEnemyCharacterMarkerType : UINT8 {
	None = 0,
	RevealMarker = 1,
	AIBaseMarker = 2,
	AIWarnMarker = 3,
	AimedEnemyPlayerMarker = 4,
	AimedAIMarker = 5,
	EnemyEffectMarker = 6,
	FocusedEnemyMarker = 7,
	KillCamSelfMarker = 8,
	EEnemyCharacterMarkerType_MAX = 9
};

// Enum GPGameplay.EFriendlyCharacterMarkerType
enum class EFriendlyCharacterMarkerType : UINT8 {
	None = 0,
	FriendlyMarker = 1,
	ImpendingDeathMarker = 2,
	DeathMarker = 3,
	OBFriendlyMarker = 4,
	OBImpendingDeathMarker = 5,
	OBDeathMarker = 6,
	BattleFieldOBFriendlyMarker = 7,
	BattleFieldOBImpendingDeathMarker = 8,
	BattleFieldOBDeathMarker = 9,
	OBAIMarker = 10,
	EFriendlyCharacterMarkerType_MAX = 11
};

// Enum GPGameplay.EGPMarkerClassType
enum class EGPMarkerClassType : UINT8 {
	None = 0,
	FriendlyCharacterMarker = 1,
	EnemyCharacterMarker = 2,
	SceneWeaponMarker = 3,
	VehicleMarker = 4,
	TacticalEquipmentMarker = 5,
	BattleFieldGameModeMarker = 6,
	SOLGameModeMarker = 7,
	QuestMarker = 8,
	MapMarker = 9,
	MarkingMarker = 10,
	InteractorMarker = 11,
	EGPMarkerClassType_MAX = 12
};

// Enum GPGameplay.EGPMarkerType
enum class EGPMarkerType : UINT8 {
	None = 0,
	EGPMarkerType_MAX = 1
};

// Enum GPGameplay.EMarkerRefreshFrequencyLevel
enum class EMarkerRefreshFrequencyLevel : UINT8 {
	EveryFrame = 0,
	SuperHighFrequency = 1,
	HighFrequency = 2,
	MidFrequency = 3,
	LowFrequency = 4,
	EMarkerRefreshFrequencyLevel_MAX = 5
};

// Enum GPGameplay.EMarkerCampType
enum class EMarkerCampType : UINT8 {
	None = 0,
	Neutral = 1,
	Campmate = 2,
	Teammate = 3,
	Enemy = 4,
	Self = 5,
	EMarkerCampType_MAX = 6
};

// Enum GPGameplay.EGPMarkerViewStatus
enum class EGPMarkerViewStatus : UINT8 {
	PendingCreate = 0,
	Created = 1,
	EGPMarkerViewStatus_MAX = 2
};

// Enum GPGameplay.EGPMarkedActorStatus
enum class EGPMarkedActorStatus : UINT8 {
	Normal = 0,
	Clipped = 1,
	Destroyed = 2,
	EGPMarkedActorStatus_MAX = 3
};

// Enum GPGameplay.EMarkerUIWigetType
enum class EMarkerUIWigetType : UINT8 {
	None = 0,
	DistanceText = 1,
	NameText = 2,
	Bar = 4,
	Icon = 8,
	All = 15,
	EMarkerUIWigetType_MAX = 16
};

// Enum GPGameplay.ERevealMarkerReason
enum class ERevealMarkerReason : UINT8 {
	None = 0,
	Resident = 1,
	AimReveal = 2,
	FireReveal = 3,
	MarkingReveal = 4,
	LockReveal = 5,
	ERevealMarkerReason_MAX = 6
};

// Enum GPGameplay.ECharacterMarkerState
enum class ECharacterMarkerState : UINT8 {
	None = 0,
	Alive = 1,
	PendingDeath = 2,
	FirstDeath = 3,
	Death = 4,
	ECharacterMarkerState_MAX = 5
};

// Enum GPGameplay.EQuickChatMarkingItemType
enum class EQuickChatMarkingItemType : UINT8 {
	None = 0,
	ThankYou = 1,
	NeedMedic = 2,
	NeedRepair = 3,
	NeedMunitions = 4,
	NeedVehicle = 5,
	EQuickChatMarkingItemType_MAX = 6
};

// Enum GPGameplay.MarkType
enum class MarkType : UINT8 {
	CHARACTER = 0,
	MarkType_MAX = 1
};

// Enum GPGameplay.ENetworkNotifyPriority
enum class ENetworkNotifyPriority : UINT8 {
	NetworkIdentityNotifyPriority_NoUse = 0,
	NetworkIdentityNotifyPriority_Default = 101,
	NetworkIdentityNotifyPriority_Blackboard = 50,
	NetworkIdentityNotifyPriority_ActorRoot = 100,
	NetworkIdentityNotifyPriority_First = 110,
	NetworkIdentityNotifyPriority_Second = 120,
	NetworkIdentityNotifyPriority_Third = 130,
	NetworkIdentityNotifyPriority_Fourth = 140,
	NetworkIdentityNotifyPriority_Fifth = 150,
	NetworkIdentityNotifyPriority_Sixth = 160,
	NetworkIdentityNotifyPriority_Seventh = 170,
	NetworkIdentityNotifyPriority_Eighth = 180,
	NetworkIdentityNotifyPriority_MAX = 181
};

// Enum GPGameplay.ENotifyTeammatesType
enum class ENotifyTeammatesType : UINT8 {
	ENotify_None = 0,
	ENotify_SkillReady = 1,
	ENotify_NumMax = 2,
	ENotify_MAX = 3
};

// Enum GPGameplay.EOutLineScreenEffectStencil
enum class EOutLineScreenEffectStencil : UINT8 {
	None = 0,
	OutLineRed_3P = 30,
	OutLineWhite = 31,
	OutLineGreen = 32,
	OutLineBlue = 33,
	OutLineAI = 34,
	OutLineRed_1P = 35,
	OutLineLocking = 36,
	OutLineLockComplete = 37,
	OutLineGreen_SupportEffect = 38,
	OutLineYellow_Low = 40,
	OutLineYellow_High = 41,
	EOutLineScreenEffectStencil_MAX = 42
};

// Enum GPGameplay.EAbilityItemOutLineType
enum class EAbilityItemOutLineType : UINT8 {
	None = 0,
	OnlyTeamate = 1,
	AllCamp = 2,
	EAbilityItemOutLineType_MAX = 3
};

// Enum GPGameplay.EOutLineEffectType
enum class EOutLineEffectType : int {
	OutLineType_None = 0,
	OutLineType_ProxSensor = 1,
	OutLineType_ArrowMark = 2,
	OutLineType_MedicGun = 4,
	OutLineType_MedicGunHit = 8,
	OutLineType_SupportEffect = 16,
	OutLineType_DyingLockEnemy = 32,
	OutLineType_Breakthrough_Defender = 64,
	OutLineType_DyingShowTeammateCanRescueSelf = 128,
	OutLineType_DyingShowCampMedicCanRescueSelf = 256,
	OutLineType_Locking = 512,
	OutLineType_LockComplete = 1024,
	OutLineType_LockFire = 2048,
	OutLineType_OnlyMarker = 4096,
	OutLineType_SOL_OB_Teammate = 8192,
	OutLineType_SOL_OB_Enemy = 16384,
	OutLineType_SOL_OB_AI = 32768,
	OutLineType_SOL_OB_FreeCamera = 65536,
	OutLineType_MAX = 65537
};

// Enum GPGameplay.EPlayerParachutePhaseType
enum class EPlayerParachutePhaseType : UINT8 {
	None = 0,
	Parachute = 1,
	Glide = 2,
	EPlayerParachutePhaseType_MAX = 3
};

// Enum GPGameplay.EParachutePhaseType
enum class EParachutePhaseType : UINT8 {
	EParachutePhase_None = 0,
	EParachutePhase_Flying = 1,
	EParachutePhase_Landing = 2,
	EParachutePhase_MAX = 3
};

// Enum GPGameplay.EGPPathFollowStatus
enum class EGPPathFollowStatus : UINT8 {
	Init = 0,
	Play = 1,
	Pause = 2,
	Stop = 3,
	EGPPathFollowStatus_MAX = 4
};

// Enum GPGameplay.ECameraModifier
enum class ECameraModifier : UINT8 {
	ECM_Default = 0,
	ECM_Reborn = 1,
	ECM_Redeploy = 2,
	ECM_GunSway = 3,
	ECM_AssaultSpeedUp = 4,
	ECM_Fire = 5,
	ECM_Bleeding = 6,
	ECM_Sprint = 7,
	ECM_CameraShake = 8,
	ECM_FPPFocusActor = 9,
	ECM_AssaultShock = 10,
	ECM_BeHit = 11,
	ECM_WeaponRecoil = 12,
	ECM_InVehicle = 13,
	ECM_ProneImpact = 14,
	ECM_FPPCameraOperate = 15,
	ECM_JoggleCamera = 16,
	ECM_ExplosionBeHit = 17,
	ECM_AssaultSpeedUpMobile = 18,
	ECM_MAX = 19
};

// Enum GPGameplay.EDefaultFOVRenderReason
enum class EDefaultFOVRenderReason : UINT8 {
	EDFRR_Default = 0,
	EDFRR_MachiGun = 1,
	EDFRR_DriveCar = 2,
	EDFRR_ClimbLadder = 3,
	EDFRR_Telescope = 4,
	EDFRR_StarApp = 5,
	EDFRR_GetRopeDown = 6,
	EDFRR_Parachute = 7,
	EDFRR_Interact = 8,
	EDFRR_CrocodileBite = 9,
	EDFRR_Max = 10
};

// Enum GPGameplay.EPOVModifyOption
enum class EPOVModifyOption : UINT8 {
	DoNotModify = 0,
	DefaultValue = 1,
	SetValue = 2,
	EPOVModifyOption_MAX = 3
};

// Enum GPGameplay.ECameraRotationType
enum class ECameraRotationType : UINT8 {
	CameraRot_Final = 0,
	CameraRot_WeaponTrace = 1,
	CameraRot_MAX = 2
};

// Enum GPGameplay.EFovAdjustMode
enum class EFovAdjustMode : UINT8 {
	FovMode_FixY = 0,
	FovMode_FixX = 1,
	FovMode_FixShortSide = 2,
	FovMode_FixLongSide = 3,
	FovMode_MAX = 4
};

// Enum GPGameplay.ECameraSmoothDirection
enum class ECameraSmoothDirection : UINT8 {
	CameraSmoothDirection_None = 0,
	CameraSmoothDirection_OnlyZ = 1,
	CameraSmoothDirection_Full = 2,
	CameraSmoothDirection_MAX = 3
};

// Enum GPGameplay.ECameraSmoothType
enum class ECameraSmoothType : UINT8 {
	CameraSmoothType_None = 0,
	CameraSmoothType_Crouch = 1,
	CameraSmoothType_Prone = 2,
	CameraSmoothType_QuickCrouch = 3,
	CameraSmoothType_Parachute = 4,
	CameraSmoothType_Climb = 5,
	CameraSmoothType_MAX = 6
};

// Enum GPGameplay.EPlayerMarkerScreenPosType
enum class EPlayerMarkerScreenPosType : UINT8 {
	OnAim = 0,
	Inner = 1,
	Middle = 2,
	Outer = 3,
	EPlayerMarkerScreenPosType_MAX = 4
};

// Enum GPGameplay.EPlayerPVSConnectionVisibleReason
enum class EPlayerPVSConnectionVisibleReason : UINT8 {
	None = 0,
	EPlayerPVSConnectionVisible_OutlineEffect = 1,
	EPlayerPVSConnectionVisible_Tracing = 2,
	EPlayerPVSConnectionVisibleReason_MAX = 3
};

// Enum GPGameplay.ETeamIdentity
enum class ETeamIdentity : UINT8 {
	None = 0,
	TeamMember = 1,
	TeamLeader = 2,
	Commander = 3,
	ETeamIdentity_MAX = 4
};

// Enum GPGameplay.EBattleFieldForcesType
enum class EBattleFieldForcesType : UINT8 {
	None = 0,
	Forces_Haavk = 1,
	Forces_GTI = 2,
	EBattleFieldForcesType_MAX = 3
};

// Enum GPGameplay.EPlayerState
enum class EPlayerState : UINT8 {
	PlayerState_NONE = 0,
	PlayerState_Normal = 1,
	PlayerState_Airplane = 2,
	PlayerState_Air = 3,
	PlayerState_Drive = 4,
	PlayerState_Weak = 5,
	PlayerState_OffLine = 6,
	PlayerState_Dead = 7,
	PlayerState_Spectating = 8,
	PlayerState_MAX = 9
};

// Enum GPGameplay.EPlayerGender
enum class EPlayerGender : UINT8 {
	PlayerGender_None = 0,
	PlayerGender_Male = 1,
	PlayerGender_Female = 2,
	PlayerGender_Unknow = 3,
	PlayerGender_Hide = 4,
	PlayerGender_Max = 5
};

// Enum GPGameplay.EHitPartType
enum class EHitPartType : UINT8 {
	Body = 0,
	Head = 1,
	LeftShoulder = 2,
	RightShoulder = 3,
	LeftLeg = 4,
	RightLeg = 5,
	EHitPartType_MAX = 6
};

// Enum GPGameplay.ERagdollAnimType
enum class ERagdollAnimType : UINT8 {
	NormalDeath = 0,
	DropBody = 1,
	ToImpendingDeath = 2,
	VehicleKill = 3,
	ERagdollAnimType_MAX = 4
};

// Enum GPGameplay.ERagdollConstraintAnimType
enum class ERagdollConstraintAnimType : UINT8 {
	Blend = 0,
	Fixed = 1,
	ERagdollConstraintAnimType_MAX = 2
};

// Enum GPGameplay.EGPAIDeathWeaponType
enum class EGPAIDeathWeaponType : UINT8 {
	None = 0,
	Medium = 1,
	Heavy = 2,
	EGPAIDeathWeaponType_MAX = 3
};

// Enum GPGameplay.EWeaponDeathType
enum class EWeaponDeathType : UINT8 {
	None = 0,
	Medium = 1,
	Heavy = 2,
	EWeaponDeathType_MAX = 3
};

// Enum GPGameplay.ESHMoveMode
enum class ESHMoveMode : UINT8 {
	Stand = 0,
	Crouch = 1,
	Prone = 2,
	Sprint = 3,
	SilentWalk = 4,
	InAir = 5,
	ESHMoveMode_MAX = 6
};

// Enum GPGameplay.EFSHForbidReason
enum class EFSHForbidReason : UINT8 {
	EFR_Default = 0,
	EFR_Sprint = 1,
	EFR_Jump = 2,
	EFR_Prone = 3,
	ForbidReasonMAX = 4,
	EFSHForbidReason_MAX = 5
};

// Enum GPGameplay.ESHMovementState
enum class ESHMovementState : UINT8 {
	None = 0,
	Grounded = 1,
	InAir = 2,
	ESHMovementState_MAX = 3
};

// Enum GPGameplay.ESHPlayerMoveMode
enum class ESHPlayerMoveMode : UINT8 {
	None = 0,
	StandStill = 1,
	Walk = 2,
	Run = 3,
	Sprint = 4,
	ESHPlayerMoveMode_MAX = 5
};

// Enum GPGameplay.EGPHudDataType
enum class EGPHudDataType : UINT8 {
	None = 0,
	LocAndRot = 1,
	TeamCharacterHealth = 2,
	VehicleInfo = 3,
	SceneWeaponInfo = 4,
	EGPHudDataType_MAX = 5
};

// Enum GPGameplay.EGPSceneActorType
enum class EGPSceneActorType : UINT8 {
	SA_NONE = 0,
	SA_Character = 1,
	SA_Vehicle = 2,
	SA_SceneWeapon = 3,
	SA_MAX = 4
};

// Enum GPGameplay.EGPSceneActorStateType
enum class EGPSceneActorStateType : UINT8 {
	E_BeginPlay = 0,
	E_EndPlay = 1,
	E_Relevancy = 2,
	E_MAX = 3
};

// Enum GPGameplay.EGPHudDataUpdateFrequency
enum class EGPHudDataUpdateFrequency : UINT8 {
	Freeze = 0,
	LowFrequency = 1,
	MidFrequency = 2,
	HighFrequency = 3,
	EGPHudDataUpdateFrequency_MAX = 4
};

// Enum GPGameplay.ECustomPrimitiveDataFloatDefine
enum class ECustomPrimitiveDataFloatDefine : UINT8 {
	CPD_BaseColorFator = 0,
	CPD_EmissiveFator = 1,
	CPD_DistanceOffset = 2,
	CPD_Blank3 = 3,
	CPD_MAX = 4
};

// Enum GPGameplay.ESkeletalMeshAnimUROActorType
enum class ESkeletalMeshAnimUROActorType : UINT8 {
	Normal = 0,
	Player = 1,
	AI = 2,
	Weapon = 3,
	Equipment = 4,
	Breakable = 5,
	ESkeletalMeshAnimUROActorType_MAX = 6
};

// Enum GPGameplay.EDataFlowType
enum class EDataFlowType : UINT8 {
	None = 0,
	BeDamaged = 1,
	BeHealed = 2,
	BeKnocked = 3,
	BeBuffed = 4,
	BeRemoveBuffed = 5,
	Move = 6,
	Sprint = 7,
	Squat = 8,
	Jump = 9,
	EDataFlowType_MAX = 10
};

// Enum GPGameplay.ESkillConflictResolveType
enum class ESkillConflictResolveType : UINT8 {
	Accept = 0,
	Refuse = 1,
	Break = 2,
	ESkillConflictResolveType_MAX = 3
};

// Enum GPGameplay.EAbiltyTemplateAttachMeshMode
enum class EAbiltyTemplateAttachMeshMode : UINT8 {
	ATTACH_ALL = 0,
	ATTACH_FPP = 1,
	ATTACH_TPP = 2,
	ATTACH_MAX = 3
};

// Enum GPGameplay.EAbilitySpawnState
enum class EAbilitySpawnState : UINT8 {
	Init = 0,
	Request = 1,
	Done = 2,
	Removed = 3,
	EAbilitySpawnState_MAX = 4
};

// Enum GPGameplay.EAbilityTriggerType
enum class EAbilityTriggerType : UINT8 {
	None = 0,
	Then = 1,
	Trigger = 2,
	UnTrigger = 3,
	CallEvent = 4,
	Custom = 5,
	EAbilityTriggerType_MAX = 6
};

// Enum GPGameplay.EAbilityEnterFlag
enum class EAbilityEnterFlag : UINT8 {
	CanNotPlay = 0,
	CanPlay = 1,
	NotifyServerEnter = 2,
	EAbilityEnterFlag_MAX = 3
};

// Enum GPGameplay.EAbilityStateFlag
enum class EAbilityStateFlag : UINT8 {
	RepExcute = 0,
	PredictExcute = 1,
	EAbilityStateFlag_MAX = 2
};

// Enum GPGameplay.EAbilityNodeExcuteType
enum class EAbilityNodeExcuteType : UINT8 {
	Both = 0,
	Server = 1,
	Client = 2,
	Client1P = 3,
	Client3P = 4,
	ServerAndClient1P = 5,
	EAbilityNodeExcuteType_MAX = 6
};

// Enum GPGameplay.ECharacterSkillType
enum class ECharacterSkillType : UINT8 {
	None = 0,
	SkillType1 = 1,
	SkillType2 = 2,
	SkillType3 = 3,
	SkillType4 = 4,
	ECharacterSkillType_MAX = 5
};

// Enum GPGameplay.ELoadResourceType
enum class ELoadResourceType : UINT8 {
	NONE = 0,
	Server = 1,
	Client1P = 2,
	Client3P = 4,
	Server_Client1P = 3,
	Server_Client1P_Client3P = 7,
	ELoadResourceType_MAX = 8
};

// Enum GPGameplay.EAbilitySpawnType
enum class EAbilitySpawnType : UINT8 {
	NONE = 0,
	Server = 1,
	Client1P = 2,
	Client3P = 4,
	EAbilitySpawnType_MAX = 5
};

// Enum GPGameplay.ESkillWeaponSwitchType
enum class ESkillWeaponSwitchType : UINT8 {
	Default = 0,
	Quiet = 1,
	Instant = 2,
	GetWeaponQuiet = 3,
	PutWeaponQuiet = 4,
	GetWeaponFast = 5,
	PutWeaponFast = 6,
	GetAndPutWeaponFast = 7,
	PutQuietAndGetWeaponFast = 8,
	ESkillWeaponSwitchType_MAX = 9
};

// Enum GPGameplay.ESkillStateType
enum class ESkillStateType : UINT8 {
	DoubleHandsSkill = 1,
	LeftHandSkill = 2,
	RightHandSkill = 3,
	LegsSkill = 4,
	SpecialSkill = 5,
	ESkillStateType_MAX = 6
};

// Enum GPGameplay.ESkillBehaviorPreFilterState
enum class ESkillBehaviorPreFilterState : UINT8 {
	ESkillBehavior_Failed = 0,
	ESkillBehavior_FailedWithTips = 1,
	ESkillBehavior_Successed = 2,
	ESkillBehavior_MAX = 3
};

// Enum GPGameplay.ESkillNumType
enum class ESkillNumType : UINT8 {
	UT_Normal = 0,
	UT_Item = 1,
	UT_NoShow = 2,
	UT_MAX = 3
};

// Enum GPGameplay.ESkillUsingType
enum class ESkillUsingType : UINT8 {
	UT_Normal = 0,
	UT_Normal_Charging = 1,
	UT_Select = 2,
	UT_Rocking = 3,
	UT_Disable_Charging = 4,
	UT_Activate = 5,
	UT_Disable_UseCD = 6,
	UT_Disable_EMP = 7,
	UT_Disable_NoCharging = 8,
	UT_MAX = 9
};

// Enum GPGameplay.ESkillItemUsingType
enum class ESkillItemUsingType : UINT8 {
	UT_Normal = 0,
	UT_Selected = 1,
	UT_Activate = 2,
	UT_Disable = 3,
	UT_MAX = 4
};

// Enum GPGameplay.ESkillButtonState
enum class ESkillButtonState : UINT8 {
	ESB_Normal = 0,
	ESB_Cancel = 1,
	ESB_Activate = 2,
	ESB_Disable = 3,
	ESB_Slot1 = 4,
	ESB_Slot2 = 5,
	ESB_Fire = 6,
	ESB_MAX = 7
};

// Enum GPGameplay.ECharacterSkillAbilityMask
enum class ECharacterSkillAbilityMask : UINT8 {
	None = 0,
	CanMove = 1,
	CanRotate = 2,
	CanCharacterRotate = 3,
	CanCrouch = 4,
	CanProne = 5,
	CanJump = 6,
	CanVault = 7,
	CanReload = 8,
	CanAimOn = 9,
	CanUseItem = 10,
	CanOperate = 11,
	CanLooting = 12,
	CanDetectInteractor = 13,
	CanDetectRescue = 14,
	CanUserChangeXPP = 15,
	CanDiscardOrEquipWeapon = 16,
	CanSwitchHelmetMask = 17,
	PauseSwitchHelmetMask = 18,
	CanFire = 19,
	CanDrive = 20,
	CanPlayTacticalAction = 21,
	CanClimbLadder = 22,
	CanUseTelescope = 23,
	CanChangeWeaponMode = 24,
	CanShowInteractUI = 25,
	CanLean = 26,
	CanBeHit = 27,
	CanUseSkill = 28,
	CanAssassinate = 29,
	CanCarrybody = 30,
	CanParachute = 31,
	CanSlidingTackle = 32,
	CanUseZipline = 33,
	CanAutoChangeClip = 34,
	CanWeaponInspect = 35,
	CanHighValueItemInspect = 36,
	CanWeaponBipodDeploy = 37,
	CanNotBlockFriend = 38,
	CanStandUp = 39,
	CanProneMove = 40,
	CanProneStandUp = 41,
	CanSkillSwtichWeapon = 42,
	CanWeaponBolt = 43,
	CanZoom = 44,
	CanSwitchWeapon = 45,
	CanPlayMarkingAnim = 46,
	CanFirefighting = 47,
	CanApplySpray = 48,
	CanPlayOneHandedGesture = 49,
	CanPlayTwoHandedGesture = 50,
	CanSprint = 51,
	CanBeBreakByOtherSkill = 52,
	All = 53,
	ECharacterSkillAbilityMask_MAX = 54
};

// Enum GPGameplay.EFlowDataType
enum class EFlowDataType : UINT8 {
	None = 0,
	Props = 1,
	ActiveSKill = 2,
	Passive = 3,
	EFlowDataType_MAX = 4
};

// Enum GPGameplay.ESkillLogicType
enum class ESkillLogicType : UINT8 {
	None = 0,
	Assault = 1,
	Support = 2,
	Scout = 3,
	Engineer = 4,
	Support101_SkillSmoke = 5,
	Support101_ItemSmoke = 6,
	Support101_Gun = 7,
	Item = 8,
	TestAbility = 9,
	RecycleMine = 10,
	ActivaMine = 11,
	ESkillLogicType_MAX = 12
};

// Enum GPGameplay.ESkillActorEvent
enum class ESkillActorEvent : UINT8 {
	Idle = 0,
	Fire = 1,
	BeginEquipWeapon = 2,
	EndEquipWeapon = 3,
	WeaponChanged = 4,
	ESkillActorEvent_MAX = 5
};

// Enum GPGameplay.ESkillBehavior
enum class ESkillBehavior : UINT8 {
	NormalStart = 0,
	NormalBreak = 1,
	NormalEnd = 2,
	UnNormalEnd = 3,
	Fire = 4,
	FirePress = 5,
	Reload = 6,
	Jump = 7,
	Aim = 8,
	SwtichWeapon = 9,
	AssaultBreak = 10,
	CharacherDie = 11,
	CurWeaponAllAmmoEmpty = 12,
	UseItem = 13,
	SwtichWeaponSuccess = 14,
	BeginEquipWeapon = 15,
	EndEquipWeapon = 16,
	FireUnPress = 17,
	EndFire = 18,
	SupportWeaponFire = 19,
	UseSkill2_Begin = 20,
	UseSkill2_End = 21,
	SkillWeaponAttach = 22,
	SkillWeaponDetach = 23,
	BeginEquip = 24,
	WeaponComponentFire = 25,
	WeaponComponentEndFire = 26,
	WeaponComponentSwitchToIdle = 27,
	TakeDamge = 28,
	EMPBreak = 29,
	ESkillBehavior_MAX = 30
};

// Enum GPGameplay.ESkillBtnCall
enum class ESkillBtnCall : UINT8 {
	None = 0,
	Pressed = 1,
	Released = 2,
	Click = 3,
	LongPress = 4,
	ESkillBtnCall_MAX = 5
};

// Enum GPGameplay.ESkillDragMode
enum class ESkillDragMode : UINT8 {
	None = 0,
	ESkillDragMode_MAX = 1
};

// Enum GPGameplay.ESkillKeyStatus
enum class ESkillKeyStatus : UINT8 {
	SKILL_STATUS_UNKNOW = 0,
	SKILL_STATUS_READY = 1,
	SKILL_STATUS_PRECAST = 2,
	SKILL_STATUS_CASTING = 3,
	SKILL_STATUS_AFTERCAST = 4,
	SKILL_STATUS_FINISH = 5,
	SKILL_STATUS_COOLING = 6,
	SKILL_STATUS_CHARGING = 7,
	SKILL_STATUS_PREPARING = 8,
	SKILL_STATUS_MAX = 9
};

// Enum GPGameplay.ESkillRecycleType
enum class ESkillRecycleType : UINT8 {
	None = 0,
	SuppressionMine = 1,
	AntiTankMine = 2,
	ClaymoreMine = 3,
	ESkillRecycleType_MAX = 4
};

// Enum GPGameplay.ESkillUIState
enum class ESkillUIState : UINT8 {
	UIState_Undefine = 0,
	UIState_Ready = 1,
	UIState_Using = 2,
	UIState_CDing = 3,
	UIState_Disable = 4,
	UIState_Forbit = 5,
	UIState_StateDisable = 6,
	UIState_Score = 7,
	UIState_CampNum = 8,
	UIState_UseNoReady = 9,
	UIState_TemplateNoReady = 10,
	UIState_OtherSkill = 11,
	UIState_Blocked = 12,
	UIState_SwitchWeapon = 13,
	UIState_ZoomWeapon = 14,
	UIState_NoSkill = 15,
	UIState_NoCharacter = 16,
	UIState_TakeDamgeBreak = 17,
	UIState_FireBreak = 18,
	UIState_TeamNum = 19,
	UIState_Sector = 20,
	UIState_LieDownForbidSmoke = 21,
	UIState_MAX = 22
};

// Enum GPGameplay.EThreatMarkerType
enum class EThreatMarkerType : UINT8 {
	Origin = 0,
	Screen = 1,
	EThreatMarkerType_MAX = 2
};

// Enum GPGameplay.EThreatCampType
enum class EThreatCampType : UINT8 {
	Self = 0,
	SameTeam = 1,
	SameCamp = 2,
	Enemy = 3,
	EThreatCampType_MAX = 4
};

// Enum GPGameplay.ESlideBreakType
enum class ESlideBreakType : UINT8 {
	None = 0,
	SlideBreak_Jump = 1,
	SlideBreak_Crouch = 2,
	ESlideBreakType_MAX = 3
};

// Enum GPGameplay.ECharingSlotState
enum class ECharingSlotState : UINT8 {
	Normal = 0,
	Counting = 1,
	Pause = 2,
	Disable = 3,
	ECharingSlotState_MAX = 4
};

// Enum GPGameplay.ESoundVisualizationVerticalType
enum class ESoundVisualizationVerticalType : UINT8 {
	Upper = 0,
	Middle = 1,
	Lower = 2,
	ESoundVisualizationVerticalType_MAX = 3
};

// Enum GPGameplay.EMovementRelatedSpringArmState
enum class EMovementRelatedSpringArmState : UINT8 {
	ESpringArmState_None = 0,
	ESpringArmState_Default = 1,
	ESpringArmState_Crouch = 2,
	ESpringArmState_Prone = 3,
	ESpringArmState_Swim = 4,
	ESpringArmState_Vault = 5,
	ESpringArmState_SlidingTackle = 6,
	ESpringArmState_Parachute = 7,
	ESpringArmState_FPP = 8,
	ESpringArmState_TPPToFPP = 9,
	ESpringArmState_BeCarryBySomeOne = 10,
	ESpringArmState_LeftLeanPeek = 11,
	ESpringArmState_RightLeanPeek = 12,
	ESpringArmState_NPCTalk = 13,
	ESpringArmState_Error = 14,
	ESpringArmState_MAX = 15
};

// Enum GPGameplay.EVoiceOverTriggerType
enum class EVoiceOverTriggerType : UINT8 {
	None = 0,
	OverlapTrigger = 1,
	InteractTrigger = 2,
	EVoiceOverTriggerType_MAX = 3
};

// Enum GPGameplay.ETacticalActionType
enum class ETacticalActionType : UINT8 {
	None = 0,
	RESPECT = 1,
	WINGCHUN = 2,
	ROCKPAPERSCISSORS = 3,
	ETacticalActionType_MAX = 4
};

// Enum GPGameplay.EVaultEndMoveType
enum class EVaultEndMoveType : UINT8 {
	EVaultEndMove_Walking = 0,
	EVaultEndMove_Falling = 1,
	EVaultEndMove_MAX = 2
};

// Enum GPGameplay.EVaultAnimType
enum class EVaultAnimType : UINT8 {
	EVaultAnim_None = 0,
	EVA_StepOn = 1,
	EVA_Vault = 2,
	EVA_Climb = 3,
	EVaultAnimType_MAX = 4
};

// Enum GPGameplay.EObstacleHeightType
enum class EObstacleHeightType : UINT8 {
	EObstacleHeight_None = 0,
	EObstacleHeight_61 = 1,
	EObstacleHeight_91 = 2,
	EObstacleHeight_141 = 3,
	EObstacleHeight_181 = 4,
	EObstacleHeight_Max = 5
};

// Enum GPGameplay.EClimbVaultFailedReason
enum class EClimbVaultFailedReason : UINT8 {
	EChoice_None = 0,
	TouchAngle = 1,
	ObstacleHeight = 2,
	ApexPoint = 3,
	ObstacleAbruptSlope = 4,
	ObstacleWidth = 5,
	CollideOverHead = 6,
	EClimbVaultFailedReason_MAX = 7
};

// Enum GPGameplay.EClimbVaultChoice
enum class EClimbVaultChoice : UINT8 {
	EChoice_None = 0,
	EChoice_Climb = 1,
	EChoice_Vault = 2,
	EChoice_MAX = 3
};

// Enum GPGameplay.EClimbLadderFixTransformType
enum class EClimbLadderFixTransformType : UINT8 {
	EClimbLadderFix_DownStart = 0,
	EClimbLadderFix_DownEnd = 1,
	EClimbLadderFix_TopStart = 2,
	EClimbLadderFix_TopEnd = 3,
	EClimbLadderFix_Nearly = 4,
	EClimbLadderFix_MAX = 5
};

// Enum GPGameplay.EClimbLadderCheckType
enum class EClimbLadderCheckType : UINT8 {
	EClimbLadderCheck_None = 0,
	EClimbLadderCheck_DownEnter = 1,
	EClimbLadderCheck_DownExit = 2,
	EClimbLadderCheck_TopEnter = 3,
	EClimbLadderCheck_TopExit = 4,
	EClimbLadderCheck_JumpEnter = 5,
	EClimbLadderCheck_JumpExit = 6,
	EClimbLadderCheck_Cancel = 7,
	EClimbLadderCheck_MAX = 8
};

// Enum GPGameplay.EVehicleExtraPartType
enum class EVehicleExtraPartType : UINT8 {
	NONE = 0,
	WEAPON = 1,
	SKILL = 2,
	SKIN = 3,
	EVehicleExtraPartType_MAX = 4
};

// Enum GPGameplay.EVehicleResetType
enum class EVehicleResetType : UINT8 {
	NONE = 0,
	STATUS = 1,
	PHYSICS = 2,
	AI = 4,
	PASSENGERS = 8,
	ALL = 15,
	EVehicleResetType_MAX = 16
};

// Enum GPGameplay.EAnimVehicleSeatType
enum class EAnimVehicleSeatType : UINT8 {
	Sitting = 0,
	Stand = 1,
	EAnimVehicleSeatType_MAX = 2
};

// Enum GPGameplay.EWeaponStage
enum class EWeaponStage : UINT8 {
	Dormancy = 0,
	DeActive = 1,
	Active = 2,
	EWeaponStage_MAX = 3
};

// Enum GPGameplay.EWeaponInputOwner
enum class EWeaponInputOwner : UINT8 {
	None = 0,
	Left = 1,
	Right = 2,
	EWeaponInputOwner_MAX = 3
};

// Enum GPGameplay.EZiplineHudStatus
enum class EZiplineHudStatus : UINT8 {
	None = 0,
	Hidden = 1,
	DisplayGetOn = 2,
	DisplayGetOff = 3,
	EZiplineHudStatus_MAX = 4
};

// Enum GPGameplay.EIntCharacterSnap
enum class EIntCharacterSnap : UINT8 {
	None = 0,
	SnapToLatest = 1,
	EIntCharacterSnap_MAX = 2
};

// Enum GPGameplay.EScopeZoomType
enum class EScopeZoomType : UINT8 {
	ScopeZoomTypeDefault = 0,
	ScopeZoomTypeSideAiming = 1,
	ScopeZoomTypeMax = 2,
	EScopeZoomType_MAX = 3
};

// Enum GPGameplay.EMaterialSequencerPlayerPlayStatus
enum class EMaterialSequencerPlayerPlayStatus : UINT8 {
	None = 0,
	Playing = 1,
	EMaterialSequencerPlayerPlayStatus_MAX = 2
};

// Enum GPGameplay.EMaterialSequencerNotifyType
enum class EMaterialSequencerNotifyType : UINT8 {
	None = 0,
	Name = 1,
	EMaterialSequencerNotifyType_MAX = 2
};

// Enum GPGameplay.EMaterialSequenceParamsType
enum class EMaterialSequenceParamsType : UINT8 {
	Float = 0,
	LinearColor = 1,
	Vector = 2,
	EMaterialSequenceParamsType_MAX = 3
};

// Enum GPGameplay.EWeaponAdapterItemType
enum class EWeaponAdapterItemType : UINT8 {
	NONE = 0,
	Foregrip = 1,
	Handguard = 2,
	Receiver = 3,
	PistolGrip = 4,
	Stock = 5,
	GunBarral = 6,
	TacticalDevices = 7,
	EWeaponAdapterItemType_MAX = 8
};

// Enum GPGameplay.EWeaponAdapterHandIKPoseType
enum class EWeaponAdapterHandIKPoseType : UINT8 {
	NONE = 0,
	FPP = 1,
	TPP = 2,
	FPPWithWidget = 3,
	TPPWithWidget = 4,
	FPPNear = 5,
	FPPFar = 6,
	FPPNearWithWidget = 7,
	FPPFarWithWidget = 8,
	FPP_R = 9,
	TPP_R = 10,
	EWeaponAdapterHandIKPoseType_MAX = 11
};

// Enum GPGameplay.EMagazineAnimType
enum class EMagazineAnimType : UINT8 {
	Normal = 0,
	Long = 1,
	Drum = 2,
	Special = 3,
	EMagazineAnimType_MAX = 4
};

// Enum GPGameplay.EMagazineType
enum class EMagazineType : UINT8 {
	NONE = 0,
	NormalMagazine = 1,
	CLMagazine = 2,
	EMagazineType_MAX = 3
};

// Enum GPGameplay.ETextureType
enum class ETextureType : UINT8 {
	NONE = 0,
	BaseColorMap = 1,
	MACMap = 2,
	NRMap = 3,
	ETextureType_MAX = 4
};

// Enum GPGameplay.EWeaponPartAnimFunctionIKType
enum class EWeaponPartAnimFunctionIKType : UINT8 {
	NONE = 0,
	LeftIK = 1,
	RightIK = 2,
	EWeaponPartAnimFunctionIKType_MAX = 3
};

// Enum GPGameplay.EWeaponPartAnimFunctionType
enum class EWeaponPartAnimFunctionType : UINT8 {
	NONE = 0,
	IK_LeftHand = 1,
	Anim_MagBulletChain = 2,
	Anim_BipodUpDown = 3,
	Anim_Overide = 4,
	Anim_Sco = 5,
	Anim_TransparentMag = 6,
	EWeaponPartAnimFunctionType_MAX = 7
};

// Enum GPGameplay.EWeaponPartFunctionType
enum class EWeaponPartFunctionType : UINT8 {
	NONE = 0,
	StaticAttributeModify = 2,
	StaticAttributeReplace = 3,
	StaticArrayAttributeModify = 4,
	EWeaponPartFunctionType_MAX = 5
};

// Enum GPGameplay.EWeaponPartFunctionDynamicType
enum class EWeaponPartFunctionDynamicType : UINT8 {
	NONE = 0,
	AlwaysEffective = 1,
	TacticalEffective = 2,
	EWeaponPartFunctionDynamicType_MAX = 3
};

// Enum GPGameplay.EModularWeaponDescCompare
enum class EModularWeaponDescCompare : UINT8 {
	None = 0,
	Adapter = 1,
	ExtraModel = 2,
	Skin = 4,
	Pendant = 8,
	SolutionCompare = 1,
	AllCompare = 15,
	EModularWeaponDescCompare_MAX = 16
};

// Enum GPGameplay.EModularPartNodeFlagState
enum class EModularPartNodeFlagState : UINT8 {
	Default = 0,
	Simulate = 1,
	RelationSimulate = 2,
	EModularPartNodeFlagState_MAX = 3
};

// Enum GPGameplay.EModularWeaponBuildStage
enum class EModularWeaponBuildStage : UINT8 {
	None = 0,
	WaitLoadDynamicPartsAsset = 1,
	DynamicPartsAssetLoading = 2,
	DynamicPartsAssetLoadFinished = 3,
	ModularBuild = 4,
	EModularWeaponBuildStage_MAX = 5
};

// Enum GPGameplay.EModularWeaponMergeStage
enum class EModularWeaponMergeStage : UINT8 {
	None = 0,
	WaitLoadAllPartsAsset = 1,
	AllPartsAssetLoading = 2,
	AllPartsAssetLoadFnished = 3,
	MeshMerge = 4,
	EModularWeaponMergeStage_MAX = 5
};

// Enum GPGameplay.ETuneSliderType
enum class ETuneSliderType : UINT8 {
	Continue = 0,
	Discrete = 1,
	ETuneSliderType_MAX = 2
};

// Enum GPGameplay.ETuneMeshType
enum class ETuneMeshType : UINT8 {
	None = 0,
	Position = 1,
	Rotation = 2,
	ETuneMeshType_MAX = 3
};

// Enum GPGameplay.EWeaponVoidPartsModelConditionType
enum class EWeaponVoidPartsModelConditionType : UINT8 {
	None = 0,
	Socket = 1,
	AdapterType = 2,
	ItemId = 3,
	EWeaponVoidPartsModelConditionType_MAX = 4
};

// Enum GPGameplay.EWeaponPartMeshType
enum class EWeaponPartMeshType : UINT8 {
	Mesh1p = 0,
	Mesh3P = 1,
	MeshUI = 2,
	EWeaponPartMeshType_MAX = 3
};

// Enum GPGameplay.FPartAddtionRuleType
enum class FPartAddtionRuleType : UINT8 {
	None = 0,
	Addtive = 1,
	Replace = 2,
	FPartAddtionRuleType_MAX = 3
};

// Enum GPGameplay.EMaterialParameterType
enum class EMaterialParameterType : UINT8 {
	Vector = 0,
	Scalar = 1,
	Texture = 2,
	EMaterialParameterType_MAX = 3
};

// Enum GPGameplay.EApperanceModifyType
enum class EApperanceModifyType : UINT8 {
	None = 0,
	AppendModel = 1,
	EApperanceModifyType_MAX = 2
};

// Enum GPGameplay.EWeaponExtraModelConditionType
enum class EWeaponExtraModelConditionType : UINT8 {
	None = 0,
	Socket = 1,
	AdapterType = 2,
	ItemId = 3,
	EWeaponExtraModelConditionType_MAX = 4
};

// Enum GPGameplay.EWeaponExtraModelVisibility
enum class EWeaponExtraModelVisibility : UINT8 {
	Visible = 0,
	Hidden = 1,
	EWeaponExtraModelVisibility_MAX = 2
};

// Enum GPGameplay.EFxFuntionType
enum class EFxFuntionType : UINT8 {
	ReplaceMuzzleFlashFx = 0,
	ReplaceShellDropFx = 1,
	ReplaceMuzzleTrailFx = 2,
	ReplaceRealBulletTrailFx = 3,
	ReplaceBulletTrailFx = 4,
	ReplaceHitFx = 5,
	ReplaceMuzzleLightLevel = 6,
	AddMuzzleLightLevel = 7,
	EFxFuntionType_MAX = 8
};

// Enum GPGameplay.EAssemblerAudioType
enum class EAssemblerAudioType : UINT8 {
	None = 0,
	Receiver = 1,
	GunBarral = 2,
	PistolGrip = 3,
	Stock = 4,
	Handguard = 5,
	Sight = 11,
	Magazine = 12,
	Muzzle = 13,
	Foregrip = 14,
	Underbarrel = 15,
	TacticalDevices = 16,
	Bipod = 17,
	ForSight = 18,
	RearSight = 19,
	SightBase = 21,
	Ammo = 99,
	Pop_Gun = 201,
	Select_Gun = 202,
	EAssemblerAudioType_MAX = 203
};

// Enum GPGameplay.EForbidLeftHandIKType
enum class EForbidLeftHandIKType : UINT8 {
	EOutReachDistance = 0,
	EHaveAdapterInSocket = 1,
	EAttachInSocket = 2,
	EForbidLeftHandIKType_MAX = 3
};

// Enum GPGameplay.EAimDownSightsState
enum class EAimDownSightsState : UINT8 {
	InVisible = 0,
	Special_Pose = 1,
	Constant = 2,
	EAimDownSightsState_MAX = 3
};

// Enum GPGameplay.EPartFunctionTag
enum class EPartFunctionTag : UINT8 {
	NONE = 0,
	SupportSideAiming = 1,
	All = 255,
	EPartFunctionTag_MAX = 256
};

// Enum GPGameplay.EAssemblerCameraType
enum class EAssemblerCameraType : UINT8 {
	LOCK = 0,
	ROTATE_ROOT = 1,
	ROTATE_ARROUND = 2,
	AUTO_ROTATE = 3,
	EAssemblerCameraType_MAX = 4
};

// Enum GPGameplay.EAssemblerCamPoint
enum class EAssemblerCamPoint : UINT8 {
	POINT_DEFAULT = 0,
	POINT_GUN_SELECTED = 1,
	POINT_GUN_DISPLAY = 2,
	POINT_MUZZLE = 3,
	POINT_BARREL = 4,
	POINT_HANDGUARD = 5,
	POINT_SIGHT = 6,
	POINT_MAGAZINE = 7,
	POINT_GRIP = 8,
	POINT_STOCK = 9,
	POINT_UP_RAIL = 10,
	POINT_DOWN_RAIL = 11,
	POINT_LEFT_RAIL = 12,
	POINT_RIGHT_RAIL = 13,
	POINT_BIPOD = 14,
	POINT_GUN_PRESET = 15,
	POINT_SPECIAL = 16,
	POINT_CONNECTOR = 17,
	POINT_CHEEKPAD = 18,
	POINT_PISTOLGRIP_PATCH = 19,
	POINT_SCO_SECONDARY = 20,
	POINT_HANU_POINT = 21,
	POINT_HAND_POINT = 22,
	POINT_HANL_POINT = 23,
	POINT_HANR_POINT = 24,
	POINT_BARBIP_POINT = 25,
	POINT_HANKIT_POINT = 26,
	POINT_STOKIT_POINT = 27,
	POINT_BARKIT_POINT = 28,
	POINT_SCOU_POINT = 29,
	POINT_RISER_POINT = 30,
	POINT_FOR_POINT = 31,
	POINT_COMMON_POINT = 32,
	POINT_GRIPBASS_POINT = 33,
	POINT_MAGBASS_POINT = 34,
	POINT_FLASHKILL_POINT = 35,
	POINT_HANDGUARDU_POINT = 36,
	POINT_GAS_POINT = 37,
	POINT_HAMMER_POINT = 38,
	POINT_TRIGGER_POINT = 39,
	POINT_HYDRASCO_POINT = 50,
	POINT_SHIELD_POINT = 51,
	POINT_BOLT_POINT = 52,
	POINT_GISG2_POINT = 53,
	POINT_PENDANT_POINT = 90,
	POINT_GUN_SOLUTION = 100,
	POINT_GUN_SOL_INSPECTOR = 200,
	POINT_GUN_DISPLAY_FEATURE1 = 201,
	POINT_GUN_SKIN_DEFAULT = 202,
	POINT_GUN_FINETUNE = 203,
	POINT_GUN_UPGRADE = 204,
	NONE = 205,
	EAssemblerCamPoint_MAX = 206
};

// Enum GPGameplay.EPerkEffectAdditiveLogic
enum class EPerkEffectAdditiveLogic : UINT8 {
	None = 0,
	DurationAndCD = 1,
	TriggerIcon = 2,
	Max = 3
};

// Enum GPGameplay.EPerkEffectTriggerCond
enum class EPerkEffectTriggerCond : UINT8 {
	None = 0,
	LowHealth = 1,
	Max = 2
};

// Enum GPGameplay.EPerkSharedEffectType
enum class EPerkSharedEffectType : UINT8 {
	None = 0,
	ZoyaSOL = 1,
	ZoyaBreakThrough = 2,
	Max = 3
};

// Enum GPGameplay.EPerkSharedEffectSource
enum class EPerkSharedEffectSource : UINT8 {
	None = 0,
	Zoya = 1,
	Max = 2
};

// Enum GPGameplay.EPerkSpecialEffectType
enum class EPerkSpecialEffectType : UINT8 {
	None = 0,
	StaminaNotLose = 1,
	SuperDash = 2,
	ExSkillCoolDownReduce = 3,
	ArmdedForceItem1SkillCoolDownReduce = 4,
	ArmdedForceItem2SkillCoolDownReduce = 5,
	AimingAdverseResistance = 6,
	CrouchOrSilentWalkSpeedUp = 7,
	CureBodyWhenRescueSucceed = 8,
	Max = 9
};

// Enum GPGameplay.EPerkEffectType
enum class EPerkEffectType : UINT8 {
	AddBuff = 0,
	AddSkill = 1,
	TriggerSpecialEffect = 2,
	Max = 3
};

// Enum GPGameplay.EBuffEntityTriggerIconType
enum class EBuffEntityTriggerIconType : UINT8 {
	None = 0,
	EXSkillCooling = 1,
	BattleFieldPropSkill1Cooling = 2,
	BattleFieldPropSkill2Cooling = 3,
	CrouchOrSilentWalk = 4,
	Max = 5
};

// Enum GPGameplay.ESoftState
enum class ESoftState : UINT8 {
	Custom = 0,
	EFiring = 1,
	EReload = 2,
	ESoftState_MAX = 3
};

// Enum GPGameplay.EAbilityEntitySysteType
enum class EAbilityEntitySysteType : UINT8 {
	Ability = 0,
	SysteTypeMax = 1,
	EAbilityEntitySysteType_MAX = 2
};

// Enum GPGameplay.ESupportType
enum class ESupportType : UINT8 {
	HealthPack = 0,
	ArmorPack = 1,
	ESupportType_MAX = 2
};

// Enum GPGameplay.ESwitchWeaponOperation
enum class ESwitchWeaponOperation : UINT8 {
	OP_Start = 0,
	OP_ActivatePending = 1,
	OP_Cancel = 2,
	OP_MAX = 3
};

// Enum GPGameplay.EClassRepNodeMapping
enum class EClassRepNodeMapping : UINT8 {
	NotRouted = 0,
	RelevantAllConnections = 1,
	RelevantToTeam = 2,
	RelevantToClientProxy = 3,
	Spatialize_Static = 4,
	Spatialize_Dynamic = 5,
	Spatialize_Dormancy = 6,
	EClassRepNodeMapping_MAX = 7
};

// Enum GPGameplay.EVehiclePartType
enum class EVehiclePartType : UINT8 {
	NONE = 0,
	FRONT_WHEEL = 1,
	REAL_WHEEL = 2,
	ENGINE_MAX = 3,
	FRONT_LIGHT = 4,
	REAL_LIGHT = 5,
	VEHICLE_GLASS = 6,
	WEAPON = 7,
	LEFT_TRACK = 8,
	RIGHT_TRACK = 9,
	BODY = 10,
	EVehiclePartType_MAX = 11
};

// Enum GPGameplay.EScopeLocationType
enum class EScopeLocationType : UINT8 {
	Undefined = 0,
	Main = 1,
	Top = 2,
	Side = 3,
	Sloping = 4,
	EScopeLocationType_MAX = 5
};

// Enum GPGameplay.EShadowTransferType
enum class EShadowTransferType : UINT8 {
	FromLeft = 0,
	FromRight = 1,
	EShadowTransferType_MAX = 2
};

// Enum GPGameplay.EScopeCompositeType
enum class EScopeCompositeType : UINT8 {
	CompositeUpDown = 0,
	CompositeLeftRight = 1,
	CompositeFrontBack = 2,
	EScopeCompositeType_MAX = 3
};

// Enum GPGameplay.ECrosshairType
enum class ECrosshairType : UINT8 {
	Crosshair_None = 0,
	Crosshair_Holo = 1,
	Crosshair_RedDot = 2,
	Crosshair_MAX = 3
};

// Enum GPGameplay.EWeaponAdapterType
enum class EWeaponAdapterType : UINT8 {
	Receiver = 1,
	GunBarral = 2,
	PistolGrip = 3,
	Stock = 4,
	Handguard = 5,
	Sight = 11,
	Magazine = 12,
	Muzzle = 13,
	Foregrip = 14,
	Underbarrel = 15,
	TacticalDevices = 16,
	Bipod = 17,
	ForSight = 18,
	RearSight = 19,
	SightBase = 21,
	Special = 20,
	Silencer = 200,
	EWeaponAdapterType_MAX = 201
};

// Enum GPGameplay.EBurnningPotState
enum class EBurnningPotState : UINT8 {
	StateIdle = 0,
	StateFiring = 1,
	StateCutting = 2,
	StateDeactive = 3,
	EBurnningPotState_MAX = 4
};

// Enum GPGameplay.EWeaponAmmoLogicType
enum class EWeaponAmmoLogicType : UINT8 {
	None = 0,
	CommonAmmo = 1,
	ItemAmmo = 2,
	EWeaponAmmoLogicType_MAX = 3
};

// Enum GPGameplay.EAddAmmoFailReason
enum class EAddAmmoFailReason : UINT8 {
	None = 0,
	NoProperWeapon = 1,
	FullCarriedAmmo = 2,
	CanNotAddAmmo = 3,
	NotSupportedAmmoType = 4,
	EAddAmmoFailReason_MAX = 5
};

// Enum GPGameplay.ECharacterLeftArmAnimType
enum class ECharacterLeftArmAnimType : UINT8 {
	None = 0,
	Scene = 1,
	Weapon = 2,
	ECharacterLeftArmAnimType_MAX = 3
};

// Enum GPGameplay.EWeaponAnimDirectItemType
enum class EWeaponAnimDirectItemType : UINT8 {
	None = 0,
	FPPMoveF = 1,
	FPPMoveFR = 2,
	FPPMoveFL = 3,
	FPPMoveB = 4,
	FPPMoveBR = 5,
	FPPMoveBL = 6,
	FPPMoveL = 7,
	FPPMoveR = 8,
	TPPMoveF = 9,
	TPPMoveFR = 10,
	TPPMoveFL = 11,
	TPPMoveB = 12,
	TPPMoveBR = 13,
	TPPMoveBL = 14,
	TPPMoveL = 15,
	TPPMoveR = 16,
	EWeaponAnimDirectItemType_MAX = 17
};

// Enum GPGameplay.EWeaponAnimItemType
enum class EWeaponAnimItemType : UINT8 {
	None = 0,
	FPPDef = 1,
	FPPStand = 2,
	FPPCrouch = 3,
	FPPProne = 4,
	FPPFracture = 5,
	FPPImpendingDeath = 6,
	TPPDef = 7,
	TPPStand = 8,
	TPPCrouch = 9,
	TPPProne = 10,
	TPPFracture = 11,
	TPPImpendingDeath = 12,
	TPPUnderFPPStand = 13,
	TPPUnderFPPCrouch = 14,
	TPPUnderFPPProne = 15,
	TPPUnderFPPFracture = 16,
	TPPUnderFPPImpendingDeath = 17,
	EWeaponAnimItemType_MAX = 18
};

// Enum GPGameplay.EWeaponAnimXPPType
enum class EWeaponAnimXPPType : UINT8 {
	None = 0,
	Both = 1,
	FPP = 2,
	TPPor3P = 3,
	EWeaponAnimXPPType_MAX = 4
};

// Enum GPGameplay.ERuntimeOverrideAnimDatType
enum class ERuntimeOverrideAnimDatType : UINT8 {
	None = 0,
	WeaponAnimBasePos = 1,
	WeaponAnimBS = 2,
	WeaponAnimOperaction = 3,
	Max = 4
};

// Enum GPGameplay.EWeaponAnimDataTableType
enum class EWeaponAnimDataTableType : UINT8 {
	None = 0,
	WeaponAnimBasePos = 1,
	WeaponAnimOperaction = 2,
	SpecialWeaponAnim = 3,
	AiAnimPosTable = 4,
	InWeaponAnimMax = 5,
	WeaponPartAnim = 6,
	CharacterLeftArm = 7,
	HallCharacterAnim = 8,
	HallWeaponPartAnim = 9,
	Max = 10
};

// Enum GPGameplay.ERequestAnimType
enum class ERequestAnimType : UINT8 {
	EWeaponAnim = 0,
	EItemAnim = 1,
	EBasicAnim = 2,
	ERequestAnimType_MAX = 3
};

// Enum GPGameplay.EGunSwayType
enum class EGunSwayType : UINT8 {
	Common = 0,
	Vehicle = 1,
	EGunSwayType_MAX = 2
};

// Enum GPGameplay.EWeaponEffectType
enum class EWeaponEffectType : UINT8 {
	None = 0,
	MuzzleFlash = 1,
	ShellDrop = 2,
	MuzzleTrail = 3,
	BulletTrail = 4,
	ModelFx = 5,
	OverHeatTrail = 6,
	EWeaponEffectType_MAX = 7
};

// Enum GPGameplay.EWeaponDisplayMode
enum class EWeaponDisplayMode : UINT8 {
	None = 0,
	FirstPerson = 1,
	ThirdPerson = 2,
	ThirdPersonOther = 3,
	EWeaponDisplayMode_MAX = 4
};

// Enum GPGameplay.EWeaponHiddenTag
enum class EWeaponHiddenTag : UINT8 {
	OwnerHidden = 0,
	CarringBody = 1,
	PreciseOperate = 2,
	Redeploy = 3,
	Helicopter = 4,
	Vehicle = 5,
	VaultAndClimb = 6,
	RescuePrecise = 7,
	Assassinate = 8,
	Ability = 9,
	Parachute = 10,
	Interactive = 11,
	ExitCutScene = 12,
	RaiseWatch = 13,
	BeCarryBody = 14,
	LOD = 15,
	BeAssassinate = 16,
	ImpendingDeath = 17,
	ClimbLadder = 18,
	UseItem = 19,
	Perform = 20,
	Firefighting = 21,
	TagMax = 22,
	EWeaponHiddenTag_MAX = 23
};

// Enum GPGameplay.EWeaponAttributeValueType
enum class EWeaponAttributeValueType : UINT8 {
	Normal = 0,
	Percentage = 1,
	EWeaponAttributeValueType_MAX = 2
};

// Enum GPGameplay.EAttributeBetterDeterminer
enum class EAttributeBetterDeterminer : UINT8 {
	None = 0,
	Max = 1,
	Min = 2
};

// Enum GPGameplay.ELimitFormulateType
enum class ELimitFormulateType : UINT8 {
	None = 0,
	MULT_A_Min = 1,
	MULT_A_Max = 2,
	Final_Min = 3,
	Final_Max = 4,
	ELimitFormulateType_MAX = 5
};

// Enum GPGameplay.EWeaponAttackTriggerMode
enum class EWeaponAttackTriggerMode : UINT8 {
	OnHit = 0,
	OnExplode = 1,
	Custom = 2,
	EWeaponAttackTriggerMode_MAX = 3
};

// Enum GPGameplay.EWeaponBoolPropertyType
enum class EWeaponBoolPropertyType : UINT8 {
	None = 0,
	IsBipodDown = 1,
	IsPowerFlashOn = 2,
	IsTacticalEquipUOn = 3,
	IsTacticalEquipU1On = 4,
	IsTacticalEquipU2On = 5,
	IsTacticalEquipROn = 6,
	IsTacticalEquipR1On = 7,
	IsTacticalEquipR2On = 8,
	IsTacticalEquipDOn = 9,
	IsTacticalEquipD1On = 10,
	IsTacticalEquipD2On = 11,
	IsTacticalEquipLOn = 12,
	IsTacticalEquipL1On = 13,
	IsTacticalEquipL2On = 14,
	Max = 15
};

// Enum GPGameplay.EWeaponAmmoDamageType
enum class EWeaponAmmoDamageType : UINT8 {
	HitFirst = 0,
	PassHand = 1,
	EWeaponAmmoDamageType_MAX = 2
};

// Enum GPGameplay.EVehicleLockType
enum class EVehicleLockType : UINT8 {
	NONE = 0,
	Terrestrial = 1,
	Aerial = 2,
	All = 255,
	EVehicleLockType_MAX = 256
};

// Enum GPGameplay.EWeaponGunKickTriggerType
enum class EWeaponGunKickTriggerType : UINT8 {
	EveryFire = 0,
	FirstFireKeep = 1,
	FirstFireLoop = 2,
	EWeaponGunKickTriggerType_MAX = 3
};

// Enum GPGameplay.EWeaponFireShakeWaveform
enum class EWeaponFireShakeWaveform : UINT8 {
	CosWave = 0,
	SinWave = 1,
	PerlinNoise = 2,
	Curve = 3,
	CosWaveE = 4,
	SinWaveE = 5,
	EWeaponFireShakeWaveform_MAX = 6
};

// Enum GPGameplay.EWeaponFireShakeType
enum class EWeaponFireShakeType : UINT8 {
	FireBegin = 0,
	FireLoop = 1,
	FireAlways = 2,
	FireRecoil = 3,
	EWeaponFireShakeType_MAX = 4
};

// Enum GPGameplay.EWeaponOpenSightOnFireMode
enum class EWeaponOpenSightOnFireMode : UINT8 {
	None = 0,
	OpenSightMode_SemiAutomatic = 1,
	OpenSightMode_Automatic = 2,
	OpenSightMode_Sniper = 3,
	OpenSightMode_Missile = 4,
	EWeaponOpenSightOnFireMode_MAX = 5
};

// Enum GPGameplay.EWeaponFireWithSightRealseConfigMode
enum class EWeaponFireWithSightRealseConfigMode : UINT8 {
	None = 0,
	StopFire_CloseSight = 1,
	OpenFire_Sight = 2,
	EWeaponFireWithSightRealseConfigMode_MAX = 3
};

// Enum GPGameplay.EWeaponFireWithSightPressConfigMode
enum class EWeaponFireWithSightPressConfigMode : UINT8 {
	None = 0,
	OpenSightWithFire = 1,
	OpenSight = 2,
	EWeaponFireWithSightPressConfigMode_MAX = 3
};

// Enum GPGameplay.EWeaponInputAutoFireMode
enum class EWeaponInputAutoFireMode : UINT8 {
	None = 0,
	Single = 1,
	Auto = 2,
	EWeaponInputAutoFireMode_MAX = 3
};

// Enum GPGameplay.EWeaponInputRightActionMode
enum class EWeaponInputRightActionMode : UINT8 {
	None = 0,
	Follow_FireWithSightOpenConfig = 1,
	Follow_FireConfig = 2,
	EWeaponInputRightActionMode_MAX = 3
};

// Enum GPGameplay.EWeaponAdditiveAnimTriggerType
enum class EWeaponAdditiveAnimTriggerType : UINT8 {
	None = 0,
	Always = 1,
	EveryFire = 2,
	WhileFireOnce = 3,
	WhileFireLoop = 4,
	EndFire = 5,
	EWeaponAdditiveAnimTriggerType_MAX = 6
};

// Enum GPGameplay.EHitEventType_FX
enum class EHitEventType_FX : UINT8 {
	None = 0,
	KillWithHead = 1,
	KillWithBody = 2,
	HitWithHead = 3,
	HitWithBody = 4,
	HitWithArmor = 5,
	EHitEventType_MAX = 6
};

// Enum GPGameplay.EProjectileFlyMode
enum class EProjectileFlyMode : UINT8 {
	FlyMode_PhysicSimulate = 0,
	FlyMode_HitScan = 1,
	FlyMode_HitScanDelay = 2,
	FlyMode_MAX = 3
};

// Enum GPGameplay.EDamageAttenBlendMode
enum class EDamageAttenBlendMode : UINT8 {
	BlendMode_Dest = 0,
	BlendMode_LinearLerp = 1,
	BlendMode_MAX = 2
};

// Enum GPGameplay.ECrosshairScaleMode
enum class ECrosshairScaleMode : UINT8 {
	ScaleGap = 0,
	ScaleAll = 1,
	ScaleOverride = 2,
	ECrosshairScaleMode_MAX = 3
};

// Enum GPGameplay.EWeaponDataRecoilType
enum class EWeaponDataRecoilType : UINT8 {
	WeaponRecoil_DFM = 0,
	WeaponRecoil_Polynomial = 1,
	WeaponRecoil_VelocityModel = 2,
	WeaponRecoil_MAX = 3
};

// Enum GPGameplay.EExplosionType
enum class EExplosionType : UINT8 {
	None = 0,
	Weapon_Grenade = 1,
	Weapon_RPG_8 = 2,
	Weapon_C4 = 3,
	Weapon_Missile = 4,
	WeaponMelee_Hurt = 5,
	Weapon_3Grenade = 6,
	Vehicle_ArmedPickup = 7,
	Vehicle_Motor = 8,
	Vehicle_TutuCar = 9,
	Vehicle_UNTrunk = 10,
	Vehicle_DarkTideJeep = 11,
	Vehicle_CargoTrunk = 12,
	Vehicle_Drone = 13,
	Tank_Projectile = 14,
	FixedTrackRocket = 15,
	Other_Shell = 16,
	Other_RocketRecycling = 17,
	Type_Large = 18,
	Type_Mid = 19,
	Type_Small = 20,
	Weapon_Point = 21,
	RankSkill_GuidedMissle = 22,
	Other_Debug = 23,
	Max = 24
};

// Enum GPGameplay.EMainAttributeFunctionCurvingType
enum class EMainAttributeFunctionCurvingType : UINT8 {
	NONE = 0,
	DeltaMapping = 1,
	DeltaMappingThenScale = 2,
	AbsoluteMapping = 3,
	AbsoluteMappingThenScale = 4,
	EMainAttributeFunctionCurvingType_MAX = 5
};

// Enum GPGameplay.EWeaponDataModifierPeriod
enum class EWeaponDataModifierPeriod : UINT8 {
	GAME_MODE = 0,
	PARTS = 1,
	PART_TUNE = 2,
	Max = 3
};

// Enum GPGameplay.EWeaponDataArrayModifierType
enum class EWeaponDataArrayModifierType : UINT8 {
	None = 0,
	Add = 1,
	Rem = 2,
	Max = 3
};

// Enum GPGameplay.EWeaponDataReplaceType
enum class EWeaponDataReplaceType : UINT8 {
	None = 0,
	Final = 1,
	Initial = 2,
	Max = 3
};

// Enum GPGameplay.EWeaponDataModifierType
enum class EWeaponDataModifierType : UINT8 {
	None = 0,
	Addend = 1,
	Mult_A = 2,
	Mult_B = 3,
	Mult_C = 4,
	Max = 5
};

// Enum GPGameplay.EScopeLenMatState
enum class EScopeLenMatState : UINT8 {
	Close = 0,
	Switch = 1,
	Open = 2,
	EScopeLenMatState_MAX = 3
};

// Enum GPGameplay.WeaponInspectType
enum class WeaponInspectType : UINT8 {
	WeaponInspectType_Default = 0,
	WeaponInspectType_Empty = 1,
	WeaponInspectType_Finally = 2,
	WeaponInspectType_FirstEmpty = 3,
	WeaponInspectType_MAX = 4
};

// Enum GPGameplay.ETieWeaponState
enum class ETieWeaponState : UINT8 {
	E_Idle = 0,
	E_Vacant = 1,
	E_Using = 2,
	E_Broken = 3,
	E_Destory = 4,
	E_MAX = 5
};

// Enum GPGameplay.ESceneWeaponType
enum class ESceneWeaponType : UINT8 {
	E_None = 0,
	E_MachineGun = 1,
	E_FixedWeaponAA = 2,
	E_FixedWEaponShore = 3,
	E_GiantTowerGuidedRocket = 4,
	E_GiantTowerWeaponAA = 5,
	E_HumveeCracked = 6,
	E_HawkMachineGun = 7,
	E_MAX = 8
};

// Enum GPGameplay.ESceneHealthState
enum class ESceneHealthState : UINT8 {
	None = 0,
	E_Normal = 1,
	E_Impaired = 2,
	E_Destory = 3,
	E_Constructable = 4,
	ESceneHealthState_MAX = 5
};

// Enum GPGameplay.ECrossHairBindMode
enum class ECrossHairBindMode : UINT8 {
	BindToFireLocation = 0,
	BindToFrontSight = 1,
	BindToScreenCenter = 2,
	ECrossHairBindMode_MAX = 3
};

// Enum GPGameplay.EWeaponOffsetType
enum class EWeaponOffsetType : UINT8 {
	WeaponZoomOffset_Rotation = 0,
	WeaponZoomOffset = 1,
	WeaponDisplayOffset = 2,
	WeaponAdditiveAnim = 3,
	WeaponAdditiveAnim_FiringAnim = 4,
	WeaponCameraShakeRoll = 5,
	WeaponGunKick = 6,
	WeaponGunSway = 7,
	WeaponOwnerHitShake = 8,
	WeaponGunKick2 = 9,
	WeaponOffsetFinal = 10,
	EWeaponOffsetType_MAX = 11
};

// Enum GPGameplay.EZoomAlignmentMode
enum class EZoomAlignmentMode : UINT8 {
	TransformAlignment = 0,
	DisableAlignment = 2,
	EZoomAlignmentMode_MAX = 3
};

// Enum GPGameplay.EEquipmentPartDamageType
enum class EEquipmentPartDamageType : UINT8 {
	Default = 0,
	Fix = 1,
	EEquipmentPartDamageType_MAX = 2
};

// Enum GPGameplay.EWeaponHandAnimType
enum class EWeaponHandAnimType : UINT8 {
	None = 0,
	LeftHandType = 1,
	RightHandType = 2,
	BothHandsType = 3,
	EWeaponHandAnimType_MAX = 4
};

// Enum GPGameplay.EWeaponFireCrosshairStyle
enum class EWeaponFireCrosshairStyle : UINT8 {
	CrosshairNormal = 0,
	EWeaponFireCrosshairStyle_MAX = 1
};

// Enum GPGameplay.ECharacterLogicPoseType
enum class ECharacterLogicPoseType : UINT8 {
	None = 0,
	StandPose = 1,
	CrouchPose = 2,
	PronePose = 3,
	ECharacterLogicPoseType_MAX = 4
};

// Enum GPGameplay.EChracterPoseType
enum class EChracterPoseType : UINT8 {
	None = 0,
	Stand = 1,
	Crouch = 2,
	Prone = 3,
	Jump = 4,
	Run = 5,
	Fly = 6,
	Sprint = 7,
	Fracture = 8,
	ImpendingDeath = 9,
	Swim = 10,
	SlidingTackle = 11,
	Rescue = 12,
	EChracterPoseType_MAX = 13
};

// Enum GPGameplay.EHandIKType
enum class EHandIKType : UINT8 {
	HandIKType_None = 0,
	HandIKType_Primary = 1,
	HandIKType_Submachine = 2,
	HandIKType_Pistol = 3,
	HandIKType_SpecialLongWeapon = 4,
	HandIKType_Max = 5
};

// Enum GPGameplay.ETurn8AngleType
enum class ETurn8AngleType : UINT8 {
	None = 0,
	Angle_Turn_1 = 1,
	Angle_TurnLeft_46 = 2,
	Angle_TurnLeft_91 = 3,
	Angle_TurnLeft_136 = 4,
	Angle_TurnLeft_181 = 5,
	Angle_TurnRight_46 = 6,
	Angle_TurnRight_91 = 7,
	Angle_TurnRight_136 = 8,
	Max = 9
};

// Enum GPGameplay.EEightDirectionType
enum class EEightDirectionType : UINT8 {
	None = 0,
	Direction_F = 1,
	Direction_FR = 2,
	Direction_FL = 3,
	Direction_B = 4,
	Direction_BR = 5,
	Direction_BL = 6,
	Direction_L = 7,
	Direction_R = 8,
	Max = 9
};

// Enum GPGameplay.EAnimationSpecialUseType
enum class EAnimationSpecialUseType : UINT8 {
	None = 0,
	TPPAnim_UnderFPP = 6,
	EAnimationSpecialUseType_MAX = 7
};

// Enum GPGameplay.EWeaponSpreadModifierType
enum class EWeaponSpreadModifierType : UINT8 {
	CentralLimitTheorem = 0,
	SimpleRandom = 1,
	EWeaponSpreadModifierType_MAX = 2
};

// Enum GPGameplay.EDistributionInSpreadType
enum class EDistributionInSpreadType : UINT8 {
	UniformDistribution = 0,
	CutCakeDistribution = 1,
	CustomDistribution = 2,
	EDistributionInSpreadType_MAX = 3
};

// Enum GPGameplay.EWeaponSpreadAreaType
enum class EWeaponSpreadAreaType : UINT8 {
	Oval = 0,
	EWeaponSpreadAreaType_MAX = 1
};

// Enum GPGameplay.EWeaponAdditiveGetAnimResultType
enum class EWeaponAdditiveGetAnimResultType : UINT8 {
	RotateSpine = 0,
	RotateByCenter = 1,
	RotateByHoldPoint = 2,
	AddtiveLeftHand = 3,
	EWeaponAdditiveGetAnimResultType_MAX = 4
};

// Enum GPGameplay.EWeaponAntiCheatType
enum class EWeaponAntiCheatType : UINT8 {
	None = 0,
	Time = 1,
	SwitchWeapon = 2,
	Ammo = 3,
	FireSpread = 4,
	FireRecoil = 5,
	ChangeClip = 101,
	Chamber = 102,
	Equipping = 103,
	Firing = 104,
	OtherState = 200,
	EWeaponAntiCheatType_MAX = 201
};

// Enum GPGameplay.EShakerRuntimeRecoilSimulatorStage
enum class EShakerRuntimeRecoilSimulatorStage : UINT8 {
	None = 0,
	StartFire = 1,
	FireRebound = 2,
	Recover = 3,
	EShakerRuntimeRecoilSimulatorStage_MAX = 4
};

// Enum GPGameplay.EZoomInParamType
enum class EZoomInParamType : UINT8 {
	Default = 0,
	Sight = 1,
	Scope = 2,
	Debug = 3,
	Max = 4
};

// Enum GPGameplay.EGPCameraSwayMode
enum class EGPCameraSwayMode : UINT8 {
	EGPCameraSwayMode_AimWalk = 0,
	EGPCameraSwayMode_Walk = 1,
	EGPCameraSwayMode_Run = 2,
	EGPCameraSwayMode_MAX = 3
};

// Enum GPGameplay.EMeleeFireMode
enum class EMeleeFireMode : UINT8 {
	Auto = 0,
	Single = 1,
	EMeleeFireMode_MAX = 2
};

// Enum GPGameplay.EWeaponObjectMatchLevel
enum class EWeaponObjectMatchLevel : UINT8 {
	MatchAll = 0,
	MatchWeaponId = 1,
	MatchWeaponType = 2,
	AlwaysMatch = 3,
	Similarity = 4,
	EWeaponObjectMatchLevel_MAX = 5
};

// Enum GPGameplay.EProcedureAnimBoneType
enum class EProcedureAnimBoneType : UINT8 {
	ScopeCenter = 0,
	WeaponRoot = 1,
	Camera = 2,
	FrontSight = 3,
	Custom = 4,
	EProcedureAnimBoneType_MAX = 5
};

// Enum GPGameplay.EMysticalSkinParamValueType
enum class EMysticalSkinParamValueType : UINT8 {
	Constant = 0,
	Random = 1,
	Random01 = 2,
	EMysticalSkinParamValueType_MAX = 3
};

// Enum GPGameplay.EWeaponSkinRareType
enum class EWeaponSkinRareType : UINT8 {
	Normal = 0,
	Rare = 1,
	VeryRare = 2,
	EWeaponSkinRareType_MAX = 3
};

// Enum GPGameplay.ESkinEffectTriggerEventType
enum class ESkinEffectTriggerEventType : UINT8 {
	None = 0,
	PlayMaterialAnim = 1,
	ESkinEffectTriggerEventType_MAX = 2
};

// Enum GPGameplay.EWeaponSkinRenderMode
enum class EWeaponSkinRenderMode : UINT8 {
	None = 0,
	Dye = 1,
	EWeaponSkinRenderMode_MAX = 2
};

// Enum GPGameplay.EAbilityThrowableStickyType
enum class EAbilityThrowableStickyType : UINT8 {
	None = 0,
	All = 1,
	OnlyVehicle = 2,
	OnlyDFMChar = 3,
	EAbilityThrowableStickyType_MAX = 4
};

// Enum GPGameplay.EWeaponThrowableType
enum class EWeaponThrowableType : UINT8 {
	None = 0,
	EWeaponThrowableType_MAX = 1
};

// ScriptStruct GPGameplay.PointHitActionResult
// Size: 0x20 (Inherited: 0x00)
struct FPointHitActionResult {
public:

	uint64_t Guid; // 0x00(0x08)
	enum class EDamageValidateResult ResultType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	uint64_t RuleId; // 0x10(0x08)
	int32_t Code; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TakeHitInfo
// Size: 0xd0 (Inherited: 0x00)
struct FTakeHitInfo {
public:

	uint64_t Uin; // 0x00(0x08)
	uint64_t VictimUin; // 0x08(0x08)
	bool bEmpty; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct FVector_NetQuantize RelHitLocation; // 0x14(0x0c)
	struct FVector_NetQuantize Momentum; // 0x20(0x0c)
	struct FVector_NetQuantize HitFromLocation; // 0x2c(0x0c)
	struct FVector_NetQuantize HitLocation; // 0x38(0x0c)
	char pad_44[0x4]; // 0x44(0x04)
	struct FGameplayTagContainer HitEffectTypeTagContainer; // 0x48(0x20)
	char ShotDirPitch; // 0x68(0x01)
	char ShotDirYaw; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	struct FName HitBoneName; // 0x6c(0x08)
	enum class EHitGroupType HitPhysicsType; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct UPhysicalMaterial* HitPhysicsMaterial; // 0x78(0x08)
	char Count; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct UClass* HitArmor; // 0x88(0x08)
	enum class EDirection HitDirection; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct AActor* HitCauser; // 0x98(0x08)
	enum class EHitDamageApplyType HitDamageApplyType; // 0xa0(0x01)
	enum class EDamageType DamageType; // 0xa1(0x01)
	bool bShowHitDir; // 0xa2(0x01)
	char pad_A3[0x2d]; // 0xa3(0x2d)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RescueInfo
// Size: 0x38 (Inherited: 0x00)
struct FRescueInfo {
public:

	struct AGPCharacterBase* BeRescueCharacter; // 0x00(0x08)
	bool bCurrentRescueLeft; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FRotator BeRescuueRotator; // 0x0c(0x0c)
	struct FRotator RescuueRotator; // 0x18(0x0c)
	struct FVector RescueLoc; // 0x24(0x0c)
	int32_t ChangeCount; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SubtitleSequenceInfo
// Size: 0x38 (Inherited: 0x00)
struct FSubtitleSequenceInfo {
public:

	char pad_0[0x28]; // 0x00(0x28)
	struct FName SubtitleSequenceId; // 0x28(0x08)
	char pad_30[0x8]; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SubtitleGroupItem
// Size: 0x18 (Inherited: 0x00)
struct FSubtitleGroupItem {
public:

	struct FName SubtitleId; // 0x00(0x08)
	float MinShowPercent; // 0x08(0x04)
	bool bNeedInteractToNext; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float NextSubtitleSequenceDelay; // 0x10(0x04)
	int32_t LoopTimes; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TeamScoreInfo
// Size: 0x18 (Inherited: 0x0c)
struct FTeamScoreInfo : public FFastArraySerializerItem {
public:

	struct FName ScoreType; // 0x0c(0x08)
	int32_t Score; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectSafeBoxInfo
// Size: 0x10 (Inherited: 0x00)
struct FSpectSafeBoxInfo {
public:

	uint32_t SafeBoxId; // 0x00(0x04)
	uint32_t OperateId; // 0x04(0x04)
	float params1; // 0x08(0x04)
	float params2; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectWeaponInfo
// Size: 0x0c (Inherited: 0x00)
struct FSpectWeaponInfo {
public:

	uint16_t WeaponAmmoCount; // 0x00(0x02)
	char pad_2[0x2]; // 0x02(0x02)
	int32_t CacheTotalAmmoCount; // 0x04(0x04)
	int32_t FiringMode; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectTelescopeInfo
// Size: 0x0c (Inherited: 0x00)
struct FSpectTelescopeInfo {
public:

	bool bIsUsingTelescope; // 0x00(0x01)
	bool bStartOpenTransition; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	float CurrentFOV; // 0x04(0x04)
	int32_t CurrentIndex; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMissionInfo
// Size: 0x40 (Inherited: 0x00)
struct FPlayerMissionInfo {
public:

	int32_t missionid; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString Name; // 0x08(0x10)
	struct TArray<struct FMissionListener> MissionListeners; // 0x18(0x10)
	bool Complete; // 0x28(0x01)
	bool failed; // 0x29(0x01)
	bool ForceUpdate; // 0x2a(0x01)
	enum class EGameRuleType MissionWorldType; // 0x2b(0x01)
	float TotalTimeLimit; // 0x2c(0x04)
	struct TArray<struct FPlayerMissionMapIcon> MapIconMarkers; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMissionMapIcon
// Size: 0x18 (Inherited: 0x00)
struct FPlayerMissionMapIcon {
public:

	enum class EGPQuestActionMarkerType Type; // 0x00(0x01)
	bool BindRotate; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TArray<struct AActor*> actors; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionListener
// Size: 0x60 (Inherited: 0x00)
struct FMissionListener {
public:

	struct FString Title; // 0x00(0x10)
	struct FString CompleteDesc; // 0x10(0x10)
	struct TArray<struct FMissionObjectiveItem> MissionObjectiveItems; // 0x20(0x10)
	bool Side; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float TimeLimit; // 0x34(0x04)
	bool TimeLimitPause; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	int32_t HintType; // 0x3c(0x04)
	bool ForceUpdate; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct TArray<int64_t> members; // 0x48(0x10)
	uint64_t SimpleQuestID; // 0x58(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionObjectiveItem
// Size: 0x70 (Inherited: 0x00)
struct FMissionObjectiveItem {
public:

	struct FString desc11; // 0x00(0x10)
	struct FString desc12; // 0x10(0x10)
	bool Complete; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FString InteractTag; // 0x28(0x10)
	struct TArray<struct AActor*> InteractActors; // 0x38(0x10)
	int32_t PopupCount; // 0x48(0x04)
	bool ShowTitle; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32_t IdentityCode; // 0x50(0x04)
	float TextTimeLimit; // 0x54(0x04)
	bool BindHealth; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float Percent; // 0x5c(0x04)
	enum class EGPQuestActionMarkerType markerType; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	int32_t Index; // 0x64(0x04)
	int32_t marker; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionRewardsInfo
// Size: 0x28 (Inherited: 0x00)
struct FMissionRewardsInfo {
public:

	struct FString Icon; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	int32_t Num; // 0x20(0x04)
	bool Exp; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.WeaponSkinParam
// Size: 0x18 (Inherited: 0x00)
struct FWeaponSkinParam {
public:

	struct TArray<struct FName> ParamNames; // 0x00(0x10)
	float Value; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AmmoDataItem
// Size: 0x20 (Inherited: 0x00)
struct FAmmoDataItem {
public:

	uint64_t ItemID; // 0x00(0x08)
	uint64_t Guid; // 0x08(0x08)
	int32_t Num; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	uint64_t BindPlayerId; // 0x18(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GunDescRow
// Size: 0x80 (Inherited: 0x10)
struct FGunDescRow : public FDescRowBase {
public:

	uint64_t DesKey; // 0x10(0x08)
	uint64_t DesId; // 0x18(0x08)
	int16_t Index; // 0x20(0x02)
	char pad_22[0x6]; // 0x22(0x06)
	uint64_t ItemID; // 0x28(0x08)
	uint64_t Guid; // 0x30(0x08)
	int16_t ParentIndex; // 0x38(0x02)
	char pad_3A[0x2]; // 0x3a(0x02)
	uint32_t ParentSocketId; // 0x3c(0x04)
	uint32_t SocketId; // 0x40(0x04)
	int16_t Child; // 0x44(0x02)
	char NodeType; // 0x46(0x01)
	char pad_47[0x1]; // 0x47(0x01)
	int32_t Durability; // 0x48(0x04)
	char BindType; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	uint64_t BindPlayerId; // 0x50(0x08)
	bool bRawBinded; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct TArray<uint64_t> TuneIds; // 0x60(0x10)
	struct TArray<float> TuneValues; // 0x70(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RightKeyTipsSkillData
// Size: 0x28 (Inherited: 0x00)
struct FRightKeyTipsSkillData {
public:

	struct FName Key; // 0x00(0x08)
	struct FText Desc; // 0x08(0x18)
	bool bOverrideDesc; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerLocation
// Size: 0x18 (Inherited: 0x00)
struct FPlayerLocation {
public:

	int64_t Uin; // 0x00(0x08)
	struct FVector Location; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPActorChannelInfo
// Size: 0x14 (Inherited: 0x00)
struct FGPActorChannelInfo {
public:

	char pad_0[0x14]; // 0x00(0x14)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkInit
// Size: 0x150 (Inherited: 0x00)
struct FMarkInit {
public:

	struct FString MarkerTypeString; // 0x00(0x10)
	struct TWeakObjectPtr<struct AActor> TargetActor; // 0x10(0x08)
	struct APlayerController* Controller; // 0x18(0x08)
	struct TArray<enum class EMarkFeature> Features; // 0x20(0x10)
	struct UGPMarkerItemBase* MarkerItemPtr; // 0x30(0x08)
	char pad_38[0x20]; // 0x38(0x20)
	struct UPaperSprite* Sprite0; // 0x58(0x08)
	struct UPaperSprite* Sprite1; // 0x60(0x08)
	struct UPaperSprite* Sprite2; // 0x68(0x08)
	struct UPaperSprite* Sprite3; // 0x70(0x08)
	struct FColor Color0; // 0x78(0x04)
	struct FColor Color1; // 0x7c(0x04)
	struct AActor* Actor0; // 0x80(0x08)
	struct AActor* Actor1; // 0x88(0x08)
	struct UObject* Object0; // 0x90(0x08)
	struct UObject* Object1; // 0x98(0x08)
	int32_t Int0; // 0xa0(0x04)
	int32_t Int1; // 0xa4(0x04)
	float Float0; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	uint64_t Int2; // 0xb0(0x08)
	struct FString String0; // 0xb8(0x10)
	struct FText Text0; // 0xc8(0x18)
	struct FName Name0; // 0xe0(0x08)
	char pad_E8[0x8]; // 0xe8(0x08)
	struct FMatrix Matrix0; // 0xf0(0x40)
	struct FVector Vector0; // 0x130(0x0c)
	char pad_13C[0x4]; // 0x13c(0x04)
	uint64_t Int64; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommonCountDownInfo
// Size: 0x30 (Inherited: 0x00)
struct FCommonCountDownInfo {
public:

	enum class ECountDownPriority CountDowType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText CountDownTitle; // 0x08(0x18)
	float EndCountDownTime; // 0x20(0x04)
	bool bShow; // 0x24(0x01)
	bool bUseTenSecondsWidgetShow; // 0x25(0x01)
	bool ColoredTitle; // 0x26(0x01)
	char pad_27[0x1]; // 0x27(0x01)
	int32_t UrgentTime; // 0x28(0x04)
	bool EmphasizeTen; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionTurnInItem
// Size: 0x60 (Inherited: 0x00)
struct FMissionTurnInItem {
public:

	struct TMap<int64_t, int32_t> DataMap; // 0x00(0x50)
	struct TArray<struct FNpcTurnInItem> Data; // 0x50(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.NpcTurnInItem
// Size: 0x68 (Inherited: 0x00)
struct FNpcTurnInItem {
public:

	struct TMap<struct FString, int32_t> DataMap; // 0x00(0x50)
	struct TArray<struct FItemTurnInItem> Data; // 0x50(0x10)
	int64_t Key; // 0x60(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ItemTurnInItem
// Size: 0x70 (Inherited: 0x00)
struct FItemTurnInItem {
public:

	struct TMap<int64_t, int32_t> DataMap; // 0x00(0x50)
	struct TArray<struct FMissionTurnInItemInfo> Data; // 0x50(0x10)
	struct FString Key; // 0x60(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionTurnInItemInfo
// Size: 0x28 (Inherited: 0x00)
struct FMissionTurnInItemInfo {
public:

	int64_t ID; // 0x00(0x08)
	struct FString Name; // 0x08(0x10)
	int32_t Num; // 0x18(0x04)
	int32_t numTotal; // 0x1c(0x04)
	int32_t gid; // 0x20(0x04)
	int32_t hasNum; // 0x24(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttributeOpStructArray
// Size: 0x18 (Inherited: 0x00)
struct FAttributeOpStructArray {
public:

	struct FName AttribiteName; // 0x00(0x08)
	struct TArray<struct FAttributeOperateData> Datas; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttributeOperateData
// Size: 0x18 (Inherited: 0x00)
struct FAttributeOperateData {
public:

	enum class AttributeAdditionType GameplayModOp; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FAttributeOperateValue> OperateValues; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttributeOperateValue
// Size: 0x20 (Inherited: 0x00)
struct FAttributeOperateValue {
public:

	uint64_t ID; // 0x00(0x08)
	uint64_t BuffId; // 0x08(0x08)
	bool IsValid; // 0x10(0x01)
	bool isPause; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float Value; // 0x14(0x04)
	char pad_18[0x8]; // 0x18(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.WeaponDebugInfo
// Size: 0x18 (Inherited: 0x00)
struct FWeaponDebugInfo {
public:

	char pad_0[0x18]; // 0x00(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPGameModeLogicConfig
// Size: 0x30 (Inherited: 0x00)
struct FGPGameModeLogicConfig {
public:

	bool UseTPPDriving; // 0x00(0x01)
	bool SnapToGetOnOffDriving; // 0x01(0x01)
	bool DisableDeadBodyLootingFeature; // 0x02(0x01)
	bool DisableLiveSpectatingFeature; // 0x03(0x01)
	bool DisableMoveAndAttackedImpendingDeath; // 0x04(0x01)
	bool EnableCarryBody; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	float RebornImpendingDeathHealthValue; // 0x08(0x04)
	float FastRescueRebornImpendingDeathHealthValue; // 0x0c(0x04)
	bool EnableParachute; // 0x10(0x01)
	bool ForceUseLocalBattleClassSkillSetting; // 0x11(0x01)
	bool ClientDefaultRecordMemoryReplayForKillcam; // 0x12(0x01)
	char pad_13[0x1]; // 0x13(0x01)
	float KillCamTimeBufferBeforeDead; // 0x14(0x04)
	float KillCamTimeBufferAfterDead; // 0x18(0x04)
	float KillCamRecordHz; // 0x1c(0x04)
	struct FString KillCamHUDViewName; // 0x20(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SceneWeaponOnFireInfo
// Size: 0x08 (Inherited: 0x00)
struct FSceneWeaponOnFireInfo {
public:

	int32_t SceneWeaponID; // 0x00(0x04)
	int32_t CampId; // 0x04(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPPlayerUIN
// Size: 0x08 (Inherited: 0x00)
struct FGPPlayerUIN {
public:

	uint64_t Uin; // 0x00(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RedeployMarkInit
// Size: 0xd0 (Inherited: 0x00)
struct FRedeployMarkInit {
public:

	struct AActor* TargetActor; // 0x00(0x08)
	uint64_t UniqueId; // 0x08(0x08)
	struct APlayerController* Controller; // 0x10(0x08)
	struct TArray<enum class EMarkFeature> Features; // 0x18(0x10)
	struct UPaperSprite* Sprite0; // 0x28(0x08)
	struct UPaperSprite* Sprite1; // 0x30(0x08)
	struct UPaperSprite* Sprite2; // 0x38(0x08)
	struct UPaperSprite* Sprite3; // 0x40(0x08)
	struct FColor Color0; // 0x48(0x04)
	struct FColor Color1; // 0x4c(0x04)
	struct AActor* Actor0; // 0x50(0x08)
	struct AActor* Actor1; // 0x58(0x08)
	struct UObject* Object0; // 0x60(0x08)
	struct UObject* Object1; // 0x68(0x08)
	int32_t Int0; // 0x70(0x04)
	int32_t Int1; // 0x74(0x04)
	float Float0; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	uint64_t Int2; // 0x80(0x08)
	struct FString String0; // 0x88(0x10)
	struct FText Text0; // 0x98(0x18)
	struct FName Name0; // 0xb0(0x08)
	struct FVector TargetActorLocation; // 0xb8(0x0c)
	float TargetActorRotation; // 0xc4(0x04)
	uint64_t Int64; // 0xc8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityEntityQuery
// Size: 0xc0 (Inherited: 0x00)
struct FAbilityEntityQuery {
public:

	char pad_0[0xc0]; // 0x00(0xc0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityShareMemoryPool
// Size: 0x50 (Inherited: 0x00)
struct FAbilityShareMemoryPool {
public:

	char pad_0[0x50]; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ShareMemoryPoolHandle
// Size: 0x10 (Inherited: 0x00)
struct FShareMemoryPoolHandle {
public:

	char pad_0[0x10]; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityShareMemoryWithFreeList
// Size: 0x28 (Inherited: 0x00)
struct FAbilityShareMemoryWithFreeList {
public:

	char pad_0[0x28]; // 0x00(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityShareMemoryChunk
// Size: 0x30 (Inherited: 0x00)
struct FAbilityShareMemoryChunk {
public:

	char pad_0[0x30]; // 0x00(0x30)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityShareMemory
// Size: 0x20 (Inherited: 0x00)
struct FAbilityShareMemory {
public:

	char pad_0[0x20]; // 0x00(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RepAmmoTimeLine
// Size: 0x20 (Inherited: 0x00)
struct FRepAmmoTimeLine {
public:

	struct TArray<struct FAmmoKeyFrame> Data; // 0x00(0x10)
	int32_t Front; // 0x10(0x04)
	int32_t Rear; // 0x14(0x04)
	int32_t MaxSize; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimLODConfigParam
// Size: 0x14 (Inherited: 0x00)
struct FAnimLODConfigParam {
public:

	int32_t Index; // 0x00(0x04)
	int32_t ExplicitlyAnimGraphLOD; // 0x04(0x04)
	int32_t ExplicitlyURO; // 0x08(0x04)
	int32_t TickRate; // 0x0c(0x04)
	bool TickReverse; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimNode_BlendCurveOnly
// Size: 0x68 (Inherited: 0x40)
struct FAnimNode_BlendCurveOnly : public FAnimNode_Base {
public:

	struct FPoseLink BasePose; // 0x40(0x10)
	struct FPoseLink CurvePose; // 0x50(0x10)
	enum class ECurveBlendOption_BCOnly CurveBlendOption; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimNode_BulletChain
// Size: 0x168 (Inherited: 0xf8)
struct FAnimNode_BulletChain : public FAnimNode_SkeletalControlBase {
public:

	int32_t CurrentBulletNum; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TMap<int32_t, struct FBoneReference> BulletBoneMap; // 0x100(0x50)
	char pad_150[0x18]; // 0x150(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimNode_CustomBlendSpacePlayer
// Size: 0x318 (Inherited: 0x2f8)
struct FAnimNode_CustomBlendSpacePlayer : public FAnimNode_BlendSpacePlayer {
public:

	struct UAnimSequence* CacheDebugPtr; // 0x2f8(0x08)
	char pad_300[0x18]; // 0x300(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimNode_Parabola
// Size: 0x180 (Inherited: 0xf8)
struct FAnimNode_Parabola : public FAnimNode_SkeletalControlBase {
public:

	float InitSpeed; // 0xf8(0x04)
	float InitSpeedZ; // 0xfc(0x04)
	struct FVector StartLocaltion; // 0x100(0x0c)
	struct FBoneReference ParabolaBoneReference; // 0x10c(0x10)
	float LimitTime; // 0x11c(0x04)
	char pad_120[0x60]; // 0x120(0x60)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimNode_PartCopyBone
// Size: 0x78 (Inherited: 0x40)
struct FAnimNode_PartCopyBone : public FAnimNode_Base {
public:

	struct FPoseLink Source; // 0x40(0x10)
	struct FName SourceBoneName; // 0x50(0x08)
	struct USkeletalMesh* SrcSkeletalMesh; // 0x58(0x08)
	struct FName TargetBoneName; // 0x60(0x08)
	struct USkeletalMesh* TargetSkeletalMesh; // 0x68(0x08)
	char pad_70[0x8]; // 0x70(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MyStruct
// Size: 0x01 (Inherited: 0x00)
struct FMyStruct {
public:

	char pad_0[0x1]; // 0x00(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CloseEyeScreenFXInfo
// Size: 0x0c (Inherited: 0x00)
struct FCloseEyeScreenFXInfo {
public:

	float CloseEyeBlendInTime; // 0x00(0x04)
	float CloseEyeDurationTime; // 0x04(0x04)
	float CloseEyeBlendOutTime; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.KillInfoWeaponImageRow
// Size: 0x78 (Inherited: 0x10)
struct FKillInfoWeaponImageRow : public FDescRowBase {
public:

	struct TArray<uint64_t> WeaponIdArray; // 0x10(0x10)
	struct TArray<uint64_t> AttackerValueIdArray; // 0x20(0x10)
	struct TArray<int32_t> VehicleIdArray; // 0x30(0x10)
	enum class EWeaponItemType WeaponItemType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FText DescName; // 0x48(0x18)
	struct FSoftObjectPath WeaponImagePath; // 0x60(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.FuzzyMatchIdCollection
// Size: 0x18 (Inherited: 0x00)
struct FFuzzyMatchIdCollection {
public:

	uint64_t WeaponID; // 0x00(0x08)
	uint64_t AttackValueId; // 0x08(0x08)
	int32_t VehicleId; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.VehicleArmorDamageCorrectConfig
// Size: 0x40 (Inherited: 0x10)
struct FVehicleArmorDamageCorrectConfig : public FDescRowBase {
public:

	uint64_t ID; // 0x10(0x08)
	float Default; // 0x18(0x04)
	float Light; // 0x1c(0x04)
	float LightMiddle; // 0x20(0x04)
	float Middle; // 0x24(0x04)
	float Heavy; // 0x28(0x04)
	float Raid; // 0x2c(0x04)
	float RaidTankBoss; // 0x30(0x04)
	float LittleBird; // 0x34(0x04)
	float SOLHelicopter; // 0x38(0x04)
	float FSV; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageBuffValue
// Size: 0x48 (Inherited: 0x10)
struct FDamageBuffValue : public FDescRowBase {
public:

	uint64_t ID; // 0x10(0x08)
	struct FSoftObjectPath KillIconPath; // 0x18(0x18)
	struct FSoftObjectPath DeathInfoIconPath; // 0x30(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RangeBuffParam
// Size: 0x20 (Inherited: 0x00)
struct FRangeBuffParam {
public:

	float BuffApplyProbability; // 0x00(0x04)
	float DamageUpperBound; // 0x04(0x04)
	float DamageLowerBound; // 0x08(0x04)
	uint32_t BuffId; // 0x0c(0x04)
	struct TArray<enum class EDFMGamePlayMode> EnabledGameModes; // 0x10(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttackerValueData
// Size: 0x70 (Inherited: 0x10)
struct FAttackerValueData : public FDescRowBase {
public:

	uint64_t AttackerValueId; // 0x10(0x08)
	struct FText DisplayName; // 0x18(0x18)
	enum class EDamageSystemDamageType DamageType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FName DestructibleItemDemageType; // 0x34(0x08)
	char pad_3C[0x4]; // 0x3c(0x04)
	uint64_t DefaultDamageId; // 0x40(0x08)
	uint64_t DamageIdGameMode01; // 0x48(0x08)
	uint64_t DamageIdGameMode02; // 0x50(0x08)
	uint64_t DamageIdGameMode03; // 0x58(0x08)
	uint64_t DamageIdGameMode04; // 0x60(0x08)
	bool NeedHitMark; // 0x68(0x01)
	bool bHitDirForCharacter; // 0x69(0x01)
	bool NeedBeHitFeedback; // 0x6a(0x01)
	char pad_6B[0x5]; // 0x6b(0x05)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttributeSystemTagRow
// Size: 0x18 (Inherited: 0x10)
struct FAttributeSystemTagRow : public FDescRowBase {
public:

	struct FName SystemTag; // 0x10(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttributeOperatesRow
// Size: 0x48 (Inherited: 0x10)
struct FAttributeOperatesRow : public FDescRowBase {
public:

	uint32_t AttributeOperateID; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<uint32_t> AttributeIDArray; // 0x18(0x10)
	enum class AttributeAdditionType GameplayModOp; // 0x28(0x01)
	bool bCustomValue; // 0x29(0x01)
	char pad_2A[0x2]; // 0x2a(0x02)
	float OperateValue; // 0x2c(0x04)
	struct FText Description; // 0x30(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DFMAttributeNameRow
// Size: 0x20 (Inherited: 0x10)
struct FDFMAttributeNameRow : public FDescRowBase {
public:

	uint32_t AttributeID; // 0x10(0x04)
	struct FName AttributeName; // 0x14(0x08)
	bool NotSyncToServer; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DFMAttributeModEffect
// Size: 0x10 (Inherited: 0x00)
struct FDFMAttributeModEffect {
public:

	struct FName AttributeName; // 0x00(0x08)
	enum class AttributeAdditionType GameplayModOp; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float OperateValue; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HeadsetAudioPostProcessTableRow
// Size: 0x28 (Inherited: 0x10)
struct FHeadsetAudioPostProcessTableRow : public FDescRowBase {
public:

	int32_t HeadsetId; // 0x10(0x04)
	float AudioRangeScaler; // 0x14(0x04)
	float AmbientVolunme; // 0x18(0x04)
	float CutOfFrequence; // 0x1c(0x04)
	float Resonance; // 0x20(0x04)
	int32_t CompressorId; // 0x24(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.BulletHitAction
// Size: 0x20 (Inherited: 0x00)
struct FBulletHitAction {
public:

	enum class EBulletHitActionType HitActionType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	uint64_t AttackId; // 0x08(0x08)
	uint64_t BuffId; // 0x10(0x08)
	uint64_t CustomExcuteActionId; // 0x18(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CampConfig
// Size: 0x40 (Inherited: 0x08)
struct FCampConfig : public FTableRowBase {
public:

	int32_t CampId; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FText CampName; // 0x10(0x18)
	struct TArray<int32_t> FriendCamps; // 0x28(0x10)
	bool bEnableDamageInCamp; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CampInfo
// Size: 0x18 (Inherited: 0x00)
struct FCampInfo {
public:

	struct TArray<struct FTeamInfo> TeamList; // 0x00(0x10)
	int32_t Camp; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterSnapShotPoseType
// Size: 0x02 (Inherited: 0x00)
struct FCharacterSnapShotPoseType {
public:

	char pad_0[0x2]; // 0x00(0x02)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterAnimSnapshotConfig
// Size: 0x78 (Inherited: 0x10)
struct FCharacterAnimSnapshotConfig : public FDescRowBase {
public:

	enum class ECharacterSnatshotBasePose Poise; // 0x10(0x01)
	enum class ECharacterSnatshotSubPose Lean; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	uint64_t VehicleId; // 0x18(0x08)
	struct TArray<struct FCharacterAnimSnatshotInVehicle> Seat_PoseAnims; // 0x20(0x10)
	uint64_t SceneWeaponID; // 0x30(0x08)
	struct TArray<struct FCharacterSnatshotBodyPartTransform> BodyPartsTransform; // 0x38(0x10)
	float Z_Scale; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	/*struct TSoftObjectPtr<UAnimSequence>*/char PoseAnim[0x28]; // 0x50(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterSnatshotBodyPartTransform
// Size: 0x40 (Inherited: 0x00)
struct FCharacterSnatshotBodyPartTransform {
public:

	struct FName BoneName; // 0x00(0x08)
	char pad_8[0x8]; // 0x08(0x08)
	struct FTransform BoneTransform; // 0x10(0x30)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterAnimSnatshotInVehicle
// Size: 0x78 (Inherited: 0x00)
struct FCharacterAnimSnatshotInVehicle {
public:

	struct FName SeatName; // 0x00(0x08)
	/*struct TSoftObjectPtr<UAnimSequence>*/char PoseAnim[0x28]; // 0x08(0x28)
	/*struct TSoftObjectPtr<UAnimSequence>*/char LeanOutPoseAnim[0x28]; // 0x30(0x28)
	struct TArray<struct FCharacterSnatshotBodyPartTransform> BodyPartsTransform; // 0x58(0x10)
	struct TArray<struct FCharacterSnatshotBodyPartTransform> LeanOutBodyPartsTransform; // 0x68(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AddAtrributeOperateParam
// Size: 0x10 (Inherited: 0x00)
struct FAddAtrributeOperateParam {
public:

	uint32_t BuffId; // 0x00(0x04)
	uint32_t BuffGUID; // 0x04(0x04)
	uint32_t EquipmentId; // 0x08(0x04)
	int32_t SkillId; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.LaserLerpInfo
// Size: 0x10 (Inherited: 0x00)
struct FLaserLerpInfo {
public:

	char pad_0[0x10]; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ScopeCollection
// Size: 0x10 (Inherited: 0x00)
struct FScopeCollection {
public:

	/*struct TArray<struct TScriptInterface<IRangeScopeInterface>>*/char RangeScopes[0x10]; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerDamageValidateStat
// Size: 0x60 (Inherited: 0x00)
struct FPlayerDamageValidateStat {
public:

	uint64_t PlayerUin; // 0x00(0x08)
	struct TMap<int64_t, int32_t> FaildCntMap; // 0x08(0x50)
	int32_t RequestHitCnt; // 0x58(0x04)
	int32_t FaildCnt; // 0x5c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageValidateStat
// Size: 0x18 (Inherited: 0x00)
struct FDamageValidateStat {
public:

	int64_t RuleId; // 0x00(0x08)
	int32_t AccpetCnt; // 0x08(0x04)
	int32_t AbortCnt; // 0x0c(0x04)
	int32_t AbortOnlyLogCnt; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.C2SBatchMakeDamage
// Size: 0x10 (Inherited: 0x00)
struct FC2SBatchMakeDamage {
public:

	struct TArray<struct FC2SMakeDamage> DamageItems; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.C2SMakeDamage
// Size: 0x180 (Inherited: 0x00)
struct FC2SMakeDamage {
public:

	uint64_t Guid; // 0x00(0x08)
	struct FHitResult HitResult; // 0x08(0x88)
	uint64_t AttackId; // 0x90(0x08)
	struct AActor* MakerActor; // 0x98(0x08)
	struct AActor* MakerInstigator; // 0xa0(0x08)
	struct AActor* Taker; // 0xa8(0x08)
	uint64_t InstigatorUin; // 0xb0(0x08)
	uint64_t DamageTakerUin; // 0xb8(0x08)
	enum class EDamageSystemDamageType DamageType; // 0xc0(0x01)
	char pad_C1[0x3]; // 0xc1(0x03)
	struct FVector MakerLocation; // 0xc4(0x0c)
	struct FVector MakerRotation; // 0xd0(0x0c)
	struct FVector MakerInstigatorLocation; // 0xdc(0x0c)
	struct FVector MakerInstigatorRotation; // 0xe8(0x0c)
	struct FVector TakerLocation; // 0xf4(0x0c)
	struct FVector TakerRotation; // 0x100(0x0c)
	float StartTime; // 0x10c(0x04)
	struct FVector PointStartLocation; // 0x110(0x0c)
	struct FVector PointDirection; // 0x11c(0x0c)
	struct FVector RadialLocation; // 0x128(0x0c)
	char pad_134[0x4]; // 0x134(0x04)
	struct TArray<struct AActor*> IgnoreActors; // 0x138(0x10)
	struct TArray<struct UClass*> IngoreClass; // 0x148(0x10)
	enum class EDamageType DamageTag; // 0x158(0x01)
	char pad_159[0x7]; // 0x159(0x07)
	struct FGameplayTagContainer DamageTagsContainer; // 0x160(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.S2CDamageApply_Radial
// Size: 0x30 (Inherited: 0x00)
struct FS2CDamageApply_Radial {
public:

	struct TArray<struct FS2CDamageApplyItem_Radial> DamageItems; // 0x00(0x10)
	struct AActor* MakerActor; // 0x10(0x08)
	struct AActor* MakerInstigator; // 0x18(0x08)
	struct FVector RadialLocation; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.S2CDamageApplyItem_Radial
// Size: 0x38 (Inherited: 0x00)
struct FS2CDamageApplyItem_Radial {
public:

	uint64_t Guid; // 0x00(0x08)
	float HPDamage; // 0x08(0x04)
	float ArmorDamage; // 0x0c(0x04)
	struct AActor* Taker; // 0x10(0x08)
	uint64_t AttackId; // 0x18(0x08)
	bool bBlock; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	struct FVector_NetQuantize MakerOwnerLocation; // 0x24(0x0c)
	int32_t HitNum; // 0x30(0x04)
	bool bBreakArmor; // 0x34(0x01)
	bool bBreakHelmetArmor; // 0x35(0x01)
	char TakerSourceStatus; // 0x36(0x01)
	char TakerResultStatus; // 0x37(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.S2CBatchDamageApply
// Size: 0x10 (Inherited: 0x00)
struct FS2CBatchDamageApply {
public:

	struct TArray<struct FS2CDamageApply> DamageItems; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.S2CDamageApply
// Size: 0x108 (Inherited: 0x00)
struct FS2CDamageApply {
public:

	uint64_t Guid; // 0x00(0x08)
	uint64_t FireId; // 0x08(0x08)
	float HPDamage; // 0x10(0x04)
	float ArmorDamage; // 0x14(0x04)
	struct FHitResult HitResult; // 0x18(0x88)
	struct AActor* MakerActor; // 0xa0(0x08)
	struct AActor* MakerInstigator; // 0xa8(0x08)
	struct AActor* Taker; // 0xb0(0x08)
	char TakerSourceStatus; // 0xb8(0x01)
	char TakerResultStatus; // 0xb9(0x01)
	char ArmorLevel; // 0xba(0x01)
	char pad_BB[0x5]; // 0xbb(0x05)
	int64_t AttackerValueId; // 0xc0(0x08)
	bool bBreakArmor; // 0xc8(0x01)
	bool bBreakHelmetArmor; // 0xc9(0x01)
	enum class EDamageType HitDamageType; // 0xca(0x01)
	char pad_CB[0x1]; // 0xcb(0x01)
	float CameraSwayHitScale; // 0xcc(0x04)
	float GunSwayHitScale; // 0xd0(0x04)
	struct FVector_NetQuantize MakerOwnerLocation; // 0xd4(0x0c)
	struct FGameplayTagContainer TagContainer; // 0xe0(0x20)
	enum class EDamageSystemDamageType DamageType; // 0x100(0x01)
	char pad_101[0x7]; // 0x101(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.S2CRequestPointHitActionFaild
// Size: 0x18 (Inherited: 0x00)
struct FS2CRequestPointHitActionFaild {
public:

	uint64_t Guid; // 0x00(0x08)
	uint64_t FaildRuleId; // 0x08(0x08)
	enum class EDamageValidateResult ResultType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32_t ResultCode; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageItem
// Size: 0x10 (Inherited: 0x00)
struct FDamageItem {
public:

	struct FName Name; // 0x00(0x08)
	float Value; // 0x08(0x04)
	enum class EDamageModifyType ModifyType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageConstId
// Size: 0x01 (Inherited: 0x00)
struct FDamageConstId {
public:

	char pad_0[0x1]; // 0x00(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageSystemDamageTypeName
// Size: 0x01 (Inherited: 0x00)
struct FDamageSystemDamageTypeName {
public:

	char pad_0[0x1]; // 0x00(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RadialSamplePoint
// Size: 0x14 (Inherited: 0x00)
struct FRadialSamplePoint {
public:

	struct FVector Point; // 0x00(0x0c)
	struct FName BoneName; // 0x0c(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.WeaponFireRepValidateInfo
// Size: 0x88 (Inherited: 0x00)
struct FWeaponFireRepValidateInfo {
public:

	uint64_t PlayerUin; // 0x00(0x08)
	uint64_t FireId; // 0x08(0x08)
	uint64_t AmmoId; // 0x10(0x08)
	bool bAim; // 0x18(0x01)
	bool bSuccess; // 0x19(0x01)
	char pad_1A[0x2]; // 0x1a(0x02)
	int32_t RemainBulletNum; // 0x1c(0x04)
	float FireTimeStamp; // 0x20(0x04)
	float ClientLogicFireTimeStamp; // 0x24(0x04)
	float ServerDeltaTime; // 0x28(0x04)
	struct FVector WeaponPosition; // 0x2c(0x0c)
	struct FRotator WeaponRotator; // 0x38(0x0c)
	struct FVector MakerInstigatorPosition; // 0x44(0x0c)
	struct FRotator MakerInstigatorRotation; // 0x50(0x0c)
	int32_t DamageApplyNum; // 0x5c(0x04)
	int32_t ZoomFovOnFire; // 0x60(0x04)
	struct FVector2D RecoilDelta; // 0x64(0x08)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FString LightFeatureStr; // 0x70(0x10)
	int32_t ContinueFireNum; // 0x80(0x04)
	enum class EWeaponFireValidateFaildReason FaildReason; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageValidateRuleRow
// Size: 0x58 (Inherited: 0x10)
struct FDamageValidateRuleRow : public FDescRowBase {
public:

	enum class EDamageValidateType DamageValidateType; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	int64_t DamageValidateRuleId; // 0x18(0x08)
	/*struct TSoftClassPtr<UObject>*/char RuleClass[0x28]; // 0x20(0x28)
	struct UDamageValidationRuleBase* RuleInstance; // 0x48(0x08)
	char bEnable : 1; // 0x50(0x01)
	char bDebug : 1; // 0x50(0x01)
	char pad_50_2 : 6; // 0x50(0x01)
	bool bAbortOnlySendLog; // 0x51(0x01)
	char pad_52[0x2]; // 0x52(0x02)
	float AllowDiff; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DataTableConstrainRow
// Size: 0x40 (Inherited: 0x08)
struct FDataTableConstrainRow : public FTableRowBase {
public:

	/*struct TSoftObjectPtr<UDataTable>*/char DataTable[0x28]; // 0x08(0x28)
	struct TArray<struct FTableColumnConstrain> TableColumnConstrains; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TransformHistoryData
// Size: 0x20 (Inherited: 0x00)
struct FTransformHistoryData {
public:

	struct TArray<struct FTransformHistoryDataItem> DataItems; // 0x00(0x10)
	float LifeSpan; // 0x10(0x04)
	char pad_14[0xc]; // 0x14(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TransformHistoryDataItem
// Size: 0x40 (Inherited: 0x00)
struct FTransformHistoryDataItem {
public:

	float Time; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
	struct FTransform Transform; // 0x10(0x30)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DPVSConnectionInfo
// Size: 0x40 (Inherited: 0x00)
struct FDPVSConnectionInfo {
public:

	struct TArray<struct FDPVSConnectionActorInfo> Actor; // 0x00(0x10)
	char pad_10[0x30]; // 0x10(0x30)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DPVSConnectionActorInfo
// Size: 0x0c (Inherited: 0x00)
struct FDPVSConnectionActorInfo {
public:

	char pad_0[0xc]; // 0x00(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DPVSActorInfo
// Size: 0x20 (Inherited: 0x00)
struct FDPVSActorInfo {
public:

	char pad_0[0x20]; // 0x00(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RandomKickTransItem
// Size: 0x30 (Inherited: 0x00)
struct FRandomKickTransItem {
public:

	float KickTransScaleBase; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	/*struct TSoftObjectPtr<UCurveVector>*/char TranslationCurve[0x28]; // 0x08(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.LevelSubsystemContainer
// Size: 0x50 (Inherited: 0x00)
struct FLevelSubsystemContainer {
public:

	struct TMap<struct UClass*, struct ALevelSubsystem*> LevelSubsystemMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.EndAbilityOption
// Size: 0x03 (Inherited: 0x00)
struct FEndAbilityOption {
public:

	bool EquipAnim; // 0x00(0x01)
	bool CastUseCD; // 0x01(0x01)
	bool DestoryAttachMesh; // 0x02(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SkillLogicStateProperty
// Size: 0x20 (Inherited: 0x00)
struct FSkillLogicStateProperty {
public:

	int32_t LogicID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FVector> Params; // 0x08(0x10)
	bool bool_param; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SkillLogicClientState
// Size: 0x0c (Inherited: 0x00)
struct FSkillLogicClientState {
public:

	struct FName LogicName; // 0x00(0x08)
	int32_t ClientLocalExcute; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SkillBtnCallData
// Size: 0x18 (Inherited: 0x00)
struct FSkillBtnCallData {
public:

	int32_t LogicID; // 0x00(0x04)
	struct FName LogicName; // 0x04(0x08)
	struct FName FunctionName; // 0x0c(0x08)
	enum class ESkillBtnCall Call; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SkillBehaviorData
// Size: 0x18 (Inherited: 0x00)
struct FSkillBehaviorData {
public:

	int32_t LogicID; // 0x00(0x04)
	struct FName LogicName; // 0x04(0x08)
	struct FName FunctionName; // 0x0c(0x08)
	enum class ESkillBehavior Call; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAIAnimProxyFootIK
// Size: 0x64 (Inherited: 0x00)
struct FGPAIAnimProxyFootIK {
public:

	bool bEnableFootLock; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float FootLockBlendOutTime; // 0x04(0x04)
	float LeftFootLockAlpha; // 0x08(0x04)
	float RightFootLockAlpha; // 0x0c(0x04)
	struct FVector LeftFootLockLocation; // 0x10(0x0c)
	struct FVector RightFootLockLocation; // 0x1c(0x0c)
	char pad_28[0x8]; // 0x28(0x08)
	float LeftFootIKAlpha; // 0x30(0x04)
	float RightFootIKAlpha; // 0x34(0x04)
	bool bLeftFootGrounded; // 0x38(0x01)
	bool bRightFootGrounded; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	struct FVector LeftFootGroundLocation; // 0x3c(0x0c)
	struct FVector RightFootGroundLocation; // 0x48(0x0c)
	struct FVector HipsTargetLocation; // 0x54(0x0c)
	char pad_60[0x4]; // 0x60(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RootMotionAnimBlendInfo
// Size: 0x38 (Inherited: 0x00)
struct FRootMotionAnimBlendInfo {
public:

	struct UAnimMontage* Anim; // 0x00(0x08)
	struct UAnimSequence* LocoAnim; // 0x08(0x08)
	char pad_10[0x28]; // 0x10(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DeathAnimConfigWithDirRange
// Size: 0x30 (Inherited: 0x00)
struct FDeathAnimConfigWithDirRange {
public:

	float YawMin; // 0x00(0x04)
	float YawMax; // 0x04(0x04)
	struct FName AnimName; // 0x08(0x08)
	struct TArray<struct FName> ExtraAnimNames; // 0x10(0x10)
	struct TArray<struct FName> InplaceAimsNames; // 0x20(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.OverrideAnimAssetArray
// Size: 0x10 (Inherited: 0x00)
struct FOverrideAnimAssetArray {
public:

	struct TArray<struct FOverrideAnimAsset> OverrideAnimAssets; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.OverrideAnimAsset
// Size: 0x18 (Inherited: 0x00)
struct FOverrideAnimAsset {
public:

	struct UAnimationAsset* OverrideAsset; // 0x00(0x08)
	char pad_8[0x10]; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimDataManager
// Size: 0x50 (Inherited: 0x00)
struct FAnimDataManager {
public:

	char pad_0[0x50]; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimDataTableRow
// Size: 0x430 (Inherited: 0x08)
struct FAnimDataTableRow : public FTableRowBase {
public:

	struct TMap<enum class EAnimTacticalActionType, struct FTacticalActionAnimRow> TacticalActionAnimTable; // 0x08(0x50)
	struct TMap<enum class EAnimClimbLadderType, struct FClimbLadderAnimRow> ClimbLadderAnimTable; // 0x58(0x50)
	struct TMap<enum class EAnimParachuteType, struct FParachuteAnimRow> ParachuteAnimTable; // 0xa8(0x50)
	struct TMap<enum class EAnimRaiseWatchType, struct FRaiseWatchAnimRow> RaiseWatchAnimTable; // 0xf8(0x50)
	struct TMap<enum class EAnimMarkingType, struct FMarkingAnimRow> MarkingAnimTable; // 0x148(0x50)
	struct TMap<enum class EAnimApplySprayType, struct FApplySprayAnimRow> ApplySprayAnimTable; // 0x198(0x50)
	struct TMap<enum class EAnimFirefightingType, struct FFirefightingAnimRow> FirefightingAnimTable; // 0x1e8(0x50)
	struct TMap<enum class EAnimCarryBodyType, struct FCarryBodyAnimRow> CarryBodyAnimTable; // 0x238(0x50)
	struct TMap<enum class EAnimKnockbackType, struct FKnockbackAnimRow> KnockbackAnimTable; // 0x288(0x50)
	char pad_2D8[0x158]; // 0x2d8(0x158)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPCommonAnimationData
// Size: 0x78 (Inherited: 0x00)
struct FGPCommonAnimationData {
public:

	struct AWeaponBase* WeaponInv; // 0x00(0x08)
	/*struct TScriptInterface<IWeaponDataComponentAnimInterface>*/char WeaponAnimDataComponent[0x10]; // 0x08(0x10)
	/*struct TScriptInterface<IWeaponDataComponentAppearanceInterface>*/char WeaponAppearanceDataComponent[0x10]; // 0x18(0x10)
	struct UWeaponDataComponentAdapter* WeaponDataComponentAdapter; // 0x28(0x08)
	struct UWeaponDataComponentAnim* WeaponAnimDataComponentRealComp; // 0x30(0x08)
	/*struct TScriptInterface<IWeaponFuncComponentAdditiveAnimInterface>*/char WeaponAdditiveAnimFuncComponent[0x10]; // 0x38(0x10)
	/*struct TScriptInterface<IWeaponFuncComponentInspectInterface>*/char WeaponFuncInspect[0x10]; // 0x48(0x10)
	/*struct TScriptInterface<IGPWeaponProxyInterface>*/char WeaponProxy[0x10]; // 0x58(0x10)
	char pad_68[0x10]; // 0x68(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.IntroVehicleAIAnimInstanceProxy
// Size: 0x790 (Inherited: 0x748)
struct FIntroVehicleAIAnimInstanceProxy : public FAnimInstanceProxy {
public:

	float DriveTurnX; // 0x748(0x04)
	float DriveTurnY; // 0x74c(0x04)
	struct FVector SiteRootLocation; // 0x750(0x0c)
	struct FRotator SiteRootRotation; // 0x75c(0x0c)
	bool bInVehicle; // 0x768(0x01)
	bool bIsGetOff; // 0x769(0x01)
	bool bIsDead; // 0x76a(0x01)
	bool bIsAlert; // 0x76b(0x01)
	char pad_76C[0x4]; // 0x76c(0x04)
	struct AGPCharacter* OwnerPawn; // 0x770(0x08)
	struct UGPVehicleDataComponent* VehicleDataComponent; // 0x778(0x08)
	struct UGPFightStateComponent* FightStateComponent; // 0x780(0x08)
	char pad_788[0x8]; // 0x788(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAnimProxyConfiguration
// Size: 0x28 (Inherited: 0x00)
struct FGPAnimProxyConfiguration {
public:

	float VelocityBlendInterpSpeed; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FCustomizedOrientationWarpingAngleSetting CustomizedOrientationWarpingAngleSetting; // 0x08(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAnimInstanceProxy_PlayerIK
// Size: 0x750 (Inherited: 0x748)
struct FGPAnimInstanceProxy_PlayerIK : public FAnimInstanceProxy {
public:

	char pad_748[0x8]; // 0x748(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAnimProxyFootIK
// Size: 0x50 (Inherited: 0x00)
struct FGPAnimProxyFootIK {
public:

	float LeftFootLockAlpha; // 0x00(0x04)
	float RightFootLockAlpha; // 0x04(0x04)
	struct FVector LeftFootLockLocation; // 0x08(0x0c)
	struct FVector RightFootLockLocation; // 0x14(0x0c)
	struct FRotator LeftFootLockRotation; // 0x20(0x0c)
	struct FRotator RightFootLockRotation; // 0x2c(0x0c)
	float LeftFootIKAlpha; // 0x38(0x04)
	float RightFootIKAlpha; // 0x3c(0x04)
	struct FVector Velocity; // 0x40(0x0c)
	char pad_4C[0x4]; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RepTurningInfo
// Size: 0x0c (Inherited: 0x00)
struct FRepTurningInfo {
public:

	float StartYawValue; // 0x00(0x04)
	float TargetYawValue; // 0x04(0x04)
	bool IsTurning; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIPhysBlendInfo
// Size: 0x18 (Inherited: 0x00)
struct FAIPhysBlendInfo {
public:

	struct FName BoneName; // 0x00(0x08)
	float BlendRate; // 0x08(0x04)
	float CurrentBlendAlpha; // 0x0c(0x04)
	float BlendOutStartTime; // 0x10(0x04)
	float EnablePhysTime; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimMontageBlending
// Size: 0x18 (Inherited: 0x00)
struct FAnimMontageBlending {
public:

	struct UAnimMontage* AnimMontage; // 0x00(0x08)
	struct UAnimMontage* AnimMontage2; // 0x08(0x08)
	char pad_10[0x8]; // 0x10(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RepAnimInfo
// Size: 0x28 (Inherited: 0x00)
struct FRepAnimInfo {
public:

	struct UAnimSequenceBase* AnimSequence; // 0x00(0x08)
	enum class EAnimationPlayType AnimPlayType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FName StartSection; // 0x0c(0x08)
	int32_t ForcePlayBit; // 0x14(0x04)
	char NeedStopBit : 1; // 0x18(0x01)
	char pad_18_1 : 7; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float PlayRate; // 0x1c(0x04)
	bool bJumpToAction; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RuntimeSmallActionData
// Size: 0x14 (Inherited: 0x00)
struct FRuntimeSmallActionData {
public:

	float DeltaTime2TriggerChanceScale; // 0x00(0x04)
	float CdTime; // 0x04(0x04)
	float CanTriggerTime; // 0x08(0x04)
	float BaseTriggerChance; // 0x0c(0x04)
	float RandomFailAddChance; // 0x10(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SequenceAnimList
// Size: 0x18 (Inherited: 0x00)
struct FSequenceAnimList {
public:

	struct TArray<struct FSequenceAnim> AnimList; // 0x00(0x10)
	float StartTime; // 0x10(0x04)
	int32_t PlayState; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SequenceAnim
// Size: 0x20 (Inherited: 0x00)
struct FSequenceAnim {
public:

	struct FSoftObjectPath AnimPath; // 0x00(0x18)
	float Length; // 0x18(0x04)
	enum class EAnimationPlayType PlayType; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPRootMotionAnimTrackData
// Size: 0x2c8 (Inherited: 0x00)
struct FGPRootMotionAnimTrackData {
public:

	struct FFloatCurve PosXCurve; // 0x00(0xb0)
	struct FFloatCurve PosYCurve; // 0xb0(0xb0)
	struct FFloatCurve PosZCurve; // 0x160(0xb0)
	struct FFloatCurve RotYawCurve; // 0x210(0xb0)
	char pad_2C0[0x8]; // 0x2c0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SequenceAnimListParam
// Size: 0x10 (Inherited: 0x00)
struct FSequenceAnimListParam {
public:

	struct TArray<struct FSequenceAnim> AnimList; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.LocomotionMovePara
// Size: 0x20 (Inherited: 0x00)
struct FLocomotionMovePara {
public:

	float AnimWalkStandardSpeed; // 0x00(0x04)
	float AnimRunStandardSpeed; // 0x04(0x04)
	struct UCurveFloat* AnimSprintRateCurve; // 0x08(0x08)
	float AnimSprintStandardSpeed; // 0x10(0x04)
	float AnimSuperSprintStandardSpeed; // 0x14(0x04)
	float AimSprintScaleFromVelocity; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPGunAOProxy
// Size: 0x10 (Inherited: 0x00)
struct FGPGunAOProxy {
public:

	float GunAOHorAxis; // 0x00(0x04)
	float GunAOVerAxis; // 0x04(0x04)
	float GunHorAOFadeoutDelayTime; // 0x08(0x04)
	float HorAOSensibility; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AnimSpeedInfo
// Size: 0x08 (Inherited: 0x00)
struct FAnimSpeedInfo {
public:

	float NormalizedSpeed; // 0x00(0x04)
	float MaxMoveSpeed; // 0x04(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DFMEffectArray
// Size: 0x08 (Inherited: 0x00)
struct FDFMEffectArray {
public:

	char pad_0[0x8]; // 0x00(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DFMEffectData
// Size: 0x0c (Inherited: 0x00)
struct FDFMEffectData {
public:

	float GameplayEffectDuration; // 0x00(0x04)
	float GameplayEffectPeriod; // 0x04(0x04)
	float GameplayEffectValue; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.OnGPAttributeChangeData
// Size: 0x60 (Inherited: 0x00)
struct FOnGPAttributeChangeData {
public:

	char pad_0[0x40]; // 0x00(0x40)
	struct AActor* Instigator; // 0x40(0x08)
	char pad_48[0x18]; // 0x48(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AddAttributeArrayHandle
// Size: 0x10 (Inherited: 0x00)
struct FAddAttributeArrayHandle {
public:

	struct TArray<struct FAddAttributeHandle> AttributeHandles; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AddAttributeHandle
// Size: 0x40 (Inherited: 0x00)
struct FAddAttributeHandle {
public:

	char pad_0[0x8]; // 0x00(0x08)
	uint64_t AttributeRowId; // 0x08(0x08)
	struct TArray<struct FAdditionData> AdditionDatas; // 0x10(0x10)
	float BaseValue; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	uint64_t Guid; // 0x28(0x08)
	char pad_30[0x10]; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AdditionData
// Size: 0x14 (Inherited: 0x00)
struct FAdditionData {
public:

	char pad_0[0x4]; // 0x00(0x04)
	struct FName AttributeName; // 0x04(0x08)
	uint32_t ModifierIndex; // 0x0c(0x04)
	enum class AttributeAdditionType GameplayModOp; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AttributeSetHealthReplicationItem
// Size: 0x38 (Inherited: 0x20)
struct FAttributeSetHealthReplicationItem : public FPropertyReplicationItem {
public:

	float Health; // 0x20(0x04)
	float ShieldHealth; // 0x24(0x04)
	float ArmorHealth; // 0x28(0x04)
	float HelmetArmorHealth; // 0x2c(0x04)
	float IsAlive; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.FakeFootstepRecord
// Size: 0x30 (Inherited: 0x00)
struct FFakeFootstepRecord {
public:

	struct AGPCharacter* CHARACTER; // 0x00(0x08)
	float LastPlayTime; // 0x08(0x04)
	enum class EGPAudioFootSoundType LastFootstepType; // 0x0c(0x01)
	bool bDistanceAllowFakeFootstep; // 0x0d(0x01)
	enum class EFakeFootstepStatus FakeFootstepStatus; // 0x0e(0x01)
	char pad_F[0x21]; // 0x0f(0x21)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.FootstepAudioConfigRow
// Size: 0xf0 (Inherited: 0x10)
struct FFootstepAudioConfigRow : public FDescRowBase {
public:

	struct TMap<enum class EGPAudioFootSoundType, float> FootstepStateLength; // 0x10(0x50)
	struct TMap<enum class EGPAudioFootSoundType, float> AIFootstepStateLength; // 0x60(0x50)
	int32_t bUseFakeFootStepAnimLOD; // 0xb0(0x04)
	float EnableFakeFootstepDistance; // 0xb4(0x04)
	float DisableFakeFootstepDistance; // 0xb8(0x04)
	float EnableFakeFootstepDistanceMP; // 0xbc(0x04)
	float DisableFakeFootstepDistanceMP; // 0xc0(0x04)
	struct FName WaterRTPCName; // 0xc4(0x08)
	float MinWaterFootstepRTPCValue; // 0xcc(0x04)
	float MaxWaterFootstepRTPCValue; // 0xd0(0x04)
	float JumpLowHeight; // 0xd4(0x04)
	float JumpMiddleHeight; // 0xd8(0x04)
	float JumpHighHeight; // 0xdc(0x04)
	float AICrackTriggerCDTimeMin; // 0xe0(0x04)
	float AICrackTriggerCDTimeMax; // 0xe4(0x04)
	float FlybyTriggerCDTimeMin; // 0xe8(0x04)
	float FlybyTriggerCDTimeMax; // 0xec(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AudioSubtitleInfo
// Size: 0x38 (Inherited: 0x00)
struct FAudioSubtitleInfo {
public:

	struct FText SubtitleText; // 0x00(0x18)
	struct UGPAudioEventAsset* AudioEvent; // 0x18(0x08)
	enum class ESubtitlePriorityType SubtitlePriority; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float SubtitleShowingDuration; // 0x24(0x04)
	enum class ESubtitleHudType HUDType; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct AActor* SpeakerActor; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIDialogSubtitleTableItem
// Size: 0x48 (Inherited: 0x10)
struct FAIDialogSubtitleTableItem : public FDescRowBase {
public:

	struct FText SubtitleText; // 0x10(0x18)
	struct UGPAudioEventAsset* AudioEvent; // 0x28(0x08)
	struct FString Comment; // 0x30(0x10)
	float DisplayDistance; // 0x40(0x04)
	float SubtitleDuring; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ServerPlayerFullDataInfo
// Size: 0x58 (Inherited: 0x00)
struct FServerPlayerFullDataInfo {
public:

	struct AGPNetworkPlayerController* LocalPlayerController; // 0x00(0x08)
	struct AAIController* LocalAIController; // 0x08(0x08)
	bool IsAI; // 0x10(0x01)
	bool isAILabAI; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct AGPCharacterBase* LocalPlayerPawn; // 0x18(0x08)
	struct AController* LocalFocusPlayer; // 0x20(0x08)
	struct AGPCharacterBase* LocalFocusPlayerPawn; // 0x28(0x08)
	struct AActor* LastLocalFocusActor; // 0x30(0x08)
	struct AActor* LocalFocusActor; // 0x38(0x08)
	int32_t CurrentSpectateIndex; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct AController*> CurrentSpectatingMePlayers; // 0x48(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CalcPlayerViewInfo
// Size: 0x10 (Inherited: 0x00)
struct FCalcPlayerViewInfo {
public:

	struct FRotator PlayerRot; // 0x00(0x0c)
	float ServerAccTimeStamp; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CameraMovementWhenBeHitConfig
// Size: 0x30 (Inherited: 0x10)
struct FCameraMovementWhenBeHitConfig : public FDescRowBase {
public:

	int32_t CameraMoveRecID; // 0x10(0x04)
	float CameraVerticalMoveValue; // 0x14(0x04)
	float CameraHorizontalMoveValue; // 0x18(0x04)
	float CameraMoveEaseTime; // 0x1c(0x04)
	enum class EGPWeaponEasingType CameraMoveEaseType; // 0x20(0x01)
	bool bRecoverCameraMoveEase; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	float CameraShakeFactor; // 0x24(0x04)
	struct UCurveFloat* CurveModifyFactor; // 0x28(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterStateAudioEventConfig
// Size: 0x30 (Inherited: 0x00)
struct FCharacterStateAudioEventConfig {
public:

	enum class EStateAudioEventType StateAudioEventType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t Priority; // 0x04(0x04)
	struct UGPAudioEventAsset* StateAudioEventAsset; // 0x08(0x08)
	struct TArray<enum class EDFMGamePlayMode> EffectiveGamePlayModes; // 0x10(0x10)
	struct FString StateName; // 0x20(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterStateAudioEventConfigRow
// Size: 0x50 (Inherited: 0x10)
struct FCharacterStateAudioEventConfigRow : public FDescRowBase {
public:

	enum class EStateAudioEventType StateAudioEventType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32_t Priority; // 0x14(0x04)
	struct FSoftObjectPath StateAudioEventAsset; // 0x18(0x18)
	struct FString StateName; // 0x30(0x10)
	struct TArray<enum class EDFMGamePlayMode> EffectiveGamePlayModes; // 0x40(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ExpertVoiceTableRow
// Size: 0x30 (Inherited: 0x10)
struct FExpertVoiceTableRow : public FDescRowBase {
public:

	int64_t ExpertId; // 0x10(0x08)
	struct FSoftObjectPath ExpertSpeakConfigTablePath; // 0x18(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterSpeakItemInfo
// Size: 0x110 (Inherited: 0x10)
struct FCharacterSpeakItemInfo : public FDescRowBase {
public:

	enum class ECharacterAudioType AudioType; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString AudioTypeString; // 0x18(0x10)
	enum class ECharacterAudioPlayMode PlayMode; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct TArray<enum class EDFMGamePlayMode> EffectiveGamePlayModes; // 0x30(0x10)
	bool bNotifyServer; // 0x40(0x01)
	bool bEnableInSOL; // 0x41(0x01)
	bool bFake3P; // 0x42(0x01)
	bool bAllowTriggerWhenDie; // 0x43(0x01)
	bool bAllowTriggerWhenImpendingDeath; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float TriggerDistance; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<enum class ECharacterAudioListener> SpeakNeedPlayers; // 0x50(0x10)
	struct TArray<enum class ECharacterAudioListener> ListenerArray; // 0x60(0x10)
	struct TArray<enum class ECharacterAudioListener> RandomSpeakers; // 0x70(0x10)
	bool bTriggerByTeamRadio; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float CdTime; // 0x84(0x04)
	int32_t Priority; // 0x88(0x04)
	bool bCanBeInterrupt; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	float MaxWaitingTime; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
	struct FString StateEventToClear; // 0x98(0x10)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char AudioAsset[0x28]; // 0xa8(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char AudioStopAsset[0x28]; // 0xd0(0x28)
	bool bUseRandomEvent; // 0xf8(0x01)
	char pad_F9[0x3]; // 0xf9(0x03)
	int32_t AvoidRepeatNum; // 0xfc(0x04)
	/*struct TArray<struct TSoftObjectPtr<UGPAudioEventAsset>>*/char RandomEventsPool[0x10]; // 0x100(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharOutLineEffectData
// Size: 0x14 (Inherited: 0x00)
struct FCharOutLineEffectData {
public:

	int32_t OutLineEffectBitArry; // 0x00(0x04)
	int32_t ProxSensorMarkKey; // 0x04(0x04)
	int32_t PenetratingGunMarkKey; // 0x08(0x04)
	int32_t BreakthroughDefenderMarkKey; // 0x0c(0x04)
	int32_t OnlyMarkerMarkKey; // 0x10(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharMarkerData
// Size: 0x18 (Inherited: 0x00)
struct FCharMarkerData {
public:

	bool Active; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t OwnerCampID; // 0x04(0x04)
	int32_t OwnerTeamID; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	uint64_t OwnerUin; // 0x10(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterTableName
// Size: 0x01 (Inherited: 0x00)
struct FCharacterTableName {
public:

	char pad_0[0x1]; // 0x00(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPCollisionManager
// Size: 0x38 (Inherited: 0x00)
struct FGPCollisionManager {
public:

	struct UPrimitiveComponent* CapsuleComp; // 0x00(0x08)
	struct UPrimitiveComponent* ProneComp; // 0x08(0x08)
	struct TArray<struct FGPCollisionInfoSimple> ActivateProneCollisionState; // 0x10(0x10)
	struct TArray<struct FGPCollisionInfoSimple> ActivateCapsuleCollisionState; // 0x20(0x10)
	char pad_30[0x8]; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPCollisionInfoSimple
// Size: 0x08 (Inherited: 0x00)
struct FGPCollisionInfoSimple {
public:

	enum class ECollisionState State; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t Priority; // 0x04(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPCollisionItem
// Size: 0x48 (Inherited: 0x10)
struct FGPCollisionItem : public FDescRowBase {
public:

	enum class ECollisionState State; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32_t Priority; // 0x14(0x04)
	struct FName ColliisonProfile; // 0x18(0x08)
	enum class ECollisionChannel ObjectType; // 0x20(0x01)
	enum class ECollisionEnabled CollisionEnabled; // 0x21(0x01)
	struct FCollisionResponseContainer ResponseToChannels; // 0x22(0x20)
	bool NeedActivate; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ReplayNetworkGUID
// Size: 0x10 (Inherited: 0x00)
struct FReplayNetworkGUID {
public:

	uint32_t RawValue; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterMovementLogInfo
// Size: 0x138 (Inherited: 0x00)
struct FCharacterMovementLogInfo {
public:

	struct ACHARACTER* OwnerCharacter; // 0x00(0x08)
	struct UCharacterMovementComponent* MovementComponent; // 0x08(0x08)
	struct UPrimitiveComponent* Base; // 0x10(0x08)
	char pad_18[0x120]; // 0x18(0x120)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ClientAdjustPositionInfo
// Size: 0x60 (Inherited: 0x00)
struct FClientAdjustPositionInfo {
public:

	struct ACHARACTER* OwnerCharacter; // 0x00(0x08)
	struct UPrimitiveComponent* NewBase; // 0x08(0x08)
	char pad_10[0x50]; // 0x10(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RepOverrideMovementInfo
// Size: 0x02 (Inherited: 0x00)
struct FRepOverrideMovementInfo {
public:

	bool EnableOverrideSpeedPose; // 0x00(0x01)
	enum class EOverrideMovementType CurrentOverridePose; // 0x01(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterMovementSpeedItemConfig
// Size: 0x30 (Inherited: 0x10)
struct FCharacterMovementSpeedItemConfig : public FDescRowBase {
public:

	int32_t SpeedID; // 0x10(0x04)
	float StandSilentWalkSpeed; // 0x14(0x04)
	float StandRunSpeed; // 0x18(0x04)
	float StandSprintSpeed; // 0x1c(0x04)
	float CrouchRunSpeed; // 0x20(0x04)
	float CrouchSilentWalkSpeed; // 0x24(0x04)
	float ProneMoveSpeed; // 0x28(0x04)
	float UsingItemSpeedFactor; // 0x2c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterMovementConstSpeedConfig
// Size: 0x58 (Inherited: 0x10)
struct FCharacterMovementConstSpeedConfig : public FDescRowBase {
public:

	int32_t SpeedID; // 0x10(0x04)
	float StandSilentWalkSpeed; // 0x14(0x04)
	float StandRunSpeed; // 0x18(0x04)
	float StandSprintSpeed; // 0x1c(0x04)
	float CrouchRunSpeed; // 0x20(0x04)
	float CrouchSilentWalkSpeed; // 0x24(0x04)
	float ProneMoveSpeed; // 0x28(0x04)
	float SuperSprintSpeed; // 0x2c(0x04)
	float StandPeekSpeedFactor; // 0x30(0x04)
	float CrouchPeekSpeedFactor; // 0x34(0x04)
	float StandFireSpeedFactor; // 0x38(0x04)
	float CrouchFireSpeedFactor; // 0x3c(0x04)
	float ProneFireSpeedFactor; // 0x40(0x04)
	float StandAimSpeedFactor; // 0x44(0x04)
	float CrouchAimSpeedFactor; // 0x48(0x04)
	float ProneAimSpeedFactor; // 0x4c(0x04)
	float PeekAimSpeedFactor; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterSpeedFactor
// Size: 0x34 (Inherited: 0x00)
struct FCharacterSpeedFactor {
public:

	float StandPeekSpeedFactor; // 0x00(0x04)
	float CrouchPeekSpeedFactor; // 0x04(0x04)
	float StandFireSpeedFactor; // 0x08(0x04)
	float CrouchFireSpeedFactor; // 0x0c(0x04)
	float ProneFireSpeedFactor; // 0x10(0x04)
	float StandAimSpeedFactor; // 0x14(0x04)
	float CrouchAimSpeedFactor; // 0x18(0x04)
	float ProneAimSpeedFactor; // 0x1c(0x04)
	float UsingItemSpeedFactor; // 0x20(0x04)
	float StandHoldBreathSpeedFactor; // 0x24(0x04)
	float CrouchHoldBreathSpeedFactor; // 0x28(0x04)
	float ProneHoldBreathSpeedFactor; // 0x2c(0x04)
	float PeekAimSpeedFactor; // 0x30(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DeadInfo
// Size: 0x68 (Inherited: 0x00)
struct FDeadInfo {
public:

	bool bIsDead; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float DyingTime; // 0x04(0x04)
	float DeadTime; // 0x08(0x04)
	bool bMoving; // 0x0c(0x01)
	char pad_D[0x2]; // 0x0d(0x02)
	enum class EDirection DeathDirection; // 0x0f(0x01)
	enum class EChracterPoseType DeathPose; // 0x10(0x01)
	enum class EDamageType DeathDamageType; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float AngleFromShotDir; // 0x14(0x04)
	struct FVector RawShotDir; // 0x18(0x0c)
	struct FName ShotBone; // 0x24(0x08)
	struct FVector RawShotPos; // 0x2c(0x0c)
	uint64_t KillerUin; // 0x38(0x08)
	uint64_t KillerGUID; // 0x40(0x08)
	float DeathAnimDelayTime; // 0x48(0x04)
	struct TWeakObjectPtr<struct AWeaponBase> SourceWeapon; // 0x4c(0x08)
	struct FVector DeathLoc; // 0x54(0x0c)
	float ServerDeadTime; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HitDownInfo
// Size: 0x30 (Inherited: 0x00)
struct FHitDownInfo {
public:

	struct FVector ShotDir; // 0x00(0x0c)
	struct FVector ShotLocation; // 0x0c(0x0c)
	struct FName ShotBone; // 0x18(0x08)
	uint64_t InstigatorUin; // 0x20(0x08)
	bool bIsSet; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PoseTransitionTime
// Size: 0x18 (Inherited: 0x00)
struct FPoseTransitionTime {
public:

	float StandToProneTransitionTime; // 0x00(0x04)
	float StandToCrouchTransitionTime; // 0x04(0x04)
	float CrouchToStandTransitionTime; // 0x08(0x04)
	float CrouchToProneTransitionTime; // 0x0c(0x04)
	float ProneToStandTransitionTime; // 0x10(0x04)
	float ProneToCrouchTransitionTime; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterPartBoneArray
// Size: 0x10 (Inherited: 0x00)
struct FCharacterPartBoneArray {
public:

	struct TArray<struct FName> BoneNameArray; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterPartDamageRateInfo
// Size: 0x18 (Inherited: 0x00)
struct FCharacterPartDamageRateInfo {
public:

	struct TArray<struct FName> BoneNameArray; // 0x00(0x10)
	float DamageRate; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RecvTimeDebugInfo
// Size: 0x68 (Inherited: 0x00)
struct FRecvTimeDebugInfo {
public:

	char pad_0[0x68]; // 0x00(0x68)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPVerifyJumpInfo
// Size: 0x38 (Inherited: 0x00)
struct FGPVerifyJumpInfo {
public:

	bool bVerifyJumpHeight; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MaxJumpHeight; // 0x04(0x04)
	struct FVector Location; // 0x08(0x0c)
	struct FVector StartVelocity; // 0x14(0x0c)
	struct UPrimitiveComponent* MovementBase; // 0x20(0x08)
	struct FName BaseBoneName; // 0x28(0x08)
	bool bBaseRelativePosition; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationTableName
// Size: 0x01 (Inherited: 0x00)
struct FCommercializationTableName {
public:

	char pad_0[0x1]; // 0x00(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationWatchRow
// Size: 0xc0 (Inherited: 0x10)
struct FCommercializationWatchRow : public FDescRowBase {
public:

	struct TMap<struct FName, struct FCommercializationWatchResource> resource; // 0x10(0x50)
	struct TArray<struct FCommercializationWatchMaterialSettings> MaterialConfig; // 0x60(0x10)
	struct TMap<enum class ECharacterState, struct FCommercializationWatchStateSettings> StateConfig; // 0x70(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationWatchStateSettings
// Size: 0x60 (Inherited: 0x00)
struct FCommercializationWatchStateSettings {
public:

	char pad_0[0x8]; // 0x00(0x08)
	bool bPlayAudio; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float StateSwitchInterval; // 0x0c(0x04)
	struct TMap<struct FName, float> Settings; // 0x10(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationWatchMaterialSettings
// Size: 0x0c (Inherited: 0x00)
struct FCommercializationWatchMaterialSettings {
public:

	int32_t MaterialIndex; // 0x00(0x04)
	struct FName ParameterName; // 0x04(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationWatchResource
// Size: 0x38 (Inherited: 0x00)
struct FCommercializationWatchResource {
public:

	struct TArray<struct FCommercializationWatchTexture> Textures; // 0x00(0x10)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char Audio[0x28]; // 0x10(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationWatchTexture
// Size: 0x50 (Inherited: 0x00)
struct FCommercializationWatchTexture {
public:

	/*struct TSoftObjectPtr<UTexture>*/char TextureHD[0x28]; // 0x00(0x28)
	/*struct TSoftObjectPtr<UTexture>*/char TextureMobile[0x28]; // 0x28(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ShuffleList
// Size: 0x10 (Inherited: 0x00)
struct FShuffleList {
public:

	struct TArray<struct FName> List; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ItemData
// Size: 0x48 (Inherited: 0x00)
struct FItemData {
public:

	char pad_0[0x48]; // 0x00(0x48)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommercializationItemInfo
// Size: 0x18 (Inherited: 0x00)
struct FCommercializationItemInfo {
public:

	uint64_t HeroID; // 0x00(0x08)
	uint64_t ItemID; // 0x08(0x08)
	int64_t Slot; // 0x10(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SprayConfig
// Size: 0x34 (Inherited: 0x00)
struct FSprayConfig {
public:

	int32_t SortOrder; // 0x00(0x04)
	struct FVector DecalSizeHD; // 0x04(0x0c)
	struct FVector DecalSizeMobile; // 0x10(0x0c)
	float FadeInDuration; // 0x1c(0x04)
	float FadeOutStartDelay; // 0x20(0x04)
	float FadeOutDuration; // 0x24(0x04)
	float CharacterPaintDuration; // 0x28(0x04)
	float BoxTextureScale; // 0x2c(0x04)
	enum class ECollisionChannel SprayTraceChannel; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DecalSizeSetting
// Size: 0x18 (Inherited: 0x00)
struct FDecalSizeSetting {
public:

	struct FVector DecalSizeHD; // 0x00(0x0c)
	struct FVector DecalSizeMobile; // 0x0c(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SprayInfo
// Size: 0x3c (Inherited: 0x00)
struct FSprayInfo {
public:

	struct FName ResourceId; // 0x00(0x08)
	struct FRotator CameraRot; // 0x08(0x0c)
	struct FVector ImpactNormal; // 0x14(0x0c)
	struct FVector ImpactPoint; // 0x20(0x0c)
	struct TWeakObjectPtr<struct UPrimitiveComponent> Component; // 0x2c(0x08)
	struct FName BoneName; // 0x34(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SprayPaint
// Size: 0xe8 (Inherited: 0x00)
struct FSprayPaint {
public:

	struct FSoftObjectPath FPPMesh; // 0x00(0x18)
	struct FName FPPSocketName; // 0x18(0x08)
	struct FSoftObjectPath TPPMesh; // 0x20(0x18)
	struct FName TPPSocketName; // 0x38(0x08)
	/*struct TSoftObjectPtr<UAnimSequence>*/char FPPAnim[0x28]; // 0x40(0x28)
	/*struct TSoftObjectPtr<UAnimSequence>*/char TPPAnim[0x28]; // 0x68(0x28)
	/*struct TSoftObjectPtr<UAnimSequence>*/char TPPProneAnim[0x28]; // 0x90(0x28)
	float FPPVisibleTime; // 0xb8(0x04)
	float FPPHiddenTime; // 0xbc(0x04)
	float TPPVisibleTime; // 0xc0(0x04)
	float TPPHiddenTime; // 0xc4(0x04)
	float TPPProneVisibleTime; // 0xc8(0x04)
	float TPPProneHiddenTime; // 0xcc(0x04)
	struct FName EffectId; // 0xd0(0x08)
	struct FName EffectSocketName; // 0xd8(0x08)
	float ApplySprayTime; // 0xe0(0x04)
	float LifeSpan; // 0xe4(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterSpeakStatus
// Size: 0x90 (Inherited: 0x00)
struct FCharacterSpeakStatus {
public:

	char pad_0[0x90]; // 0x00(0x90)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DestructAnimationInfo
// Size: 0xa0 (Inherited: 0x00)
struct FDestructAnimationInfo {
public:

	/*struct TSoftObjectPtr<UAnimationAsset>*/char BreakableAnimPath_Forward[0x28]; // 0x00(0x28)
	/*struct TSoftObjectPtr<UAnimationAsset>*/char BreakableAnimPath_Back[0x28]; // 0x28(0x28)
	/*struct TSoftObjectPtr<UAnimationAsset>*/char BreakableAnimPath_Left[0x28]; // 0x50(0x28)
	/*struct TSoftObjectPtr<UAnimationAsset>*/char BreakableAnimPath_Right[0x28]; // 0x78(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.NPCHitMontageSectionName
// Size: 0x18 (Inherited: 0x00)
struct FNPCHitMontageSectionName {
public:

	float NPCHPRateLowerLimit; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString MontageSectionName; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ExplosionTypeInfo
// Size: 0x10 (Inherited: 0x00)
struct FExplosionTypeInfo {
public:

	float OuterDistance; // 0x00(0x04)
	float TotalTime; // 0x04(0x04)
	struct UClass* CameraShakeType; // 0x08(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPFootIKInstanceProxy
// Size: 0x7e0 (Inherited: 0x748)
struct FGPFootIKInstanceProxy : public FAnimInstanceProxy {
public:

	bool bEnableFootIK; // 0x748(0x01)
	char pad_749[0x3]; // 0x749(0x03)
	float FootIKAlpha; // 0x74c(0x04)
	struct FVector LeftFootOffset; // 0x750(0x0c)
	struct FRotator LeftFootRotOffset; // 0x75c(0x0c)
	struct FVector RightFootOffset; // 0x768(0x0c)
	struct FRotator RightFootRotOffset; // 0x774(0x0c)
	struct FVector BipOffset; // 0x780(0x0c)
	char pad_78C[0x4]; // 0x78c(0x04)
	struct AGPCharacterBase* OwnerPawn; // 0x790(0x08)
	char pad_798[0x48]; // 0x798(0x48)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPFSMNetworkedTransaction
// Size: 0x38 (Inherited: 0x00)
struct FGPFSMNetworkedTransaction {
public:

	struct TArray<struct FGuid> FromStateGuids; // 0x00(0x10)
	struct TArray<struct FGuid> NowStateGuids; // 0x10(0x10)
	struct FGuid TransactionGuid; // 0x20(0x10)
	struct FDateTime Timestamp; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageRecordViewItemNameMap
// Size: 0x10 (Inherited: 0x00)
struct FDamageRecordViewItemNameMap {
public:

	uint64_t Uin; // 0x00(0x08)
	struct FName ActorName; // 0x08(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DamageRecordViewItem
// Size: 0x110 (Inherited: 0x00)
struct FDamageRecordViewItem {
public:

	struct FName MakerInstigatorPlayerName; // 0x00(0x08)
	struct FText MakerInstigatorPlayerNameTEXT; // 0x08(0x18)
	uint64_t MakerInstigatorUin; // 0x20(0x08)
	uint64_t MakerGUID; // 0x28(0x08)
	struct FName TakerInstigatorPlayerName; // 0x30(0x08)
	struct FText TakerInstigatorPlayerNameTEXT; // 0x38(0x18)
	uint64_t TakerUin; // 0x50(0x08)
	int64_t MakerInstigatorRankMatchScore; // 0x58(0x08)
	bool MakerIsRobotAI; // 0x60(0x01)
	bool MakerIsAILabAI; // 0x61(0x01)
	char pad_62[0x2]; // 0x62(0x02)
	float Distance; // 0x64(0x04)
	uint64_t FireId; // 0x68(0x08)
	uint64_t WeaponID; // 0x70(0x08)
	uint64_t AmmoId; // 0x78(0x08)
	uint64_t BuffId; // 0x80(0x08)
	uint64_t ArmorItemId; // 0x88(0x08)
	float TakerHealthPercent; // 0x90(0x04)
	float TakerHealthMax; // 0x94(0x04)
	float TakerBaseHealthMax; // 0x98(0x04)
	float ArmorHealth; // 0x9c(0x04)
	float ArmorHealthMax; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	uint64_t AttackerValueId; // 0xa8(0x08)
	int32_t AttackerLevel; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	uint64_t SkillId; // 0xb8(0x08)
	char DamagePart; // 0xc0(0x01)
	char CharacterPart; // 0xc1(0x01)
	char pad_C2[0x2]; // 0xc2(0x02)
	float Damage; // 0xc4(0x04)
	float ArmorDamage; // 0xc8(0x04)
	float HelmetArmorDamage; // 0xcc(0x04)
	float BodyArmorDamage; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct TArray<char> CharacterParts; // 0xd8(0x10)
	float MaxDamage; // 0xe8(0x04)
	float ServerTimeSeconds; // 0xec(0x04)
	bool bAttacker; // 0xf0(0x01)
	char pad_F1[0x3]; // 0xf1(0x03)
	float AttackerWeaponBulletConfigHPDamage; // 0xf4(0x04)
	float AttackerWeaponBulletConfigArmorDamage; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	uint64_t MakerHeroId; // 0x100(0x08)
	uint64_t TakerHeroId; // 0x108(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterArray
// Size: 0x10 (Inherited: 0x00)
struct FCharacterArray {
public:

	struct TArray<struct ACHARACTER*> Characters; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterPreSpawnRow
// Size: 0x18 (Inherited: 0x08)
struct FCharacterPreSpawnRow : public FTableRowBase {
public:

	struct TArray<struct FCharacterPreSpawnInfo> SpawnInfos; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterPreSpawnInfo
// Size: 0x38 (Inherited: 0x00)
struct FCharacterPreSpawnInfo {
public:

	/*struct TSoftClassPtr<UObject>*/char Class[0x28]; // 0x00(0x28)
	int32_t Num; // 0x28(0x04)
	struct FVector Location; // 0x2c(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPGameModeMissionConfig
// Size: 0x20 (Inherited: 0x00)
struct FGPGameModeMissionConfig {
public:

	struct TArray<struct FSoftObjectPath> MissionPersistentLevelS; // 0x00(0x10)
	struct TArray<struct FString> MissionDirs; // 0x10(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPGameplayAttribute
// Size: 0x38 (Inherited: 0x00)
struct FGPGameplayAttribute {
public:

	struct FString AttributeName; // 0x00(0x10)
	/*struct TFieldPath<FNone>*/char Attribute[0x20]; // 0x10(0x20)
	struct UClass* AttributeOwner; // 0x30(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPGameplayAttributeData
// Size: 0x18 (Inherited: 0x00)
struct FGPGameplayAttributeData {
public:

	char pad_0[0x10]; // 0x00(0x10)
	float BaseValue; // 0x10(0x04)
	float CurrentValue; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.FastRescueResouce
// Size: 0x80 (Inherited: 0x00)
struct FFastRescueResouce {
public:

	struct UAnimSequence* RescueSomeoneClipFPP_Fast; // 0x00(0x08)
	struct UAnimSequence* RescueSomeoneClipFPP_FastLoop; // 0x08(0x08)
	struct UAnimSequence* RescueSomeoneClipFPP_FastEnd; // 0x10(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_Fast; // 0x18(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_FastLoop; // 0x20(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_FastEnd; // 0x28(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_CrouchFast; // 0x30(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_CrouchFastLoop; // 0x38(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_CrouchFastEnd; // 0x40(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_ProneFast; // 0x48(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_ProneFastLoop; // 0x50(0x08)
	struct UAnimSequence* RescueSomeoneClipTPP_ProneFastEnd; // 0x58(0x08)
	struct FName ItemKey; // 0x60(0x08)
	struct FName ItemKeyBody; // 0x68(0x08)
	struct FName ItemKeyScop; // 0x70(0x08)
	struct FName FastRecueSocket; // 0x78(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PreStateRTTInfo
// Size: 0x18 (Inherited: 0x00)
struct FPreStateRTTInfo {
public:

	enum class EFSMCharacterState CharacterState; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<enum class ECharacterStateMask> CharacterStateMaskArray; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.LODInfoArray
// Size: 0x10 (Inherited: 0x00)
struct FLODInfoArray {
public:

	struct TArray<float> LODInfos; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPRadarCheckParams
// Size: 0x18 (Inherited: 0x00)
struct FGPRadarCheckParams {
public:

	struct TArray<struct FName> NameOfSocketsToProject; // 0x00(0x10)
	int32_t MinExposedSocketNumber; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPRadarInfo
// Size: 0x10 (Inherited: 0x00)
struct FGPRadarInfo {
public:

	char pad_0[0x10]; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPZiplineActorInfo
// Size: 0xc0 (Inherited: 0x00)
struct FGPZiplineActorInfo {
public:

	struct AZiplineInteractorActor* CurrentZiplineActor; // 0x00(0x08)
	struct FVector DraftGearLocation; // 0x08(0x0c)
	struct FRotator DraftGearRotation; // 0x14(0x0c)
	struct FRotator LockGearRotation; // 0x20(0x0c)
	float DraftGearDistance; // 0x2c(0x04)
	float DraftGearRoll; // 0x30(0x04)
	float DraftGearLineLength; // 0x34(0x04)
	float CurrentMoveSpeed; // 0x38(0x04)
	struct FVector CurrentZiplineLocation; // 0x3c(0x0c)
	struct FRotator CurrentZiplineRotation; // 0x48(0x0c)
	float ZiplineLengthHasMoved; // 0x54(0x04)
	bool bLerpVerticalRotationFinished; // 0x58(0x01)
	bool bLerpHorizontalRotationFinished; // 0x59(0x01)
	bool bLerpRotationFinished; // 0x5a(0x01)
	bool bLerpLocationFinished; // 0x5b(0x01)
	bool bEnterIsGreen; // 0x5c(0x01)
	bool bCurrentIsInGreenStartArea; // 0x5d(0x01)
	bool bCurrentIsInRedStartArea; // 0x5e(0x01)
	bool bCurrentIsInSegmentArea; // 0x5f(0x01)
	enum class EEndZiplineReason GetOffZiplineReason; // 0x60(0x01)
	bool bCollisionCheckEnabled; // 0x61(0x01)
	char pad_62[0x2]; // 0x62(0x02)
	int32_t ZiplineTriggerEnterCount; // 0x64(0x04)
	bool bCollisionDetected; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct TWeakObjectPtr<struct AActor> CollidedActor; // 0x6c(0x08)
	struct FVector CollisionDropDirection; // 0x74(0x0c)
	struct FVector LerpTargetLocation; // 0x80(0x0c)
	struct FRotator LerpTargetRotation; // 0x8c(0x0c)
	struct FVector GetOffZiplineVelocity; // 0x98(0x0c)
	float CurrentDraftGearOffset; // 0xa4(0x04)
	float ClientMovedLength; // 0xa8(0x04)
	float ServerWaitTime; // 0xac(0x04)
	struct FVector ServerLocation; // 0xb0(0x0c)
	char pad_BC[0x4]; // 0xbc(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPZiplineSimulatedInfo
// Size: 0x40 (Inherited: 0x00)
struct FGPZiplineSimulatedInfo {
public:

	struct AZiplineInteractorActor* CurrentZiplineActor; // 0x00(0x08)
	bool bEnterIsGreen; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float CurrentDraftGearOffset; // 0x0c(0x04)
	struct FVector DraftGearLocation; // 0x10(0x0c)
	struct FRotator DraftGearRotation; // 0x1c(0x0c)
	float DraftGearRoll; // 0x28(0x04)
	float DraftGearLineLength; // 0x2c(0x04)
	struct FRotator LockGearRotation; // 0x30(0x0c)
	char pad_3C[0x4]; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPZiplineInfo
// Size: 0xa0 (Inherited: 0x00)
struct FGPZiplineInfo {
public:

	float ServerAllowPercentError; // 0x00(0x04)
	float ZiplineCollisionDropSpeed; // 0x04(0x04)
	float ZiplineEndDropSpeed; // 0x08(0x04)
	float ZiplineCancelDropSpeed; // 0x0c(0x04)
	float ZiplineJumpDropUpVerticalSpeed; // 0x10(0x04)
	float ZiplineMoveMaxSpeed; // 0x14(0x04)
	float ZiplineMoveStartSpeed; // 0x18(0x04)
	float ZiplineMoveSpeedAcc; // 0x1c(0x04)
	float LerpLocationSpeed; // 0x20(0x04)
	float LerpRotationSpeed; // 0x24(0x04)
	float SweepDistance; // 0x28(0x04)
	float SweepBeginDelayTime; // 0x2c(0x04)
	struct UGPAudioEventAsset* StartLoopZiplineVoice; // 0x30(0x08)
	struct UGPAudioEventAsset* EndZiplineVoice; // 0x38(0x08)
	struct UGPAudioEventAsset* StartLoopVerticalZiplineVoice; // 0x40(0x08)
	struct UGPAudioEventAsset* EndVerticalZiplineVoice; // 0x48(0x08)
	struct FName ZiplineRTPCName; // 0x50(0x08)
	/*struct TSoftObjectPtr<UMaterialInstance>*/char ZiplineScreenEffectMI[0x28]; // 0x58(0x28)
	struct FName AttachSocketName; // 0x80(0x08)
	float CouplerLineSlerp; // 0x88(0x04)
	float ServerClientDistanceTolerance; // 0x8c(0x04)
	float ServerWaitClientTime; // 0x90(0x04)
	float ServerUseClientLocErrorTolerance; // 0x94(0x04)
	float CooldownAfterArrived; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPLocomotionJumpInfo
// Size: 0x30 (Inherited: 0x00)
struct FGPLocomotionJumpInfo {
public:

	float FallVelocityThreshold_Low; // 0x00(0x04)
	float FallVelocityThreshold_High; // 0x04(0x04)
	float FallVelocityThreshold_VeryHigh; // 0x08(0x04)
	float FallVelocityThreshold_Kill; // 0x0c(0x04)
	float FallDamagePercent_High; // 0x10(0x04)
	float FallDamagePercent_VeryHigh; // 0x14(0x04)
	float FallVelocityThresholdForAnimation_High; // 0x18(0x04)
	float JumpNearGroundThreashold; // 0x1c(0x04)
	float HealthMAX; // 0x20(0x04)
	float OwnerHalfHeight; // 0x24(0x04)
	float OwnerRadius; // 0x28(0x04)
	float JumpDetectRadiusAdd; // 0x2c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPGameRuleSetting
// Size: 0x78 (Inherited: 0x00)
struct FGPGameRuleSetting {
public:

	enum class EDFMGamePlayMode StartSpotAllocatorType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName UIDataTableType; // 0x04(0x08)
	struct FName UIDataTableTypeHDOverride; // 0x0c(0x08)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString LuaHudTableName; // 0x18(0x10)
	struct FString LuaBaseHudTableName; // 0x28(0x10)
	struct TArray<struct FString> PersistentLevelName; // 0x38(0x10)
	struct UClass* RulePawn; // 0x48(0x08)
	struct TArray<struct UClass*> RuleInvalidCharacterComponentArray; // 0x50(0x10)
	struct TArray<struct UClass*> RuleSubsystemClass; // 0x60(0x10)
	float ReviveGodModeTime; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DSTickInfo
// Size: 0x08 (Inherited: 0x00)
struct FDSTickInfo {
public:

	int32_t NetServerMaxTickRate; // 0x00(0x04)
	float FastNetTickSeconds; // 0x04(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AllPlayerLoadLevelCompletedInfo
// Size: 0x0c (Inherited: 0x00)
struct FAllPlayerLoadLevelCompletedInfo {
public:

	struct FName CheckLoadLevelReason; // 0x00(0x08)
	bool HasAllPlayerLoadLevelCompleted; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectInfo
// Size: 0x30 (Inherited: 0x00)
struct FSpectInfo {
public:

	struct TArray<struct FSpectMemberInfo> MemberInfoList; // 0x00(0x10)
	uint64_t SpectUni; // 0x10(0x08)
	struct FString PlayerName; // 0x18(0x10)
	int32_t PlayerLevel; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectMemberInfo
// Size: 0x50 (Inherited: 0x00)
struct FSpectMemberInfo {
public:

	struct FString PlayerName; // 0x00(0x10)
	uint64_t PlayerUni; // 0x10(0x08)
	struct FString RankName1; // 0x18(0x10)
	struct FString RankName2; // 0x28(0x10)
	int32_t RankScore; // 0x38(0x04)
	int32_t TotalKilled; // 0x3c(0x04)
	int32_t TotalGames; // 0x40(0x04)
	float GamesRate; // 0x44(0x04)
	int32_t Level; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.NiceInfo
// Size: 0x10 (Inherited: 0x00)
struct FNiceInfo {
public:

	uint64_t PlayerUni; // 0x00(0x08)
	bool bNice; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectFashionMesh
// Size: 0x10 (Inherited: 0x00)
struct FSpectFashionMesh {
public:

	struct TArray<struct FName> AllMesh; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.FadeInfo
// Size: 0x24 (Inherited: 0x00)
struct FFadeInfo {
public:

	struct FName FadeUITextKeyName; // 0x00(0x08)
	bool ShouldShowFadeUI; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float FadeInAlpha; // 0x0c(0x04)
	float FadeInTime; // 0x10(0x04)
	float FadeOutTime; // 0x14(0x04)
	float DelayOutTime; // 0x18(0x04)
	float MinFadeTime; // 0x1c(0x04)
	float Timeout; // 0x20(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GameMapIdRow
// Size: 0x38 (Inherited: 0x10)
struct FGameMapIdRow : public FDescRowBase {
public:

	int32_t GameMapId; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString MapTypeDes; // 0x18(0x10)
	struct FString MapDes; // 0x28(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.FadeUITextRow
// Size: 0x78 (Inherited: 0x10)
struct FFadeUITextRow : public FDescRowBase {
public:

	struct FName FadeUITextKeyName; // 0x10(0x08)
	struct FText Title; // 0x18(0x18)
	struct FText SubTitle1; // 0x30(0x18)
	struct FText SubTitle2; // 0x48(0x18)
	struct FText Text; // 0x60(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GameModeTypeRow
// Size: 0x40 (Inherited: 0x10)
struct FGameModeTypeRow : public FDescRowBase {
public:

	int32_t ServerGameModeType; // 0x10(0x04)
	int32_t MainGameModeType; // 0x14(0x04)
	int32_t SubGameModeType; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FString Des; // 0x20(0x10)
	struct FString WeaponParamsPath; // 0x30(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GameTeamMemberCountTypeRow
// Size: 0x28 (Inherited: 0x10)
struct FGameTeamMemberCountTypeRow : public FDescRowBase {
public:

	int32_t GameTeamMemberCountType; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Des; // 0x18(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GameRoomTypeRow
// Size: 0x28 (Inherited: 0x10)
struct FGameRoomTypeRow : public FDescRowBase {
public:

	int32_t GameRoomType; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Des; // 0x18(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPHandIKInstanceProxy
// Size: 0x7c0 (Inherited: 0x748)
struct FGPHandIKInstanceProxy : public FAnimInstanceProxy {
public:

	bool bUsePreHandIK; // 0x748(0x01)
	enum class EHandIKType WeaponIKType; // 0x749(0x01)
	char pad_74A[0x2]; // 0x74a(0x02)
	struct FVector LeftHandJointLoc; // 0x74c(0x0c)
	struct FVector LeftHandEffectLoc; // 0x758(0x0c)
	struct FVector RightHandJointLoc; // 0x764(0x0c)
	struct FVector ZoomHandOffsetVector; // 0x770(0x0c)
	bool bIsCameraZooming; // 0x77c(0x01)
	bool bShouldCopyIKGun; // 0x77d(0x01)
	char pad_77E[0x2]; // 0x77e(0x02)
	float ZoomHandOffsetBlendOut; // 0x780(0x04)
	float LeftArmIKAlpha; // 0x784(0x04)
	float RightArmIKAlpha; // 0x788(0x04)
	bool bDualWeapon; // 0x78c(0x01)
	char pad_78D[0x3]; // 0x78d(0x03)
	struct AGPCharacterBase* OwnerPawn; // 0x790(0x08)
	struct AWeaponBase* CurWeapon; // 0x798(0x08)
	struct UGPCameraModeComponent* CameraModeComponent; // 0x7a0(0x08)
	bool bWeaponDisableIK; // 0x7a8(0x01)
	bool bEnableHandIK; // 0x7a9(0x01)
	bool bOnVehicle; // 0x7aa(0x01)
	bool bDisableHandIK; // 0x7ab(0x01)
	int32_t RecordGripOrder; // 0x7ac(0x04)
	bool bRecordUnderFPP; // 0x7b0(0x01)
	char pad_7B1[0xf]; // 0x7b1(0x0f)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HitPartInfo
// Size: 0x28 (Inherited: 0x00)
struct FHitPartInfo {
public:

	struct FName HitBoneName; // 0x00(0x08)
	float DamageScale; // 0x08(0x04)
	enum class EHitGroupType HitGroup; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FGameplayTag HitGroupTag; // 0x10(0x08)
	float PveDamageScale; // 0x18(0x04)
	float PveRandRatio; // 0x1c(0x04)
	float HardStraightScale; // 0x20(0x04)
	bool bWeaknessGroup; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HotFixHelperDataInfo
// Size: 0x18 (Inherited: 0x00)
struct FHotFixHelperDataInfo {
public:

	struct AActor* HotFixActor; // 0x00(0x08)
	struct TArray<float> HotFixFloatArray; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HudDataLocSceneVehicleInfo
// Size: 0x20 (Inherited: 0x00)
struct FHudDataLocSceneVehicleInfo {
public:

	struct TArray<int32_t> NetUniqueIDArr; // 0x00(0x10)
	struct TArray<int32_t> RotYawArr; // 0x10(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HudDataLocCharacterInfo
// Size: 0x20 (Inherited: 0x00)
struct FHudDataLocCharacterInfo {
public:

	struct TArray<int64_t> NetUniqueIDArr; // 0x00(0x10)
	struct TArray<int32_t> RotYawArr; // 0x10(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HudDataLocMsg
// Size: 0x10 (Inherited: 0x00)
struct FHudDataLocMsg {
public:

	struct TArray<struct FVector> LocationArray; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPHudDataFastArray
// Size: 0x120 (Inherited: 0x108)
struct FGPHudDataFastArray : public FFastArraySerializer {
public:

	struct TArray<struct FGPHudData> Items; // 0x108(0x10)
	struct AGPHudDataReplicator* Owner; // 0x118(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HudDataLocSceneVehicle
// Size: 0x14 (Inherited: 0x00)
struct FHudDataLocSceneVehicle {
public:

	int32_t NetUniqueID; // 0x00(0x04)
	struct FVector_NetQuantize Loc; // 0x04(0x0c)
	int32_t RotYaw; // 0x10(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.HudDataLocCharacter
// Size: 0x18 (Inherited: 0x00)
struct FHudDataLocCharacter {
public:

	int64_t NetUniqueID; // 0x00(0x08)
	struct FVector_NetQuantize Loc; // 0x08(0x0c)
	int32_t RotYaw; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.InputDisableReasonSet
// Size: 0x50 (Inherited: 0x00)
struct FInputDisableReasonSet {
public:

	/*struct TSet<enum class EInputDisableReason>*/char InputDisableReasons[0x50]; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityKnockbackSettingConfig
// Size: 0x88 (Inherited: 0x00)
struct FAbilityKnockbackSettingConfig {
public:

	struct UCurveFloat* HeightCurve; // 0x00(0x08)
	struct UCurveFloat* MovePath; // 0x08(0x08)
	float RotLerpTime; // 0x10(0x04)
	float KnockDownTime; // 0x14(0x04)
	float GetUpTime; // 0x18(0x04)
	float InitZSpped; // 0x1c(0x04)
	float BlendInTime; // 0x20(0x04)
	float BlendOutTime; // 0x24(0x04)
	float GravityZ; // 0x28(0x04)
	float CheckFallingTime; // 0x2c(0x04)
	bool bForceRotateImmediate; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float FallingVelocityDecelerate; // 0x34(0x04)
	float KnockBackBodyLength; // 0x38(0x04)
	float KnockBackDownTime; // 0x3c(0x04)
	struct FName EnterPostProcessName; // 0x40(0x08)
	bool DisableCrouchInSimulation; // 0x48(0x01)
	bool bUseFullBodyAllOverride; // 0x49(0x01)
	char pad_4A[0x2]; // 0x4a(0x02)
	float SimulationAnimLoopAddTime; // 0x4c(0x04)
	struct TArray<struct FAbilityKnockbackRoleLoadConfig> RoleLoadConfigArray; // 0x50(0x10)
	int32_t FallingAttackValueId; // 0x60(0x04)
	struct FName GetUpEvent; // 0x64(0x08)
	float FallDownTime; // 0x6c(0x04)
	enum class EGPAudioFootSoundType FallDownFootSoundType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct TArray<int32_t> AddBuffs; // 0x78(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityKnockbackRoleLoadConfig
// Size: 0x0c (Inherited: 0x00)
struct FAbilityKnockbackRoleLoadConfig {
public:

	float CurrentMinLoad; // 0x00(0x04)
	float CurrentMaxLoad; // 0x04(0x04)
	float KnockBackTimeScale; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPLuaQuestData
// Size: 0x60 (Inherited: 0x00)
struct FGPLuaQuestData {
public:

	int64_t quest_id; // 0x00(0x08)
	int32_t quest_state; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	int64_t quest_accept_time; // 0x10(0x08)
	struct TArray<struct FGPLuaQuestObjectiveData> quest_objectives; // 0x18(0x10)
	struct TArray<int64_t> marked_objective_id; // 0x28(0x10)
	int64_t expire_time; // 0x38(0x08)
	bool marked; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FString map_marker; // 0x48(0x10)
	int64_t expire_left_time; // 0x58(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPLuaQuestObjectiveData
// Size: 0x30 (Inherited: 0x00)
struct FGPLuaQuestObjectiveData {
public:

	int64_t quest_objective_id; // 0x00(0x08)
	bool has_completed; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32_t Value; // 0x0c(0x04)
	bool has_marked; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	int64_t spent_seconds; // 0x18(0x08)
	int64_t required_count; // 0x20(0x08)
	bool accepted_state; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPMarkerColorConfigRow
// Size: 0x20 (Inherited: 0x08)
struct FGPMarkerColorConfigRow : public FTableRowBase {
public:

	enum class EGPMarkerColorType ColorType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FLinearColor LinearColor; // 0x0c(0x10)
	char pad_1C[0x4]; // 0x1c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerCoordinatedStruct
// Size: 0x70 (Inherited: 0x00)
struct FMarkerCoordinatedStruct {
public:

	struct AActor* MarkedActor; // 0x00(0x08)
	uint64_t ActorID; // 0x08(0x08)
	/*struct TSet<enum class EMarkerCoordinatedType>*/char CurMarkerCoordinatedTypes[0x50]; // 0x10(0x50)
	char pad_60[0x10]; // 0x60(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerItemCreateConfig
// Size: 0x50 (Inherited: 0x08)
struct FMarkerItemCreateConfig : public FTableRowBase {
public:

	struct UClass* MarkerItemClassBPClass; // 0x08(0x08)
	/*struct TSoftObjectPtr<UGPMarkerConfigDataAsset>*/char MarkerConfig[0x28]; // 0x10(0x28)
	struct TArray<enum class EDFMGamePlayMode> AllowCreateGameplayModes; // 0x38(0x10)
	uint64_t GameMarkerFeature; // 0x48(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingCharacterVoiceDataTableRow
// Size: 0x28 (Inherited: 0x10)
struct FMarkingCharacterVoiceDataTableRow : public FDescRowBase {
public:

	enum class EMarkingChatType MarkingType; // 0x10(0x01)
	bool bIsRespond; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct FString CharacterVoiceAudioString; // 0x18(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingChatMessageDataTableRow
// Size: 0x68 (Inherited: 0x10)
struct FMarkingChatMessageDataTableRow : public FDescRowBase {
public:

	enum class EMarkingChatType MarkingChatType; // 0x10(0x01)
	bool bIsRespond; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct TMap<struct FName, struct FName> Id2PresetChatIdMap; // 0x18(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingLocationTypeDataTableRow
// Size: 0x48 (Inherited: 0x10)
struct FMarkingLocationTypeDataTableRow : public FDescRowBase {
public:

	enum class EMarkingLocationType MarkingLocationType; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FSoftObjectPath MarkerIconPath; // 0x18(0x18)
	struct FText MarkerName; // 0x30(0x18)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingConfigDataTableRow
// Size: 0x1f8 (Inherited: 0x10)
struct FMarkingConfigDataTableRow : public FDescRowBase {
public:

	enum class EDFMGamePlayMode DFMGamePlayMode; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float MarkDetectDistance; // 0x14(0x04)
	struct FVector MarkLocationOffset; // 0x18(0x0c)
	char pad_24[0x4]; // 0x24(0x04)
	struct TMap<enum class EMarkingLocationType, float> LocationMarkerExistTimeMap; // 0x28(0x50)
	float MarkingMarkerAimCheckRadius; // 0x78(0x04)
	float MarkItemDistance; // 0x7c(0x04)
	struct FVector MarkItemOffset; // 0x80(0x0c)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct TMap<enum class EMarkingItemType, float> ItemMarkerExistTimeMap; // 0x90(0x50)
	float ItemRespondMarkerExistTime; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct UCurveFloat* MarkingExpandScalarCurve; // 0xe8(0x08)
	float MarkUnitDistance; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct TMap<int32_t, struct FUnitMarkingTimeCampConfig> UnitMarkerExistTimeMap; // 0xf8(0x50)
	int32_t MarkingEnemyMaxNum; // 0x148(0x04)
	int32_t MarkingNoneEnemyMaxNum; // 0x14c(0x04)
	float MarkEnemyTimeWindowLength; // 0x150(0x04)
	int32_t MarkEnemyLimitInTimeWindow; // 0x154(0x04)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char NormalLocationMarkAudio[0x28]; // 0x158(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char EnemyLocationMarkAudio[0x28]; // 0x180(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char ItemMarkAudio[0x28]; // 0x1a8(0x28)
	/*struct TSoftObjectPtr<UGPAudioEventAsset>*/char CancelMarkAudio[0x28]; // 0x1d0(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.UnitMarkingTimeCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FUnitMarkingTimeCampConfig {
public:

	struct TMap<enum class EMarkerCampType, float> MarkingTimeMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.UnitMarkingInfoStruct
// Size: 0x60 (Inherited: 0x00)
struct FUnitMarkingInfoStruct {
public:

	struct TMap<uint64_t, struct FUnitMarkingInfo> UnitMarkingInfoArray; // 0x00(0x50)
	bool MarkerOwnerStillExist; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	int32_t EnemyCampMarkerCount; // 0x54(0x04)
	int32_t NoneEnemyCampMarkerCount; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.UnitMarkingInfo
// Size: 0x58 (Inherited: 0x00)
struct FUnitMarkingInfo {
public:

	struct AGPCharacter* OwnerCharacter; // 0x00(0x08)
	struct AGPPlayerState* OwnerPlayerState; // 0x08(0x08)
	uint64_t OwnerPlayerUin; // 0x10(0x08)
	struct FVector MarkerWorldLocation; // 0x18(0x0c)
	char pad_24[0x4]; // 0x24(0x04)
	uint64_t MarkerUniqueId; // 0x28(0x08)
	enum class EGPMarkerClassType MarkerClassType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	int32_t markerType; // 0x34(0x04)
	struct AActor* MarkedActor; // 0x38(0x08)
	enum class EMarkerCampType ShowMarkerCamp; // 0x40(0x01)
	enum class EMarkerCampType MarkedActorCamp; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	float MarkTime; // 0x44(0x04)
	float ConfigValidTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	uint64_t CustomUniqueId; // 0x50(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingSubTypeMarkerItemStruct
// Size: 0x50 (Inherited: 0x00)
struct FMarkingSubTypeMarkerItemStruct {
public:

	struct TMap<char, struct UGPMarkerItemBase*> MarkingSubTypeMarkerItemMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.BubbleMarkingInfo
// Size: 0x38 (Inherited: 0x00)
struct FBubbleMarkingInfo {
public:

	struct AGPCharacter* OwnerCharacter; // 0x00(0x08)
	struct AGPPlayerState* OwnerPlayerState; // 0x08(0x08)
	uint64_t OwnerPlayerUin; // 0x10(0x08)
	uint64_t MarkerUniqueId; // 0x18(0x08)
	uint32_t markerType; // 0x20(0x04)
	enum class EQuickChatMarkingItemType QuickChatMarkingItemType; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct AActor* MarkedActor; // 0x28(0x08)
	float MarkTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.LocationMarkingInfo
// Size: 0x48 (Inherited: 0x00)
struct FLocationMarkingInfo {
public:

	struct AGPCharacter* OwnerCharacter; // 0x00(0x08)
	struct AGPPlayerState* OwnerPlayerState; // 0x08(0x08)
	uint64_t OwnerPlayerUin; // 0x10(0x08)
	struct FVector MarkingLocation; // 0x18(0x0c)
	struct FVector MarkingHitPlaneNormal; // 0x24(0x0c)
	struct FVector MarkerShowLocation; // 0x30(0x0c)
	enum class EMarkingLocationType MarkingLocationType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float MarkTime; // 0x40(0x04)
	float ConfigValidTime; // 0x44(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingBaseInfo
// Size: 0x30 (Inherited: 0x00)
struct FMarkingBaseInfo {
public:

	struct AGPCharacter* OwnerCharacter; // 0x00(0x08)
	struct AGPPlayerState* OwnerPlayerState; // 0x08(0x08)
	uint64_t OwnerPlayerUin; // 0x10(0x08)
	uint64_t MarkerUniqueId; // 0x18(0x08)
	float CurrentLeftTime; // 0x20(0x04)
	struct FVector MarkingLocation; // 0x24(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TransferMarkerUpdateConfig
// Size: 0x2c (Inherited: 0x00)
struct FTransferMarkerUpdateConfig {
public:

	bool bAllowShowDistance; // 0x00(0x01)
	bool bShowDistanceDefault; // 0x01(0x01)
	bool bShowDistanceWhenAiming; // 0x02(0x01)
	bool bHideDistanceWhenCovered; // 0x03(0x01)
	float MaxDistanceShowDistance; // 0x04(0x04)
	bool bHideDistanceWhenOutScreen; // 0x08(0x01)
	bool bEnableOpacityChange; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	float NormalOpacity; // 0x0c(0x04)
	float CoveredOpacity; // 0x10(0x04)
	float AimingOpacity; // 0x14(0x04)
	bool bOutScreenOverrideOpacity; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float OutScreenOverrideOpacity; // 0x1c(0x04)
	bool bAllowShowName; // 0x20(0x01)
	bool bShowNameDefault; // 0x21(0x01)
	bool bShowNameWhenAiming; // 0x22(0x01)
	bool bHideNameWhenCovered; // 0x23(0x01)
	float MaxNameShowDistance; // 0x24(0x04)
	bool bHideNameWhenOutScreen; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SectorAnchorMarkerUpdateConfig
// Size: 0x24 (Inherited: 0x00)
struct FSectorAnchorMarkerUpdateConfig {
public:

	bool bShowNumIconNotArmedIcon; // 0x00(0x01)
	bool bAllowShowDistance; // 0x01(0x01)
	bool bShowDistanceDefault; // 0x02(0x01)
	bool bShowDistanceWhenAiming; // 0x03(0x01)
	bool bHideDistanceWhenCovered; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float MaxDistanceShowDistance; // 0x08(0x04)
	bool bHideDistanceWhenOutScreen; // 0x0c(0x01)
	bool bEnableOpacityChange; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	float NormalOpacity; // 0x10(0x04)
	float CoveredOpacity; // 0x14(0x04)
	float AimingOpacity; // 0x18(0x04)
	bool bOutScreenOverrideOpacity; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float OutScreenOverrideOpacity; // 0x20(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMarkerTypeConfig
// Size: 0x14 (Inherited: 0x00)
struct FPlayerMarkerTypeConfig {
public:

	struct FVector2D MarkerOffset; // 0x00(0x08)
	struct FVector WorldLocationOffset; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FPlayerMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FPlayerMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMarkerUpdateConfig
// Size: 0x40 (Inherited: 0x00)
struct FPlayerMarkerUpdateConfig {
public:

	bool bShowSmallIconInner; // 0x00(0x01)
	bool bShowSmallIconMiddle; // 0x01(0x01)
	bool bShowSmallIconOuter; // 0x02(0x01)
	bool bAllowShowDistance; // 0x03(0x01)
	bool bShowDistanceDefault; // 0x04(0x01)
	bool bShowDistanceWhenAiming; // 0x05(0x01)
	bool bHideDistanceWhenCovered; // 0x06(0x01)
	char pad_7[0x1]; // 0x07(0x01)
	float MaxDistanceShowDistance; // 0x08(0x04)
	bool bHideDistanceWhenOutScreen; // 0x0c(0x01)
	bool bHideDistanceInner; // 0x0d(0x01)
	bool bHideDistanceMiddle; // 0x0e(0x01)
	bool bHideDistanceOuter; // 0x0f(0x01)
	bool bAllowShowName; // 0x10(0x01)
	bool bShowNameDefault; // 0x11(0x01)
	bool bShowNameWhenAiming; // 0x12(0x01)
	bool bHideNameWhenCovered; // 0x13(0x01)
	float MaxDistanceShowName; // 0x14(0x04)
	bool bHideNameWhenOutScreen; // 0x18(0x01)
	bool bHideNameInner; // 0x19(0x01)
	bool bHideNameMiddle; // 0x1a(0x01)
	bool bHideNameOuter; // 0x1b(0x01)
	bool bEnableOpacityChange; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float NormalOpacity; // 0x20(0x04)
	float CoveredOpacity; // 0x24(0x04)
	float AimingOpacity; // 0x28(0x04)
	float InnerOpacity; // 0x2c(0x04)
	float MiddleOpacity; // 0x30(0x04)
	float OuterOpacity; // 0x34(0x04)
	bool bOutScreenOverrideOpacity; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float OutScreenOverrideOpacity; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.EnemyEffectTypeConfig
// Size: 0x14 (Inherited: 0x00)
struct FEnemyEffectTypeConfig {
public:

	struct FVector2D MarkerOffset; // 0x00(0x08)
	struct FVector WorldLocationOffset; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.EnemyEffectMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FEnemyEffectMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FEnemyEffectMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.EnemyEffectMarkerUpdateConfig
// Size: 0x18 (Inherited: 0x00)
struct FEnemyEffectMarkerUpdateConfig {
public:

	bool bEnableOpacityChange; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float NormalOpacity; // 0x04(0x04)
	float CoveredOpacity; // 0x08(0x04)
	float AimingOpacity; // 0x0c(0x04)
	bool bOutScreenOverrideOpacity; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float OutScreenOverrideOpacity; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIWarnTypeConfig
// Size: 0x14 (Inherited: 0x00)
struct FAIWarnTypeConfig {
public:

	struct FVector2D MarkerOffset; // 0x00(0x08)
	struct FVector WorldLocationOffset; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIWarnMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FAIWarnMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FAIWarnMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIWarnMarkerUpdateConfig
// Size: 0x18 (Inherited: 0x00)
struct FAIWarnMarkerUpdateConfig {
public:

	bool bEnableOpacityChange; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float NormalOpacity; // 0x04(0x04)
	float CoveredOpacity; // 0x08(0x04)
	float AimingOpacity; // 0x0c(0x04)
	bool bOutScreenOverrideOpacity; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float OutScreenOverrideOpacity; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIBaseTypeConfig
// Size: 0x14 (Inherited: 0x00)
struct FAIBaseTypeConfig {
public:

	struct FVector2D MarkerOffset; // 0x00(0x08)
	struct FVector WorldLocationOffset; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIBaseMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FAIBaseMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FAIBaseMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AIBaseMarkerUpdateConfig
// Size: 0x20 (Inherited: 0x00)
struct FAIBaseMarkerUpdateConfig {
public:

	bool bAllowShowDistance; // 0x00(0x01)
	bool bShowDistanceDefault; // 0x01(0x01)
	bool bShowDistanceWhenAiming; // 0x02(0x01)
	bool bHideDistanceWhenCovered; // 0x03(0x01)
	float MaxDistanceShowDistance; // 0x04(0x04)
	bool bHideDistanceWhenOutScreen; // 0x08(0x01)
	bool bEnableOpacityChange; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	float NormalOpacity; // 0x0c(0x04)
	float CoveredOpacity; // 0x10(0x04)
	float AimingOpacity; // 0x14(0x04)
	bool bOutScreenOverrideOpacity; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float OutScreenOverrideOpacity; // 0x1c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TacticalEquipTypeConfig
// Size: 0x14 (Inherited: 0x00)
struct FTacticalEquipTypeConfig {
public:

	struct FVector2D MarkerOffset; // 0x00(0x08)
	struct FVector WorldLocationOffset; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TacticalEquipMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FTacticalEquipMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FTacticalEquipMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TacticalEquipMarkerUpdateConfig
// Size: 0x24 (Inherited: 0x00)
struct FTacticalEquipMarkerUpdateConfig {
public:

	bool bAllowShowHealth; // 0x00(0x01)
	bool bShowHealthDefault; // 0x01(0x01)
	bool bShowHealthWhenAiming; // 0x02(0x01)
	bool bHideHealthWhenCovered; // 0x03(0x01)
	float MaxDistanceShowHealth; // 0x04(0x04)
	bool bHideHealthWhenOutScreen; // 0x08(0x01)
	bool bAllowShowNameInfo; // 0x09(0x01)
	bool bShowNameInfoDefault; // 0x0a(0x01)
	bool bShowNameInfoWhenAiming; // 0x0b(0x01)
	bool bHideNameInfoWhenCovered; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float MaxDistanceShowNameInfo; // 0x10(0x04)
	bool bHideNameInfoWhenOutScreen; // 0x14(0x01)
	bool bAllowShowCoolDown; // 0x15(0x01)
	bool bShowCoolDownDefault; // 0x16(0x01)
	bool bShowCoolDownWhenAiming; // 0x17(0x01)
	bool bHideCoolDownWhenCovered; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float MaxDistanceShowCoolDown; // 0x1c(0x04)
	bool bHideCoolDownWhenOutScreen; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.VehicleTypeConfig
// Size: 0x14 (Inherited: 0x00)
struct FVehicleTypeConfig {
public:

	struct FVector2D MarkerOffset; // 0x00(0x08)
	struct FVector WorldLocationOffset; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.VehicleMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FVehicleMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FVehicleMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.VehicleMarkerUpdateConfig
// Size: 0x44 (Inherited: 0x00)
struct FVehicleMarkerUpdateConfig {
public:

	bool bAllowShowDistance; // 0x00(0x01)
	bool bShowDistanceDefault; // 0x01(0x01)
	bool bShowDistanceWhenAiming; // 0x02(0x01)
	bool bHideDistanceWhenCovered; // 0x03(0x01)
	float MaxDistanceShowDistance; // 0x04(0x04)
	bool bHideDistanceWhenOutScreen; // 0x08(0x01)
	bool bAllowShowHealth; // 0x09(0x01)
	bool bShowHealthDefault; // 0x0a(0x01)
	bool bShowHealthWhenAiming; // 0x0b(0x01)
	bool bHideHealthWhenCovered; // 0x0c(0x01)
	bool bShowHealthWhenHit; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	float ShowHealthTimeWhenHit; // 0x10(0x04)
	bool bShowHealthWhenIsEngineer; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	float MaxDistanceShowHealth; // 0x18(0x04)
	bool bHideHealthWhenOutScreen; // 0x1c(0x01)
	bool bAllowShowPassengerInfo; // 0x1d(0x01)
	bool bShowPassengerInfoDefault; // 0x1e(0x01)
	bool bShowPassengerInfoWhenAiming; // 0x1f(0x01)
	bool bHidePassengerInfoWhenCovered; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float MaxDistanceShowPassengerInfo; // 0x24(0x04)
	bool bHidePassengerInfoWhenOutScreen; // 0x28(0x01)
	bool bEnableOpacityChange; // 0x29(0x01)
	char pad_2A[0x2]; // 0x2a(0x02)
	float NormalOpacity; // 0x2c(0x04)
	float CoveredOpacity; // 0x30(0x04)
	float AimingOpacity; // 0x34(0x04)
	bool bOutScreenOverrideOpacity; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float OutScreenOverrideOpacity; // 0x3c(0x04)
	float EngineerSeeHealthBarDistance; // 0x40(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.VehicleMarkingCharacterVoiceConfig
// Size: 0x50 (Inherited: 0x00)
struct FVehicleMarkingCharacterVoiceConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FVehicleMarkingCharacterVoiceInfo> MarkingCampCharacterVoiceMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.VehicleMarkingCharacterVoiceInfo
// Size: 0x50 (Inherited: 0x00)
struct FVehicleMarkingCharacterVoiceInfo {
public:

	struct TMap<enum class EAnimVehicleType, struct FString> VehicleTypeMarkingCharacterVoiceMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterMarkerUpdateCampConfig
// Size: 0x50 (Inherited: 0x00)
struct FCharacterMarkerUpdateCampConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FCharacterMarkerUpdateConfig> MarkerCampConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CharacterMarkerUpdateConfig
// Size: 0x2c (Inherited: 0x00)
struct FCharacterMarkerUpdateConfig {
public:

	bool bShowNumIconNotArmedIcon; // 0x00(0x01)
	bool bAllowShowName; // 0x01(0x01)
	bool bShowNameDefault; // 0x02(0x01)
	bool bShowNameWhenAiming; // 0x03(0x01)
	bool bHideNameWhenCovered; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float MaxDistanceShowName; // 0x08(0x04)
	bool bHideNameWhenOutScreen; // 0x0c(0x01)
	bool bAllowShowHealth; // 0x0d(0x01)
	bool bShowHealthDefault; // 0x0e(0x01)
	bool bShowHealthWhenAiming; // 0x0f(0x01)
	bool bShowHealthWhenIsMedic; // 0x10(0x01)
	bool bHideHealthWhenCovered; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float MaxDistanceShowHealth; // 0x14(0x04)
	float MedicShowHealthPercent; // 0x18(0x04)
	bool bHideHealthWhenOutScreen; // 0x1c(0x01)
	bool bShowHealthWhenHit; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
	float ShowHealthTimeWhenHit; // 0x20(0x04)
	bool bAllowShowArmorIcon; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float MPShowBigIconDistance; // 0x28(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingCharacterVoiceConfig
// Size: 0x50 (Inherited: 0x00)
struct FMarkingCharacterVoiceConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FString> MarkingCampCharacterVoiceMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerViewCreateCampBaseConfig
// Size: 0x50 (Inherited: 0x00)
struct FMarkerViewCreateCampBaseConfig {
public:

	struct TMap<enum class EMarkerCampType, struct FMarkerViewCreateConfig> MarkerCampBaseConfigMap; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerViewCreateConfig
// Size: 0xd0 (Inherited: 0x00)
struct FMarkerViewCreateConfig {
public:

	enum class EMarkerRefreshFrequencyLevel MarkerRefreshFrequencyLevel; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float CreatedDistance; // 0x04(0x04)
	bool bHideWhenOutScreen; // 0x08(0x01)
	bool bHideWhenCovered; // 0x09(0x01)
	bool bForceShowWithinDistance; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
	float ForceShowDistance; // 0x0c(0x04)
	bool bShowWithinDistance; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float ShowDistance; // 0x14(0x04)
	float AimCheckDistance; // 0x18(0x04)
	bool bHideWhenNotAimed; // 0x1c(0x01)
	bool bHideWhenNotInAimedCircle; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
	struct TArray<float> AimedCircleRadiusFactorArray; // 0x20(0x10)
	struct TArray<float> AimedCircleRadiusAimingOpacityArray; // 0x30(0x10)
	struct TArray<float> AimedCircleRadiusNotAimingOpacityArray; // 0x40(0x10)
	bool bScaleWithDistance; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct TArray<float> ScaleDistanceArray; // 0x58(0x10)
	struct TArray<float> ScaleScalarArray; // 0x68(0x10)
	bool bOutScreenOverrideScale; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float OutScreenOverrideScale; // 0x7c(0x04)
	bool bOwnerPlayMarkingEffect; // 0x80(0x01)
	bool bOtherPlayMarkingEffect; // 0x81(0x01)
	bool bOwnerMarkingEffectLast; // 0x82(0x01)
	bool bOtherMarkingEffectLast; // 0x83(0x01)
	bool bEnableOpacityChange; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	float NormalOpacity; // 0x88(0x04)
	float CoveredOpacity; // 0x8c(0x04)
	float AimingOpacity; // 0x90(0x04)
	bool bOutScreenOverrideOpacity; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float OutScreenOverrideOpacity; // 0x98(0x04)
	bool bEnableOpacityDistance; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	struct TArray<float> OpacityDistanceArray; // 0xa0(0x10)
	struct TArray<float> OpacityScalarArray; // 0xb0(0x10)
	bool bNeedShowDistanceText; // 0xc0(0x01)
	bool bShowDistanceDefault; // 0xc1(0x01)
	bool bShowDistanceWhenAiming; // 0xc2(0x01)
	bool bHideDistanceWhenCovered; // 0xc3(0x01)
	float MaxDistanceShowDistance; // 0xc4(0x04)
	bool bHideDistanceWhenOutScreen; // 0xc8(0x01)
	bool bShowDistanceWhenMarked; // 0xc9(0x01)
	bool bNeedHideMarkerWhenImpendingDeath; // 0xca(0x01)
	bool bNeedShowArrow; // 0xcb(0x01)
	enum class EMarkerEdgeTrackType MarkerEdgeTrackType; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkingBubbleConfig
// Size: 0x40 (Inherited: 0x00)
struct FMarkingBubbleConfig {
public:

	float BubbleInterval; // 0x00(0x04)
	float BubbleDuration; // 0x04(0x04)
	float BubbleMaxDistance; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FSoftObjectPath BubbleSpritePath; // 0x10(0x18)
	struct TArray<int32_t> ArmedForceIdArray; // 0x28(0x10)
	bool bLoopAnimation; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float LoopAnimationInterval; // 0x3c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerStringItemPool
// Size: 0x50 (Inherited: 0x00)
struct FMarkerStringItemPool {
public:

	struct TMap<struct FString, struct UGPMarkerItemBase*> MarkerItemBaseArray; // 0x00(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ActorMarkerItemPoolNew
// Size: 0x58 (Inherited: 0x00)
struct FActorMarkerItemPoolNew {
public:

	char pad_0[0x8]; // 0x00(0x08)
	struct TMap<uint32_t, struct UGPMarkerItemBase*> MarkerItemBaseArray; // 0x08(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ActorMarkerItemPool
// Size: 0x58 (Inherited: 0x00)
struct FActorMarkerItemPool {
public:

	char pad_0[0x8]; // 0x00(0x08)
	struct TMap<uint32_t, struct UGPMarkerItemBase*> MarkerItemBaseArray; // 0x08(0x50)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerTickBucket
// Size: 0x0c (Inherited: 0x00)
struct FMarkerTickBucket {
public:

	float UpdateFrequency; // 0x00(0x04)
	char pad_4[0x8]; // 0x04(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMarkerInfo
// Size: 0x10 (Inherited: 0x00)
struct FPlayerMarkerInfo {
public:

	uint64_t PlayerUin; // 0x00(0x08)
	int32_t CharacterStatus; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkerPendingItem
// Size: 0x10 (Inherited: 0x00)
struct FMarkerPendingItem {
public:

	struct TArray<struct UGPMarkerItemBase*> PendingMarkerItems; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MarkCharacterInfo
// Size: 0x50 (Inherited: 0x00)
struct FMarkCharacterInfo {
public:

	struct AActor* MarkedActor; // 0x00(0x08)
	struct FVector2D ScreePos; // 0x08(0x08)
	struct FVector2D HeadScreePos; // 0x10(0x08)
	bool bInDetailSquare; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float CurrentMarkingTime; // 0x1c(0x04)
	float CurrentCancelingTime; // 0x20(0x04)
	bool bIsMarking; // 0x24(0x01)
	bool bIsMarked; // 0x25(0x01)
	bool bIsCanceling; // 0x26(0x01)
	char pad_27[0x1]; // 0x27(0x01)
	float CancelNeededTime; // 0x28(0x04)
	float MarkNeededTime; // 0x2c(0x04)
	bool bHasOutlineMesh; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComp; // 0x38(0x08)
	float DistToCharacter; // 0x40(0x04)
	bool bShowProgressionUI; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float DelayShowProgressionTime; // 0x48(0x04)
	bool FromWeaponMark; // 0x4c(0x01)
	bool FromAbilityMark; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MaterialShaderKeyword
// Size: 0x10 (Inherited: 0x00)
struct FMaterialShaderKeyword {
public:

	char pad_0[0x10]; // 0x00(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MaterialVaraintDataRow
// Size: 0x48 (Inherited: 0x08)
struct FMaterialVaraintDataRow : public FTableRowBase {
public:

	struct FName MaterialName; // 0x08(0x08)
	/*struct TSoftObjectPtr<UMaterialInterface>*/char SrcMaterial[0x28]; // 0x10(0x28)
	struct TArray<struct FMaterialVariantRow> MaterialVariants; // 0x38(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MaterialVariantRow
// Size: 0x50 (Inherited: 0x00)
struct FMaterialVariantRow {
public:

	struct TArray<struct FName> Keywords; // 0x00(0x10)
	/*struct TSoftObjectPtr<UMaterialInterface>*/char Material[0x28]; // 0x10(0x28)
	struct TArray<struct FMaterialVariantStaticSwitchExtraMaterials> ExtraMaterials; // 0x38(0x10)
	bool bAutoGen; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MaterialVariantStaticSwitchExtraMaterials
// Size: 0x80 (Inherited: 0x00)
struct FMaterialVariantStaticSwitchExtraMaterials {
public:

	struct TMap<struct FName, struct FMaterialVariantStaticSwitchRow> StaticSwitchs; // 0x00(0x50)
	/*struct TSoftObjectPtr<UMaterialInterface>*/char Material[0x28]; // 0x50(0x28)
	bool bAutoGen; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MaterialVariantStaticSwitchRow
// Size: 0x0c (Inherited: 0x00)
struct FMaterialVariantStaticSwitchRow {
public:

	struct FName StaticSwitchName; // 0x00(0x08)
	bool Value; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPMilitaryPropsAnimInstanceProxy
// Size: 0x748 (Inherited: 0x748)
struct FGPMilitaryPropsAnimInstanceProxy : public FAnimInstanceProxy {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPHaavkAnimInstanceProxy
// Size: 0x780 (Inherited: 0x748)
struct FGPHaavkAnimInstanceProxy : public FAnimInstanceProxy {
public:

	enum class EGPWeaponStateType WeaponState; // 0x748(0x01)
	char pad_749[0x7]; // 0x749(0x07)
	struct UAnimSequence* IdleSeq; // 0x750(0x08)
	struct UAnimSequence* InactiveSeq; // 0x758(0x08)
	bool bIsWeaponDamage; // 0x760(0x01)
	bool bIsWeaponActive; // 0x761(0x01)
	char pad_762[0x2]; // 0x762(0x02)
	float AOAimingPitch; // 0x764(0x04)
	float AOAimingYaw; // 0x768(0x04)
	bool bIsLaunch; // 0x76c(0x01)
	char pad_76D[0x13]; // 0x76d(0x13)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPModularWeaponAnimInstanceProxy
// Size: 0x8f0 (Inherited: 0x748)
struct FGPModularWeaponAnimInstanceProxy : public FAnimInstanceProxy {
public:

	struct FPartAnimStructForPin PartAnimStruct; // 0x748(0x10)
	bool ResetAccumulatedTimeToggle; // 0x758(0x01)
	char pad_759[0x3]; // 0x759(0x03)
	int32_t CacheModifyMultBoneMeshLod; // 0x75c(0x04)
	struct FModifyMultBoneStructForPin ModifyMultBoneStruct; // 0x760(0x70)
	float UpdateModifyBonesAlpha; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)
	struct UAnimSequenceBase* Sequence; // 0x7d8(0x08)
	struct UAnimSequenceBase* AimSequence; // 0x7e0(0x08)
	struct UAnimSequenceBase* IdleSequence; // 0x7e8(0x08)
	float PlayRate; // 0x7f0(0x04)
	float StartPosition; // 0x7f4(0x04)
	bool bLoopAnimation; // 0x7f8(0x01)
	bool bPlayAimAnim; // 0x7f9(0x01)
	bool bPlayWeaponAnim; // 0x7fa(0x01)
	bool bHasIdlePose; // 0x7fb(0x01)
	char pad_7FC[0x4]; // 0x7fc(0x04)
	bool bUpdateMagCL; // 0x800(0x01)
	char pad_801[0x3]; // 0x801(0x03)
	float MagCLInitSpeed; // 0x804(0x04)
	float MagCLAddSpeedZ; // 0x808(0x04)
	struct FVector StartLocation; // 0x80c(0x0c)
	bool bIsEmptyAmmo; // 0x818(0x01)
	bool bIsFireMode; // 0x819(0x01)
	enum class EGPWeaponFiringMode EWeaponFiringMode; // 0x81a(0x01)
	char pad_81B[0x1]; // 0x81b(0x01)
	float EmptyAmmoAlpha; // 0x81c(0x04)
	float FireModeAlpha; // 0x820(0x04)
	char pad_824[0x6]; // 0x824(0x06)
	bool bIsFPPWeapn; // 0x82a(0x01)
	char pad_82B[0x5]; // 0x82b(0x05)
	struct UAnimSequenceBase* OnHockAnim; // 0x830(0x08)
	struct UAnimSequenceBase* FireModeAnim; // 0x838(0x08)
	struct TMap<enum class EGPWeaponFiringMode, struct UAnimSequenceBase*> FireModeAnimMap; // 0x840(0x50)
	float FireModeAnimPLayTime; // 0x890(0x04)
	char pad_894[0x4]; // 0x894(0x04)
	struct AGPCharacter* OwnerPawn; // 0x898(0x08)
	struct AWeaponBase* NewWeaponInv; // 0x8a0(0x08)
	char pad_8A8[0x10]; // 0x8a8(0x10)
	/*struct TScriptInterface<IWeaponInterface>*/char CurInv[0x10]; // 0x8b8(0x10)
	/*struct TScriptInterface<IWeaponDataComponentAnimInterface>*/char WeaponAnimDataComponent[0x10]; // 0x8c8(0x10)
	struct UModularWeaponDataComponentAnim* ModularWeaponAnimDataComponentRealComp; // 0x8d8(0x08)
	char pad_8E0[0x10]; // 0x8e0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MPGPWeaponDescInfo
// Size: 0x30 (Inherited: 0x00)
struct FMPGPWeaponDescInfo {
public:

	struct TArray<struct FGunDescRow> GunDescRows; // 0x00(0x10)
	uint64_t PoorItemId; // 0x10(0x08)
	uint64_t ModifyTimeStamp; // 0x18(0x08)
	uint64_t AttrModifyTimeStamp; // 0x20(0x08)
	uint64_t SkinId; // 0x28(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.NetActorInitializeFilter
// Size: 0x148 (Inherited: 0x00)
struct FNetActorInitializeFilter {
public:

	char pad_0[0x148]; // 0x00(0x148)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SpectatorBriefInfo
// Size: 0x28 (Inherited: 0x00)
struct FSpectatorBriefInfo {
public:

	struct FString MyName; // 0x00(0x10)
	uint64_t MyUin; // 0x10(0x08)
	int32_t MyTeamID; // 0x18(0x04)
	int32_t CampId; // 0x1c(0x04)
	bool bIsAILab; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.ActorMoveMessage
// Size: 0x2c (Inherited: 0x00)
struct FActorMoveMessage {
public:

	struct FVector Position; // 0x00(0x0c)
	struct FRotator Rotation; // 0x0c(0x0c)
	struct FVector Velocity; // 0x18(0x0c)
	uint32_t ClientTick; // 0x24(0x04)
	bool Snapshot; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityNotifyInfo
// Size: 0x28 (Inherited: 0x00)
struct FAbilityNotifyInfo {
public:

	char pad_0[0x28]; // 0x00(0x28)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.OutLineEffectTimeData
// Size: 0x0c (Inherited: 0x00)
struct FOutLineEffectTimeData {
public:

	enum class EOutLineEffectType ItemOutLineType; // 0x00(0x04)
	float OutlineEffectMaxTime; // 0x04(0x04)
	float OutlineForceStopTime; // 0x08(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityItemOutLineData
// Size: 0x10 (Inherited: 0x00)
struct FAbilityItemOutLineData {
public:

	int32_t ItemUin; // 0x00(0x04)
	enum class EAbilityItemOutLineType ItemOutLineType; // 0x04(0x04)
	int32_t TeamOrCampID; // 0x08(0x04)
	float OutlineEndTime; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPParachuteRepInfo
// Size: 0x1c (Inherited: 0x00)
struct FGPParachuteRepInfo {
public:

	float StartTimestamp; // 0x00(0x04)
	struct FVector OriginPos; // 0x04(0x0c)
	struct FVector DestPos; // 0x10(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CommonSplinePathData
// Size: 0x02 (Inherited: 0x00)
struct FCommonSplinePathData {
public:

	bool bUseCacheGroundHeight; // 0x00(0x01)
	bool bLoop; // 0x01(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPPathWayPointPauseSettings
// Size: 0x08 (Inherited: 0x00)
struct FGPPathWayPointPauseSettings {
public:

	bool bAutoResume; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float PauseDuration; // 0x04(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.CachedZoomRateByFOV
// Size: 0x20 (Inherited: 0x00)
struct FCachedZoomRateByFOV {
public:

	char pad_0[0x20]; // 0x00(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAutoAimingSettings
// Size: 0x6c (Inherited: 0x00)
struct FGPAutoAimingSettings {
public:

	float AutoAimingFollowSpringCoeff; // 0x00(0x04)
	float AutoAimingConstantFollowSpeed; // 0x04(0x04)
	float AutoAimingConstantFollowSpeed_Verti; // 0x08(0x04)
	float AutoAimingConstantFollowSpeed_NearFire; // 0x0c(0x04)
	float AutoAimingMaxAngleSpeed; // 0x10(0x04)
	float AutoAimingMaxAngleSpeed_NearFire; // 0x14(0x04)
	bool bUseConstantSpeed; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float AutoAimingDistance_Min; // 0x1c(0x04)
	float AutoAimingDistance_Max; // 0x20(0x04)
	float AutoAimingStartRange; // 0x24(0x04)
	float AutoAimingEndRange; // 0x28(0x04)
	float AutoAimingTargetOffset; // 0x2c(0x04)
	float AutoAimingRangeScaleByDis; // 0x30(0x04)
	float AutoAimingHeightRate; // 0x34(0x04)
	float AutoAimingHeightRate_NearFire; // 0x38(0x04)
	float AutoAimingMoveCompensateRatio; // 0x3c(0x04)
	float AutoAimingMoveCompensateDisThresholdSq; // 0x40(0x04)
	float AutoAimingMoveCompensateRatio_NearFire; // 0x44(0x04)
	float AutoAimingCompensateMaxAngleSpeed; // 0x48(0x04)
	float AutoAimingCompensateMaxAngleSpeed_NearFire; // 0x4c(0x04)
	float AutoAimingQuitThreshold; // 0x50(0x04)
	float AutoAimingCheckInterval; // 0x54(0x04)
	float RotateDampingCoeff_X; // 0x58(0x04)
	float RotateDampingCoeff_Y; // 0x5c(0x04)
	float RotateDampingRange; // 0x60(0x04)
	bool bPauseAimingAfterFire; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	float FireAimingCoolDownTime; // 0x68(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPSceneFOVChangeDataInfo
// Size: 0x20 (Inherited: 0x00)
struct FGPSceneFOVChangeDataInfo {
public:

	char pad_0[0x20]; // 0x00(0x20)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPCharacterCameraData
// Size: 0x28 (Inherited: 0x00)
struct FGPCharacterCameraData {
public:

	float OverShoulderNearDistance; // 0x00(0x04)
	struct FVector OverShoulderOffset; // 0x04(0x0c)
	float AimDistance; // 0x10(0x04)
	struct FVector AimOffset; // 0x14(0x0c)
	float AimPitch; // 0x20(0x04)
	float AimFOV; // 0x24(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMissionDialogInfo
// Size: 0x18 (Inherited: 0x00)
struct FPlayerMissionDialogInfo {
public:

	struct FString Tag; // 0x00(0x10)
	int32_t GroupID; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionObjectiveProgress
// Size: 0x68 (Inherited: 0x00)
struct FMissionObjectiveProgress {
public:

	bool HasAuthority; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TMap<uint64_t, int32_t> DataMap; // 0x08(0x50)
	struct TArray<struct FMissionObjectiveProgressData> Data; // 0x58(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionObjectiveProgressData
// Size: 0x68 (Inherited: 0x00)
struct FMissionObjectiveProgressData {
public:

	struct TMap<uint64_t, int32_t> DataMap; // 0x00(0x50)
	int32_t ID; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct TArray<struct FMissionObjectiveItemData> Data; // 0x58(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionObjectiveItemData
// Size: 0x48 (Inherited: 0x00)
struct FMissionObjectiveItemData {
public:

	uint64_t missionid; // 0x00(0x08)
	uint64_t objectiveId; // 0x08(0x08)
	float Progress; // 0x10(0x04)
	float TargetProgress; // 0x14(0x04)
	struct FString QuestName; // 0x18(0x10)
	struct FString ObjectiveTitle; // 0x28(0x10)
	bool bSide; // 0x38(0x01)
	bool bCurrentActive; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	uint64_t TriggerId; // 0x40(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.MissionGiverInfo
// Size: 0x18 (Inherited: 0x00)
struct FMissionGiverInfo {
public:

	struct TArray<int32_t> RelativeMission; // 0x00(0x10)
	int32_t Index; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMissionUIInfo
// Size: 0x20 (Inherited: 0x00)
struct FPlayerMissionUIInfo {
public:

	int32_t missionid; // 0x00(0x04)
	struct FVector pos; // 0x04(0x0c)
	bool bCurrentActive; // 0x10(0x01)
	bool bAccepted; // 0x11(0x01)
	bool bExpired; // 0x12(0x01)
	char pad_13[0x5]; // 0x13(0x05)
	int64_t TimeLeft; // 0x18(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerMissionGiverInfo
// Size: 0x30 (Inherited: 0x00)
struct FPlayerMissionGiverInfo {
public:

	uint64_t missionid; // 0x00(0x08)
	struct AActor* Actor; // 0x08(0x08)
	struct FString actorTag; // 0x10(0x10)
	struct FVector actorPos; // 0x20(0x0c)
	bool give; // 0x2c(0x01)
	bool mapmarker; // 0x2d(0x01)
	bool ForceUpdate; // 0x2e(0x01)
	bool Option; // 0x2f(0x01)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TurnInItemQueryData
// Size: 0x20 (Inherited: 0x00)
struct FTurnInItemQueryData {
public:

	char pad_0[0x8]; // 0x00(0x08)
	struct FString NPCTag; // 0x08(0x10)
	int64_t QuestID; // 0x18(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TimeLimitMissions
// Size: 0x60 (Inherited: 0x00)
struct FTimeLimitMissions {
public:

	struct TMap<int64_t, int32_t> DataMap; // 0x00(0x50)
	struct TArray<struct FTimeLimitMissionInfo> Data; // 0x50(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TimeLimitMissionInfo
// Size: 0x18 (Inherited: 0x00)
struct FTimeLimitMissionInfo {
public:

	int64_t missionid; // 0x00(0x08)
	int32_t TimeLeft; // 0x08(0x04)
	int32_t ExpireTime; // 0x0c(0x04)
	int32_t DsExpireTime; // 0x10(0x04)
	bool InArea; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerDeathAndCarryDataInfo
// Size: 0x30 (Inherited: 0x00)
struct FPlayerDeathAndCarryDataInfo {
public:

	int32_t PlayerImpendingDeathNum; // 0x00(0x04)
	int32_t ImpendingDeathToDeathFastNum; // 0x04(0x04)
	float LogImpendingDeathStartTime; // 0x08(0x04)
	int32_t ImpendingDeathGiveUpNum; // 0x0c(0x04)
	int32_t ImpendingDeathRescueNum; // 0x10(0x04)
	int32_t ImpendingDeathForHelpNum; // 0x14(0x04)
	int32_t DeathForHelpNum; // 0x18(0x04)
	int32_t PlayerCarryNum; // 0x1c(0x04)
	int32_t PlayerCarryAINum; // 0x20(0x04)
	int32_t PlayerCarryTeamMemberNum; // 0x24(0x04)
	int32_t PlayerCarryPlayerNum; // 0x28(0x04)
	int32_t ImpendingDeathForHelpResponseNum; // 0x2c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerWeaponMysticalSkinInfo
// Size: 0x50 (Inherited: 0x00)
struct FPlayerWeaponMysticalSkinInfo {
public:

	uint64_t SkinGid; // 0x00(0x08)
	uint64_t SkinId; // 0x08(0x08)
	uint64_t UniqueNumber; // 0x10(0x08)
	uint64_t KillCnt; // 0x18(0x08)
	int32_t Rarity; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FString CustomName; // 0x28(0x10)
	uint64_t Wear; // 0x38(0x08)
	uint64_t MysticalId; // 0x40(0x08)
	uint64_t Seed; // 0x48(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerWeaponSkinInfo
// Size: 0x18 (Inherited: 0x00)
struct FPlayerWeaponSkinInfo {
public:

	uint64_t SkinId; // 0x00(0x08)
	uint64_t ColorId; // 0x08(0x08)
	bool bLockApperance; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayerWeaponSkinSetup
// Size: 0x20 (Inherited: 0x00)
struct FPlayerWeaponSkinSetup {
public:

	uint64_t WeaponID; // 0x00(0x08)
	uint64_t SkinId; // 0x08(0x08)
	uint64_t SkinGid; // 0x10(0x08)
	uint64_t PendantID; // 0x18(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.LoginInfo
// Size: 0x18 (Inherited: 0x00)
struct FLoginInfo {
public:

	char pad_0[0x8]; // 0x00(0x08)
	int32_t LoginNumber; // 0x08(0x04)
	int32_t OfflineNumber; // 0x0c(0x04)
	int32_t ReloginNumber; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.TeamMemberInfo
// Size: 0x40 (Inherited: 0x00)
struct FTeamMemberInfo {
public:

	uint64_t PlayerUin; // 0x00(0x08)
	struct FString PlayerName; // 0x08(0x10)
	int32_t InnerTeamIndex; // 0x18(0x04)
	int32_t TeamId; // 0x1c(0x04)
	int32_t CampId; // 0x20(0x04)
	uint32_t PlayerGUID; // 0x24(0x04)
	struct AGPCharacter* CHARACTER; // 0x28(0x08)
	struct AController* Controller; // 0x30(0x08)
	struct AGPPlayerState* PS; // 0x38(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPPostprocessDynamicMaterialInfo
// Size: 0x68 (Inherited: 0x00)
struct FGPPostprocessDynamicMaterialInfo {
public:

	uint32_t EffectPriority; // 0x00(0x04)
	uint32_t EffectIndex; // 0x04(0x04)
	struct UMaterialInstanceDynamic* VeryHighPostMaterial; // 0x08(0x08)
	struct UMaterialInstanceDynamic* VeryHighFullScreenMaterial; // 0x10(0x08)
	struct UStaticMesh* VeryHighQuadMesh; // 0x18(0x08)
	struct UMaterialInstanceDynamic* HighPostMaterial; // 0x20(0x08)
	struct UMaterialInstanceDynamic* HighFullScreenMaterial; // 0x28(0x08)
	struct UStaticMesh* HighQuadMesh; // 0x30(0x08)
	struct UMaterialInstanceDynamic* MediumFullScreenMaterial; // 0x38(0x08)
	struct UStaticMesh* MediumQuadMesh; // 0x40(0x08)
	struct UMaterialInstanceDynamic* LowFullScreenMaterial; // 0x48(0x08)
	struct UStaticMesh* LowQuadMesh; // 0x50(0x08)
	struct UMaterialInstanceDynamic* VeryLowFullScreenMaterial; // 0x58(0x08)
	struct UStaticMesh* VeryLowQuadMesh; // 0x60(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPProjectileFXItem
// Size: 0x1c (Inherited: 0x00)
struct FGPProjectileFXItem {
public:

	struct FVector ZeroBasedCenterPos; // 0x00(0x0c)
	float SqrDistance; // 0x0c(0x04)
	float radius; // 0x10(0x04)
	struct TWeakObjectPtr<struct UObject> FXOwner; // 0x14(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagdollPhysicsBodyCollectionData
// Size: 0x18 (Inherited: 0x00)
struct FRagdollPhysicsBodyCollectionData {
public:

	bool bFromServer; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FRagdollPhysicsBodyData> BodyDataCollection; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagdollPhysicsBodyData
// Size: 0x20 (Inherited: 0x00)
struct FRagdollPhysicsBodyData {
public:

	struct FName BoneName; // 0x00(0x08)
	struct FVector Location; // 0x08(0x0c)
	struct FVector LinearVelocity; // 0x14(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagDollDeathConfigTable
// Size: 0x90 (Inherited: 0x10)
struct FRagDollDeathConfigTable : public FDescRowBase {
public:

	struct UPhysicsAsset* ServerRagdollPhysicsAsset; // 0x10(0x08)
	struct UPhysicsAsset* ClientRagDollPhysicsAsset; // 0x18(0x08)
	struct FName PhysicalAnimationName; // 0x20(0x08)
	float DeathAnimationFourDirTolerantAngle; // 0x28(0x04)
	float DeathMaxSpeedFromAnimation; // 0x2c(0x04)
	float DeathPhysicStrength; // 0x30(0x04)
	float DeathPhysicServerStrength; // 0x34(0x04)
	float DeathCrouchForceStrengthMul; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FRagDollDeathForceInfo> DeathForceArray; // 0x40(0x10)
	struct TArray<struct FRagdollConstraintInfo> ConstraintInfos; // 0x50(0x10)
	float ConstraintAnimTime; // 0x60(0x04)
	bool bEnableSelfCollision; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FName> IncreaseDampingBones; // 0x68(0x10)
	bool bEnableHipsConstraint; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float HipsConstraintStiffness; // 0x7c(0x04)
	float HipsConstraintDamping; // 0x80(0x04)
	float VehicleVelocityFactor; // 0x84(0x04)
	float VehicleVerticalVelocity; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagdollConstraintInfo
// Size: 0x34 (Inherited: 0x00)
struct FRagdollConstraintInfo {
public:

	struct FName ConstraintBoneName; // 0x00(0x08)
	float MotorStiffness; // 0x08(0x04)
	float MotorDamping; // 0x0c(0x04)
	struct FRotator ConstraintRotation; // 0x10(0x0c)
	bool bBlendToConstraintRotation; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float bBlendToConstraintRotationSpeed; // 0x20(0x04)
	enum class ERagdollConstraintAnimType ConstraintAlphaType; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float FixMotorAlpha; // 0x28(0x04)
	float OffsetMotorAlpha; // 0x2c(0x04)
	bool bStopWhileHipStable; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagDollDeathForceInfo
// Size: 0x48 (Inherited: 0x00)
struct FRagDollDeathForceInfo {
public:

	float PlayAnimationTime; // 0x00(0x04)
	float PhysicalAnimationTimer; // 0x04(0x04)
	float BlendToPhysicsTime; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<struct FName> BoneNameList; // 0x10(0x10)
	struct TArray<struct FName> AddForceBoneNameList; // 0x20(0x10)
	struct TArray<float> HitForceList; // 0x30(0x10)
	enum class EHitPartType PartType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagDollReplicateData
// Size: 0x4c (Inherited: 0x00)
struct FRagDollReplicateData {
public:

	bool bIsStopPhysicsFromServer; // 0x00(0x01)
	bool RagDollStopLocationValid; // 0x01(0x01)
	bool bRagdollOnMovableBase; // 0x02(0x01)
	bool bRepMovementValid; // 0x03(0x01)
	struct FVector RagDollStopLocation; // 0x04(0x0c)
	struct FRepMovement ReplicatePhysicsMovement; // 0x10(0x34)
	float MeshOffsetZ; // 0x44(0x04)
	bool bRagdollErrorNeedClear; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagdollPhysicsComponentPostPhysicsTickFunction
// Size: 0x68 (Inherited: 0x60)
struct FRagdollPhysicsComponentPostPhysicsTickFunction : public FTickFunction {
public:

	struct UGPRagDollPhysicsComponent* Target; // 0x60(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagdollAnimationContext
// Size: 0x1a0 (Inherited: 0x00)
struct FRagdollAnimationContext {
public:

	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x00(0x08)
	char pad_8[0x8]; // 0x08(0x08)
	struct UAnimSequence* TargetAnimation; // 0x10(0x08)
	char pad_18[0x188]; // 0x18(0x188)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RagdollImpendingDeathInfo
// Size: 0x28 (Inherited: 0x00)
struct FRagdollImpendingDeathInfo {
public:

	enum class EChracterPoseType DeathPose; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName ShotBone; // 0x04(0x08)
	char DeathDirection; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FVector RawShotDir; // 0x10(0x0c)
	struct FVector VehicleVelocity; // 0x1c(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAIDeathAnimConfigRow
// Size: 0x18 (Inherited: 0x08)
struct FGPAIDeathAnimConfigRow : public FTableRowBase {
public:

	struct TArray<struct FDeathAnimConfigWithDirRange> DeathAnims; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.KinematicHipRepInfo
// Size: 0x18 (Inherited: 0x00)
struct FKinematicHipRepInfo {
public:

	float ProbGroundDis; // 0x00(0x04)
	float ProbDropLen; // 0x04(0x04)
	struct TArray<struct FDeathPoints> Points; // 0x08(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.DeathPoints
// Size: 0x1c (Inherited: 0x00)
struct FDeathPoints {
public:

	float InitSpeed; // 0x00(0x04)
	struct FVector StartPoint; // 0x04(0x0c)
	struct FVector LastPoint; // 0x10(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PlayRagDollPhysicsParam
// Size: 0x14 (Inherited: 0x00)
struct FPlayRagDollPhysicsParam {
public:

	struct TWeakObjectPtr<struct USkeletalMeshComponent> InSkeletalMeshComponent; // 0x00(0x08)
	char pad_8[0xc]; // 0x08(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.AbilityRushSettingConfig
// Size: 0x190 (Inherited: 0x00)
struct FAbilityRushSettingConfig {
public:

	struct UCurveFloat* RushHeightCurve; // 0x00(0x08)
	struct UCurveFloat* RushHeightCurveR; // 0x08(0x08)
	struct UCurveFloat* RushHeightCurveL; // 0x10(0x08)
	struct UCurveFloat* RushHeightCurveB; // 0x18(0x08)
	struct UCurveFloat* RushHeightCurve_falling; // 0x20(0x08)
	struct UCurveFloat* RushHeightCurveR_falling; // 0x28(0x08)
	struct UCurveFloat* RushHeightCurveL_falling; // 0x30(0x08)
	struct UCurveFloat* RushHeightCurveB_falling; // 0x38(0x08)
	struct FName RushAction_F_AnimKey; // 0x40(0x08)
	struct FName RushAction_L_AnimKey; // 0x48(0x08)
	struct FName RushAction_R_AnimKey; // 0x50(0x08)
	struct FName RushAction_B_AnimKey; // 0x58(0x08)
	float AnimPlate; // 0x60(0x04)
	float RushTime; // 0x64(0x04)
	float MaxMoveDist; // 0x68(0x04)
	float LastEndTime; // 0x6c(0x04)
	bool UseMovePath; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UCurveFloat* RushMovePath; // 0x78(0x08)
	struct UCurveFloat* RushMovePathB; // 0x80(0x08)
	struct UCurveFloat* RushMovePathR; // 0x88(0x08)
	struct UCurveFloat* RushMovePathL; // 0x90(0x08)
	struct UCurveFloat* BreakCurve; // 0x98(0x08)
	float BreakBlendOutTime; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct TArray<int32_t> AddBuffs; // 0xa8(0x10)
	struct TArray<int32_t> ForwadAddBuffs; // 0xb8(0x10)
	struct TArray<int32_t> BackAddBuffs; // 0xc8(0x10)
	struct TArray<int32_t> LeftAddBuffs; // 0xd8(0x10)
	struct TArray<int32_t> RightAddBuffs; // 0xe8(0x10)
	struct TArray<int32_t> AddEndBuffs; // 0xf8(0x10)
	float EndTimeOffset; // 0x108(0x04)
	bool DebugDraw; // 0x10c(0x01)
	enum class EAnimationPlayType AnimationPlayTypeFPP; // 0x10d(0x01)
	enum class EAnimationPlayType AnimationPlayTypeTPP; // 0x10e(0x01)
	enum class EFPPCameraRotationCalcType CameraRotationCalcType; // 0x10f(0x01)
	float AirSpeedFactor; // 0x110(0x04)
	bool UseAirEndSpeed; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	float AirEndSpeed; // 0x118(0x04)
	float AllowVaultControlTime; // 0x11c(0x04)
	float ContinueTime; // 0x120(0x04)
	float ContinueTimeB; // 0x124(0x04)
	float ContinueTimeR; // 0x128(0x04)
	float ContinueTimeL; // 0x12c(0x04)
	float GroundContinueTime; // 0x130(0x04)
	float GroundContinueTimeB; // 0x134(0x04)
	float GroundContinueTimeR; // 0x138(0x04)
	float GroundContinueTimeL; // 0x13c(0x04)
	float MaxZFallingSpeed; // 0x140(0x04)
	float F_Distance_Scale; // 0x144(0x04)
	float B_Distance_Scale; // 0x148(0x04)
	float L_Distance_Scale; // 0x14c(0x04)
	float R_Distance_Scale; // 0x150(0x04)
	float F_Time_Scale; // 0x154(0x04)
	float B_Time_Scale; // 0x158(0x04)
	float L_Time_Scale; // 0x15c(0x04)
	float R_Time_Scale; // 0x160(0x04)
	float GroundContinueScale; // 0x164(0x04)
	struct FSoftObjectPath GPAudioOnAdd; // 0x168(0x18)
	float MoveStopDistance; // 0x180(0x04)
	float MoveStopTime; // 0x184(0x04)
	bool MoveStopSkill; // 0x188(0x01)
	bool DebugMoveStop; // 0x189(0x01)
	bool MoveStopDistanceIncludeZ; // 0x18a(0x01)
	char pad_18B[0x5]; // 0x18b(0x05)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.PendingSceneActorInfo
// Size: 0x10 (Inherited: 0x00)
struct FPendingSceneActorInfo {
public:

	struct AActor* SceneActor; // 0x00(0x08)
	int32_t NetworkGUID; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SceneActorInfo
// Size: 0x18 (Inherited: 0x00)
struct FSceneActorInfo {
public:

	enum class EGPSceneActorType SceneActorType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t UniqueId; // 0x04(0x04)
	int32_t NetworkGUID; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct AActor* SceneActor; // 0x10(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.SOLSeamlessEnterConfig
// Size: 0x68 (Inherited: 0x08)
struct FSOLSeamlessEnterConfig : public FTableRowBase {
public:

	struct FName MapName; // 0x08(0x08)
	float StageFailedTimeout_GetOn; // 0x10(0x04)
	float StageFailedTimeout_PadShow; // 0x14(0x04)
	float StageFailedTimeout_InteractMap; // 0x18(0x04)
	float ForceInteractTime; // 0x1c(0x04)
	float TimeOut_WaitStartMatch; // 0x20(0x04)
	float SeamlessLoginEnsureTime; // 0x24(0x04)
	float PlayerLateProtectTime; // 0x28(0x04)
	float SeamlessAbseilTime; // 0x2c(0x04)
	float DelayShowConnectDSTipsTime; // 0x30(0x04)
	float DelayShowLoadLevelTipsTime; // 0x34(0x04)
	float DelayShowWaitMatchStartTipsTime; // 0x38(0x04)
	float TimeOut_LevelStreaming; // 0x3c(0x04)
	float TimeOut_LevelPhysics; // 0x40(0x04)
	float TimeOut_ConnectingDS; // 0x44(0x04)
	float GetOnBlackScreenTime; // 0x48(0x04)
	float StageFailedTimeout_EDITOR; // 0x4c(0x04)
	float StageFailedTimeout_ASAN; // 0x50(0x04)
	float DelaySwitchGameFlowTime; // 0x54(0x04)
	float DEBUG_GetOnDelayTime; // 0x58(0x04)
	float TimeOut_HUDPreload; // 0x5c(0x04)
	float AsyncLoadingTimeLimit_InteractMap; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPSHAnimInstanceProxy
// Size: 0x860 (Inherited: 0x748)
struct FGPSHAnimInstanceProxy : public FAnimInstanceProxy {
public:

	struct AGPSafeHouseCharacter* OwnerPawn; // 0x748(0x08)
	struct UGPSafeHouseCharacterMovementComponent* MovementComponent; // 0x750(0x08)
	struct UGPSafeHouseAnimProxyComponent* SHAnimProxyComponent; // 0x758(0x08)
	bool bShouldJump; // 0x760(0x01)
	bool bShouldStop; // 0x761(0x01)
	bool bShouldSprint; // 0x762(0x01)
	bool bShouldCrouch; // 0x763(0x01)
	bool bShouldProne; // 0x764(0x01)
	bool bShouldSilentWalk; // 0x765(0x01)
	bool MoveModeChange; // 0x766(0x01)
	bool bIsFalling; // 0x767(0x01)
	bool bIsMoving; // 0x768(0x01)
	bool bIsCrouch; // 0x769(0x01)
	bool bIsProne; // 0x76a(0x01)
	bool bIsSprint; // 0x76b(0x01)
	bool bIsSilentWalk; // 0x76c(0x01)
	bool bIsStand; // 0x76d(0x01)
	char pad_76E[0x2]; // 0x76e(0x02)
	float Velocity; // 0x770(0x04)
	float MovingDirection; // 0x774(0x04)
	float VelocityForAnim; // 0x778(0x04)
	char pad_77C[0x4]; // 0x77c(0x04)
	struct UAnimSequence* CurrentMovementModeTransitionAnimation; // 0x780(0x08)
	struct UBlendSpaceBase* CurrentMovementModeTransitionAnimationBS; // 0x788(0x08)
	struct UBlendSpaceBase* CurrentMoveBS; // 0x790(0x08)
	struct UAnimSequence* CurrentIdleAnimation; // 0x798(0x08)
	struct TMap<struct FName, struct UAnimSequence*> AnimSequence; // 0x7a0(0x50)
	struct TMap<struct FName, struct UBlendSpaceBase*> AnimBlendSpece; // 0x7f0(0x50)
	/*struct TScriptInterface<IWeaponDataComponentAnimInterface>*/char WeaponAnimDataComponent[0x10]; // 0x840(0x10)
	struct UGPSafeHouseBlackboardComponent* BlackBoard; // 0x850(0x08)
	char pad_858[0x8]; // 0x858(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.RepairRecord
// Size: 0x0c (Inherited: 0x00)
struct FRepairRecord {
public:

	char pad_0[0xc]; // 0x00(0x0c)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// ScriptStruct GPGameplay.GPAnimUpdateRateSettings
// Size: 0x20 (Inherited: 0x00)
struct FGPAnimUpdateRateSettings {
public:

