
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// AnimBlueprintGeneratedClass Player_BaseLocomotion_3P.Player_BaseLocomotion_3P_C
// Size: 0xaef8 (Inherited: 0x19c0)
class UPlayer_BaseLocomotion_3P_C : public UGPAnimInstance_Locomotion {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x19c0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1CB49A7B49C204E4F4D20E9A4C92A850; // 0x19c8(0xf0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33B1A51B4C1BE8B403CEE1AECA12F07F; // 0x1ab8(0x100)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7E8C55634A6FB2F201965797B23AC988; // 0x1bb8(0xf0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_197BF2104980C2BE73E6A28EAA987EE2; // 0x1ca8(0x110)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_A5799D044C952EBFF4F2D1B2C1ADAD16; // 0x1db8(0xd8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0302B9E64A33510FCF28ECB6C0DA7763; // 0x1e90(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E40F7AF4460066F195268F80E3545142; // 0x1ef8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_495BE15F494BBC23E6CA6D8F5081325D; // 0x1f60(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_095683464FFC788BA4EB7A8171010B65; // 0x1fc8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45C2FFB845DDE0C757ED4898861D373C; // 0x2030(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_360CA02446A675EF67612FA665BD3623; // 0x2098(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75C78D024C9FD0E53D5B49B5A9255D58; // 0x2100(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_ACB3163E45F76A56962CE7B53CB19AB2; // 0x2168(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_001D33E94DBEC1A9F9953882C16045C7; // 0x21d0(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A77335BD42825BCE8CA693BDDD917D1D; // 0x2238(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_280970A341C860D06A3B61AB5344D998; // 0x22a0(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4D02CFBF48A51ACE57EF5BB74E10FA12; // 0x2308(0x2f8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_E79167C64B47666EA2A6BCACCFBD4B31; // 0x2600(0x60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7CD781FE40115C8DD3658E83349813ED; // 0x2660(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AC7BA1AE420A731320DFD5A111BD8659; // 0x26c8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9D4E8EF1434EAFBB04F306BB101D2CC1; // 0x2730(0x68)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_14FBC8574B9176FA26BC1D8D1DD4F7D3; // 0x2798(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_BB7C596D477184F0A0AA3CB5200A0735; // 0x27e0(0x60)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1BFE05774F78458F452BEF8306A184C4; // 0x2840(0x2f8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_845383924C317B378BE721A98FD1E0EC; // 0x2b38(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82A83EB94200F0F7F79D9AAE987A5A76; // 0x2b98(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_180DBE3D4B02E28650668D9C165D7CE9; // 0x2c98(0x60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2EE5EBA64DBF8855B5ABD69E140FCED5; // 0x2cf8(0x68)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D941E88A4D21E737C41B67880F3B52B4; // 0x2d60(0x158)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5ECFDE8E4D6F5C81239147BD26E67E26; // 0x2eb8(0x60)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F2EA3796458ABF89C79568BED5F32E2A; // 0x2f18(0x2f8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_E3C24A7149014E77A089CBA1B544D248; // 0x3210(0x60)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization_8EF5EA0645E1764FB1E4AD977BD72271; // 0x3270(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DE549EFB43E77BC06C900EBEBD922B5E; // 0x3318(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0D5DD8BD4CD39AAB1EF9DABE82094475; // 0x3380(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34B0426349C341AD578578A6DC17636F; // 0x33e8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F3E790AF4D16E023A67B978E0E3F4B0B; // 0x3450(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89CD9A694154443D2379789ADEE5C42F; // 0x34b8(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51B1D5AC489CD937DC7D95917F40C687; // 0x3520(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_189E390542F261E5EAC3F39AA71E0C32; // 0x3588(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22E2EF5E4878CAD0ACEE348B1D90862F; // 0x35f0(0x68)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E4ED51BE49F2EAF8521679A42A396F77; // 0x3658(0x68)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6515F97F40BFA5E3807ED8AAE8BE9389; // 0x36c0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4E2A9EA84E8F6B02308D26A20DC43E4D; // 0x3718(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_211E43EC438F003A989F77BCD40A5645; // 0x3778(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_BA5CA5FD479D9F333F0A0EAD82D85B38; // 0x3878(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ECA0D46F4358F9699B8D68B0555B4A42; // 0x3978(0x100)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CA8C57CD42A00F86BC5C739A1EE3FA9B; // 0x3a78(0x100)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_A153D7B44B29720E7C2068A180F024CE; // 0x3b78(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68ADB1E1447D0803F9568798B3057C5E; // 0x3bf8(0x58)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_588938E64FE6CE04D39505B853981C68; // 0x3c50(0x110)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_256FC0C94B2217E7117BAAB6FB14CA7E; // 0x3d60(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28BE1FA84720EBA4207EC5B55F9C480A; // 0x3dc0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_137D8FBE4C176DD039E34C9298D516EA; // 0x3e18(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7CAEDF5144CE71788F19FC9C01EA2BDF; // 0x3e78(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_A0AC837043F0966AED0F1AA2BD5AB9D7; // 0x3fd0(0xf0)
	struct FAnimNode_Slot AnimGraphNode_Slot_BC51E58F4C83FC9DE5BCB7914E821CED; // 0x40c0(0x78)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_D6F4DDA944C3FB584085309B001CCF14; // 0x4138(0x2e0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization_D277856B41483DCD0CADC49E790A0785; // 0x4418(0xa8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_42A1CA674C5F5AAFBDB284A528EDB4D2; // 0x44c0(0x88)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6A8FF1974C0FBE7938FF2DA13DD2FC9B; // 0x4548(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_9DC989D64436991EFEC54B89DB2EE74E; // 0x45a0(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42EDBCA94C0FC9D091D860883A55748D; // 0x4618(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_FDB7761143136B68E9B3759262009659; // 0x4670(0x88)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3DFA0AA24F90F6F18033198B91658313; // 0x46f8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_CC0D6A4D40D0DA0D599D6F807A923C9F; // 0x47f8(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3AE57D934A971ED25A40EBA7B12C8C12; // 0x4858(0x158)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_522ED2A7465274F2B8A1029086113819; // 0x49b0(0x60)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_AB5E524943AFBC643AAB55AD010C8A4F; // 0x4a10(0xd8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_773DF5564AB49CCC311FBE80385E174F; // 0x4ae8(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_E46781404D12B1846EBABC88AF785824; // 0x4b70(0x60)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_ED767E014957AE9E116DFF8890295FF2; // 0x4bd0(0x2f8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3299B9194C18A978A85476855A9E70A2; // 0x4ec8(0xf8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97FE115341FB33ED93B580B4613B92D2; // 0x4fc0(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_FDF8E0BE48FD4FC58F3B37B60D710ED7; // 0x50c0(0x60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D8F821CE45EC332D9C58008A8850DC27; // 0x5120(0x68)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_08EB18404BECC3B847B0AD977733736F; // 0x5188(0x158)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_0D30F08C470EF9FC89A97895D5131D1A; // 0x52e0(0x60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7AB464044489A296E6150E852904E0FA; // 0x5340(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1EA3BDC34AED71626D6AACA06DC03EE1; // 0x5498(0xf8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1117BB634E6E8BC75E818A8F1E07AED2; // 0x5590(0x2f8)
	struct FAnimNode_Root AnimGraphNode_Root_0BE552864D7A88FA15DD6B9006334555; // 0x5888(0x60)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_1D8478CB46570FD2F17D2C878F945C3C; // 0x58e8(0x88)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_E6A2199F434871244CD05F893E2DC4A5; // 0x5970(0x88)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_7BB4B45F47875576B0DEC4872CD93216; // 0x59f8(0xe8)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_139C2AD6421D4ACC75F26E8918F2E75D; // 0x5ae0(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_44BA478B42623EFBDAF051B8713BCECF; // 0x5b68(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_5B9635024C76CF56B705B380BD257E5D; // 0x5bf0(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_BFD4BABF4AA9E6E138BBD19D5DB0B578; // 0x5c78(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_745ACA78428109BF2BB0319A897CF9AD; // 0x5d00(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_5B41D17A46A4C58E094D13805D7F7702; // 0x5d88(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_16953EE2409BCBD0A36AECA3BF86BDD1; // 0x5e10(0x88)
	struct FAnimMode_OrientationWarping AnimGraphNode_OrientationWarping_38DEEFE14DD7B391E0D61A9B748361CB; // 0x5e98(0x88)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_463FD89A4AF501E8FF2B9F95C4B9F1B3; // 0x5f20(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2668D8134F92B679489EFC81EC1333FC; // 0x6218(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F1A778784D39803CE6AC95A88E0CFEE8; // 0x6510(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_094DAFA0481E99ED9707AAB7E6984B05; // 0x6808(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F99EA1854635E1965CCBAD9286441B55; // 0x6b00(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_080324904FA38AD62BC1EBA84C5EA4AF; // 0x6df8(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_516B170C4C235D0598102E9B38E0263D; // 0x70f0(0x2f8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_0C98DAD4418F655D0F86BC95C4D8F09D; // 0x73e8(0x2f8)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_A1D69D9F464D21AC25BAFF8226E71B02; // 0x76e0(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_4D6AF3DF4CBE88DBB250A6A385E41C22; // 0x79c0(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_676F38D84E1C04443AAA0586AD4D35B8; // 0x7ca0(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_DA208AEF43E1E207F434E0A74BE8A85D; // 0x7f80(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_D57DC95E4ED0F4EA667BF1B8CAB3DD35; // 0x8260(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_DB069B5F4EFCD97DF76622B00B31FD41; // 0x8540(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_3C8CF03F4B165FEFE089FDA0B98EB43A; // 0x8820(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_61E30258485EADC175D10A84DFC7468C; // 0x8b00(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_D9BB5F2A49D105D7DC6A66A46F6A9F60; // 0x8de0(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_E35D8C154689EAE1576A83840DD2D69E; // 0x90c0(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_105F40A44FB4089611A059AF28F20E67; // 0x93a0(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_7CF8D3E54B6FEC37CDE9CB950B194422; // 0x9680(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_8DFDB3CB4B9ADB44EFC30A8522C600EE; // 0x9960(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_A315DBDB4961ECE8BD57EC8660FFCF1C; // 0x9c40(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_D016FB2048FAF8F83C6D0CA950101572; // 0x9f20(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_EAFC876D49219928AE4577BD14B4A4FE; // 0xa200(0x2e0)
	struct FAnimNode_CacheBlend ZZAnimGraphNode_CacheBlend_F117A745498029EC184EAC9A8C4BFC13; // 0xa4e0(0x2e0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6595FB124A12BA811F76B9AD3412C288; // 0xa7c0(0xd8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_E0082FFA4925D01EFA69F4B1309B8C9F; // 0xa898(0x110)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5B3BBFA04784E937713EBF96E09C1106; // 0xa9a8(0xf8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_B9E75065404F99AA6DC3ABA9E61F4933; // 0xaaa0(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_0FF6D39449D4D4348E8A0596AACC2685; // 0xab90(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_0000EE4A49E3BDE7D366129D8C6BDC81; // 0xabe8(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_C07DA7C8483BA62DD331C8B3D73C0F31; // 0xac40(0xf0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2925AC8C41796C6689B2FF95299C28D3; // 0xad30(0x100)
	struct TArray<float> Customized_Orientation_Warping_Angles_8_Directions; // 0xae30(0x10)
	int32_t Previous_Orientation_Warping_Direction_8_Directions; // 0xae40(0x04)
	float Orientation_Warping_Blend_Time; // 0xae44(0x04)
	struct FCustomizedOrientationWarpingAngleSetting Customized_Orientation_Warping_Setting_8_Directions; // 0xae48(0x20)
	float Orientation_Warping_Buffer_Value; // 0xae68(0x04)
	int32_t Current_Valid_Direction; // 0xae6c(0x04)
	float Left_Foot_IK_Modify_Alpha; // 0xae70(0x04)
	struct FVector Left_Foot_IK_Location; // 0xae74(0x0c)
	struct FRotator Left_Foot_IK_Rotation; // 0xae80(0x0c)
	float Right_Foot_IK_Modify_Alpha; // 0xae8c(0x04)
	struct FVector Right_Foot_IK_Location; // 0xae90(0x0c)
	struct FRotator Right_Foot_IK_Rotation; // 0xae9c(0x0c)
	float Current_Orientation_Warping_Time; // 0xaea8(0x04)
	struct FVector LastVelocity; // 0xaeac(0x0c)
	bool Toggle_Warping; // 0xaeb8(0x01)
	char pad_AEB9[0x3]; // 0xaeb9(0x03)
	float LastNormalizedSpeed; // 0xaebc(0x04)
	float Orientation_Warping_Blend_Time_Classical_Time; // 0xaec0(0x04)
	float CurrentRotateRootAngle; // 0xaec4(0x04)
	struct FVector LocRelativeVelocityDir; // 0xaec8(0x0c)
	float Sum; // 0xaed4(0x04)
	struct FVector RelativeDirection; // 0xaed8(0x0c)
	struct FVelocityBlend VelocityBlend; // 0xaee4(0x10)
	float VelocityBlendInterpSpeed; // 0xaef4(0x04)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Player_BaseLocomotion_3P.Player_BaseLocomotion_3P_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000001
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
