
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// Class Slate.ButtonWidgetStyle
// Size: 0x2d0 (Inherited: 0x38)
class UButtonWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FButtonStyle ButtonStyle; // 0x38(0x298)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x600 (Inherited: 0x38)
class UCheckBoxWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FCheckBoxStyle CheckBoxStyle; // 0x38(0x5c8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x440 (Inherited: 0x38)
class UComboBoxWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FComboBoxStyle ComboBoxStyle; // 0x38(0x408)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x408 (Inherited: 0x38)
class UComboButtonWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FComboButtonStyle ComboButtonStyle; // 0x38(0x3d0)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x898 (Inherited: 0x38)
class UEditableTextBoxWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x38(0x860)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x270 (Inherited: 0x38)
class UEditableTextWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FEditableTextStyle EditableTextStyle; // 0x38(0x238)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.ProgressWidgetStyle
// Size: 0x1f0 (Inherited: 0x38)
class UProgressWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FProgressBarStyle ProgressBarStyle; // 0x38(0x1b8)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x550 (Inherited: 0x38)
class UScrollBarWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FScrollBarStyle ScrollBarStyle; // 0x38(0x518)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x280 (Inherited: 0x38)
class UScrollBoxWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FScrollBoxStyle ScrollBoxStyle; // 0x38(0x248)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.SlateSettings
// Size: 0x38 (Inherited: 0x30)
class USlateSettings : public UObject {
public:

	bool bExplicitCanvasChildZOrder; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x348 (Inherited: 0x38)
class USpinBoxWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FSpinBoxStyle SpinBoxStyle; // 0x38(0x310)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x2c8 (Inherited: 0x38)
class UTextBlockWidgetStyle : public USlateWidgetStyleContainerBase {
public:

	struct FTextBlockStyle TextBlockStyle; // 0x38(0x290)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};

// Class Slate.ToolMenuBase
// Size: 0x30 (Inherited: 0x30)
class UToolMenuBase : public UObject {
public:


	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
