
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass UI_EdgeLightDebug.UI_EdgeLightDebug_C
// Size: 0x328 (Inherited: 0x298)
class UUI_EdgeLightDebug_C : public UUserWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UButton* Button_143; // 0x2a0(0x08)
	struct UButton* Button_162; // 0x2a8(0x08)
	struct UButton* Button_370; // 0x2b0(0x08)
	struct UEditableTextBox* EditableTextBox; // 0x2b8(0x08)
	struct UEditableTextBox* EditableTextBox_2; // 0x2c0(0x08)
	struct UEditableTextBox* EditableTextBox_3; // 0x2c8(0x08)
	struct UEditableTextBox* EditableTextBox_4; // 0x2d0(0x08)
	struct UEditableTextBox* EditableTextBox_5; // 0x2d8(0x08)
	struct UEditableTextBox* EditableTextBox_6; // 0x2e0(0x08)
	struct UEditableTextBox* EditableTextBox_7; // 0x2e8(0x08)
	struct UEditableTextBox* EditableTextBox_8; // 0x2f0(0x08)
	struct UEditableTextBox* EditableTextBox_9; // 0x2f8(0x08)
	struct UEditableTextBox* EditableTextBox_10; // 0x300(0x08)
	struct TArray<struct ASkeletalMeshActor*> NewVar_1; // 0x308(0x10)
	struct TArray<struct ATextRenderActor*> NewVar_2; // 0x318(0x10)

	void Construct(); // Function UI_EdgeLightDebug.UI_EdgeLightDebug_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x73fffec0700078
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
