
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_Power.WBP_Store_RecommendHomepage_Power_C
// Size: 0x388 (Inherited: 0x298)
class UWBP_Store_RecommendHomepage_Power_C : public UUserWidget {
public:

	struct UWidgetAnimation* WBP_Store_RecommendHomepage_Power_loop; // 0x298(0x08)
	struct UDFImage* DFImage; // 0x2a0(0x08)
	struct UDFImage* DFImage_5; // 0x2a8(0x08)
	struct UDFImage* DFImage_7; // 0x2b0(0x08)
	struct UDFImage* DFImage_8; // 0x2b8(0x08)
	struct UDFImage* DFImage_9; // 0x2c0(0x08)
	struct UDFImage* DFImage_10; // 0x2c8(0x08)
	struct UDFImage* DFImage_12; // 0x2d0(0x08)
	struct UDFImage* DFImage_16; // 0x2d8(0x08)
	struct UDFImage* DFImage_17; // 0x2e0(0x08)
	struct UDFImage* DFImage_18; // 0x2e8(0x08)
	struct UDFImage* DFImage_81; // 0x2f0(0x08)
	struct UDFImage* fx_guang; // 0x2f8(0x08)
	struct UDFImage* fx_lizifencen; // 0x300(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x308(0x08)
	struct UDFImage* fx_lizifencen_3; // 0x310(0x08)
	struct UDFImage* fx_lizifencen_4; // 0x318(0x08)
	struct UDFImage* fx_lizifencen_5; // 0x320(0x08)
	struct UDFImage* fx_lizifencen_6; // 0x328(0x08)
	struct UDFImage* fx_wu_3; // 0x330(0x08)
	struct UDFImage* fx_wu_4; // 0x338(0x08)
	struct UDFImage* M_UI_Base_MardLight_004; // 0x340(0x08)
	struct UDFImage* M_UI_Base_MardLight_005; // 0x348(0x08)
	struct UDFImage* M_UI_Base_MardLight_006; // 0x350(0x08)
	struct UDFImage* MI_UI_Store_RecommendHomepage_Power_001; // 0x358(0x08)
	struct UDFImage* MI_UI_Store_RecommendHomepage_Power_002; // 0x360(0x08)
	struct UDFImage* MI_UI_Store_RecommendHomepage_Power_003; // 0x368(0x08)
	struct UDFImage* MI_UI_WBP_Store_RecommendHomepage_VFX_BMGL08; // 0x370(0x08)
	struct UDFImage* MI_UI_WBP_Store_RecommendHomepage_VFX_BMGL10; // 0x378(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x380(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
