
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_PacksBtn.WBP_Store_PacksBtn_C
// Size: 0x5d0 (Inherited: 0x550)
class UWBP_Store_PacksBtn_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* Selected; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_PacksBtn_Click; // 0x560(0x08)
	struct UWidgetAnimation* HoverAni; // 0x568(0x08)
	struct UDFImage* DFImage_119; // 0x570(0x08)
	struct UDFImage* DFImage_341; // 0x578(0x08)
	struct UDFImage* DFImage_414; // 0x580(0x08)
	struct UDFImage* DFImages_m_fx; // 0x588(0x08)
	struct UDFImage* DFImages_m_fx_2; // 0x590(0x08)
	struct UImage* Image_188; // 0x598(0x08)
	struct UImage* Image_FX_01; // 0x5a0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5a8(0x08)
	struct UWBP_CommonHoverScaleOnly_C* WBP_CommonHoverScaleOnly; // 0x5b0(0x08)
	struct UDFImage* wtBundleIcon; // 0x5b8(0x08)
	struct UDFButton* wtButtonSelect; // 0x5c0(0x08)
	struct UWBP_SlotCompSelected_C* wtSlotCompSelected; // 0x5c8(0x08)

	void BndEvt__WBP_ItemHover_K2Node_ComponentBoundEvent_0_OnCommonHoverEvent__DelegateSignature(); // Function WBP_Store_PacksBtn.WBP_Store_PacksBtn_C.BndEvt__WBP_ItemHover_K2Node_ComponentBoundEvent_0_OnCommonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
