
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithFinetuneMainUI.WBP_GunStand_GunsmithFinetuneMainUI_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_GunStand_GunsmithFinetuneMainUI_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_GunStand_GunsmithMainPreviewUI_hidden; // 0x550(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithMainPreviewUI_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithMainPreviewUI_in; // 0x560(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_Content; // 0x568(0x08)
	struct UPlatformPaddingBox* wt_PlatformPaddingBox_PointCanvas; // 0x570(0x08)
	struct UTextBlock* wt_TextBlock_WeaponName; // 0x578(0x08)
	struct UWBP_CommonSwitch2_C* wt_WBP_CommonSwitch2; // 0x580(0x08)
	struct UWBP_GunStand_GunsmithFinetune3DPointCanvasUI_C* wt_WBP_GunStand_GunsmithFinetune3DPointCanvasUI; // 0x588(0x08)
	struct UWBP_GunStand_GunsmithSimulateStatePropmtUI_C* wt_WBP_GunStand_GunsmithSimulateStatePropmtUI; // 0x590(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
