
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Common_CardS2.WBP_Common_CardS2_C
// Size: 0x61c (Inherited: 0x550)
class UWBP_Common_CardS2_C : public UHeroCardLuaBaseWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Common_CardS2_in; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Common_CardS2_HoverAni; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Common_CardS2_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Common_CardS2_in_2; // 0x570(0x08)
	struct UDFImage* ArmedForceImg; // 0x578(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x580(0x08)
	struct UDFImage* DFImage_fx_xian01_2; // 0x588(0x08)
	struct UDFImage* DFImage_fx_xian01_3; // 0x590(0x08)
	struct UDFImage* DFImage_fx_xian01_4; // 0x598(0x08)
	struct UDFImage* DFImage_fx_xian01_5; // 0x5a0(0x08)
	struct UDFImage* DFImage_Line; // 0x5a8(0x08)
	struct UDFSizeBox* DFSizeBox_1; // 0x5b0(0x08)
	struct UDFSizeBox* DFSizeBox_2; // 0x5b8(0x08)
	struct UImage* Image_kuangfx; // 0x5c0(0x08)
	struct UDFCommonTextBlock* LevelText; // 0x5c8(0x08)
	struct UComputeTextBlock* NameTB; // 0x5d0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5d8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_196; // 0x5f0(0x08)
	struct UDFImage* Title_Icon; // 0x5f8(0x08)
	struct UWBP_Common_CardIcon_C* WBP_Common_CardIcon; // 0x600(0x08)
	struct UWBP_Common_CardIcon_C* WBP_Common_CardIcon_2; // 0x608(0x08)
	struct UWBP_Common_CardIcon_C* WBP_Common_CardIcon_3; // 0x610(0x08)
	int32_t TypeSize; // 0x618(0x04)

	void SetType(int32_t Type); // Function WBP_Common_CardS2.WBP_Common_CardS2_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x72c0650073
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
