
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithPartMainUI.WBP_GunStand_GunsmithPartMainUI_C
// Size: 0x600 (Inherited: 0x550)
class UWBP_GunStand_GunsmithPartMainUI_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithPartMainUI_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithPartMainUI_in; // 0x560(0x08)
	struct UDFImage* DFImage; // 0x568(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x570(0x08)
	struct UDFCanvasPosReContainer* PlatformPaddingBox_PC2; // 0x578(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x580(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char WBP_DFCommonCheckBoxWithText[0x8]; // 0x588(0x08)
	struct UWBP_AssemblyMapNeed_C* WBP_GunStand_AttachmentChangeTips; // 0x590(0x08)
	struct UNamedSlot* wt_Slot_DebugUIContext; // 0x598(0x08)
	struct UDFWaterfallScrollView* wt_WaterFallList; // 0x5a0(0x08)
	struct UWBP_AssemblyMapNeed_C* wt_WBP_AssemblyMapNeed; // 0x5a8(0x08)
	struct UWBP_AssemblyMapNeed_C* wt_WBP_AssemblyMapNeed4Finetune; // 0x5b0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wt_WBP_CommonButton_Equip[0x8]; // 0x5b8(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wt_WBP_CommonButton_Finetune[0x8]; // 0x5c0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wt_WBP_CommonButton_PurchaseAndEquip[0x8]; // 0x5c8(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wt_WBP_CommonButton_Simulate[0x8]; // 0x5d0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wt_WBP_CommonButton_UnEquip[0x8]; // 0x5d8(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wt_WBP_CommonButton_Unlock_MP[0x8]; // 0x5e0(0x08)
	struct UWBP_GunStand_GunsmithSceneSocketPartUI_C* wt_WBP_GunStand_GunsmithSceneSocketPartUI; // 0x5e8(0x08)
	struct UWBP_GunStand_GunsmithSimulateStatePropmtUI_C* wt_WBP_GunStand_GunsmithSimulateStatePropmtUI; // 0x5f0(0x08)
	struct UDFCanvasPanel* wtUnlockPanel; // 0x5f8(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_GunStand_GunsmithPartMainUI.WBP_GunStand_GunsmithPartMainUI_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
