
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage.WBP_Store_RecommendHomepage_C
// Size: 0x6a0 (Inherited: 0x550)
class UWBP_Store_RecommendHomepage_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in_3; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo_finsh; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in; // 0x570(0x08)
	struct UDFButton* DFButton_38; // 0x578(0x08)
	struct UDFImage* DFImage_119; // 0x580(0x08)
	struct UDFImage* DFImage_267; // 0x588(0x08)
	struct UDFImage* DFImage_276; // 0x590(0x08)
	struct UDFMImage* DFMImage_82; // 0x598(0x08)
	struct UDFMImage* DFMImage_152; // 0x5a0(0x08)
	struct UDFMImage* DFMImage_221; // 0x5a8(0x08)
	struct UDFScaleBox* DFScaleBox_2; // 0x5b0(0x08)
	struct UDFWidgetSwitcher* DFWidgetSwitcher_101; // 0x5b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5c0(0x08)
	struct URichTextBlock* RichTextBlock; // 0x5c8(0x08)
	struct UWBP_Common_JumpOver_C* WBP_Common_JumpOver; // 0x5d0(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5d8(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton[0x8]; // 0x5e0(0x08)
	struct UWBP_CommonVideoComponent_C* WBP_CommonVideoComponent; // 0x5e8(0x08)
	struct UWBP_StaffLottery_Bg_C* WBP_StaffLottery_Bg; // 0x5f0(0x08)
	struct UWBP_Store_RecommendHomepage_Breakthrough_C* WBP_Store_RecommendHomepage_Breakthrough; // 0x5f8(0x08)
	struct UWBP_Store_RecommendHomepage_FieryOwl_C* WBP_Store_RecommendHomepage_FieryOwl_C_1; // 0x600(0x08)
	struct UWBP_Store_RecommendHomepage_HaavkIndustry_C* WBP_Store_RecommendHomepage_HaavkIndustry; // 0x608(0x08)
	struct UWBP_Store_RecommendHomepage_Medusa_C* WBP_Store_RecommendHomepage_Medusa; // 0x610(0x08)
	struct UWBP_Store_RecommendHomepage_Mercy_C* WBP_Store_RecommendHomepage_Mercy; // 0x618(0x08)
	struct UWBP_Store_RecommendHomepage_Power_C* WBP_Store_RecommendHomepage_Power; // 0x620(0x08)
	struct UWBP_Store_RecommendHomepage_VFX_BMGLB_C* WBP_Store_RecommendHomepage_VFX_BMGLB; // 0x628(0x08)
	struct UWBP_Store_RecommendHomepage_VFX_PrismOffensive_C* WBP_Store_RecommendHomepage_VFX_PrismOffensive; // 0x630(0x08)
	struct UWBP_Store_RecommendHomepage_Victor_Dark_C* WBP_Store_RecommendHomepage_Victor_Dark_523; // 0x638(0x08)
	struct UWBP_Store_RecommendHomepage_WitchDoctor_C* WBP_Store_RecommendHomepage_WitchDoctor; // 0x640(0x08)
	/*struct UWBP_Store_RecommendHomepage_Zero_C**/char WBP_Store_RecommendHomepage_Zero[0x8]; // 0x648(0x08)
	struct UDFImage* wt_NameIcon; // 0x650(0x08)
	struct UWBP_Store_Countdown_C* wtCountDown; // 0x658(0x08)
	struct UDFWaterfallScrollView* wtDFWaterfallScrollView_3; // 0x660(0x08)
	struct UDFImage* wtIamgeCountDown; // 0x668(0x08)
	struct UTextBlock* wtSkipText; // 0x670(0x08)
	struct UComputeTextBlock* wtTextBundleName; // 0x678(0x08)
	struct UDFTextBlock* wtTextGoodsTip; // 0x680(0x08)
	struct UDFTextBlock* wtTextPriceOrign; // 0x688(0x08)
	struct TArray<struct FString> ID; // 0x690(0x10)

	void SetVfx(struct FString& ID); // Function WBP_Store_RecommendHomepage.WBP_Store_RecommendHomepage_C.SetVfx // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x72c0650073
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
