
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_ContentWeapon.WBP_ContentWeapon_C
// Size: 0x600 (Inherited: 0x550)
class UWBP_ContentWeapon_C : public ULuaUIBaseView {
public:

	struct UDFImage* DFImage; // 0x550(0x08)
	struct UDFImage* DFImage_92; // 0x558(0x08)
	struct UWBP_ItemDetailContent_EnhancedAccessoryLevel_C* wArmorPiercingLevel; // 0x560(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect; // 0x568(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_2; // 0x570(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_3; // 0x578(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_4; // 0x580(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_5; // 0x588(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_6; // 0x590(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_7; // 0x598(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup; // 0x5a0(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_2; // 0x5a8(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_3; // 0x5b0(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_4; // 0x5b8(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_5; // 0x5c0(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_8; // 0x5c8(0x08)
	struct UWBP_DFCommonCheckButtonV3S1_C* WBP_WBP_ItemDetailContent_attribute; // 0x5d0(0x08)
	struct UWBP_DFCommonCheckButtonV3S1_C* WBP_WBP_ItemDetailContent_attribute_2; // 0x5d8(0x08)
	struct UVerticalBox* WeaponVerticalBox; // 0x5e0(0x08)
	struct UWBP_ItemDetailContent_ListContent_C* wWeaponAdaptsContent; // 0x5e8(0x08)
	struct TArray<struct FLinearColor> BpColor; // 0x5f0(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
