
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Common_CardIcon.WBP_Common_CardIcon_C
// Size: 0x5ac (Inherited: 0x550)
class UWBP_Common_CardIcon_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hero_CustomBusinessCard_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Hero_CustomBusinessCard_in; // 0x560(0x08)
	struct UDFButton* DFButton_1; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_1; // 0x570(0x08)
	struct UDFImage* DFImage; // 0x578(0x08)
	struct UDFImage* DFImage_52; // 0x580(0x08)
	struct UImage* Image_44; // 0x588(0x08)
	struct UPlatformSizeBox* PlatformSizeBox_1; // 0x590(0x08)
	struct UWBP_SlotCompDecBtn_C* WBP_SlotCompDecBtn; // 0x598(0x08)
	struct UWVP_Common_DragSelectedBox_C* WVP_Common_DragSelectedBox; // 0x5a0(0x08)
	int32_t Type; // 0x5a8(0x04)

	void SetType(int32_t Selection); // Function WBP_Common_CardIcon.WBP_Common_CardIcon_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3cc71c70c0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
