
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_CommonPopWindowsV2.WBP_CommonPopWindowsV2_C
// Size: 0x718 (Inherited: 0x568)
class UWBP_CommonPopWindowsV2_C : public UCommonPopWindowV2LuaBaseWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x568(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_smalllin_shangxia; // 0x570(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_smalllin_zuoyou; // 0x578(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_smalllin_overall; // 0x580(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_largein_shangxia; // 0x588(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_largein_zuoyou; // 0x590(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_largein_overall; // 0x598(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_loop1; // 0x5a0(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_loop; // 0x5a8(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_out; // 0x5b0(0x08)
	struct UCanvasPanel* CanvasPanel_12; // 0x5b8(0x08)
	struct UDFBackgroundBlur* DFBackgroundBlur_154; // 0x5c0(0x08)
	struct UDFImage* DFImage; // 0x5c8(0x08)
	struct UDFImage* DFImage_92; // 0x5d0(0x08)
	struct UDFImage* DFImage_93; // 0x5d8(0x08)
	struct UDFImage* DFImage_101; // 0x5e0(0x08)
	struct UDFImage* DFImage_146; // 0x5e8(0x08)
	struct UDFImage* DFImage_192; // 0x5f0(0x08)
	struct UDFImage* DFImage_255; // 0x5f8(0x08)
	struct UDFImage* DFImage__FX_13; // 0x600(0x08)
	struct UDFImage* DFImage_Icon_line; // 0x608(0x08)
	struct UDFImage* DFImage_Icon_line_2; // 0x610(0x08)
	struct UDFImage* DFImage_Icon_line_3; // 0x618(0x08)
	struct UDFImage* DFImage_Icon_line_4; // 0x620(0x08)
	struct UDFImage* DFImage_title_line_01; // 0x628(0x08)
	struct UDFImage* DFImage_title_line_02; // 0x630(0x08)
	struct UDFImage* DFImage_title_line_03; // 0x638(0x08)
	struct UDFImage* DFImage_title_line_04; // 0x640(0x08)
	struct UDFMImage* DFMImage_fxguzhangxian_3; // 0x648(0x08)
	struct UDFScaleBox* DFScaleBox_3; // 0x650(0x08)
	struct UImage* Image; // 0x658(0x08)
	struct UImage* Image_22; // 0x660(0x08)
	struct UImage* Image_3; // 0x668(0x08)
	struct UImage* Image_404; // 0x670(0x08)
	struct UImage* Image_10462142; // 0x678(0x08)
	struct UNamedSlot* NamedSlot_100; // 0x680(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x688(0x08)
	struct UWBP_CommonPopWindowsV2_line_C* WBP_CommonPopWindowsV2_line_C_10; // 0x690(0x08)
	/*struct UWBP_TopBarHD_InputSummary_C**/char WBP_TopBarHD_InputSummary[0x8]; // 0x698(0x08)
	struct UDFButton* wtCloseBtn; // 0x6a0(0x08)
	struct UComputeTextBlock* wTextBlock_01; // 0x6a8(0x08)
	struct UDFHorizontalBox* wtForCenterBtnHb; // 0x6b0(0x08)
	struct UImage* wtForCenterBtnImg; // 0x6b8(0x08)
	struct UDFNamedSlot* wtForRightBtnSlot; // 0x6c0(0x08)
	struct FText Title; // 0x6c8(0x18)
	int32_t BP_SizeType; // 0x6e0(0x04)
	int32_t BP_SidebarType; // 0x6e4(0x04)
	struct FVector2D BP_BtnSizeOne; // 0x6e8(0x08)
	struct FVector2D BP_BtnSizeTwo; // 0x6f0(0x08)
	/*struct TArray<struct TSoftObjectPtr<UPaperSprite>>*/char Image_2[0x10]; // 0x6f8(0x10)
	/*struct TArray<struct TSoftObjectPtr<UTexture2D>>*/char Image1[0x10]; // 0x708(0x10)

	void SetPC(); // Function WBP_CommonPopWindowsV2.WBP_CommonPopWindowsV2_C.SetPC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
