
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_DiscounPackst.WBP_Store_DiscounPackst_C
// Size: 0x641 (Inherited: 0x550)
class UWBP_Store_DiscounPackst_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_DiscounPackst_in; // 0x558(0x08)
	struct UWidgetAnimation* HoverAni; // 0x560(0x08)
	struct UDFImage* DFImage; // 0x568(0x08)
	struct UDFImage* DFImage_2; // 0x570(0x08)
	struct UDFImage* DFImage_3; // 0x578(0x08)
	struct UDFImage* DFImage_70; // 0x580(0x08)
	struct UDFImage* DFImage_161; // 0x588(0x08)
	struct UDFImage* DFImage_319; // 0x590(0x08)
	struct UDFImage* DFImage_423; // 0x598(0x08)
	struct UDFImage* DFImage_480; // 0x5a0(0x08)
	struct UDFImage* DFImage_719; // 0x5a8(0x08)
	struct UDFImage* DFImage_eye_fx; // 0x5b0(0x08)
	struct UDFImage* DFImage_fx_gun; // 0x5b8(0x08)
	struct UDFImage* DFImagefx_4; // 0x5c0(0x08)
	struct UDFImage* DFImagefx_5; // 0x5c8(0x08)
	struct UDFImage* DFImagefx_6; // 0x5d0(0x08)
	struct UDFImage* DFImagefx_7; // 0x5d8(0x08)
	struct UDFRetainerBox* DFRetainerBox_1; // 0x5e0(0x08)
	struct UImage* Image_kuangfx_2; // 0x5e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5f0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5f8(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x600(0x08)
	struct UDFButton* wtButtonSelect; // 0x608(0x08)
	struct UDFImage* wtIamgeCountDown; // 0x610(0x08)
	struct UDFImage* wtImageIcon; // 0x618(0x08)
	struct UWBP_Store_Countdown_C* wtStoreCountDown; // 0x620(0x08)
	struct UComputeTextBlock* wtTextBundleName; // 0x628(0x08)
	struct UDFRichTextBlock* wtTextBuyLimit; // 0x630(0x08)
	struct URichTextBlock* wtTextPrice; // 0x638(0x08)
	bool IsSlideButtons; // 0x640(0x01)

	void SetSlideButtons(bool IsSlideButtons); // Function WBP_Store_DiscounPackst.WBP_Store_DiscounPackst_C.SetSlideButtons // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x6ec0000050
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
