
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_HaavkIndustry.WBP_Store_RecommendHomepage_HaavkIndustry_C
// Size: 0x338 (Inherited: 0x298)
class UWBP_Store_RecommendHomepage_HaavkIndustry_C : public UUserWidget {
public:

	struct UWidgetAnimation* WBP_Store_RecommendHomepage_HaavkIndustry_loop; // 0x298(0x08)
	struct UDFImage* DFImage_2; // 0x2a0(0x08)
	struct UDFImage* DFImage_81; // 0x2a8(0x08)
	struct UDFImage* fx_guang; // 0x2b0(0x08)
	struct UDFImage* fx_lizifencen; // 0x2b8(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x2c0(0x08)
	struct UDFImage* fx_lizifencen_3; // 0x2c8(0x08)
	struct UDFImage* fx_lizifencen_4; // 0x2d0(0x08)
	struct UDFImage* fx_wu_4; // 0x2d8(0x08)
	struct UDFImage* M_UI_Base_MardLight_3; // 0x2e0(0x08)
	struct UDFImage* M_UI_Base_MardLight_005; // 0x2e8(0x08)
	struct UDFImage* M_UI_Base_MardLight_007; // 0x2f0(0x08)
	struct UDFImage* M_UI_Base_MardLight_008; // 0x2f8(0x08)
	struct UDFImage* M_UI_Base_MardLight_009; // 0x300(0x08)
	struct UDFImage* M_UI_Base_MardLight_010; // 0x308(0x08)
	struct UDFImage* MI_UI_Base_D_Add_7; // 0x310(0x08)
	struct UDFImage* MI_UI_SettlementTip; // 0x318(0x08)
	struct UDFImage* MI_UI_SettlementTip_001; // 0x320(0x08)
	struct UDFImage* MI_UI_WBP_Reflow_PopWindow_004; // 0x328(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x330(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
