
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_ModeHall.WBP_ModeHall_C
// Size: 0x6f8 (Inherited: 0x550)
class UWBP_ModeHall_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_ModeHall_ChoseMode; // 0x558(0x08)
	struct UWidgetAnimation* WBP_ModeHall_out; // 0x560(0x08)
	struct UWidgetAnimation* _22222; // 0x568(0x08)
	struct UWidgetAnimation* WBP_ModeHall_in_3; // 0x570(0x08)
	struct UWidgetAnimation* WBP_ModeHall_in_2; // 0x578(0x08)
	struct UWidgetAnimation* WBP_ModeHall_in_1; // 0x580(0x08)
	struct UWidgetAnimation* WBP_ModeHall_out_6; // 0x588(0x08)
	struct UDFButton* Button; // 0x590(0x08)
	struct UButton* Button_4; // 0x598(0x08)
	struct UButton* Button_5; // 0x5a0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char Button_77[0x8]; // 0x5a8(0x08)
	struct UButton* Button_141; // 0x5b0(0x08)
	struct UButton* Button_182; // 0x5b8(0x08)
	struct UDFHorizontalBox* CanvasPanel_65; // 0x5c0(0x08)
	struct UTextBlock* CodeHotFixTxt; // 0x5c8(0x08)
	struct UDFButton* DFButton_39; // 0x5d0(0x08)
	struct UDFButton* DFButton_88; // 0x5d8(0x08)
	struct UDFImage* DFImage; // 0x5e0(0x08)
	struct UDFImage* DFImage_2; // 0x5e8(0x08)
	struct UDFImage* DFImage_45; // 0x5f0(0x08)
	struct UDFImage* DFImage_76; // 0x5f8(0x08)
	struct UDFImage* DFImage_91; // 0x600(0x08)
	struct UDFImage* DFImage_120; // 0x608(0x08)
	struct UDFImage* DFImage_127; // 0x610(0x08)
	struct UDFImage* DFImage_144; // 0x618(0x08)
	struct UDFImage* DFImage_326; // 0x620(0x08)
	struct UDFTextBlock* DFTextBlock; // 0x628(0x08)
	struct UDFCommonMediaView_C* Image_77; // 0x630(0x08)
	struct UDFMCommonImage* Image_200; // 0x638(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x640(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x648(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x650(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x658(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x660(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_6; // 0x668(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_7; // 0x670(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_8; // 0x678(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_9; // 0x680(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_10; // 0x688(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x690(0x08)
	struct UWBP_CommonHeadIcon_C* WBP_CommonHeadIcon; // 0x698(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover_2[0x8]; // 0x6a0(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover_4[0x8]; // 0x6a8(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover_5[0x8]; // 0x6b0(0x08)
	struct UWBP_Hall_Download_C* WBP_Hall_Download; // 0x6b8(0x08)
	struct UWBP_ModeHallButton_C* WBP_ModeHallButton; // 0x6c0(0x08)
	struct UWBP_ModeHallButton_C* WBP_ModeHallButton_2; // 0x6c8(0x08)
	struct UWBP_ModeHallButton_C* WBP_ModeHallButton_3; // 0x6d0(0x08)
	struct UWBP_ModeHallButton_C* WBP_ModeHallButton_4; // 0x6d8(0x08)
	struct UWBP_ModeHallButton_C* WBP_ModeHallButton_5; // 0x6e0(0x08)
	struct UWBP_ModeHallButton_C* WBP_ModeHallButton_6; // 0x6e8(0x08)
	struct UImage* wtGuidePlay; // 0x6f0(0x08)

	void PC(); // Function WBP_ModeHall.WBP_ModeHall_C.PC // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
