
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_StaffLottery_MainUI.WBP_StaffLottery_MainUI_C
// Size: 0x708 (Inherited: 0x550)
class UWBP_StaffLottery_MainUI_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_MainUI_zhuan022; // 0x558(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_MainUI_zhuan011; // 0x560(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_MainUI_qiehuan2; // 0x568(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_MainUI_qiehuan; // 0x570(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_MainUI_out; // 0x578(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_MainUI_in; // 0x580(0x08)
	struct UWBP_StaffLottery_Bg_C* AnimBg; // 0x588(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_1; // 0x590(0x08)
	struct UDFHorizontalBox* DFHorizontalBox; // 0x598(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x5a0(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_4; // 0x5a8(0x08)
	struct UDFImage* DFImage; // 0x5b0(0x08)
	struct UDFImage* DFImage_2; // 0x5b8(0x08)
	struct UDFImage* DFImage_Title; // 0x5c0(0x08)
	struct UDFTextBlock* DFTextBlock_CostNumber; // 0x5c8(0x08)
	struct UDFTextBlock* DFTextBlock_Total; // 0x5d0(0x08)
	struct UDFTextBlock* DFTextBlock_Total_2; // 0x5d8(0x08)
	struct UDFTipsAnchor* DFTipsAnchor; // 0x5e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5f0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5f8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x600(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_UnScaleBg; // 0x608(0x08)
	struct UWBP_CommonVideoComponent_C* WBP_CommonVideoComponent; // 0x610(0x08)
	struct UWBP_DFCommonButtonV2S2_C* WBP_DFCommonButtonV2S2; // 0x618(0x08)
	struct UWBP_DFCommonIconCheckButtonS2_C* WBP_DFCommonIconCheckButtonS2; // 0x620(0x08)
	struct UDFButton* wtDetailCheckBtn; // 0x628(0x08)
	struct UDFImage* wtFirearmImg; // 0x630(0x08)
	struct UDFImage* wtFirearmImg_2; // 0x638(0x08)
	/*struct UWBP_DFCommonButtonV1S3_C**/char wtMultipleActionBtn[0x8]; // 0x640(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtPlayVideoBtn[0x8]; // 0x648(0x08)
	struct UWBP_Common_JumpOver_C* wtSkipBtn; // 0x650(0x08)
	struct UWBP_Store_Countdown_C* wtStoreCountDown; // 0x658(0x08)
	struct UComputeTextBlock* wtWeaponDesc; // 0x660(0x08)
	struct TMap<struct FString, struct FSoftObjectPath> IDToBackground; // 0x668(0x50)
	struct TMap<struct FString, struct FSoftObjectPath> IDToArtFont; // 0x6b8(0x50)

	void Setup(struct FString& ID); // Function WBP_StaffLottery_MainUI.WBP_StaffLottery_MainUI_C.Setup // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000074
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
