
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SlotCompGet.WBP_SlotCompGet_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_SlotCompGet_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_Store_PacksItem_shuaguang; // 0x550(0x08)
	struct UDFImage* DFImage_67; // 0x558(0x08)
	struct UDFImage* DFImage_1_fx; // 0x560(0x08)
	struct UDFImage* DFImage_2_fx; // 0x568(0x08)
	struct UDFImage* DFImage_3_fx; // 0x570(0x08)
	struct UDFImage* DFImage_4_fx; // 0x578(0x08)
	struct UDFImage* DFImage_5_fx; // 0x580(0x08)
	struct UDFImage* DFImage_6_fx; // 0x588(0x08)
	struct UDFImage* DFImage_7_fx; // 0x590(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
