
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_DetailList.WBP_RoleInfo_DetailList_C
// Size: 0x670 (Inherited: 0x550)
class UWBP_RoleInfo_DetailList_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_DetailList_In; // 0x558(0x08)
	struct UDFBackgroundBlur* DFBackgroundBlur_70; // 0x560(0x08)
	struct UDFHorizontalBox* DFHorizontalBox; // 0x568(0x08)
	struct UDFImage* DFImage; // 0x570(0x08)
	struct UDFImage* DFImage_2; // 0x578(0x08)
	struct UDFImage* DFImage_3; // 0x580(0x08)
	struct UDFImage* DFImage_4; // 0x588(0x08)
	struct UDFImage* DFImage_5; // 0x590(0x08)
	struct UDFImage* DFImage_6; // 0x598(0x08)
	struct UDFTextBlock* DFTextBlock_01; // 0x5a0(0x08)
	struct UDFTextBlock* DFTextBlock_02; // 0x5a8(0x08)
	struct UDFTextBlock* DFTextBlock_03; // 0x5b0(0x08)
	struct UDFTextBlock* DFTextBlock_Num01; // 0x5b8(0x08)
	struct UDFTextBlock* DFTextBlock_Num02; // 0x5c0(0x08)
	struct UDFTextBlock* DFTextBlock_Num03; // 0x5c8(0x08)
	struct UDFRichTextBlock* DFTextBlock_Tittle; // 0x5d0(0x08)
	struct UDFRichTextBlock* DFTextBlock_TittleNum; // 0x5d8(0x08)
	struct UDFTextBlock* DFTextBlock_TittleNum_2; // 0x5e0(0x08)
	struct UDFTextBlock* DFTextBlock_TittleNum_3; // 0x5e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5f0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5f8(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction[0x8]; // 0x600(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor; // 0x608(0x08)
	struct FText Text01; // 0x610(0x18)
	struct FText Text02; // 0x628(0x18)
	struct FText Text03; // 0x640(0x18)
	struct FText TittleText; // 0x658(0x18)

	void BP_SetDataText(struct FText DataTile, struct FText Data1, struct FText Data2, struct FText Data3); // Function WBP_RoleInfo_DetailList.WBP_RoleInfo_DetailList_C.BP_SetDataText // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
