
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_TipsNonres_MatchTime.WBP_TipsNonres_MatchTime_C
// Size: 0x6bc (Inherited: 0x550)
class UWBP_TipsNonres_MatchTime_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_MatchTime_ask_up; // 0x558(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_MatchTime_ask_down; // 0x560(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_MatchTime_up; // 0x568(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_MatchTime_down; // 0x570(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_MatchTime_continue; // 0x578(0x08)
	struct UWidgetAnimation* WBP_TipsNonres_MatchTime_ask; // 0x580(0x08)
	struct UWidgetAnimation* Anim_In_01; // 0x588(0x08)
	struct UWidgetAnimation* Anim_Out2; // 0x590(0x08)
	struct UWidgetAnimation* Anim_Out; // 0x598(0x08)
	struct UWidgetAnimation* Anima_MatchSuccessful; // 0x5a0(0x08)
	struct UWidgetAnimation* Anim_Loop; // 0x5a8(0x08)
	struct UWidgetAnimation* Anim_In_02; // 0x5b0(0x08)
	struct UDFImage* Bg_Line_2; // 0x5b8(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char CancleBtn[0x8]; // 0x5c0(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char ContinueBtn[0x8]; // 0x5c8(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_1; // 0x5d0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_2; // 0x5d8(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x5e0(0x08)
	struct UDFImage* DFImage; // 0x5e8(0x08)
	struct UDFImage* DFImage_2; // 0x5f0(0x08)
	struct UDFImage* DFImage_4; // 0x5f8(0x08)
	struct UDFImage* DFImage_5; // 0x600(0x08)
	struct UDFImage* DFImage_11; // 0x608(0x08)
	struct UDFImage* DFImage_12; // 0x610(0x08)
	struct UDFImage* DFImage_13; // 0x618(0x08)
	struct UDFImage* DFImage_14; // 0x620(0x08)
	struct UDFImage* DFImage_15; // 0x628(0x08)
	struct UDFImage* DFImage_16; // 0x630(0x08)
	struct UDFImage* DFImage_184; // 0x638(0x08)
	struct UDFMImage* DFMImage_fxxian01_2; // 0x640(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_68; // 0x648(0x08)
	struct UDFTextBlock* DFTextBlock_100; // 0x650(0x08)
	struct UDFTextBlock* DFTextBlock_140; // 0x658(0x08)
	struct UDFImage* HUD_TipsNonres_SP_17; // 0x660(0x08)
	struct UImage* Image_FX; // 0x668(0x08)
	struct UImage* Image_FX_3; // 0x670(0x08)
	struct UImage* Image_FX2; // 0x678(0x08)
	struct UImage* Image_FX2_2; // 0x680(0x08)
	struct UDFCanvasPanel* Panel_SuccessDe; // 0x688(0x08)
	struct UWBP_TipsNonres_MatchTime_PeopleItem_C* WBP_TipsNonres_MatchTime_PeopleItem; // 0x690(0x08)
	struct UWBP_TipsNonres_MatchTime_PeopleItem_C* WBP_TipsNonres_MatchTime_PeopleItem_2; // 0x698(0x08)
	struct UWBP_TipsNonres_MatchTime_PeopleItem_C* WBP_TipsNonres_MatchTime_PeopleItem_3; // 0x6a0(0x08)
	struct UButton* wtCancelBtn; // 0x6a8(0x08)
	struct UTextBlock* wtMapText; // 0x6b0(0x08)
	int32_t Type; // 0x6b8(0x04)

	void SetType(int32_t Type); // Function WBP_TipsNonres_MatchTime.WBP_TipsNonres_MatchTime_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
