
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Common_TopBarV1_CustomerService_Item.WBP_Common_TopBarV1_CustomerService_Item_C
// Size: 0x589 (Inherited: 0x550)
class UWBP_Common_TopBarV1_CustomerService_Item_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_111; // 0x558(0x08)
	struct UDFImage* DFImage_3; // 0x560(0x08)
	struct UDFImage* DFImage_65; // 0x568(0x08)
	struct UDFImage* DFImage_Icon; // 0x570(0x08)
	struct UWBP_CommonHoverBg_V2_C* WBP_CommonHoverBg_V2; // 0x578(0x08)
	struct UDFButton* wtSetupBtn; // 0x580(0x08)
	bool IsHall; // 0x588(0x01)

	void BP_GetReddotPanel(struct UPanelWidget*& NewParam); // Function WBP_Common_TopBarV1_CustomerService_Item.WBP_Common_TopBarV1_CustomerService_Item_C.BP_GetReddotPanel // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x6ec0000039
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
