
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUp_Game.WBP_SetUp_Game_C
// Size: 0x628 (Inherited: 0x550)
class UWBP_SetUp_Game_C_def2 : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_SetUp_Game_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUp_Game_in; // 0x558(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char Check_System_2[0x8]; // 0x560(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char Check_System_3[0x8]; // 0x568(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_System; // 0x570(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_System_2; // 0x578(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem; // 0x580(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_2; // 0x588(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_3; // 0x590(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_4; // 0x598(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_5; // 0x5a0(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_6; // 0x5a8(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_7; // 0x5b0(0x08)
	struct UWBP_SetUpComponent_ArrangemenItem_C* WBP_SetUpComponent_ArrangemenItem_8; // 0x5b8(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_3[0x8]; // 0x5c0(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_4[0x8]; // 0x5c8(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_5[0x8]; // 0x5d0(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_6[0x8]; // 0x5d8(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Cycle[0x8]; // 0x5e0(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle[0x8]; // 0x5e8(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle_2[0x8]; // 0x5f0(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitleSystem[0x8]; // 0x5f8(0x08)
	struct UWBP_SetUpComponent_MultipleChoiceColor_C* WBP_SetUpComponent_MultipleChoiceColor; // 0x600(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Scene[0x8]; // 0x608(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_3; // 0x610(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_ZoomInAdaptive[0x8]; // 0x618(0x08)
	struct UWBP_SetUpComponent_Expandable_C* wtSortlistExpandable; // 0x620(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
