
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_TipsPro_Mini_HD.WBP_TipsPro_Mini_HD_C
// Size: 0x324 (Inherited: 0x2c8)
class UWBP_TipsPro_Mini_HD_C : public UDFHDActionCommonProgressBar {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UWidgetAnimation* WBP_TipsPro_Mini_01; // 0x2d0(0x08)
	struct UWidgetAnimation* WBP_TipsPro_Mini_out; // 0x2d8(0x08)
	struct UWidgetAnimation* WBP_TipsPro_Mini_in; // 0x2e0(0x08)
	struct UWidgetAnimation* Medic_Fast_Anim; // 0x2e8(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x2f0(0x08)
	struct UDFImage* DFImage_108; // 0x2f8(0x08)
	struct UDFImage* DFImage_FX; // 0x300(0x08)
	struct UDFImage* DFImage_FX_2; // 0x308(0x08)
	struct UProgressBar* ProgressBar; // 0x310(0x08)
	struct UWBP_HUCommonBlur_C* WBP_HUCommonBlur; // 0x318(0x08)
	int32_t Type; // 0x320(0x04)

	void SetType(); // Function WBP_TipsPro_Mini_HD.WBP_TipsPro_Mini_HD_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
