
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_WeaponSkinsSale.WBP_Store_WeaponSkinsSale_C
// Size: 0x61c (Inherited: 0x550)
class UWBP_Store_WeaponSkinsSale_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_WeaponSkinsSale_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_WeaponSkinsSale_in; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_20; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_63; // 0x570(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_2; // 0x578(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_3; // 0x580(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_50; // 0x588(0x08)
	struct UDFImage* DFImage; // 0x590(0x08)
	struct UDFImage* DFImage_2; // 0x598(0x08)
	struct UDFImage* DFImage_95; // 0x5a0(0x08)
	struct UDFImage* DFImage_119; // 0x5a8(0x08)
	struct UDFScrollBox* DFScrollBox_51; // 0x5b0(0x08)
	struct UDFSizeBox* DFSizeBox_2; // 0x5b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5c0(0x08)
	struct UDFScrollGridBox* ScrollGridBox_25; // 0x5c8(0x08)
	/*struct UWBP_Common_NoAnything_C**/char WBP_Common_NoAnything[0x8]; // 0x5d0(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5d8(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* WBP_DFCommonButtonCarousel; // 0x5e0(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* WBP_DFCommonButtonCarousel_2; // 0x5e8(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* WBP_DFCommonButtonCarousel_3; // 0x5f0(0x08)
	/*struct UWBP_DFCommonDropDownBox_C**/char WBP_DFCommonDropDownBox[0x8]; // 0x5f8(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char wtDFCommonCheckBoxWithText[0x8]; // 0x600(0x08)
	/*struct UWBP_DFCommonFilterBtnV1_C**/char wtDFCommonFilterBtnV1[0x8]; // 0x608(0x08)
	struct UDFImage* wtFirearmImg; // 0x610(0x08)
	int32_t Column; // 0x618(0x04)

	void SetColumn(int32_t Column); // Function WBP_Store_WeaponSkinsSale.WBP_Store_WeaponSkinsSale_C.SetColumn // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
