
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_VFX_PrismOffensive.WBP_Store_RecommendHomepage_VFX_PrismOffensive_C
// Size: 0x5d0 (Inherited: 0x550)
class UWBP_Store_RecommendHomepage_VFX_PrismOffensive_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_Loop; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_PlayVideo; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_in; // 0x570(0x08)
	struct UDFImage* DFImage; // 0x578(0x08)
	struct UDFImage* DFImage_9; // 0x580(0x08)
	struct UDFImage* DFImage_10; // 0x588(0x08)
	struct UDFImage* DFImage_11; // 0x590(0x08)
	struct UDFImage* DFImage_12; // 0x598(0x08)
	struct UDFImage* DFImage_115; // 0x5a0(0x08)
	struct UUIMeshWidget* UIMeshWidget; // 0x5a8(0x08)
	struct UUIMeshWidget* UIMeshWidget_2; // 0x5b0(0x08)
	struct UUIMeshWidget* UIMeshWidget_3; // 0x5b8(0x08)
	struct UUIMeshWidget* UIMeshWidget_4; // 0x5c0(0x08)
	struct UUIMeshWidget* UIMeshWidget_5; // 0x5c8(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Store_RecommendHomepage_VFX_PrismOffensive.WBP_Store_RecommendHomepage_VFX_PrismOffensive_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0740065
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
