
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_Dan.WBP_RoleInfo_Dan_C
// Size: 0x2e0 (Inherited: 0x298)
class UWBP_RoleInfo_Dan_C : public UUserWidget {
public:

	struct UWidgetAnimation* WBP_RoleInfo_Dan_out; // 0x298(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_Dan_in; // 0x2a0(0x08)
	struct UDFImage* DFImage; // 0x2a8(0x08)
	struct UDFImage* DFImage_146; // 0x2b0(0x08)
	struct UDFImage* DFImage_454; // 0x2b8(0x08)
	struct UDFTextBlock* DFTextBlock_370; // 0x2c0(0x08)
	struct UDFTextBlock* DFTextBlock_453; // 0x2c8(0x08)
	struct UImage* Image_kuangfx; // 0x2d0(0x08)
	struct UWBP_Common_BigFlatRank_C* wtRankIcon; // 0x2d8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
