
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_CommonMessageTips_DrugOccupancy.WBP_CommonMessageTips_DrugOccupancy_C
// Size: 0x590 (Inherited: 0x550)
class UWBP_CommonMessageTips_DrugOccupancy_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFImage* DFImage_2; // 0x558(0x08)
	struct UDFImage* DFImage_3; // 0x560(0x08)
	struct UDFImage* DFImage_4; // 0x568(0x08)
	struct UDFImage* DFImage_5; // 0x570(0x08)
	struct UDFImage* DFImage_6; // 0x578(0x08)
	struct UDFImage* DFImage_7; // 0x580(0x08)
	struct UDFTextBlock* wtDFTextBlock; // 0x588(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_CommonMessageTips_DrugOccupancy.WBP_CommonMessageTips_DrugOccupancy_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
