
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUp_Entrance.WBP_SetUp_Entrance_C
// Size: 0x5e0 (Inherited: 0x550)
class UWBP_SetUp_Entrance_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_SetUp_Entrance_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUp_Entrance_in; // 0x558(0x08)
	struct UWBP_SetUp_Button1_C* Btn_BackToModeHall; // 0x560(0x08)
	struct UWBP_SetUp_Button1_C* Btn_BreakOut; // 0x568(0x08)
	struct UWBP_SetUp_Button1_C* Btn_LeaveBattle; // 0x570(0x08)
	struct UWBP_SetUp_Button1_C* Btn_LogUpload; // 0x578(0x08)
	struct UWBP_SetUp_Button1_C* Btn_OpenGMPanel; // 0x580(0x08)
	struct UWBP_SetUp_Button1_C* Btn_QuitGame; // 0x588(0x08)
	struct UWBP_SetUp_Button1_C* Btn_QuitGameReturn; // 0x590(0x08)
	struct UWBP_SetUp_Button1_C* Btn_Redeploy; // 0x598(0x08)
	struct UWBP_TopBarHD_BtnReturn_C* Btn_Return; // 0x5a0(0x08)
	struct UWBP_SetUp_Button1_C* Btn_SafeHouseBreakOut; // 0x5a8(0x08)
	struct UWBP_SetUp_Button1_C* Btn_SafeHouseLeaveRange; // 0x5b0(0x08)
	struct UWBP_SetUp_Button1_C* Btn_Settings; // 0x5b8(0x08)
	struct UWBP_SetUp_Button1_C* Btn_StopPIE; // 0x5c0(0x08)
	struct UWBP_SetUp_Button1_C* Btn_VoiceReporting; // 0x5c8(0x08)
	struct UDFImage* DFImage_89; // 0x5d0(0x08)
	struct UWBP_HUCommonBlur_C* WBP_HUCommonBlur; // 0x5d8(0x08)

	void BP_AddLineToLastVisibleButton(); // Function WBP_SetUp_Entrance.WBP_SetUp_Entrance_C.BP_AddLineToLastVisibleButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x7f4dfffec0740000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
