
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_Mercy.WBP_Store_RecommendHomepage_Mercy_C
// Size: 0x360 (Inherited: 0x298)
class UWBP_Store_RecommendHomepage_Mercy_C : public UUserWidget {
public:

	struct UWidgetAnimation* WBP_Store_RecommendHomepage_Mercy_loop; // 0x298(0x08)
	struct UDFCommonSpine_C* DFCommonSpine; // 0x2a0(0x08)
	struct UDFImage* DFImage_Bg; // 0x2a8(0x08)
	struct UDFImage* DFImage_Bg_17; // 0x2b0(0x08)
	struct UDFImage* DFImage_Bg_18; // 0x2b8(0x08)
	struct UDFImage* fx_guang; // 0x2c0(0x08)
	struct UDFImage* fx_lizifencen; // 0x2c8(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x2d0(0x08)
	struct UDFImage* fx_lizifencen_distort_2; // 0x2d8(0x08)
	struct UDFImage* fx_wu_2; // 0x2e0(0x08)
	struct UDFImage* fx_wu_3; // 0x2e8(0x08)
	struct UDFImage* fx_wu_5; // 0x2f0(0x08)
	struct UImage* Image_bg_vfx_4; // 0x2f8(0x08)
	struct UImage* Image_bg_vfx_metalglow; // 0x300(0x08)
	struct UImage* Image_bg_vfx_metalglow_2; // 0x308(0x08)
	struct UImage* Image_bg_vfx_metalglow_3; // 0x310(0x08)
	struct UImage* Image_bg_vfx_sparkL01; // 0x318(0x08)
	struct UImage* Image_bg_vfx_sparkL02; // 0x320(0x08)
	struct UImage* Image_bg_vfx_sparkL03; // 0x328(0x08)
	struct UImage* Image_bg_vfx_sparkL04; // 0x330(0x08)
	struct UImage* Image_core_vfx9; // 0x338(0x08)
	struct UParticleWidget* ParticleWidget; // 0x340(0x08)
	struct UUIMeshWidget* UIMeshWidget_Knife; // 0x348(0x08)
	struct UUIMeshWidget* UIMeshWidget_Knife_2; // 0x350(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x358(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
