
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_VFX_BMGLB.WBP_Store_RecommendHomepage_VFX_BMGLB_C
// Size: 0x5cc (Inherited: 0x550)
class UWBP_Store_RecommendHomepage_VFX_BMGLB_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in_3; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo_finsh; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in; // 0x570(0x08)
	struct UImage* fx_caihong; // 0x578(0x08)
	struct UDFImage* fx_FENCEN; // 0x580(0x08)
	struct UDFImage* fx_guang; // 0x588(0x08)
	struct UDFImage* fx_lizifencen; // 0x590(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x598(0x08)
	struct UDFImage* fx_lizifencen_3; // 0x5a0(0x08)
	struct UImage* FX_wqguang; // 0x5a8(0x08)
	struct UDFImage* fx_wu_3; // 0x5b0(0x08)
	struct UDFImage* fx_wu_4; // 0x5b8(0x08)
	struct UDFImage* fx_wuqi; // 0x5c0(0x08)
	int32_t Type; // 0x5c8(0x04)

	void PreConstruct(bool IsDesignTime); // Function WBP_Store_RecommendHomepage_VFX_BMGLB.WBP_Store_RecommendHomepage_VFX_BMGLB_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3f03a8f5c0000064
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
