
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Hall_TasksBox.WBP_Hall_TasksBox_C
// Size: 0x608 (Inherited: 0x550)
class UWBP_Hall_TasksBox_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hall_TasksBox_shuaxin; // 0x558(0x08)
	struct UDFButton* DFButton_1; // 0x560(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_77; // 0x568(0x08)
	struct UDFImage* DFImage_69; // 0x570(0x08)
	struct UDFImage* DFImage_103; // 0x578(0x08)
	struct UDFImage* DFImage_129; // 0x580(0x08)
	struct UDFImage* DFImage_194; // 0x588(0x08)
	struct UDFImage* DFImage_265; // 0x590(0x08)
	struct UDFImage* DFImage_320; // 0x598(0x08)
	struct UDFImage* DFImage_451; // 0x5a0(0x08)
	struct UDFImage* DFImage_917; // 0x5a8(0x08)
	struct UDFImage* DFImage_FX_2; // 0x5b0(0x08)
	struct UDFRichTextBlock* DFRichTextBlock; // 0x5b8(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_179; // 0x5c0(0x08)
	struct UDFTextBlock* DFTextBlock_63; // 0x5c8(0x08)
	struct UDFVerticalBox* DFVerticalBox_55; // 0x5d0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5d8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5e8(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton[0x8]; // 0x5f0(0x08)
	struct TArray<struct FButtonStyle> Style; // 0x5f8(0x10)

	void PC(); // Function WBP_Hall_TasksBox.WBP_Hall_TasksBox_C.PC // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
