
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_TopBarHD_Tips.WBP_TopBarHD_Tips_C
// Size: 0x5c0 (Inherited: 0x550)
class UWBP_TopBarHD_Tips_C : public ULuaUIBaseView {
public:

	struct UDFImage* DFImage_54; // 0x550(0x08)
	struct UWBP_CommonTipsBg_C* WBP_CommonTipsBg; // 0x558(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_BindDiamond; // 0x560(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_Coin; // 0x568(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_CooperateVoucher; // 0x570(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_Diamond; // 0x578(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_LogisticsVoucher; // 0x580(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_Lucky; // 0x588(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_MandelCoins; // 0x590(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_SecretKey; // 0x598(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_Special; // 0x5a0(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_Tina; // 0x5a8(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_UnbindDiamond; // 0x5b0(0x08)
	struct UWBP_TopBarHD_TipsText_C* WBP_TopBarHD_TipsText_ZongZiYe; // 0x5b8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
