
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_AuctionSearchBar.WBP_AuctionSearchBar_C
// Size: 0xe08 (Inherited: 0x550)
class UWBP_AuctionSearchBar_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_29; // 0x558(0x08)
	struct UDFCheckBox* DFCheckBox_84; // 0x560(0x08)
	struct UDFImage* DFImage; // 0x568(0x08)
	struct UDFImage* DFImage_2; // 0x570(0x08)
	struct UDFImage* DFImage_3; // 0x578(0x08)
	struct UDFImage* DFImage_35; // 0x580(0x08)
	struct UDFImage* DFImage_61; // 0x588(0x08)
	struct UDFImage* DFImage_221; // 0x590(0x08)
	struct UDFTextBlock* DFTextBlock_34; // 0x598(0x08)
	struct UWBP_InputBoxWithBtn_C* WBP_InputBoxWithBtn; // 0x5a0(0x08)
	struct FEditableTextBoxStyle Style; // 0x5a8(0x860)

	void PC(); // Function WBP_AuctionSearchBar.WBP_AuctionSearchBar_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
