
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Friend.WBP_Friend_C
// Size: 0x5c8 (Inherited: 0x550)
class UWBP_Friend_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Friend_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Friend_in; // 0x560(0x08)
	struct UDFImage* DFImage_60; // 0x568(0x08)
	struct UDFImage* DFImage_211; // 0x570(0x08)
	struct UDFNamedSlot* EmptySlot; // 0x578(0x08)
	struct UImage* Image_5; // 0x580(0x08)
	struct UWBP_InputBoxWithBtn_C* WBP_inputBox; // 0x588(0x08)
	struct UWBP_DFCommonButtonV2S1_C* wtAddFriend; // 0x590(0x08)
	struct UWBP_DFCommonButtonV2S2_C* wtBlackList; // 0x598(0x08)
	struct UWBP_DFCommonButtonV2S2_C* wtFindBtn; // 0x5a0(0x08)
	struct UDFScrollGridBox* wtFriendList; // 0x5a8(0x08)
	struct TArray<struct UPaperSprite*> RefImage; // 0x5b0(0x10)
	struct UDFScrollGridBox* DFScrollGridBox_0_1; // 0x5c0(0x08)

	void PC(); // Function WBP_Friend.WBP_Friend_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0918940
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
