
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Assembly_RentalPlan_PC.WBP_Assembly_RentalPlan_PC_C
// Size: 0x634 (Inherited: 0x550)
class UWBP_Assembly_RentalPlan_PC_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Assembly_RentalPlan_PC_in; // 0x558(0x08)
	struct UWidgetAnimation* Anim_refresh; // 0x560(0x08)
	struct UDFImage* DFImage; // 0x568(0x08)
	struct UDFImage* DFImage_35; // 0x570(0x08)
	struct UDFImage* DFImage_103; // 0x578(0x08)
	struct UDFImage* DFImage_117; // 0x580(0x08)
	struct UDFImage* DFImage_light_fx; // 0x588(0x08)
	struct UDFImage* DFImage_light_fx_2; // 0x590(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_96; // 0x598(0x08)
	struct UDFTextBlock* DFTextBlock_355; // 0x5a0(0x08)
	struct UDFImage* Select; // 0x5a8(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton[0x8]; // 0x5b0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_DFCommonButtonV1S1[0x8]; // 0x5b8(0x08)
	/*struct UWBP_EquipmentOnLoan_C**/char WBP_EquipmentOnLoan[0x8]; // 0x5c0(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView; // 0x5c8(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_2; // 0x5d0(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_3; // 0x5d8(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_5; // 0x5e0(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_9; // 0x5e8(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_10; // 0x5f0(0x08)
	struct UWBP_WarehouseContainerPanel_Pc_C* wtBagContainerView; // 0x5f8(0x08)
	struct UWBP_WarehouseContainerPanel_Pc_C* wtCHContainerView; // 0x600(0x08)
	struct UDFScrollBox* wtMainScrollBox; // 0x608(0x08)
	struct UWBP_WarehouseContainerPanel_Pc_C* wtPocketContainerView; // 0x610(0x08)
	struct FText Text; // 0x618(0x18)
	int32_t BP_SlotGroup; // 0x630(0x04)

	void BP_SetSelect(bool Condition); // Function WBP_Assembly_RentalPlan_PC.WBP_Assembly_RentalPlan_PC_C.BP_SetSelect // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xffffffffc0000001
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
