
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Itemview_Favorite.WBP_Itemview_Favorite_C
// Size: 0x58c (Inherited: 0x550)
class UWBP_Itemview_Favorite_C : public UDFInteractorWishTipsItem {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Itemview_Favorite_loop; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Itemview_Favorite_PlayOnce; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Itemview_Favorite_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Itemview_Favorite_in; // 0x570(0x08)
	struct UImage* Image_54; // 0x578(0x08)
	struct UImage* Image_130; // 0x580(0x08)
	int32_t TempAniType; // 0x588(0x04)

	void SequenceEvent__ENTRYPOINTWBP_Itemview_Favorite_2(); // Function WBP_Itemview_Favorite.WBP_Itemview_Favorite_C.SequenceEvent__ENTRYPOINTWBP_Itemview_Favorite_2 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x6bce2770
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
