
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Hall_Announcement.WBP_Hall_Announcement_C
// Size: 0x590 (Inherited: 0x550)
class UWBP_Hall_Announcement_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hall_Announcement_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Hall_Announcement_in; // 0x560(0x08)
	struct UDFCommonRichTextBlock* DFCommonRichTextBlock_RollingText; // 0x568(0x08)
	struct UDFImage* DFImage_Bg; // 0x570(0x08)
	struct UDFImage* DFImage_Icon; // 0x578(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_NormalRichTextBlock; // 0x580(0x08)
	struct UDFSizeBox* DFSizeBox_1; // 0x588(0x08)

	void IsPC(); // Function WBP_Hall_Announcement.WBP_Hall_Announcement_C.IsPC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x11c0000074
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
