
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Poster_Main_PC_S.WBP_Poster_Main_PC_S_C
// Size: 0x5b0 (Inherited: 0x550)
class UWBP_Poster_Main_PC_S_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Poster_Main_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Poster_Main_in; // 0x560(0x08)
	struct UDFButton* DFButton_Left; // 0x568(0x08)
	struct UDFButton* DFButton_Right; // 0x570(0x08)
	struct UDFImage* DFImage_Mask; // 0x578(0x08)
	struct UDFScrollBox* DFScrollBox_2; // 0x580(0x08)
	struct UDFScrollBox* DFScrollBox_142; // 0x588(0x08)
	struct UWBP_Common_JumpOver_C* WBP_Common_JumpOver; // 0x590(0x08)
	struct UWBP_DFCommonButtonClose_C* wtCommonButtonClose; // 0x598(0x08)
	struct UDFButton* DFButton_Left_1; // 0x5a0(0x08)
	struct UDFButton* DFButton_Left_2; // 0x5a8(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Poster_Main_PC_S.WBP_Poster_Main_PC_S_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
