
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Collections_ProductionSeason.WBP_Collections_ProductionSeason_C
// Size: 0x5a0 (Inherited: 0x550)
class UWBP_Collections_ProductionSeason_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_Collections_ProductionSeason_in; // 0x550(0x08)
	struct UDFImage* DFImage_5; // 0x558(0x08)
	struct UDFImage* DFImage_Line; // 0x560(0x08)
	struct UDFImage* DFImage_Line_2; // 0x568(0x08)
	struct UDFImage* DFImage_Line_3; // 0x570(0x08)
	struct UDFImage* DFImage_Line_4; // 0x578(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x580(0x08)
	struct UDFImage* wtBgImg; // 0x588(0x08)
	struct UDFButton* wtBtn; // 0x590(0x08)
	struct UWBP_SlotCompSelected_C* wtSelectedComp; // 0x598(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
