
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_AuctionSell.WBP_AuctionSell_C
// Size: 0x620 (Inherited: 0x550)
class UWBP_AuctionSell_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_AuctionSell_out_Scale; // 0x558(0x08)
	struct UWidgetAnimation* WBP_AuctionSell_in; // 0x560(0x08)
	struct UWidgetAnimation* Hightlight; // 0x568(0x08)
	struct UDFHorizontalBox* CanvasPanel_Bottom; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_1; // 0x578(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_44; // 0x580(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x588(0x08)
	struct UDFImage* DFImage_193; // 0x590(0x08)
	struct UDFImage* DFImage_260; // 0x598(0x08)
	struct UDFImage* DFImage_307; // 0x5a0(0x08)
	struct UDFImage* DFImage_337; // 0x5a8(0x08)
	struct UDFImage* DFImage_Bg; // 0x5b0(0x08)
	struct UDFImage* DFImage_Bg_12; // 0x5b8(0x08)
	struct UDFTextBlock* DFTextBlock_45; // 0x5c0(0x08)
	struct UDFNamedSlot* EmptySlot; // 0x5c8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5d0(0x08)
	struct UDFScrollGridBox* ScrollGridBox_29; // 0x5d8(0x08)
	struct UTextBlock* TextBlock_37; // 0x5e0(0x08)
	struct UTextBlock* TextBlock_48; // 0x5e8(0x08)
	struct UTextBlock* TextBlock_89; // 0x5f0(0x08)
	struct UWBP_DFCommonCheckButtonV3S1_C* WBP_CommonCheckBoxV3S1_59; // 0x5f8(0x08)
	struct UWBP_WarehouseWithTab_C* WBP_WarehouseWithTab; // 0x600(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor; // 0x608(0x08)
	struct UWVP_Common_DragSelectedBox_C* wtHighlight; // 0x610(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtHoverBtn[0x8]; // 0x618(0x08)

	void PC_Adaptation(); // Function WBP_AuctionSell.WBP_AuctionSell_C.PC_Adaptation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
