
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Poster_Panel.WBP_Poster_Panel_C
// Size: 0x624 (Inherited: 0x550)
class UWBP_Poster_Panel_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Poster_Panel_in_2; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Poster_Panel_in; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_62; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_80; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_151; // 0x578(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_157; // 0x580(0x08)
	struct UDFCDNImage* DFImage_419; // 0x588(0x08)
	struct UDFCDNImage* DFImage_LeftTopCDN; // 0x590(0x08)
	struct UDFImage* DFImage_Mask01; // 0x598(0x08)
	struct UDFImage* DFImage_Mask02; // 0x5a0(0x08)
	struct UDFCDNImage* DFImage_Poster; // 0x5a8(0x08)
	struct UDFTextBlock* DFTextBlock_78; // 0x5b0(0x08)
	struct UComputeTextBlock* DFTextBlock_85; // 0x5b8(0x08)
	struct UDFTextBlock* DFTextBlock_313; // 0x5c0(0x08)
	struct UDFVerticalBox* DFVerticalBox_127; // 0x5c8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5d0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5d8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x5e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x5f0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char WBP_DFCommonButtonV1S2[0x8]; // 0x5f8(0x08)
	struct UWBP_Poster_Panel_Item_C* WBP_Poster_Panel_Item; // 0x600(0x08)
	struct UWBP_Poster_Panel_Item_C* WBP_Poster_Panel_Item_2; // 0x608(0x08)
	struct UWBP_Poster_Panel_Item_C* WBP_Poster_Panel_Item_3; // 0x610(0x08)
	struct UWBP_Poster_Panel_Item_C* WBP_Poster_Panel_Item_4; // 0x618(0x08)
	int32_t Type; // 0x620(0x04)

	void SetType(int32_t Type); // Function WBP_Poster_Panel.WBP_Poster_Panel_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3cc71c70c0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
