
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_WarehouseEquipPanel_Pc.WBP_WarehouseEquipPanel_Pc_C
// Size: 0x630 (Inherited: 0x550)
class UWBP_WarehouseEquipPanel_Pc_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* OpenExpansionManager_in; // 0x558(0x08)
	struct UWidgetAnimation* OpenExpansionManager_out; // 0x560(0x08)
	struct UWidgetAnimation* WBP_WarehouseEquipPanel_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_WarehouseEquipPanel_in; // 0x570(0x08)
	struct UCanvasPanel* CanvasPanel_2; // 0x578(0x08)
	struct UDFImage* DFImage_103; // 0x580(0x08)
	struct UDFRetainerBox* DFRetainerBox_1; // 0x588(0x08)
	struct UDFTextBlock* HeroNameText_2; // 0x590(0x08)
	struct UDFNamedSlot* SafeBoxSubSlot_2; // 0x598(0x08)
	struct UDFNamedSlot* SafeBoxSubSlot_3; // 0x5a0(0x08)
	struct UWBP_HUCommonBlur_V4_C* WBP_HUCommonBlur_V4; // 0x5a8(0x08)
	struct UWBP_SlotCompLoadBtn_C* WBP_SlotCompLoadBtn; // 0x5b0(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView; // 0x5b8(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_2; // 0x5c0(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_4; // 0x5c8(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_6; // 0x5d0(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_9; // 0x5d8(0x08)
	struct UWBP_WarehouseEquipSlotView_C* WBP_WarehouseEquipSlotView_10; // 0x5e0(0x08)
	struct UWBP_WarehouseContainerPanel_Pc_C* wtBagContainerView; // 0x5e8(0x08)
	struct UWBP_WarehouseContainerPanel_Pc_C* wtCHContainerView; // 0x5f0(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char wtDFCommonCheckBoxWithText[0x8]; // 0x5f8(0x08)
	struct UWBP_WarehouseScroll_C* wtDownMask; // 0x600(0x08)
	struct UWBP_WarehouseWidget_Pc_C* wtEquipmentValueWidget; // 0x608(0x08)
	struct UWBP_KeyContainerView_Pc_C* wtKeyContainerView; // 0x610(0x08)
	struct UDFScrollBox* wtMainScrollBox; // 0x618(0x08)
	struct UWBP_WarehouseContainerPanel_Pc_C* wtPocketContainerView; // 0x620(0x08)
	struct UWBP_WarehouseScroll_C* wtUpMask; // 0x628(0x08)

	void SetStyle(); // Function WBP_WarehouseEquipPanel_Pc.WBP_WarehouseEquipPanel_Pc_C.SetStyle // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1bfffffff
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
