
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_FieryOwl.WBP_Store_RecommendHomepage_FieryOwl_C
// Size: 0x6c4 (Inherited: 0x550)
class UWBP_Store_RecommendHomepage_FieryOwl_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_Loop; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in_3; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo_finsh; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo; // 0x570(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in; // 0x578(0x08)
	struct UDFImage* DFImage_165; // 0x580(0x08)
	struct UDFImage* DFImage_219; // 0x588(0x08)
	struct UDFImage* DFImage_281; // 0x590(0x08)
	struct UDFImage* DFImage_332; // 0x598(0x08)
	struct UDFImage* DFImage_361; // 0x5a0(0x08)
	struct UDFImage* DFImage_417; // 0x5a8(0x08)
	struct UDFImage* DFImage_524; // 0x5b0(0x08)
	struct UDFImage* DFImage_552; // 0x5b8(0x08)
	struct UDFImage* DFImage_637; // 0x5c0(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x5c8(0x08)
	struct UDFImage* fx_lizifencen_distort; // 0x5d0(0x08)
	struct UDFImage* fx_lizifencen_distort_2; // 0x5d8(0x08)
	struct UDFImage* fx_lizifencen_distort_3; // 0x5e0(0x08)
	struct UDFImage* fx_lizifencen_distort_4; // 0x5e8(0x08)
	struct UDFImage* fx_lizifencen_distort_5; // 0x5f0(0x08)
	struct UDFImage* fx_lizifencen_fire; // 0x5f8(0x08)
	struct UDFImage* fx_lizifencen_fire_light; // 0x600(0x08)
	struct UDFImage* fx_lizifencen_fire_light_2; // 0x608(0x08)
	struct UDFImage* fx_wu_2; // 0x610(0x08)
	struct UDFImage* fx_wu_3; // 0x618(0x08)
	struct UDFImage* fx_wu_5; // 0x620(0x08)
	struct UImage* Image_bg_vfx_3; // 0x628(0x08)
	struct UImage* Image_bg_vfx_4; // 0x630(0x08)
	struct UImage* Image_bg_vfx_5; // 0x638(0x08)
	struct UImage* Image_bg_vfx_6; // 0x640(0x08)
	struct UImage* Image_core_vfx9; // 0x648(0x08)
	struct UParticleWidget* ParticleWidget; // 0x650(0x08)
	struct UParticleWidget* ParticleWidget_87; // 0x658(0x08)
	struct UUIMeshWidget* UIMeshWidget; // 0x660(0x08)
	struct UUIMeshWidget* UIMeshWidget_2; // 0x668(0x08)
	struct UUIMeshWidget* UIMeshWidget_3; // 0x670(0x08)
	struct UUIMeshWidget* UIMeshWidget_4; // 0x678(0x08)
	struct UUIMeshWidget* UIMeshWidget_5; // 0x680(0x08)
	struct UUIMeshWidget* UIMeshWidget_6; // 0x688(0x08)
	struct UUIMeshWidget* UIMeshWidget_7; // 0x690(0x08)
	struct UUIMeshWidget* UIMeshWidget_8; // 0x698(0x08)
	struct UUIMeshWidget* UIMeshWidget_9; // 0x6a0(0x08)
	struct UUIMeshWidget* UIMeshWidget_10; // 0x6a8(0x08)
	struct UUIMeshWidget* UIMeshWidget_11; // 0x6b0(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x6b8(0x08)
	int32_t Type; // 0x6c0(0x04)

	void PreConstruct(bool IsDesignTime); // Function WBP_Store_RecommendHomepage_FieryOwl.WBP_Store_RecommendHomepage_FieryOwl_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3f03a8f5c0000074
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
