
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_VehiclesMainV2.WBP_VehiclesMainV2_C
// Size: 0x5d8 (Inherited: 0x550)
class UWBP_VehiclesMainV2_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_VehiclesMainV2_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_VehiclesMainV2_in; // 0x560(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x568(0x08)
	struct UDFImage* DFImage_60; // 0x570(0x08)
	struct UDFImage* DFImage_312; // 0x578(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_95; // 0x580(0x08)
	struct UDFTextBlock* DFTextBlock_78; // 0x588(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x590(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x598(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5a0(0x08)
	struct UWBP_DFCommon_MissionUnlocked_C* WBP_DFCommon_MissionUnlocked; // 0x5a8(0x08)
	/*struct UWBP_VehiclesConditions_C**/char WBP_VehiclesConditions[0x8]; // 0x5b0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wt_CommonButtonV1S1[0x8]; // 0x5b8(0x08)
	struct UDFCanvasPanel* wt_DFCanvasPanel; // 0x5c0(0x08)
	struct UWBP_DFTabV3GroupBox_C* wtDFTabV3GroupBox; // 0x5c8(0x08)
	struct UDFWaterfallScrollView* wtWaterFallList; // 0x5d0(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_VehiclesMainV2.WBP_VehiclesMainV2_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4233fffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
