
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithFinetune3DPointItemUI.WBP_GunStand_GunsmithFinetune3DPointItemUI_C
// Size: 0xb88 (Inherited: 0x550)
class UWBP_GunStand_GunsmithFinetune3DPointItemUI_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_Yellow_in; // 0x558(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_Yellowcommon_Click; // 0x560(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_YellowHovor_Click; // 0x568(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_Yellow_Hovor; // 0x570(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_Whitecommon_Click; // 0x578(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_Whitehovor_Click; // 0x580(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_White_Hovor; // 0x588(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_White_to_Yellow; // 0x590(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_Yellow_to_White; // 0x598(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_out; // 0x5a0(0x08)
	struct UWidgetAnimation* WBP_GunStand_FineTunePoint_White_in; // 0x5a8(0x08)
	struct UDFCanvasPanel* DFCanvasPanel; // 0x5b0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_73; // 0x5b8(0x08)
	struct UDFImage* DFImage; // 0x5c0(0x08)
	struct UDFImage* DFImage_2; // 0x5c8(0x08)
	struct UDFImage* DFImage_3; // 0x5d0(0x08)
	struct UDFImage* DFImage_4; // 0x5d8(0x08)
	struct UDFImage* DFImage_5; // 0x5e0(0x08)
	struct UDFImage* DFImage_6; // 0x5e8(0x08)
	struct UDFImage* DFImage_7; // 0x5f0(0x08)
	struct UDFImage* DFImage_8; // 0x5f8(0x08)
	struct UDFImage* DFImage_9; // 0x600(0x08)
	struct UDFImage* DFImage_10; // 0x608(0x08)
	struct UDFImage* DFImage_42; // 0x610(0x08)
	struct UDFImage* DFImage_yuanfx; // 0x618(0x08)
	struct UDFImage* DFImage_yuanfx_2; // 0x620(0x08)
	struct UDFButton* wt_DFButton; // 0x628(0x08)
	struct UDFTextBlock* wt_DFTextBlock; // 0x630(0x08)
	int32_t Type; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct FButtonStyle Style0; // 0x640(0x298)
	struct FButtonStyle Style1; // 0x8d8(0x298)
	struct FText Text; // 0xb70(0x18)

	void SetType(int32_t Type); // Function WBP_GunStand_GunsmithFinetune3DPointItemUI.WBP_GunStand_GunsmithFinetune3DPointItemUI_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
