
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_MsgFriendBtn.WBP_MsgFriendBtn_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_MsgFriendBtn_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_MsgFriendBtn_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_MsgFriendBtn_in; // 0x558(0x08)
	struct UImage* Image_83; // 0x560(0x08)
	struct UImage* Image_406; // 0x568(0x08)
	struct UImage* Image_1118; // 0x570(0x08)
	struct UTextBlock* TextBlock; // 0x578(0x08)
	struct UWBP_DFCommonButtonV2S2_C* WBP_CommonButtonV2S2_C_1; // 0x580(0x08)
	struct UWBP_CommonHeadIcon_C* WBP_CommonHeadIcon; // 0x588(0x08)
	/*struct UWBP_CommonOthersPoint_C**/char WBP_CommonPoint[0x8]; // 0x590(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
