
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_TestVRam.WBP_TestVRam_C
// Size: 0x5f0 (Inherited: 0x550)
class UWBP_TestVRam_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_TestVRam_Type03; // 0x558(0x08)
	struct UWidgetAnimation* WBP_TestVRam_Type02; // 0x560(0x08)
	struct UWidgetAnimation* WBP_TestVRam_Type01; // 0x568(0x08)
	struct UDFRichTextBlock* _wtTextContent; // 0x570(0x08)
	struct UDFRichTextBlock* _wtTextContent_2; // 0x578(0x08)
	struct UDFRichTextBlock* _wtTextContent_3; // 0x580(0x08)
	struct UDFRichTextBlock* _wtTextContent_4; // 0x588(0x08)
	struct UDFButton* DFButton_3; // 0x590(0x08)
	struct UDFImage* DFImage; // 0x598(0x08)
	struct UDFImage* DFImage_2; // 0x5a0(0x08)
	struct UDFImage* DFImage_256; // 0x5a8(0x08)
	struct UDFImage* DFImage_Bg; // 0x5b0(0x08)
	struct UDFImage* DFImage_Line; // 0x5b8(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_162; // 0x5c0(0x08)
	struct UImage* ProgressBar_Action; // 0x5c8(0x08)
	struct FName C004; // 0x5d0(0x08)
	struct FName C000; // 0x5d8(0x08)
	struct UMaterialInstanceDynamic* BarMaterial; // 0x5e0(0x08)
	struct FName C001; // 0x5e8(0x08)

	void BP_SetTarget(float Progress); // Function WBP_TestVRam.WBP_TestVRam_C.BP_SetTarget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x7f4e00633f008100
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
