
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_AssemblyDefaultMain_PC.WBP_AssemblyDefaultMain_PC_C
// Size: 0x624 (Inherited: 0x550)
class UWBP_AssemblyDefaultMain_PC_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_AssemblyDefaultMain_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_AssemblyDefaultMain_in; // 0x560(0x08)
	struct UWidgetAnimation* WBP_AssemblyDefaultMain_loop; // 0x568(0x08)
	struct UCanvasPanel* CanvasPanel_2; // 0x570(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_416; // 0x578(0x08)
	struct UDFImage* DFImage; // 0x580(0x08)
	struct UDFImage* DFImage_2; // 0x588(0x08)
	struct UDFImage* DFImage_129; // 0x590(0x08)
	struct UDFTextBlock* DFTextBlock_87; // 0x598(0x08)
	struct UDFVerticalBox* DFVerticalBox_127; // 0x5a0(0x08)
	/*struct UWBP_AssemblyBackpack_PC_C**/char WBP_AssemblyBackpack_PC[0x8]; // 0x5a8(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView; // 0x5b0(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_2; // 0x5b8(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_3; // 0x5c0(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_4; // 0x5c8(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_5; // 0x5d0(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_6; // 0x5d8(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_7; // 0x5e0(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_8; // 0x5e8(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_CommonButtonV1S1[0x8]; // 0x5f0(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_CommonButtonV3S1_2[0x8]; // 0x5f8(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_CommonButtonV3S1_3[0x8]; // 0x600(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char WBP_DFCommonButtonV1S2[0x8]; // 0x608(0x08)
	struct UWBP_Assembly_WeightBtn_C* WBP_WeightButton; // 0x610(0x08)
	struct UDFImage* wtNotInteractive; // 0x618(0x08)
	int32_t Num; // 0x620(0x04)

	void Bp_SetPosition(int32_t Num); // Function WBP_AssemblyDefaultMain_PC.WBP_AssemblyDefaultMain_PC_C.Bp_SetPosition // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x52c0000064
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
