
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Vehicle_Shot.WBP_Vehicle_Shot_C
// Size: 0x5c4 (Inherited: 0x588)
class UWBP_Vehicle_Shot_C : public UDFMMobileVehicleCrossHairView {
public:

	struct UImage* AmmoProgress; // 0x588(0x08)
	struct UImage* Image_Common; // 0x590(0x08)
	struct UImage* Image_shot01; // 0x598(0x08)
	struct UImage* Image_shot02; // 0x5a0(0x08)
	struct UImage* Image_shot03; // 0x5a8(0x08)
	struct UImage* Image_shot04; // 0x5b0(0x08)
	float Value; // 0x5b8(0x04)
	int32_t Type; // 0x5bc(0x04)
	float MagazineValue; // 0x5c0(0x04)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
