
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Collections_BlueprintDetail.WBP_Collections_BlueprintDetail_C
// Size: 0x5d4 (Inherited: 0x550)
class UWBP_Collections_BlueprintDetail_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Collections_BlueprintDetail_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Collections_BlueprintDetail_IN; // 0x560(0x08)
	struct UDFImage* DFImage; // 0x568(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x570(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x578(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x580(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wtEffectsBtn[0x8]; // 0x588(0x08)
	struct UDFCanvasPanel* wtInfoPanel; // 0x590(0x08)
	/*struct UWBP_ItemDetailView_Streamline_C**/char wtItemDetailView[0x8]; // 0x598(0x08)
	struct UDFNamedSlot* wtPartsSlot; // 0x5a0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wtPurchaseBtn[0x8]; // 0x5a8(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wtRenameBtn[0x8]; // 0x5b0(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtShareBtn[0x8]; // 0x5b8(0x08)
	struct UDFTextBlock* wtShowPresetHint; // 0x5c0(0x08)
	struct UDFCheckBox* wtShowPresetPartsCheckBox; // 0x5c8(0x08)
	int32_t Type; // 0x5d0(0x04)

	void BP_SetType(int32_t Index); // Function WBP_Collections_BlueprintDetail.WBP_Collections_BlueprintDetail_C.BP_SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
