
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Chat_VoiceBtn.WBP_Chat_VoiceBtn_C
// Size: 0x590 (Inherited: 0x550)
class UWBP_Chat_VoiceBtn_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* Anim_Loop; // 0x558(0x08)
	struct UButton* Button_147; // 0x560(0x08)
	struct UImage* Image_146; // 0x568(0x08)
	struct UImage* Image_01; // 0x570(0x08)
	struct UImage* Image_02; // 0x578(0x08)
	struct UImage* Image_03; // 0x580(0x08)
	struct UTextBlock* TextBlock_255; // 0x588(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Chat_VoiceBtn.WBP_Chat_VoiceBtn_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
