
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Hall_Battle_Main.WBP_Hall_Battle_Main_C
// Size: 0x650 (Inherited: 0x550)
class UWBP_Hall_Battle_Main_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hall_Battle_Main_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Hall_Battle_Main_in; // 0x560(0x08)
	struct UDFImage* DFImage_None; // 0x568(0x08)
	struct UDFNamedSlot* DFNamedSlot_106; // 0x570(0x08)
	struct UDFImage* image_bg01_2; // 0x578(0x08)
	struct UDFImage* image_bg02; // 0x580(0x08)
	struct UDFImage* image_bg02_3; // 0x588(0x08)
	struct UDFImage* image_bg02_4; // 0x590(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x598(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5a0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5a8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x5b0(0x08)
	struct UWBP_Common_LobbyBottomBar_C* WBP_Common_LobbyBottomBar; // 0x5b8(0x08)
	struct UWBP_Common_LobbyTopBar_C* WBP_Common_LobbyTopBar; // 0x5c0(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5c8(0x08)
	/*struct UWBP_Hall_Season_C**/char WBP_Hall_Season[0x8]; // 0x5d0(0x08)
	struct UWBP_Hall_StartPC_C* WBP_Hall_StartPC; // 0x5d8(0x08)
	struct UWBP_Hall_TeamModelItem_C* WBP_Hall_TeamModelItem_2; // 0x5e0(0x08)
	struct UWBP_Hall_TeamModelItem_C* WBP_Hall_TeamModelItem_3; // 0x5e8(0x08)
	struct UWBP_Hall_TeamModelItem_C* WBP_Hall_TeamModelItem_4; // 0x5f0(0x08)
	struct UWBP_Hall_TeamModelItem_C* WBP_Hall_TeamModelItem_5; // 0x5f8(0x08)
	struct UWBP_Reflow_Entrance_C* WBP_Reflow_Entrance; // 0x600(0x08)
	struct UWBP_SafeRoomChatHistory_C* WBP_SafeRoomChatHistory; // 0x608(0x08)
	struct UWBP_TipsRes_PowerAndSignal_C* WBP_TipsRes_PowerAndSignal; // 0x610(0x08)
	/*struct UWBP_Hall_ActivityTasks_C**/char wtActivityPanel[0x8]; // 0x618(0x08)
	struct UPlatformPaddingBox* wtActivityPanelBox; // 0x620(0x08)
	struct UWBP_Hall_Commercialize_C* wtBPPanel; // 0x628(0x08)
	struct UPlatformPaddingBox* wtBPPanelBox; // 0x630(0x08)
	struct UWBP_Hall_Start_C* wtPrepareRegion; // 0x638(0x08)
	struct UWBP_Hall_Commercialize_C* wtStorePanel; // 0x640(0x08)
	struct UPlatformPaddingBox* wtStorePanelBox; // 0x648(0x08)

	void IsPC(); // Function WBP_Hall_Battle_Main.WBP_Hall_Battle_Main_C.IsPC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3cc71c70c0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
