
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Itemview_Collections.WBP_Itemview_Collections_C
// Size: 0x5d0 (Inherited: 0x550)
class UWBP_Itemview_Collections_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Itemview_Collections_loop_real; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Itemview_Collections_loop; // 0x560(0x08)
	struct UDFImage* DFImage_2; // 0x568(0x08)
	struct UDFImage* DFImage_3; // 0x570(0x08)
	struct UDFImage* DFImage_4; // 0x578(0x08)
	struct UDFImage* DFImage_5; // 0x580(0x08)
	struct UDFImage* DFImage_6; // 0x588(0x08)
	struct UDFImage* DFImage_8; // 0x590(0x08)
	struct UDFImage* DFImage_9; // 0x598(0x08)
	struct UDFImage* DFImage_10; // 0x5a0(0x08)
	struct UDFImage* DFImage_11; // 0x5a8(0x08)
	struct UDFImage* DFImage_12; // 0x5b0(0x08)
	struct UDFImage* DFImage_71; // 0x5b8(0x08)
	struct UDFImage* DFImage_136; // 0x5c0(0x08)
	struct UDFMImage* DFMImage_Fx_5; // 0x5c8(0x08)

	void SequenceEvent__ENTRYPOINTWBP_Itemview_Collections_1(); // Function WBP_Itemview_Collections.WBP_Itemview_Collections_C.SequenceEvent__ENTRYPOINTWBP_Itemview_Collections_1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x23c000005b
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
