
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_Medusa.WBP_Store_RecommendHomepage_Medusa_C
// Size: 0x308 (Inherited: 0x298)
class UWBP_Store_RecommendHomepage_Medusa_C : public UUserWidget {
public:

	struct UDFImage* DFImage; // 0x298(0x08)
	struct UDFImage* DFImage_1; // 0x2a0(0x08)
	struct UDFImage* DFImage_2; // 0x2a8(0x08)
	struct UDFImage* DFImage_3; // 0x2b0(0x08)
	struct UDFImage* DFImage_4; // 0x2b8(0x08)
	struct UDFImage* DFImage_115; // 0x2c0(0x08)
	struct UDFImage* fx_guang_2; // 0x2c8(0x08)
	struct UImage* Image_bg_vfx_6; // 0x2d0(0x08)
	struct UImage* Image_bg_vfx_BG; // 0x2d8(0x08)
	struct UImage* Image_bg_vfx_snake; // 0x2e0(0x08)
	struct UParticleWidget* ParticleWidget_87; // 0x2e8(0x08)
	struct UUIMeshWidget* UIMeshWidget_Snake; // 0x2f0(0x08)
	struct UUIMeshWidget* UIMeshWidget_Snake_2; // 0x2f8(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x300(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
