
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Chat_Voice.WBP_Chat_Voice_C
// Size: 0x5ec (Inherited: 0x5a8)
class UWBP_Chat_Voice_C_def2 : public ULuaUIHudBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5a8(0x08)
	struct UWidgetAnimation* WBP_Chat_Voice_out; // 0x5b0(0x08)
	struct UWidgetAnimation* WBP_Chat_Voice_in; // 0x5b8(0x08)
	struct UDFBlurSlotReContainer* DFBlurSlotReContainer_134; // 0x5c0(0x08)
	struct UDFImage* DFImage; // 0x5c8(0x08)
	struct UDFImage* DFImage_2; // 0x5d0(0x08)
	struct UDFImage* DFImage_67; // 0x5d8(0x08)
	struct UDFTextBlock* DFTextBlock_23; // 0x5e0(0x08)
	int32_t Type; // 0x5e8(0x04)

	void SetType(int32_t Type); // Function WBP_Chat_Voice.WBP_Chat_Voice_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x40fffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
