
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Shop_ChooseMerchantView.WBP_Shop_ChooseMerchantView_C
// Size: 0x5b4 (Inherited: 0x550)
class UWBP_Shop_ChooseMerchantView_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Shop_ChooseMerchantView_in_1; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Shop_ChooseMerchantView_in; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Shop_ChooseMerchantView_out; // 0x568(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x570(0x08)
	struct UScrollGridBox* ScrollGridBox_merchant; // 0x578(0x08)
	struct FMargin BP_padding; // 0x580(0x10)
	struct FWidgetTransform BP_scrollTrans; // 0x590(0x1c)
	float BP_merchantInDelta; // 0x5ac(0x04)
	float BP_merchantInStartDelay; // 0x5b0(0x04)

	void PC_Adaptation(); // Function WBP_Shop_ChooseMerchantView.WBP_Shop_ChooseMerchantView_C.PC_Adaptation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1bfffffff
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
