
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Hall_Start.WBP_Hall_Start_C
// Size: 0x738 (Inherited: 0x550)
class UWBP_Hall_Start_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hall_Start_click; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Hall_Start_click_un; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Hall_Start_changzhuguzhang_delete; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Hall_Start_loop; // 0x570(0x08)
	struct UWidgetAnimation* WBP_Hall_Start_in; // 0x578(0x08)
	struct UDFImage* bai; // 0x580(0x08)
	/*struct UWBP_Hall_Start_Item_C**/char Checkbox[0x8]; // 0x588(0x08)
	/*struct UWBP_Hall_Start_Item_C**/char Checkbox_217[0x8]; // 0x590(0x08)
	/*struct UWBP_Hall_Start_Item_C**/char Checkbox_218[0x8]; // 0x598(0x08)
	struct UDFButton* DFButton; // 0x5a0(0x08)
	struct UDFButton* DFButton_137; // 0x5a8(0x08)
	struct UDFButton* DFButton_165; // 0x5b0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel; // 0x5b8(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_4; // 0x5c0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_555; // 0x5c8(0x08)
	struct UDFImage* DFImage; // 0x5d0(0x08)
	struct UDFImage* DFImage_6; // 0x5d8(0x08)
	struct UDFImage* DFImage_7; // 0x5e0(0x08)
	struct UDFImage* DFImage_8; // 0x5e8(0x08)
	struct UDFImage* DFImage_113; // 0x5f0(0x08)
	struct UDFImage* DFImage_146; // 0x5f8(0x08)
	struct UDFImage* DFImage_199; // 0x600(0x08)
	struct UDFImage* DFImage_200; // 0x608(0x08)
	struct UDFImage* DFImage_224; // 0x610(0x08)
	struct UDFImage* DFImage_373; // 0x618(0x08)
	struct UDFImage* DFImage_fx1; // 0x620(0x08)
	struct UDFImage* DFImage_fx1_2; // 0x628(0x08)
	struct UDFImage* DFImage_fx1_3; // 0x630(0x08)
	struct UDFImage* DFImage_fx1_4; // 0x638(0x08)
	struct UDFImage* DFImage_fx1_5; // 0x640(0x08)
	struct UDFImage* DFImage_fx1_6; // 0x648(0x08)
	struct UDFImage* DFImage_fx1_7; // 0x650(0x08)
	struct UDFImage* DFImage_fx_click; // 0x658(0x08)
	struct UDFImage* DFImage_PressedBg; // 0x660(0x08)
	struct UDFTextBlock* DFTextBlock_2; // 0x668(0x08)
	struct UDFTextBlock* DFTextBlock_3; // 0x670(0x08)
	struct UDFTextBlock* DFTextBlock_227; // 0x678(0x08)
	struct UDFTextBlock* DFTextBlock_228; // 0x680(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_115; // 0x688(0x08)
	struct UDFImage* ImageBackground; // 0x690(0x08)
	struct UDFCanvasPanel* Left; // 0x698(0x08)
	struct UDFImage* MI_UI_Hall_StartPC; // 0x6a0(0x08)
	struct UDFImage* MI_UI_Hall_StartPC_001; // 0x6a8(0x08)
	struct UDFImage* MI_UI_Hall_StartPC_005; // 0x6b0(0x08)
	struct UDFImage* MI_UI_Hall_StartPC_006; // 0x6b8(0x08)
	struct UDFCanvasPanel* Panel_01; // 0x6c0(0x08)
	struct UDFCanvasPanel* Panel_02; // 0x6c8(0x08)
	struct UDFCanvasPanel* Panel_03; // 0x6d0(0x08)
	struct UDFCanvasPanel* Right; // 0x6d8(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x6e0(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtLoadoutBtn[0x8]; // 0x6e8(0x08)
	struct UDFButton* wtMapBtn; // 0x6f0(0x08)
	struct UDFRichTextBlock* wtMapName; // 0x6f8(0x08)
	struct UTextBlock* wtPrepareBtnText; // 0x700(0x08)
	struct UDFButton* wtStartBtn; // 0x708(0x08)
	int32_t Type; // 0x710(0x04)
	char pad_714[0x4]; // 0x714(0x04)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char Arrimage[0x10]; // 0x718(0x10)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char ArrImage_PCMOBILE[0x10]; // 0x728(0x10)

	void SetImage(int32_t Image); // Function WBP_Hall_Start.WBP_Hall_Start_C.SetImage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x6ec0780065
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
