
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_InteractSpace_Pc.WBP_InteractSpace_Pc_C
// Size: 0x3c0 (Inherited: 0x298)
class UWBP_InteractSpace_Pc_C : public UDFHDInteractorSpaceItem {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UWidgetAnimation* WBP_InteractQuality_alert; // 0x2a0(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_2; // 0x2a8(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_3; // 0x2b0(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_4; // 0x2b8(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_5; // 0x2c0(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_6; // 0x2c8(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_7; // 0x2d0(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_8; // 0x2d8(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_9; // 0x2e0(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_10; // 0x2e8(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_11; // 0x2f0(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_12; // 0x2f8(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_13; // 0x300(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_14; // 0x308(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_15; // 0x310(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_16; // 0x318(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_17; // 0x320(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_18; // 0x328(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_19; // 0x330(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_20; // 0x338(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_21; // 0x340(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_22; // 0x348(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_23; // 0x350(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_24; // 0x358(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_25; // 0x360(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_26; // 0x368(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_27; // 0x370(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_28; // 0x378(0x08)
	struct UWBP_InteractQuality_Grid_Pc_C* Grid_29; // 0x380(0x08)
	struct UUniformGridPanel* UniformGridPanel_62; // 0x388(0x08)
	struct TArray<struct UWidget*> GridArray; // 0x390(0x10)
	int32_t GridBoxWidth; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct TArray<struct FLinearColor> GridColorArray; // 0x3a8(0x10)
	int32_t GridColorIndex; // 0x3b8(0x04)
	int32_t GridImageIndex; // 0x3bc(0x04)

	void PreConstruct(bool IsDesignTime); // Function WBP_InteractSpace_Pc.WBP_InteractSpace_Pc_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
