
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_BattlePass_Main.WBP_BattlePass_Main_C
// Size: 0x838 (Inherited: 0x550)
class UWBP_BattlePass_Main_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Main_loop01; // 0x558(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Main_penqihuan; // 0x560(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Main_loop; // 0x568(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Main_out; // 0x570(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Main_in_Lua; // 0x578(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x580(0x08)
	struct UDFButton* DFButton_61; // 0x588(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_65; // 0x590(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_190; // 0x598(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_1; // 0x5a0(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x5a8(0x08)
	struct UDFImage* DFImage_2; // 0x5b0(0x08)
	struct UDFImage* DFImage_6; // 0x5b8(0x08)
	struct UDFImage* DFImage_7; // 0x5c0(0x08)
	struct UDFImage* DFImage_15; // 0x5c8(0x08)
	struct UDFImage* DFImage_18; // 0x5d0(0x08)
	struct UDFImage* DFImage_19; // 0x5d8(0x08)
	struct UDFImage* DFImage_102; // 0x5e0(0x08)
	struct UDFImage* DFImage_237; // 0x5e8(0x08)
	struct UDFImage* DFImage_395; // 0x5f0(0x08)
	struct UDFImage* DFImage_406; // 0x5f8(0x08)
	struct UDFImage* DFImage_19_ZH; // 0x600(0x08)
	struct UDFImage* DFImage_20_ZH; // 0x608(0x08)
	struct UDFImage* DFImage_21_ZH; // 0x610(0x08)
	struct UDFImage* DFImage_Current; // 0x618(0x08)
	struct UDFImage* DFImage_EN; // 0x620(0x08)
	struct UDFImage* DFImage_EN_7; // 0x628(0x08)
	struct UDFImage* DFImage_EN01; // 0x630(0x08)
	struct UDFImage* DFImage_EN01_2; // 0x638(0x08)
	struct UDFImage* DFImage_EN01_3; // 0x640(0x08)
	struct UDFImage* DFImage_EN01_4; // 0x648(0x08)
	struct UDFImage* DFImage_FX; // 0x650(0x08)
	struct UDFImage* DFImage_FX_2; // 0x658(0x08)
	struct UDFImage* DFImage_Fx_2_ZH; // 0x660(0x08)
	struct UDFImage* DFImage_Fx_2_ZH_2; // 0x668(0x08)
	struct UDFImage* DFImage_Mask; // 0x670(0x08)
	struct UDFImage* DFImage_Mask_2; // 0x678(0x08)
	struct UDFImage* DFImage_Mask_Mobile; // 0x680(0x08)
	struct UDFImage* DFImage_Mask_PC; // 0x688(0x08)
	struct UDFImage* DFImage_ZH_2; // 0x690(0x08)
	struct UDFRadialImage* DFRadialImage_80; // 0x698(0x08)
	struct UDFTextBlock* DFTextBlock_100; // 0x6a0(0x08)
	struct UDFTextBlock* DFTextBlock_156; // 0x6a8(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_115; // 0x6b0(0x08)
	struct UDFWaterfallScrollView* DFWaterfallScrollView_160; // 0x6b8(0x08)
	struct UImage* Image_123; // 0x6c0(0x08)
	struct UDFImage* Image_BpQualityIcon; // 0x6c8(0x08)
	struct UDFCanvasPanel* Panel_Base_01; // 0x6d0(0x08)
	struct UDFCanvasPanel* Panel_Base_02; // 0x6d8(0x08)
	struct UDFCanvasPanel* Panel_Base_03; // 0x6e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x6e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x6f0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x6f8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x700(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x708(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_7; // 0x710(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_8; // 0x718(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_9; // 0x720(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_11; // 0x728(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_16; // 0x730(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_17; // 0x738(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_18; // 0x740(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_19; // 0x748(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_22; // 0x750(0x08)
	struct URichTextBlock* RichText; // 0x758(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x760(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton[0x8]; // 0x768(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton_2[0x8]; // 0x770(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton_3[0x8]; // 0x778(0x08)
	/*struct UWBP_CommonItemTemplate_C**/char WBP_CommonItemTemplate[0x8]; // 0x780(0x08)
	/*struct UWBP_CommonItemTemplate_C**/char WBP_CommonItemTemplate_2[0x8]; // 0x788(0x08)
	/*struct UWBP_DFCommonButtonV1S3_C**/char WBP_DFCommonButtonV1S3_C_1[0x8]; // 0x790(0x08)
	struct UWBP_DFCommonProgressBarV1_C* WBP_DFCommonProgressBarV1; // 0x798(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction[0x8]; // 0x7a0(0x08)
	struct UDFCDNImage* wtPropImg_2; // 0x7a8(0x08)
	struct UDFCDNImage* wtPropImg_3; // 0x7b0(0x08)
	struct UDFCDNImage* wtPropImg_4; // 0x7b8(0x08)
	struct UDFScaleBox* wtPropImgBox_3; // 0x7c0(0x08)
	int32_t PCType; // 0x7c8(0x04)
	int32_t CurrentType; // 0x7cc(0x04)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char Image[0x10]; // 0x7d0(0x10)
	int32_t MobileType; // 0x7e0(0x04)
	char pad_7E4[0x4]; // 0x7e4(0x04)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char BpQualityIcon[0x10]; // 0x7e8(0x10)
	int32_t QualityType; // 0x7f8(0x04)
	int32_t PriceType; // 0x7fc(0x04)
	/*struct TSoftObjectPtr<UObject>*/char NewVar_1[0x28]; // 0x800(0x28)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char ModeImage[0x10]; // 0x828(0x10)

	void SetLanguage(); // Function WBP_BattlePass_Main.WBP_BattlePass_Main_C.SetLanguage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x6ec0780065
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
