
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_WitchDoctor.WBP_Store_RecommendHomepage_WitchDoctor_C
// Size: 0x3c8 (Inherited: 0x298)
class UWBP_Store_RecommendHomepage_WitchDoctor_C : public UUserWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_WitchDoctor_loop_Person; // 0x2a0(0x08)
	struct UDFImage* DFImage; // 0x2a8(0x08)
	struct UDFImage* DFImage_2; // 0x2b0(0x08)
	struct UDFImage* DFImage_3; // 0x2b8(0x08)
	struct UDFImage* DFImage_4; // 0x2c0(0x08)
	struct UDFImage* DFImage_5; // 0x2c8(0x08)
	struct UDFImage* DFImage_6; // 0x2d0(0x08)
	struct UDFImage* DFImage_7; // 0x2d8(0x08)
	struct UDFImage* DFImage_8; // 0x2e0(0x08)
	struct UDFImage* DFImage_9; // 0x2e8(0x08)
	struct UDFImage* DFImage_10; // 0x2f0(0x08)
	struct UDFImage* DFImage_11; // 0x2f8(0x08)
	struct UDFImage* DFImage_12; // 0x300(0x08)
	struct UDFImage* DFImage_13; // 0x308(0x08)
	struct UDFImage* DFImage_14; // 0x310(0x08)
	struct UDFImage* DFImage_15; // 0x318(0x08)
	struct UDFImage* DFImage_81; // 0x320(0x08)
	struct UDFImage* fx_guang; // 0x328(0x08)
	struct UDFImage* fx_guang_2; // 0x330(0x08)
	struct UDFImage* fx_guang_3; // 0x338(0x08)
	struct UDFImage* fx_guang_4; // 0x340(0x08)
	struct UDFImage* fx_lizifencen_distort_2; // 0x348(0x08)
	struct UDFImage* fx_wu; // 0x350(0x08)
	struct UDFImage* fx_wu_2; // 0x358(0x08)
	struct UDFImage* fx_wu_3; // 0x360(0x08)
	struct UImage* Image_bg_vfx_6; // 0x368(0x08)
	struct UImage* Image_core_vfx9; // 0x370(0x08)
	struct UImage* Image_core_vfx9_2; // 0x378(0x08)
	struct UImage* Image_core_vfx9_3; // 0x380(0x08)
	struct UImage* Image_core_vfx9_4; // 0x388(0x08)
	struct UImage* Image_core_vfx9_5; // 0x390(0x08)
	struct UImage* Image_core_vfx9_6; // 0x398(0x08)
	struct UParticleWidget* ParticleWidget; // 0x3a0(0x08)
	struct UParticleWidget* ParticleWidget_87; // 0x3a8(0x08)
	struct UUIMeshWidget* UIMeshWidget_Snake_2; // 0x3b0(0x08)
	struct UUIMeshWidget* UIMeshWidget_Snake_light; // 0x3b8(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x3c0(0x08)

	void Construct(); // Function WBP_Store_RecommendHomepage_WitchDoctor.WBP_Store_RecommendHomepage_WitchDoctor_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3f03a8f5c0000001
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
