
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUp_Radio.WBP_SetUp_Radio_C
// Size: 0x5e0 (Inherited: 0x550)
class UWBP_SetUp_Radio_C_def2 : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_SetUp_Game_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUp_Game_in; // 0x558(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_keyboardTitle[0x8]; // 0x560(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle[0x8]; // 0x568(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle_2[0x8]; // 0x570(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_MultipleChoice_2; // 0x578(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_MultipleChoice_3; // 0x580(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_MultipleChoice_4; // 0x588(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_MultipleChoice_5; // 0x590(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_MultipleChoice_6; // 0x598(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn; // 0x5a0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_2; // 0x5a8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_3; // 0x5b0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_4; // 0x5b8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_5; // 0x5c0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_6; // 0x5c8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_7; // 0x5d0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_8; // 0x5d8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
