
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_TitleItem_Big.WBP_RoleInfo_TitleItem_Big_C
// Size: 0x5a8 (Inherited: 0x550)
class UWBP_RoleInfo_TitleItem_Big_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_1; // 0x558(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_3; // 0x560(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_4; // 0x568(0x08)
	struct UDFImage* DFImage_49; // 0x570(0x08)
	struct UDFTextBlock* DFTextBlock_195; // 0x578(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x580(0x08)
	/*struct UWBP_SlotCompMaskSmallLock_C**/char WBP_SlotCompMaskSmallLock[0x8]; // 0x588(0x08)
	struct UDFButton* wtSeclectBtn; // 0x590(0x08)
	struct UImage* wtTitleBg; // 0x598(0x08)
	struct UDFImage* wtTitleIcon; // 0x5a0(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_RoleInfo_TitleItem_Big.WBP_RoleInfo_TitleItem_Big_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x69c06c0075
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
