
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Interact_SlotCompQuality_Pc.WBP_Interact_SlotCompQuality_Pc_C
// Size: 0x5cc (Inherited: 0x560)
class UWBP_Interact_SlotCompQuality_Pc_C : public UDFMCommonQuality {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x560(0x08)
	struct UWidgetAnimation* Ani_looting_show_lv6_3; // 0x568(0x08)
	struct UWidgetAnimation* Ani_looting_show_lv5_2; // 0x570(0x08)
	struct UWidgetAnimation* Ani_looting_show_lv4_1; // 0x578(0x08)
	struct UWidgetAnimation* Ani_looting_show_lv6; // 0x580(0x08)
	struct UWidgetAnimation* Ani_looting_show_lv5; // 0x588(0x08)
	struct UWidgetAnimation* Ani_looting_show_lv4; // 0x590(0x08)
	struct UWidgetAnimation* Ani_looting_1; // 0x598(0x08)
	struct UWidgetAnimation* Ani_looting; // 0x5a0(0x08)
	struct UDFImage* BG; // 0x5a8(0x08)
	struct UImage* wtArrowIcon_FX; // 0x5b0(0x08)
	struct UImage* wtBottomLine_2; // 0x5b8(0x08)
	struct UImage* wtBottomLine_3; // 0x5c0(0x08)
	int32_t BpType; // 0x5c8(0x04)

	void BP_SetType(); // Function WBP_Interact_SlotCompQuality_Pc.WBP_Interact_SlotCompQuality_Pc_C.BP_SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
