
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithDebugPartItemUI.WBP_GunStand_GunsmithDebugPartItemUI_C
// Size: 0x5b0 (Inherited: 0x550)
class UWBP_GunStand_GunsmithDebugPartItemUI_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x558(0x08)
	struct UCanvasPanel* CanvasPanel_2; // 0x560(0x08)
	struct UCanvasPanel* CanvasPanel_3; // 0x568(0x08)
	struct UCanvasPanel* CanvasPanel_4; // 0x570(0x08)
	struct UCanvasPanel* CanvasPanel_5; // 0x578(0x08)
	struct UTextBlock* wt_HiddenText; // 0x580(0x08)
	struct UTextBlock* wt_MPUnlockPartsText; // 0x588(0x08)
	struct UTextBlock* wt_PartIDText; // 0x590(0x08)
	struct UTextBlock* wt_ShowText; // 0x598(0x08)
	struct UTextBlock* wt_VirutalText; // 0x5a0(0x08)
	/*struct UWBP_CommonItemTemplate_C**/char NewVar_1[0x8]; // 0x5a8(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_GunStand_GunsmithDebugPartItemUI.WBP_GunStand_GunsmithDebugPartItemUI_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0740000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
