
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_MailNotice.WBP_MailNotice_C
// Size: 0x5e8 (Inherited: 0x550)
class UWBP_MailNotice_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_MailNotice_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_MailNotice_in; // 0x560(0x08)
	struct UCanvasPanel* CanvasPanel_366; // 0x568(0x08)
	struct UCanvasPanel* CanvasPanel_Maildetial; // 0x570(0x08)
	struct UDFBorder* DFBorder_61; // 0x578(0x08)
	struct UDFImage* DFImage; // 0x580(0x08)
	struct UDFImage* DFImage_3; // 0x588(0x08)
	struct UDFImage* DFImage_231; // 0x590(0x08)
	struct UDFImage* DFImage_299; // 0x598(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_162; // 0x5a0(0x08)
	struct UDFNamedSlot* EmptySlot; // 0x5a8(0x08)
	struct UDFScrollGridBox* ScrollGridBox_59; // 0x5b0(0x08)
	struct UDFRichTextBlock* TextBlock_136; // 0x5b8(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5c0(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_CommonButtonV3S1[0x8]; // 0x5c8(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_CommonButtonV3S1_C_1[0x8]; // 0x5d0(0x08)
	struct UWBP_MailDetail_C* WBP_MailDetail; // 0x5d8(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction[0x8]; // 0x5e0(0x08)

	void PC(); // Function WBP_MailNotice.WBP_MailNotice_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x17c0000047
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
