
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_Breakthrough.WBP_Store_RecommendHomepage_Breakthrough_C
// Size: 0x5d4 (Inherited: 0x550)
class UWBP_Store_RecommendHomepage_Breakthrough_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in_3; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo_finsh; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in; // 0x570(0x08)
	struct UDFImage* fx_lizifencen; // 0x578(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x580(0x08)
	struct UDFImage* fx_lizifencen_3; // 0x588(0x08)
	struct UDFImage* fx_lizifencen_4; // 0x590(0x08)
	struct UDFImage* fx_wu; // 0x598(0x08)
	struct UDFImage* fx_wu_2; // 0x5a0(0x08)
	struct UDFImage* fx_wu_3; // 0x5a8(0x08)
	struct UImage* Image_Bg; // 0x5b0(0x08)
	struct UUIMeshWidget* UIMeshWidget_1; // 0x5b8(0x08)
	struct UUIMeshWidget* UIMeshWidget_2; // 0x5c0(0x08)
	struct UUIMeshWidget* UIMeshWidget_3; // 0x5c8(0x08)
	int32_t Type; // 0x5d0(0x04)

	void PreConstruct(bool IsDesignTime); // Function WBP_Store_RecommendHomepage_Breakthrough.WBP_Store_RecommendHomepage_Breakthrough_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x6ec0000001
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
