
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_InteractQuality.WBP_InteractQuality_C
// Size: 0x3a4 (Inherited: 0x298)
class UWBP_InteractQuality_C : public UUserWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UWidgetAnimation* WBP_InteractQuality_out; // 0x2a0(0x08)
	struct UWidgetAnimation* WBP_InteractQuality_alert; // 0x2a8(0x08)
	struct UWidgetAnimation* WBP_InteractQuality_in; // 0x2b0(0x08)
	struct UImage* Image_1; // 0x2b8(0x08)
	struct UImage* Image_2; // 0x2c0(0x08)
	struct UImage* Image_3; // 0x2c8(0x08)
	struct UImage* Image_4; // 0x2d0(0x08)
	struct UImage* Image_5; // 0x2d8(0x08)
	struct UImage* Image_6; // 0x2e0(0x08)
	struct UImage* Image_7; // 0x2e8(0x08)
	struct UImage* Image_8; // 0x2f0(0x08)
	struct UImage* Image_9; // 0x2f8(0x08)
	struct UImage* Image_10; // 0x300(0x08)
	struct UImage* Image_11; // 0x308(0x08)
	struct UImage* Image_12; // 0x310(0x08)
	struct UImage* Image_13; // 0x318(0x08)
	struct UImage* Image_14; // 0x320(0x08)
	struct UImage* Image_15; // 0x328(0x08)
	struct UImage* Image_16; // 0x330(0x08)
	struct UImage* Image_17; // 0x338(0x08)
	struct UImage* Image_18; // 0x340(0x08)
	struct UImage* Image_19; // 0x348(0x08)
	struct UImage* Image_20; // 0x350(0x08)
	struct UImage* Image_21; // 0x358(0x08)
	struct UImage* Image_22; // 0x360(0x08)
	struct UImage* Image_23; // 0x368(0x08)
	struct UImage* Image_24; // 0x370(0x08)
	struct UImage* Image_25; // 0x378(0x08)
	struct UTextBlock* SpaceText; // 0x380(0x08)
	struct UUniformGridPanel* UniformGridPanel_62; // 0x388(0x08)
	struct TArray<struct UWidget*> GridArray; // 0x390(0x10)
	int32_t GridBoxLength; // 0x3a0(0x04)

	void RefreshGridLayout(int32_t Length, int32_t Height); // Function WBP_InteractQuality.WBP_InteractQuality_C.RefreshGridLayout // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
