
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Equipment_Battle_Preset.WBP_Equipment_Battle_Preset_C
// Size: 0x6d8 (Inherited: 0x550)
class UWBP_Equipment_Battle_Preset_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_AssemblyFirearmsMain_to_WBP_Equipment_Battle_Preset; // 0x558(0x08)
	struct UWidgetAnimation* EnterTopAni_Hero; // 0x560(0x08)
	struct UWidgetAnimation* ExitTopAni_Hero; // 0x568(0x08)
	struct UWidgetAnimation* EnterTopAni_Skill; // 0x570(0x08)
	struct UWidgetAnimation* ExitTopAni_Skill; // 0x578(0x08)
	struct UWidgetAnimation* WBP_Equipment_Battle_Preset_to_WBP_AssemblyFirearmsMain; // 0x580(0x08)
	struct UWidgetAnimation* WBP_AssemblyFirearmsMain_to_WBP_Equipment_Battle_Preset1; // 0x588(0x08)
	struct UWidgetAnimation* WBP_Hero_MainPanel_to_WBP_Equipment_Battle_Preset; // 0x590(0x08)
	struct UWidgetAnimation* WBP_Equipment_Battle_Preset_to_WBP_Hero_MainPanel; // 0x598(0x08)
	struct UWidgetAnimation* WBP_Equipment_Battle_Preset_out; // 0x5a0(0x08)
	struct UWidgetAnimation* WBP_Equipment_Battle_Preset_in; // 0x5a8(0x08)
	struct UDFImage* BG; // 0x5b0(0x08)
	struct UCanvasPanel* CanvasPanel_3; // 0x5b8(0x08)
	struct UDFBorder* DFBorder_unlockMask; // 0x5c0(0x08)
	struct UDFButton* DFButton_switchHero; // 0x5c8(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_51; // 0x5d0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_Button; // 0x5d8(0x08)
	struct UDFImage* DFImage; // 0x5e0(0x08)
	struct UDFImage* DFImage_71; // 0x5e8(0x08)
	struct UDFImage* DFImage_122; // 0x5f0(0x08)
	struct UDFImage* DFImage_291; // 0x5f8(0x08)
	struct UImage* DFMImage_armIcon; // 0x600(0x08)
	struct UDFCanvasPosReContainer* DFPosReContainer_btn; // 0x608(0x08)
	struct UDFCanvasPosReContainer* DFPosReContainer_itemList; // 0x610(0x08)
	struct UDFCanvasPosReContainer* DFPosReContainer_skillInfo; // 0x618(0x08)
	struct UDFTextBlock* DFTextBlock_155; // 0x620(0x08)
	struct UDFTextBlock* DFTextBlock_armTitle; // 0x628(0x08)
	struct UDFTextBlock* DFTextBlock_hName; // 0x630(0x08)
	struct UDFTextBlock* DFTextBlock_skillTitle; // 0x638(0x08)
	struct UDFTextBlock* DFTextBlock_unlockDes; // 0x640(0x08)
	struct UWBP_Battle_Hero_Talent_C* HeroSkill1; // 0x648(0x08)
	struct UWBP_Battle_Hero_Talent_C* HeroSkill2; // 0x650(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x658(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x660(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x668(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x670(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x678(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_6; // 0x680(0x08)
	/*struct UWBP_CommonHoverBg_C**/char WBP_CommonHoverBg[0x8]; // 0x688(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_DFCommonButtonV1S1[0x8]; // 0x690(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_DFCommonButtonV3S1[0x8]; // 0x698(0x08)
	struct UWBP_Battle_Hero_Talent_C* WBP_Hero_PropsItem1; // 0x6a0(0x08)
	struct UWBP_Battle_Hero_Talent_C* WBP_Hero_PropsItem2; // 0x6a8(0x08)
	struct UWBP_Equipment_BattleItemView_C* wtCommonItemProp1; // 0x6b0(0x08)
	struct UWBP_Equipment_BattleItemView_C* wtCommonItemProp2; // 0x6b8(0x08)
	struct UWBP_Equipment_BattleItemView_C* wtCommonItemProp3; // 0x6c0(0x08)
	struct UWBP_Equipment_BattleItemView_C* wtCommonItemWeapon1; // 0x6c8(0x08)
	struct UImage* wtDFImage_HeroIcon; // 0x6d0(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Equipment_Battle_Preset.WBP_Equipment_Battle_Preset_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
