
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Shop_Unlocked.WBP_Shop_Unlocked_C
// Size: 0x590 (Inherited: 0x550)
class UWBP_Shop_Unlocked_C : public ULuaUIBaseView {
public:

	struct UDFImage* DFImage_164; // 0x550(0x08)
	struct UDFMImage* DFMImage_19; // 0x558(0x08)
	struct UDFMImage* DFMImage_80; // 0x560(0x08)
	struct UDFMImage* DFMImage_Fx; // 0x568(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_lock; // 0x570(0x08)
	struct UCanvasPanel* wtCanvasBtnMask; // 0x578(0x08)
	struct UDFCanvasPanel* wtCanvasPansic; // 0x580(0x08)
	struct UDFCanvasPanel* wtDFHbSeasonlock; // 0x588(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
