
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_SafetyBoxPanel.WBP_Store_SafetyBoxPanel_C
// Size: 0x600 (Inherited: 0x550)
class UWBP_Store_SafetyBoxPanel_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_SafetyBoxPanel_in; // 0x558(0x08)
	struct UDFImage* BG; // 0x560(0x08)
	struct UDFImage* BG_PCOnly; // 0x568(0x08)
	struct UDFImage* DFImage; // 0x570(0x08)
	struct UDFImage* DFImage_220; // 0x578(0x08)
	struct UDFImage* DFImage_343; // 0x580(0x08)
	struct UDFImage* DFImage_393; // 0x588(0x08)
	struct UDFImage* DFImage_479; // 0x590(0x08)
	struct UDFImage* DFImage_534; // 0x598(0x08)
	struct UDFImage* DFImage_574; // 0x5a0(0x08)
	struct UDFImage* DFImage_fx_cloud; // 0x5a8(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_258; // 0x5b0(0x08)
	struct UWBP_Store_SafetyBoxSellPanel_C* NewWidgetBlueprint5; // 0x5b8(0x08)
	struct UWBP_Store_SafetyBoxSellPanel_C* NewWidgetBlueprint5_44; // 0x5c0(0x08)
	struct UWBP_Store_SafetyBoxSellPanel_C* NewWidgetBlueprint5_88; // 0x5c8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5d0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5d8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x5e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x5e8(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5f0(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction[0x8]; // 0x5f8(0x08)

	void PC(); // Function WBP_Store_SafetyBoxPanel.WBP_Store_SafetyBoxPanel_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
