
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_ChangeAvatar.WBP_RoleInfo_ChangeAvatar_C
// Size: 0x5e8 (Inherited: 0x550)
class UWBP_RoleInfo_ChangeAvatar_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_ChangeAvatar_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_ChangeAvatar_in; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_124; // 0x568(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_5; // 0x570(0x08)
	struct UDFImage* DFImage_272; // 0x578(0x08)
	struct UImage* Image_120; // 0x580(0x08)
	struct UImage* Image_182; // 0x588(0x08)
	struct UImage* Image_253; // 0x590(0x08)
	struct UImage* Image_334; // 0x598(0x08)
	struct UImage* Image_kuangfx; // 0x5a0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x5a8(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wtChangeBtn[0x8]; // 0x5b0(0x08)
	struct UImage* wtDescImage; // 0x5b8(0x08)
	struct UComputeTextBlock* wtNameLabel; // 0x5c0(0x08)
	struct UImage* wtQualityIcon; // 0x5c8(0x08)
	struct UDFImage* wtSocialImage; // 0x5d0(0x08)
	struct UDFScrollGridBox* wtSocialList; // 0x5d8(0x08)
	struct UDFHorizontalBox* wtUnlockCondition; // 0x5e0(0x08)

	void SetType(); // Function WBP_RoleInfo_ChangeAvatar.WBP_RoleInfo_ChangeAvatar_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x72c0650073
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
