
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUp_InputV1.WBP_SetUp_InputV1_C
// Size: 0x688 (Inherited: 0x550)
class UWBP_SetUp_InputV1_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_SetUp_InputV1_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUp_InputV1_in; // 0x558(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* _wtMDV; // 0x560(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* _wtMDV_2; // 0x568(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* _wtMDV_3; // 0x570(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* _wtMDV_4; // 0x578(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char _wtReverseAll[0x8]; // 0x580(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* _wtSensitivityMode; // 0x588(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* _wtSensitivityMode_2; // 0x590(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* _wtSensitivityMode_3; // 0x598(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* _wtSensitivityMode_4; // 0x5a0(0x08)
	struct UDFScrollBox* InputPanelScrollBox; // 0x5a8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles; // 0x5b0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_3; // 0x5b8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_4; // 0x5c0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_5; // 0x5c8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_6; // 0x5d0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_8; // 0x5d8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_9; // 0x5e0(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_10; // 0x5e8(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* SplitBtn_Vehicles_12; // 0x5f0(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check[0x8]; // 0x5f8(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_2[0x8]; // 0x600(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_3[0x8]; // 0x608(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_4[0x8]; // 0x610(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Check_5[0x8]; // 0x618(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle[0x8]; // 0x620(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle_2[0x8]; // 0x628(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle_3[0x8]; // 0x630(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char WBP_SetUpComponent_ListTitle_4[0x8]; // 0x638(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_MultipleChoice_7; // 0x640(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn; // 0x648(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_2; // 0x650(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_5; // 0x658(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_6; // 0x660(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_7; // 0x668(0x08)
	struct UWBP_SetUpComponent_SplitBtn_2_C* WBP_SetUpComponent_SplitBtn_8; // 0x670(0x08)
	struct UWBP_SetUpComponent_MultipleChoice_C* WBP_SetUpComponent_Tactics; // 0x678(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char WBP_SetUpComponent_Vehicles_2[0x8]; // 0x680(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
