
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SlotCompWarehouseMask.WBP_SlotCompWarehouseMask_C
// Size: 0x5a4 (Inherited: 0x550)
class UWBP_SlotCompWarehouseMask_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SlotCompWarehouseMask_normal; // 0x558(0x08)
	struct UWidgetAnimation* WBP_SlotCompWarehouseMask_Expired; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_404; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_529; // 0x578(0x08)
	struct UDFImage* DFImage_2; // 0x580(0x08)
	struct UDFImage* DFImage_71; // 0x588(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor; // 0x590(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor_2; // 0x598(0x08)
	int32_t Type; // 0x5a0(0x04)

	void SetType(int32_t Selection); // Function WBP_SlotCompWarehouseMask.WBP_SlotCompWarehouseMask_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x63c0720069
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
