
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RecommendHomepage_Victor_Dark.WBP_Store_RecommendHomepage_Victor_Dark_C
// Size: 0x63c (Inherited: 0x550)
class UWBP_Store_RecommendHomepage_Victor_Dark_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in_3; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo_finsh; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_PlayVideo; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_RecommendHomepage_in; // 0x570(0x08)
	struct UDFImage* fx_guang; // 0x578(0x08)
	struct UDFImage* fx_lizifencen; // 0x580(0x08)
	struct UDFImage* fx_lizifencen_2; // 0x588(0x08)
	struct UDFImage* fx_lizifencen_3; // 0x590(0x08)
	struct UDFImage* fx_lizifencen_distort; // 0x598(0x08)
	struct UDFImage* fx_lizifencen_distort_2; // 0x5a0(0x08)
	struct UDFImage* fx_lizifencen_distort_3; // 0x5a8(0x08)
	struct UDFImage* fx_lizifencen_distort_4; // 0x5b0(0x08)
	struct UDFImage* fx_lizifencen_fire; // 0x5b8(0x08)
	struct UDFImage* fx_lizifencen_fire_light; // 0x5c0(0x08)
	struct UDFImage* fx_lizifencen_fire_light_3; // 0x5c8(0x08)
	struct UDFImage* fx_lizifencen_fire_light_4; // 0x5d0(0x08)
	struct UDFImage* fx_wu; // 0x5d8(0x08)
	struct UDFImage* fx_wu_2; // 0x5e0(0x08)
	struct UDFImage* fx_wu_3; // 0x5e8(0x08)
	struct UDFImage* fx_wu_4; // 0x5f0(0x08)
	struct UDFImage* fx_wu_5; // 0x5f8(0x08)
	struct UImage* Image_Bg; // 0x600(0x08)
	struct UImage* Image_bg_Gun; // 0x608(0x08)
	struct UImage* Image_core_vfx10; // 0x610(0x08)
	struct UImage* Image_core_vfx9; // 0x618(0x08)
	struct UParticleWidget* ParticleWidget; // 0x620(0x08)
	struct UUIMeshWidget* UIMeshWidget; // 0x628(0x08)
	struct UUIMeshWidget* UIMeshWidget_6; // 0x630(0x08)
	int32_t Type; // 0x638(0x04)

	void PreConstruct(bool IsDesignTime); // Function WBP_Store_RecommendHomepage_Victor_Dark.WBP_Store_RecommendHomepage_Victor_Dark_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3f03a8f5c0000001
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
