
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_SafetyBoxSellPanel.WBP_Store_SafetyBoxSellPanel_C
// Size: 0x5a8 (Inherited: 0x550)
class UWBP_Store_SafetyBoxSellPanel_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_SafetyBoxSellPanel_in_4; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_SafetyBoxSellPanel_in_3; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_SafetyBoxSellPanel_in; // 0x568(0x08)
	struct UDFImage* DFImage_78; // 0x570(0x08)
	struct UDFTextBlock* DFTextBlock_2; // 0x578(0x08)
	struct UDFTextBlock* DFTextBlock_33; // 0x580(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char WBP_DFCommonButtonV1S2_151[0x8]; // 0x588(0x08)
	struct FText NewVar_1; // 0x590(0x18)

	void PreConstruct(bool IsDesignTime); // Function WBP_Store_SafetyBoxSellPanel.WBP_Store_SafetyBoxSellPanel_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
