
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Shop_ItemMaskView.WBP_Shop_ItemMaskView_C
// Size: 0x5a8 (Inherited: 0x550)
class UWBP_Shop_ItemMaskView_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Shop_ItemMaskView_unlockAni; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Shop_ItemMaskView_in; // 0x560(0x08)
	struct UImage* Image; // 0x568(0x08)
	struct UImage* Image_7; // 0x570(0x08)
	struct UImage* Image_113; // 0x578(0x08)
	struct UImage* Image_282; // 0x580(0x08)
	struct UImage* Image_422; // 0x588(0x08)
	struct UImage* Image_fxliang; // 0x590(0x08)
	struct URichTextBlock* Text_sellout; // 0x598(0x08)
	struct URichTextBlock* Text_unlock; // 0x5a0(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Shop_ItemMaskView.WBP_Shop_ItemMaskView_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2fc030005f
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
