
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Assembly_CardDisplay.WBP_Assembly_CardDisplay_C
// Size: 0x590 (Inherited: 0x550)
class UWBP_Assembly_CardDisplay_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_Assembly_CardDisplay_Out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Assembly_CardDisplay_In; // 0x558(0x08)
	struct UDFImage* DFImage_3; // 0x560(0x08)
	struct UDFImage* DFImage_4; // 0x568(0x08)
	struct UDFImage* DFImage_80; // 0x570(0x08)
	struct UDFImage* DFImage_321; // 0x578(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_9; // 0x580(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x588(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
