
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithMainPreviewUI.WBP_GunStand_GunsmithMainPreviewUI_C
// Size: 0x630 (Inherited: 0x550)
class UWBP_GunStand_GunsmithMainPreviewUI_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_GunStand_GunsmithMainPreviewUI_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithMainPreviewUI_in; // 0x558(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithMainPreviewUI_hidden; // 0x560(0x08)
	struct UDFTextBlock* DFTextBlock_180; // 0x568(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x570(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x578(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_DFCommonIconButton[0x8]; // 0x580(0x08)
	struct UWBP_GunStand_Misson_C* WBP_GunStand_Misson; // 0x588(0x08)
	struct UCanvasPanel* WBP_MoveHiddenPanel; // 0x590(0x08)
	struct UTextBlock* wNameLabel; // 0x598(0x08)
	struct UDFButton* wt_Button_Range; // 0x5a0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wt_Button_UnlockPart[0x8]; // 0x5a8(0x08)
	struct UNamedSlot* wt_SlotWeaponMainAttribute; // 0x5b0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wt_WBP_CommonButton_Unlock_MP[0x8]; // 0x5b8(0x08)
	struct UWBP_GunStand_GunsmithSceneSocketMainUI_C* wt_WBP_GunStand_GunsmithSceneSocketMainUI; // 0x5c0(0x08)
	struct UWBP_GunStand_GunsmithSimulateStatePropmtUI_C* wt_WBP_GunStand_GunsmithSimulateStatePropmtUI; // 0x5c8(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char wtButtonPreset[0x8]; // 0x5d0(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char wtButtonSkin[0x8]; // 0x5d8(0x08)
	struct UWBP_DFCommonIconCheckButton_C* wtCheckBoxLookWeaponModel; // 0x5e0(0x08)
	struct UWBP_DFCommonIconCheckButton_C* wtCheckBoxMission; // 0x5e8(0x08)
	struct UWBP_DFCommonIconCheckButton_C* wtCheckBoxWeaponDefaultSkin; // 0x5f0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wtCommonButtonV1S2[0x8]; // 0x5f8(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor; // 0x600(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor_2; // 0x608(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor_3; // 0x610(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtSaveSolutionButton[0x8]; // 0x618(0x08)
	/*struct TArray<struct TSoftObjectPtr<UPaperSprite>>*/char RefImage[0x10]; // 0x620(0x10)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
