
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithDebugPartListUI.WBP_GunStand_GunsmithDebugPartListUI_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_GunStand_GunsmithDebugPartListUI_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithPartMainUI_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_GunStand_GunsmithPartMainUI_in; // 0x560(0x08)
	struct UDFMImage* DFMImage_60; // 0x568(0x08)
	struct UWBP_GunStand_GunsmithDebugPartItemUI_C* WBP_GunStand_GunsmithDebugPartItemUI; // 0x570(0x08)
	struct UTextBlock* wt_bIsMPText; // 0x578(0x08)
	struct UDFWaterfallScrollView* wt_WaterFallList; // 0x580(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wt_WBP_CommonButtonV1S1_Close[0x8]; // 0x588(0x08)
	struct UTextBlock* wt_WeaponIDText; // 0x590(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_GunStand_GunsmithDebugPartListUI.WBP_GunStand_GunsmithDebugPartListUI_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1c0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
