
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_TopBarHDSlotPanelV1.WBP_TopBarHDSlotPanelV1_C
// Size: 0x660 (Inherited: 0x550)
class UWBP_TopBarHDSlotPanelV1_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* NewAnimation; // 0x558(0x08)
	struct UWidgetAnimation* WBP_TopBarHDSlotPanelV1_in_01; // 0x560(0x08)
	struct UWidgetAnimation* WBP_TopBarHDSlotPanelV1_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_TopBarHDSlotPanelV1_in; // 0x570(0x08)
	struct UDFImage* _wtAvatarBackground1; // 0x578(0x08)
	struct UWBP_DFTabGroupTopBox_PC_S1_C* _wtTabGroupPrimary; // 0x580(0x08)
	struct UWBP_DFTabGroupTopBox_PC_S2_C* _wtTabGroupSecondary; // 0x588(0x08)
	struct UWBP_DFTabGroupTopBox_PC_S3_C* _wtTabGroupSecondary2; // 0x590(0x08)
	struct UWBP_DFTabGroupTopBox_PC_S3_C* _wtTabGroupTertiary; // 0x598(0x08)
	struct UWBP_DFTabNavigator_S1_C* _wtTabNavigatorPrimary; // 0x5a0(0x08)
	struct UWBP_DFTabNavigator_S1_C* _wtTabNavigatorSecondary; // 0x5a8(0x08)
	struct UWBP_DFTabNavigator_S1_C* _wtTabNavigatorSecondary2; // 0x5b0(0x08)
	struct UWBP_DFTabNavigator_S1_C* _wtTabNavigatorTertiary; // 0x5b8(0x08)
	struct UDFTipsAnchor* _wtTipsAnchor_Currency; // 0x5c0(0x08)
	struct UDFButton* Btn_Currency; // 0x5c8(0x08)
	struct UDFAspectRatioBox* DFAspectRatioBox_1; // 0x5d0(0x08)
	struct UDFButton* DFButton_32; // 0x5d8(0x08)
	struct UDFCanvasPanel* DFCanvasPanel; // 0x5e0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_3; // 0x5e8(0x08)
	struct UDFImage* DFImage_Mask; // 0x5f0(0x08)
	struct UDFRetainerBox* DFRetainerBox_2; // 0x5f8(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_218; // 0x600(0x08)
	struct UGridPanel* GP_Currency; // 0x608(0x08)
	struct USizeBox* SizeBox_Currency; // 0x610(0x08)
	struct UTextBlock* Text_Title; // 0x618(0x08)
	struct UWBP_ButtonMail_C* WBP_ButtonMail; // 0x620(0x08)
	/*struct UWBP_ButtonSet_C**/char WBP_ButtonSet[0x8]; // 0x628(0x08)
	struct UWBP_HUCommonBlur_V4_C* WBP_HUCommonBlur_V4; // 0x630(0x08)
	struct UWBP_TopBarHD_Currency1_C* WBP_TopBarHD_Currency1; // 0x638(0x08)
	struct UWBP_TopBarHD_Currency1_C* WBP_TopBarHD_Currency1_2; // 0x640(0x08)
	struct UWBP_TopBarHD_Currency1_C* WBP_TopBarHD_Currency1_3; // 0x648(0x08)
	struct FMargin NewVar_1; // 0x650(0x10)

	void BP_SetTabStyle(int32_t Style); // Function WBP_TopBarHDSlotPanelV1.WBP_TopBarHDSlotPanelV1_C.BP_SetTabStyle // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
