
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Moss_Main.WBP_Moss_Main_C
// Size: 0x788 (Inherited: 0x550)
class UWBP_Moss_Main_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* Moss_panle_02_to_start; // 0x558(0x08)
	struct UWidgetAnimation* Moss_panle_01_to_start; // 0x560(0x08)
	struct UWidgetAnimation* Moss_panle_03_to_start; // 0x568(0x08)
	struct UWidgetAnimation* Moss_panle_03_loop; // 0x570(0x08)
	struct UWidgetAnimation* Moss_panle_02_to_03; // 0x578(0x08)
	struct UWidgetAnimation* Moss_panle_02_loop; // 0x580(0x08)
	struct UWidgetAnimation* Moss_panle_01_to_02; // 0x588(0x08)
	struct UWidgetAnimation* Moss_panle_01_loop; // 0x590(0x08)
	struct UWidgetAnimation* Moss_panle_start_loop_to_01; // 0x598(0x08)
	struct UWidgetAnimation* WBP_Moss_Main_MobileOpen; // 0x5a0(0x08)
	struct UWidgetAnimation* Moss_panle_start_loop; // 0x5a8(0x08)
	struct UWidgetAnimation* Moss_Loop_holding; // 0x5b0(0x08)
	struct UWidgetAnimation* Moss_panle_loop_Out; // 0x5b8(0x08)
	struct UWidgetAnimation* Moss_panle_loop; // 0x5c0(0x08)
	struct UWidgetAnimation* Moss_panle_loop_Start; // 0x5c8(0x08)
	struct UWidgetAnimation* Moss_Loop; // 0x5d0(0x08)
	struct UWidgetAnimation* Moss_Panel_Open; // 0x5d8(0x08)
	struct UDFButton* DFButton_1; // 0x5e0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel; // 0x5e8(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_76; // 0x5f0(0x08)
	struct UDFImage* DFImage_7; // 0x5f8(0x08)
	struct UDFImage* DFImage_8; // 0x600(0x08)
	struct UDFImage* DFImage_68; // 0x608(0x08)
	struct UDFImage* DFImage_142; // 0x610(0x08)
	struct UDFImage* DFImage_Circle_4; // 0x618(0x08)
	struct UDFImage* DFImage_Circle_5; // 0x620(0x08)
	struct UDFImage* DFImage_Circle_6; // 0x628(0x08)
	struct UDFImage* DFImage_Circle_7; // 0x630(0x08)
	struct UDFImage* DFImage_Circle_8; // 0x638(0x08)
	struct UDFImage* DFImage_Circle_9; // 0x640(0x08)
	struct UDFImage* DFImage_Circle_10; // 0x648(0x08)
	struct UDFImage* DFImage_Circle_11; // 0x650(0x08)
	struct UDFImage* DFImage_Circle_12; // 0x658(0x08)
	struct UDFImage* DFImage_Circle_13; // 0x660(0x08)
	struct UDFImage* DFImage_Circle_14; // 0x668(0x08)
	struct UDFImage* DFImage_Circle_15; // 0x670(0x08)
	struct UDFImage* DFImage_Circle_01; // 0x678(0x08)
	struct UDFImage* DFImage_Circle_02; // 0x680(0x08)
	struct UDFImage* DFImage_Circle_03; // 0x688(0x08)
	struct UDFImage* DFImage_Sequence; // 0x690(0x08)
	struct UDFImage* DFImage_Sequence_2; // 0x698(0x08)
	struct UDFImage* DFImage_Sequence_3; // 0x6a0(0x08)
	struct UDFImage* DFImage_Sequence_03_2; // 0x6a8(0x08)
	struct UDFImage* DFImage_Sequence_03_3; // 0x6b0(0x08)
	struct UDFImage* DFImage_Sequence_03_4; // 0x6b8(0x08)
	struct UDFImage* DFImage_Sequence_03_5; // 0x6c0(0x08)
	struct UDFImage* DFImage_Sequence_03_6; // 0x6c8(0x08)
	struct UDFImage* DFImage_Sequence_03_7; // 0x6d0(0x08)
	struct UDFImage* DFImage_Sequence_03_8; // 0x6d8(0x08)
	struct UDFImage* DFImage_Sequence_03_9; // 0x6e0(0x08)
	struct UDFImage* DFImage_Sequence_1_2; // 0x6e8(0x08)
	struct UDFImage* DFImage_Sequence_2_2; // 0x6f0(0x08)
	struct UDFImage* DFImage_Sequence_3_2; // 0x6f8(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_49; // 0x700(0x08)
	struct UImage* Image; // 0x708(0x08)
	struct UImage* Image_2; // 0x710(0x08)
	struct UImage* Image_350; // 0x718(0x08)
	struct UImage* Image_vfx; // 0x720(0x08)
	struct UImage* Image_vfx_2; // 0x728(0x08)
	struct UImage* Image_vfx_3; // 0x730(0x08)
	struct UImage* Image_vfx_4; // 0x738(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x740(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_CommonButtonV3S1_131[0x8]; // 0x748(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton_3[0x8]; // 0x750(0x08)
	/*struct UWBP_CommonKeyIconBox_C**/char WBP_CommonKeyIconBox_C_1[0x8]; // 0x758(0x08)
	/*struct TSoftObjectPtr<UObject>*/char Moss[0x28]; // 0x760(0x28)

	void IsPC(); // Function WBP_Moss_Main.WBP_Moss_Main_C.IsPC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xcef8fffec0700078
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
