
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_AuctionTransaction.WBP_AuctionTransaction_C
// Size: 0x5f0 (Inherited: 0x550)
class UWBP_AuctionTransaction_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_AuctionTransaction_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_AuctionTransaction_out_Scale; // 0x560(0x08)
	struct UWidgetAnimation* WBP_AuctionTransaction_in; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_177; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_825; // 0x578(0x08)
	struct UDFImage* DFImage; // 0x580(0x08)
	struct UDFImage* DFImage_3; // 0x588(0x08)
	struct UDFImage* DFImage_4; // 0x590(0x08)
	struct UDFImage* DFImage_200; // 0x598(0x08)
	struct UDFNamedSlot* EmptySlot; // 0x5a0(0x08)
	struct UDFNamedSlot* EmptySlot1; // 0x5a8(0x08)
	struct UImage* Image_2; // 0x5b0(0x08)
	struct UImage* Image_227; // 0x5b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5c0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5c8(0x08)
	struct UCanvasPanel* PurchasePanel; // 0x5d0(0x08)
	struct UCanvasPanel* SalesPanel; // 0x5d8(0x08)
	struct UDFScrollGridBox* ScrollGridBox; // 0x5e0(0x08)
	struct UDFScrollGridBox* ScrollGridBox_18; // 0x5e8(0x08)

	void PC_Adaptation(); // Function WBP_AuctionTransaction.WBP_AuctionTransaction_C.PC_Adaptation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec01b2e10
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
