
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_AssemblyFirearmsMain.WBP_AssemblyFirearmsMain_C
// Size: 0x62c (Inherited: 0x550)
class UWBP_AssemblyFirearmsMain_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_AssemblyFirearmsMain_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_AssemblyFirearmsMain_in; // 0x560(0x08)
	struct UWidgetAnimation* WBP_AssemblyFirearmsMain_loop; // 0x568(0x08)
	struct UDFCanvasPosReContainer* BtnPan2; // 0x570(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x578(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char CommonButtonV1S_4[0x8]; // 0x580(0x08)
	struct UDFBorder* DFBorder_2; // 0x588(0x08)
	struct UDFImage* DFImage_60; // 0x590(0x08)
	struct UDFNamedSlot* DFNamedSlot_221; // 0x598(0x08)
	struct UDFSafeZone* DFSafeZone_99; // 0x5a0(0x08)
	struct UHorizontalBox* HorizontalBox_1; // 0x5a8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5b0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x5c0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char RemoveBtn[0x8]; // 0x5c8(0x08)
	struct UDFNamedSlot* SelectionAssemblyDroDownBox; // 0x5d0(0x08)
	struct UWBP_AssemblyMapNeed_C* WBP_AssemblyMapNeed; // 0x5d8(0x08)
	struct UWBP_AssemblyMapNeed_C* WBP_AssemblyMapNeed_2; // 0x5e0(0x08)
	struct UWBP_AssemblyMapNeed_C* WBP_AssemblyMapNeed_3; // 0x5e8(0x08)
	struct UWBP_AssemblyMapNeed_C* WBP_AssemblyMapNeed_4; // 0x5f0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_CommonButtonV1S1[0x8]; // 0x5f8(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char WBP_CommonButtonV1S2_2[0x8]; // 0x600(0x08)
	/*struct UWBP_ItemDetailView_Streamline_C**/char WBP_ItemDetailView_Streamline[0x8]; // 0x608(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wt_WBP_CommonButtonV1S1_Gunsmith_Default[0x8]; // 0x610(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wt_WBP_CommonButtonV1S2_Gunsmith_Simulate[0x8]; // 0x618(0x08)
	struct UDFWaterfallScrollView* wtWaterFallList; // 0x620(0x08)
	int32_t Type; // 0x628(0x04)

	void BP_SetType(int32_t Type); // Function WBP_AssemblyFirearmsMain.WBP_AssemblyFirearmsMain_C.BP_SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000074
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
