
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RechargeBtn.WBP_Store_RechargeBtn_C
// Size: 0x608 (Inherited: 0x550)
class UWBP_Store_RechargeBtn_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RechargeBtn_in; // 0x558(0x08)
	struct UDFButton* DFButton_1; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_Amount; // 0x568(0x08)
	struct UDFImage* DFImage; // 0x570(0x08)
	struct UDFImage* DFImage_2; // 0x578(0x08)
	struct UDFImage* DFImage_3; // 0x580(0x08)
	struct UDFImage* DFImage_36; // 0x588(0x08)
	struct UDFImage* DFImage_42; // 0x590(0x08)
	struct UDFImage* DFImage_1269; // 0x598(0x08)
	struct UDFImage* DFImage_FX_bg_in; // 0x5a0(0x08)
	struct UDFTextBlock* DFTextBlock_81; // 0x5a8(0x08)
	struct UDFTextBlock* DFTextBlock_Amount; // 0x5b0(0x08)
	struct UDFTextBlock* DFTextBlock_GiftAmount; // 0x5b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5c0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5c8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x5d0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_6; // 0x5d8(0x08)
	struct URichTextBlock* RichTextBlock; // 0x5e0(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x5e8(0x08)
	int32_t Style; // 0x5f0(0x04)
	char pad_5F4[0x4]; // 0x5f4(0x04)
	struct TArray<struct FSlateBrush> BG; // 0x5f8(0x10)

	void PC(); // Function WBP_Store_RechargeBtn.WBP_Store_RechargeBtn_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
