
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Equipment_UpgradeSchedule.WBP_Equipment_UpgradeSchedule_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_Equipment_UpgradeSchedule_C : public ULuaUIBaseView {
public:

	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem; // 0x550(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_2; // 0x558(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_3; // 0x560(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_4; // 0x568(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_5; // 0x570(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_6; // 0x578(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_7; // 0x580(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_8; // 0x588(0x08)
	struct UWBP_Equipment_UpgradeScheduleItem_C* WBP_Equipment_UpgradeItem_9; // 0x590(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
