
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Shop_Mask.WBP_Shop_Mask_C
// Size: 0x658 (Inherited: 0x550)
class UWBP_Shop_Mask_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Shop_Mask_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Shop_Mask_yfout; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Shop_Mask_loop; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Shop_Mask_in; // 0x570(0x08)
	struct UWidgetAnimation* LogoLoop; // 0x578(0x08)
	struct UCanvasPanel* CanvasPanel_43; // 0x580(0x08)
	struct UCanvasPanel* CanvasPanel_86; // 0x588(0x08)
	struct UDFTextBlock* DFTextBlock_46; // 0x590(0x08)
	struct UDFTextBlock* DFTextBlock_CountDown; // 0x598(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_61; // 0x5a0(0x08)
	struct UImage* Image_66; // 0x5a8(0x08)
	struct UImage* Image_90; // 0x5b0(0x08)
	struct UImage* Image_109; // 0x5b8(0x08)
	struct UImage* Image_118; // 0x5c0(0x08)
	struct UImage* Image_fxlogo; // 0x5c8(0x08)
	struct UImage* Image_kuangfx; // 0x5d0(0x08)
	struct UImage* Image_kuangfx_2; // 0x5d8(0x08)
	struct UImage* Image_sfx; // 0x5e0(0x08)
	struct UImage* Image_sfx_2; // 0x5e8(0x08)
	struct UImage* Image_sfx_3; // 0x5f0(0x08)
	struct UImage* Image_sfx_4; // 0x5f8(0x08)
	struct UImage* Image_sfx_5; // 0x600(0x08)
	struct UImage* Image_sfx_6; // 0x608(0x08)
	struct UImage* Imagefxhx01_2; // 0x610(0x08)
	struct UImage* Imagefxhx01_5; // 0x618(0x08)
	struct UImage* Imagefxkuai01_4; // 0x620(0x08)
	struct UImage* Imagefxsao01; // 0x628(0x08)
	struct UImage* Imagefxsao01_2; // 0x630(0x08)
	struct UImage* Imagefxxian01_3; // 0x638(0x08)
	struct UImage* Imagexiangzi; // 0x640(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_DFCommonButtonV1S1[0x8]; // 0x648(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char WBP_DFCommonCheckInstruction[0x8]; // 0x650(0x08)

	void PCAdaptation(); // Function WBP_Shop_Mask.WBP_Shop_Mask_C.PCAdaptation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
