
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Guide_Falling_01.WBP_Guide_Falling_01_C
// Size: 0x5b8 (Inherited: 0x550)
class UWBP_Guide_Falling_01_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* Anima_out; // 0x550(0x08)
	struct UWidgetAnimation* Anima_qiehuan; // 0x558(0x08)
	struct UWidgetAnimation* Anima_in; // 0x560(0x08)
	struct UImage* Image_blackFX; // 0x568(0x08)
	/*struct UWBP_TopBarHD_InputSummary_C**/char WBP_TopBarHD_InputSummary[0x8]; // 0x570(0x08)
	struct UDFButton* wtBtnNext; // 0x578(0x08)
	struct UDFButton* wtBtnPre; // 0x580(0x08)
	struct UDFRichTextBlock* wtDesc; // 0x588(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* wtDot1; // 0x590(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* wtDot2; // 0x598(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* wtDot3; // 0x5a0(0x08)
	struct UWBP_DFCommonButtonCarousel_2_C* wtDot4; // 0x5a8(0x08)
	struct UDFMCommonMediaImage* wtMediaImage; // 0x5b0(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
