
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_MailDetail.WBP_MailDetail_C
// Size: 0x638 (Inherited: 0x550)
class UWBP_MailDetail_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_MailDetail_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_MailDetail_in; // 0x560(0x08)
	struct UWidgetAnimation* WBP_MailDetail_out01; // 0x568(0x08)
	struct UWidgetAnimation* WBP_MailDetail_in01; // 0x570(0x08)
	struct UDFImage* DFImage; // 0x578(0x08)
	struct UDFImage* DFImage_2; // 0x580(0x08)
	struct UDFImage* DFImage_3; // 0x588(0x08)
	struct UDFImage* DFImage_210; // 0x590(0x08)
	struct UDFImage* DFImage_299; // 0x598(0x08)
	struct UDFImage* DFImage_630; // 0x5a0(0x08)
	struct UDFImage* DFImage_Icon_line; // 0x5a8(0x08)
	struct UDFImage* DFImage_Icon_line_2; // 0x5b0(0x08)
	struct UDFImage* DFImage_Icon_line_3; // 0x5b8(0x08)
	struct UDFImage* DFImage_Icon_line_4; // 0x5c0(0x08)
	struct UDFNamedSlot* EmptySlot; // 0x5c8(0x08)
	struct URichTextBlock* RichTextBlock_1; // 0x5d0(0x08)
	struct UDFScrollGridBox* ScrollBox_1; // 0x5d8(0x08)
	struct UTextBlock* TextBlock; // 0x5e0(0x08)
	struct UTextBlock* TextBlock_2; // 0x5e8(0x08)
	struct UTextBlock* TextBlock_3; // 0x5f0(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_CommonButtonV2S1_C_3[0x8]; // 0x5f8(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char WBP_CommonButtonV2S2_C_1[0x8]; // 0x600(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char WBP_CommonButtonV2S2_C_2[0x8]; // 0x608(0x08)
	struct UWBP_CommonHeadIcon_C* WBP_CommonHeadIcon; // 0x610(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char wtDFCommonCheckBoxWithText[0x8]; // 0x618(0x08)
	struct UClass* BpTextBlockDecorator; // 0x620(0x08)
	/*struct TArray<struct TSoftObjectPtr<UPaperSprite>>*/char Icon[0x10]; // 0x628(0x10)

	void PreConstruct(bool IsDesignTime); // Function WBP_MailDetail.WBP_MailDetail_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x70c0525399701915
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
