
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_ComplexWeaponDataItem.WBP_ComplexWeaponDataItem_C
// Size: 0x5c5 (Inherited: 0x550)
class UWBP_ComplexWeaponDataItem_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFVerticalBox* wBottomVerticalBox; // 0x558(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm; // 0x560(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_2; // 0x568(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_3; // 0x570(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_4; // 0x578(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_5; // 0x580(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_6; // 0x588(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_7; // 0x590(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_8; // 0x598(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_9; // 0x5a0(0x08)
	struct UWBP_ComplexWeaponDataTerm_C* WBP_ComplexWeaponDataTerm_10; // 0x5a8(0x08)
	struct UDFTextBlock* wRequiredText; // 0x5b0(0x08)
	struct UDFVerticalBox* wTopVerticalBox; // 0x5b8(0x08)
	int32_t Type; // 0x5c0(0x04)
	bool IsGunStand; // 0x5c4(0x01)

	void SetGunStand(); // Function WBP_ComplexWeaponDataItem.WBP_ComplexWeaponDataItem_C.SetGunStand // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xdc0000026
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
