
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_DetailPentagon.WBP_RoleInfo_DetailPentagon_C
// Size: 0x5f2 (Inherited: 0x550)
class UWBP_RoleInfo_DetailPentagon_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_75; // 0x558(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_LastTen; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_Null; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_Season; // 0x570(0x08)
	struct UDFImage* DFImage_3; // 0x578(0x08)
	struct UDFImage* DFImage_Average; // 0x580(0x08)
	struct UDFImage* DFImage_Null; // 0x588(0x08)
	struct UDFImage* DFImage_Null_2; // 0x590(0x08)
	struct UDFImage* DFImage_Null_3; // 0x598(0x08)
	struct UDFImage* DFImage_Recent; // 0x5a0(0x08)
	struct UDFTextBlock* DFTextBlock05_2; // 0x5a8(0x08)
	struct UDFTextBlock* DFTextBlock05_3; // 0x5b0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5c0(0x08)
	struct UWBP_RoleInfo_Detail_TittleText_C* Tittlet01; // 0x5c8(0x08)
	struct UWBP_RoleInfo_Detail_TittleText_C* Tittlet02; // 0x5d0(0x08)
	struct UWBP_RoleInfo_Detail_TittleText_C* Tittlet03; // 0x5d8(0x08)
	struct UWBP_RoleInfo_Detail_TittleText_C* Tittlet04; // 0x5e0(0x08)
	struct UWBP_RoleInfo_Detail_TittleText_C* Tittlet05; // 0x5e8(0x08)
	bool Type; // 0x5f0(0x01)
	bool TextType; // 0x5f1(0x01)

	void SetTextType(bool TextType); // Function WBP_RoleInfo_DetailPentagon.WBP_RoleInfo_DetailPentagon_C.SetTextType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x52c0000064
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
