
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_AssemblyMain_Pc.WBP_AssemblyMain_Pc_C
// Size: 0xb98 (Inherited: 0x550)
class UWBP_AssemblyMain_Pc_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* ValueChanges; // 0x558(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_Pc_to_WBP_Hero_MainPanel; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Hero_MainPanel_to_WBP_AssemblyMain_Pc; // 0x568(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_Pc_to_WBP_AssemblyFirearmsMain; // 0x570(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_highlight; // 0x578(0x08)
	struct UWidgetAnimation* WBP_AssemblyFirearmsMain_to_WBP_AssemblyMain_Pc; // 0x580(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_Pc_to_WBP_AssemblyStorageDefault; // 0x588(0x08)
	struct UWidgetAnimation* WBP_AssemblyStorageDefault_to_WBP_AssemblyMain_Pc; // 0x590(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_out; // 0x598(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_in; // 0x5a0(0x08)
	struct UWidgetAnimation* WBP_AssemblyMain_saoguang; // 0x5a8(0x08)
	struct UDFImage* DFImage_78; // 0x5b0(0x08)
	struct UDFImage* DFImage_187; // 0x5b8(0x08)
	struct UDFImage* DFImage_248; // 0x5c0(0x08)
	struct UDFImage* DFImage_fx01; // 0x5c8(0x08)
	struct UDFRetainerBox* DFRetainerBox_1; // 0x5d0(0x08)
	struct UDFRetainerBox* DFRetainerBox_2; // 0x5d8(0x08)
	struct UDFTypeWriterTextBlock* DFTypeWriterTextBlock_109; // 0x5e0(0x08)
	struct UDFMImage* MI_UI_AssemblyMain; // 0x5e8(0x08)
	struct UWBP_Assembly_WeightBtn_C* WBP_Assembly_WeightBtn; // 0x5f0(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView; // 0x5f8(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_2; // 0x600(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_3; // 0x608(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_4; // 0x610(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_5; // 0x618(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_6; // 0x620(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_7; // 0x628(0x08)
	struct UWBP_AssemblyEquipSlotView_C* WBP_AssemblyEquipSlotView_10; // 0x630(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char WBP_CommonSwitch2[0x8]; // 0x638(0x08)
	/*struct UWBP_EquipmentOnLoan_C**/char WBP_EquipmentOnLoan[0x8]; // 0x640(0x08)
	struct UWBP_SafeRoomChatHistory_C* WBP_SafeRoomChatHistory; // 0x648(0x08)
	struct UWBP_AssemblyEquipAmmoCase_C* wtAssemblyEquipAmmoCase; // 0x650(0x08)
	struct UWBP_AssemblyDrugsBtn_Pc_C* wtAssemblyHDDrugsBtn; // 0x658(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wtCommonButtonV1S2[0x8]; // 0x660(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction[0x8]; // 0x668(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char wtRentalBtn[0x8]; // 0x670(0x08)
	struct UDFTipsAnchor* wtTipsAnchorInstruction; // 0x678(0x08)
	struct FDFBrushButtonStateStyle NewVar_1; // 0x680(0x518)

	void PreConstruct(bool IsDesignTime); // Function WBP_AssemblyMain_Pc.WBP_AssemblyMain_Pc_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffec06b006c
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
