
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_ShootingRange_LoadBullets_Main.WBP_ShootingRange_LoadBullets_Main_C
// Size: 0x5e8 (Inherited: 0x550)
class UWBP_ShootingRange_LoadBullets_Main_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_ShootingRange_LoadBullets_Main_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_ShootingRange_LoadBullets_Main_In; // 0x560(0x08)
	struct UDFBackgroundBlur* DFBackgroundBlur; // 0x568(0x08)
	struct UDFImage* DFImage_4; // 0x570(0x08)
	struct UDFVerticalBox* Panel_Info; // 0x578(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x580(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x588(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x590(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x598(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_10; // 0x5a0(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5a8(0x08)
	struct UWBP_ShootingRange_LoadBullets_Item_C* WBP_ShootingRange_LoadBullets_Item; // 0x5b0(0x08)
	struct UWBP_ShootingRange_LoadBullets_Item_C* WBP_ShootingRange_LoadBullets_Item_2; // 0x5b8(0x08)
	struct UWBP_ShootingRange_LoadBullets_Item_C* WBP_ShootingRange_LoadBullets_Item_3; // 0x5c0(0x08)
	struct UWBP_ShootingRange_LoadBullets_Item_C* WBP_ShootingRange_LoadBullets_Item_4; // 0x5c8(0x08)
	/*struct UWBP_ShootingRange_Switch_C**/char wtMobileDamageHUDToggle[0x8]; // 0x5d0(0x08)
	struct UDFTextBlock* wtPCDamageHUDHint; // 0x5d8(0x08)
	struct UDFCheckBox* wtPCDamageHUDToggle; // 0x5e0(0x08)

	void IsPC(); // Function WBP_ShootingRange_LoadBullets_Main.WBP_ShootingRange_LoadBullets_Main_C.IsPC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
