
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_ItemDetail_WeaponDetail_Equipped.WBP_ItemDetail_WeaponDetail_Equipped_C
// Size: 0x630 (Inherited: 0x550)
class UWBP_ItemDetail_WeaponDetail_Equipped_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_ItemDetail_WeaponDetail_Equipped_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_ItemDetail_WeaponDetail_Equipped_in; // 0x560(0x08)
	struct UDFImage* DFImage; // 0x568(0x08)
	struct UDFImage* DFImage_92; // 0x570(0x08)
	struct UDFImage* Line_2; // 0x578(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_DFCommonButtonV3S1[0x8]; // 0x580(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect; // 0x588(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_2; // 0x590(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_3; // 0x598(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_4; // 0x5a0(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_5; // 0x5a8(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_6; // 0x5b0(0x08)
	struct UWBP_ItemDetailContent_Effect_C* WBP_ItemDetailContent_Effect_7; // 0x5b8(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup; // 0x5c0(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_2; // 0x5c8(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_3; // 0x5d0(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_4; // 0x5d8(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_5; // 0x5e0(0x08)
	struct UWBP_ItemDetailContent_LimitGroup_C* WBP_ItemDetailContent_LimitGroup_6; // 0x5e8(0x08)
	struct URichTextBlock* wDesc; // 0x5f0(0x08)
	struct UDFVerticalBox* WeaponVerticalBox; // 0x5f8(0x08)
	struct UTextBlock* wNameLabel; // 0x600(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char wtDFCommonCheckBoxWithText[0x8]; // 0x608(0x08)
	struct UWBP_ItemDetailContent_ListContent_C* wWeaponAdaptsContent; // 0x610(0x08)
	struct UWBP_ItemDetailContent_ListContent_C* wWeaponAdaptsContent_2; // 0x618(0x08)
	int32_t BPDamageShowDistance; // 0x620(0x04)
	float BpDamageScaleY; // 0x624(0x04)
	struct FName NewVar_1; // 0x628(0x08)

	void SetStyle(); // Function WBP_ItemDetail_WeaponDetail_Equipped.WBP_ItemDetail_WeaponDetail_Equipped_C.SetStyle // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
