
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_BattlePass_Branch_Item_01_PC_S.WBP_BattlePass_Branch_Item_01_PC_S_C
// Size: 0x611 (Inherited: 0x550)
class UWBP_BattlePass_Branch_Item_01_PC_S_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Branch_Item_01_GlitchLoop; // 0x558(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Branch_Item_01_TaskSwitch2; // 0x560(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Branch_Item_01_TaskSwitch1; // 0x568(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Branch_Item_01_in; // 0x570(0x08)
	struct UDFButton* DFButton_1; // 0x578(0x08)
	struct UDFButton* DFButton_2; // 0x580(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_64; // 0x588(0x08)
	struct UDFImage* DFImage_6; // 0x590(0x08)
	struct UDFImage* DFImage_Black; // 0x598(0x08)
	struct UDFImage* DFImage_lineFX1; // 0x5a0(0x08)
	struct UDFImage* DFImage_lineFX2; // 0x5a8(0x08)
	struct UDFTextBlock* DFTextBlock; // 0x5b0(0x08)
	struct UDFTextBlock* DFTextBlock_72; // 0x5b8(0x08)
	struct UImage* Image_glichfx; // 0x5c0(0x08)
	struct UImage* Image_kuangfx_2; // 0x5c8(0x08)
	struct UDFCanvasPanel* Panel_Black; // 0x5d0(0x08)
	struct UDFCanvasPanel* Panel_De; // 0x5d8(0x08)
	struct UDFCanvasPanel* Panel_Right; // 0x5e0(0x08)
	struct UWBP_DFCommonButtonV2S2_C* WBP_CommonButtonV2S2_38; // 0x5e8(0x08)
	/*struct UWBP_CommonItemTemplate_C**/char WBP_CommonItemTemplate[0x8]; // 0x5f0(0x08)
	/*struct UWBP_CommonItemTemplate_C**/char WBP_CommonItemTemplate_2[0x8]; // 0x5f8(0x08)
	struct UWBP_DFCommonButtonV2S2_C* WBP_DFCommonButtonV2S1; // 0x600(0x08)
	struct UWBP_DFCommonButtonV2S2_C* WBP_DFCommonButtonV2S1_72; // 0x608(0x08)
	bool Lock; // 0x610(0x01)

	void SetLock(bool Lock); // Function WBP_BattlePass_Branch_Item_01_PC_S.WBP_BattlePass_Branch_Item_01_PC_S_C.SetLock // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffeff800000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
