
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_PersonalHomepage.WBP_RoleInfo_PersonalHomepage_C
// Size: 0x83a (Inherited: 0x550)
class UWBP_RoleInfo_PersonalHomepage_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_PersonalHomepage_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_PersonalHomepage_in; // 0x560(0x08)
	struct UDFButton* DFButton_56; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_269; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_PrivilegeButton; // 0x578(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_SchoolButton; // 0x580(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_Share; // 0x588(0x08)
	struct UDFCheckBox* DFCheckBox_Icon; // 0x590(0x08)
	struct UDFCommonTextBlock* DFCommonTextBlock_1; // 0x598(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_2; // 0x5a0(0x08)
	struct UDFImage* DFImage; // 0x5a8(0x08)
	struct UDFImage* DFImage_2; // 0x5b0(0x08)
	struct UDFImage* DFImage_3; // 0x5b8(0x08)
	struct UDFImage* DFImage_4; // 0x5c0(0x08)
	struct UDFImage* DFImage_5; // 0x5c8(0x08)
	struct UDFImage* DFImage_6; // 0x5d0(0x08)
	struct UDFImage* DFImage_7; // 0x5d8(0x08)
	struct UDFImage* DFImage_8; // 0x5e0(0x08)
	struct UDFImage* DFImage_9; // 0x5e8(0x08)
	struct UDFImage* DFImage_10; // 0x5f0(0x08)
	struct UDFImage* DFImage_11; // 0x5f8(0x08)
	struct UDFImage* DFImage_12; // 0x600(0x08)
	struct UDFImage* DFImage_90; // 0x608(0x08)
	struct UDFImage* DFImage_127; // 0x610(0x08)
	struct UDFImage* DFImage_189; // 0x618(0x08)
	struct UDFImage* DFImage_235; // 0x620(0x08)
	struct UDFImage* DFImage_335; // 0x628(0x08)
	struct UDFImage* DFImage_388; // 0x630(0x08)
	struct UDFSpacer* DFSpacer_30; // 0x638(0x08)
	struct UDFTextBlock* DFTextBlock_2; // 0x640(0x08)
	struct UDFTextBlock* DFTextBlock_105; // 0x648(0x08)
	struct UDFTextBlock* DFTextBlock_251; // 0x650(0x08)
	struct UDFTextBlock* DFTextBlock_706; // 0x658(0x08)
	struct UDFUniformGridPanel* DFUniformGridPanel_2; // 0x660(0x08)
	struct UDFVerticalBox* DFVerticalBox_3; // 0x668(0x08)
	struct UDFVerticalBox* DFVerticalBox_77; // 0x670(0x08)
	struct UDFWrapBox* DFWrapBox_379; // 0x678(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x680(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x688(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x690(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_6; // 0x698(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_7; // 0x6a0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_8; // 0x6a8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_9; // 0x6b0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_13; // 0x6b8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_14; // 0x6c0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_16; // 0x6c8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_20; // 0x6d0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_21; // 0x6d8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_22; // 0x6e0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_23; // 0x6e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_24; // 0x6f0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_25; // 0x6f8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_26; // 0x700(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_27; // 0x708(0x08)
	struct UPlatformSizeBox* PlatformSizeBox_1; // 0x710(0x08)
	struct UDFTextBlock* Text_Privilege; // 0x718(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton[0x8]; // 0x720(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton_2[0x8]; // 0x728(0x08)
	struct UWBP_Firend_PrivilegeButton_C* WBP_Firend_PrivilegeButton; // 0x730(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtAddFriendBtn[0x8]; // 0x738(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_2; // 0x740(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_3; // 0x748(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_4; // 0x750(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_5; // 0x758(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_6; // 0x760(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_7; // 0x768(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_8; // 0x770(0x08)
	struct UWBP_RoleInfo_BadgeDisplay_C* wtBadgeDisplay_9; // 0x778(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor; // 0x780(0x08)
	struct UDFButton* wtLeftChange; // 0x788(0x08)
	struct UWBP_RoleInfo_RankRewards_C* wtLevelIcon; // 0x790(0x08)
	struct UWBP_RoleInfo_Namecard_C* wtNameCard; // 0x798(0x08)
	struct UDFButton* wtPraiseBtn; // 0x7a0(0x08)
	struct UDFTextBlock* wtPraisedNum; // 0x7a8(0x08)
	struct UWBP_RoleInfo_Dan_C* wtRank; // 0x7b0(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtRefreshModelBtn[0x8]; // 0x7b8(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtReportBtn[0x8]; // 0x7c0(0x08)
	struct UDFButton* wtRightChange; // 0x7c8(0x08)
	struct UWBP_RoleInfo_PersonalInformation_C* wtRoleInfoData1; // 0x7d0(0x08)
	struct UWBP_RoleInfo_PersonalInformation_C* wtRoleInfoData2; // 0x7d8(0x08)
	struct UWBP_RoleInfo_PersonalInformation_C* wtRoleInfoData3; // 0x7e0(0x08)
	struct UWBP_RoleInfo_PersonalInformation_C* wtRoleInfoData4; // 0x7e8(0x08)
	struct UWBP_RoleInfo_PersonalInformation_C* wtRoleInfoData5; // 0x7f0(0x08)
	struct UWBP_RoleInfo_PersonalInformation_C* wtRoleInfoData6; // 0x7f8(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtSaveModelBtn[0x8]; // 0x800(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtShareBtn[0x8]; // 0x808(0x08)
	int32_t Type; // 0x810(0x04)
	char pad_814[0x4]; // 0x814(0x04)
	struct TArray<struct FSlateBrush> ModeIcon; // 0x818(0x10)
	struct TArray<struct FText> Text; // 0x828(0x10)
	bool Praise; // 0x838(0x01)
	bool Share; // 0x839(0x01)

	void SetShare(bool Share); // Function WBP_RoleInfo_PersonalHomepage.WBP_RoleInfo_PersonalHomepage_C.SetShare // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
