
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_ShootingRange_LoadBullets_Item.WBP_ShootingRange_LoadBullets_Item_C
// Size: 0x588 (Inherited: 0x550)
class UWBP_ShootingRange_LoadBullets_Item_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_209; // 0x558(0x08)
	struct UDFImage* DFImage_293; // 0x560(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x568(0x08)
	struct UWBP_ShootingRange_LoadBullets_ItemDetail_C* WBP_ShootingRange_LoadBullets_ItemDetail; // 0x570(0x08)
	struct UDFUniformGridPanel* wtAmmoPanel; // 0x578(0x08)
	int32_t Type; // 0x580(0x04)
	int32_t Position; // 0x584(0x04)

	void IsPC(); // Function WBP_ShootingRange_LoadBullets_Item.WBP_ShootingRange_LoadBullets_Item_C.IsPC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
