
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_BattlePass_Reward.WBP_BattlePass_Reward_C
// Size: 0x6b8 (Inherited: 0x550)
class UWBP_BattlePass_Reward_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Reward_penqihuan; // 0x558(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Reward_out; // 0x560(0x08)
	struct UWidgetAnimation* WBP_BattlePass_Reward_in; // 0x568(0x08)
	struct UDFCanvasPanel* DFCanvasPanel; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_65; // 0x578(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_190; // 0x580(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_1; // 0x588(0x08)
	struct UDFImage* DFImage; // 0x590(0x08)
	struct UDFImage* DFImage_2; // 0x598(0x08)
	struct UDFImage* DFImage_3; // 0x5a0(0x08)
	struct UDFImage* DFImage_4; // 0x5a8(0x08)
	struct UDFImage* DFImage_5; // 0x5b0(0x08)
	struct UDFImage* DFImage_18; // 0x5b8(0x08)
	struct UDFImage* DFImage_102; // 0x5c0(0x08)
	struct UDFImage* DFImage_406; // 0x5c8(0x08)
	struct UDFImage* DFImage_Mask; // 0x5d0(0x08)
	struct UDFImage* DFImage_Mask_2; // 0x5d8(0x08)
	struct UDFTextBlock* DFTextBlock_2; // 0x5e0(0x08)
	struct UDFTextBlock* DFTextBlock_100; // 0x5e8(0x08)
	struct UDFWaterfallScrollView* DFWaterfallScrollView_2; // 0x5f0(0x08)
	struct UImage* Image_123; // 0x5f8(0x08)
	struct UDFImage* Image_BpQualityIcon; // 0x600(0x08)
	struct UDFCanvasPanel* Panel_Base_01; // 0x608(0x08)
	struct UDFCanvasPanel* Panel_Base_02; // 0x610(0x08)
	struct UDFCanvasPanel* Panel_Base_03; // 0x618(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x620(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x628(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x630(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x638(0x08)
	struct URichTextBlock* RichText; // 0x640(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x648(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char WBP_CommonIconButton[0x8]; // 0x650(0x08)
	/*struct UWBP_DFCommonButtonV1S3_C**/char WBP_DFCommonButtonV1S3[0x8]; // 0x658(0x08)
	struct UDFCDNImage* wtPropImg_2; // 0x660(0x08)
	struct UDFCDNImage* wtPropImg_3; // 0x668(0x08)
	struct UDFCDNImage* wtPropImg_4; // 0x670(0x08)
	struct UDFScaleBox* wtPropImgBox_3; // 0x678(0x08)
	int32_t QualityType; // 0x680(0x04)
	char pad_684[0x4]; // 0x684(0x04)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char BpQualityIcon[0x10]; // 0x688(0x10)
	int32_t PriceType; // 0x698(0x04)
	char pad_69C[0x4]; // 0x69c(0x04)
	struct UDFCanvasPanel* Panel_Base_01_1; // 0x6a0(0x08)
	/*struct TArray<struct TSoftObjectPtr<UObject>>*/char ModeImage[0x10]; // 0x6a8(0x10)

	void SetPriceType(int32_t PriceType); // Function WBP_BattlePass_Reward.WBP_BattlePass_Reward_C.SetPriceType // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x6ec0780000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
