
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUpComponent_FunctionGroup.WBP_SetUpComponent_FunctionGroup_C
// Size: 0x5dc (Inherited: 0x550)
class UWBP_SetUpComponent_FunctionGroup_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUpComponent_FunctionGroup_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_SetUpComponent_FunctionGroup_in; // 0x560(0x08)
	struct UDFVerticalBox* FunctionList; // 0x568(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char Title[0x8]; // 0x570(0x08)
	struct FText bpTitle; // 0x578(0x18)
	struct FText bpTitle_1; // 0x590(0x18)
	struct FText bpTitle_2; // 0x5a8(0x18)
	struct FText bpTitle_3; // 0x5c0(0x18)
	int32_t Type; // 0x5d8(0x04)

	void SetType(); // Function WBP_SetUpComponent_FunctionGroup.WBP_SetUpComponent_FunctionGroup_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
