
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Hero_MainPanel.WBP_Hero_MainPanel_C
// Size: 0x6c0 (Inherited: 0x550)
class UWBP_Hero_MainPanel_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hero_MainPanel_out_pc; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Hero_MainPanel_in_pc; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Hero_MainPanel_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Hero_MainPanel_in; // 0x570(0x08)
	struct UWidgetAnimation* Switch; // 0x578(0x08)
	struct UWidgetAnimation* shizhuang_out_zhuanjia_in; // 0x580(0x08)
	struct UWidgetAnimation* peizhuang_out_zhuanjia_in; // 0x588(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x590(0x08)
	struct UCanvasPanel* CanvasPanel_2; // 0x598(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_1; // 0x5a0(0x08)
	struct UDFCanvasPosReContainer* DFCanvasPosReContainer_2; // 0x5a8(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_2; // 0x5b0(0x08)
	struct UDFImage* DFImage_69; // 0x5b8(0x08)
	struct UDFImage* DFImage_105; // 0x5c0(0x08)
	struct UDFImage* DFImage_134; // 0x5c8(0x08)
	struct UDFNamedSlot* DFNamedSlot_194; // 0x5d0(0x08)
	struct UDFRetainerBox* DFRetainerBox_1; // 0x5d8(0x08)
	struct UDFSizeBox* DFSizeBox_1; // 0x5e0(0x08)
	struct UDFTextBlock* DFTextBlock; // 0x5e8(0x08)
	struct UDFTextBlock* DFTextBlock_2; // 0x5f0(0x08)
	struct UDFTextBlock* DFTextBlock_98; // 0x5f8(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char HeroAppearanceButton[0x8]; // 0x600(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char HeroBuy[0x8]; // 0x608(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char HeroDetailBtn[0x8]; // 0x610(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char HeroOperateButton[0x8]; // 0x618(0x08)
	struct UCanvasPanel* HeroOperatePanel; // 0x620(0x08)
	struct UWBP_Hero_Talent_C* HeroSkill1; // 0x628(0x08)
	struct UWBP_Hero_Talent_C* HeroSkill2; // 0x630(0x08)
	struct UImage* Image_102; // 0x638(0x08)
	struct UImage* Image_281; // 0x640(0x08)
	struct UImage* Image_Icon_S; // 0x648(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x650(0x08)
	struct USafeZone* SafeZone_1; // 0x658(0x08)
	struct UDFScrollBox* ScrollBox_71; // 0x660(0x08)
	struct UDFCanvasPanel* SkillPanel; // 0x668(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x670(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char WBP_CommonButtonV3S1[0x8]; // 0x678(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_DFCommonButtonV3S1[0x8]; // 0x680(0x08)
	struct UWBP_Hero_Approach_C* WBP_Hero_Approach_C_1; // 0x688(0x08)
	struct UWBP_Hero_Talent_C* WBP_Hero_PropsItem1; // 0x690(0x08)
	struct UWBP_Hero_Talent_C* WBP_Hero_PropsItem2; // 0x698(0x08)
	/*struct TArray<struct TSoftObjectPtr<UPaperSprite>>*/char BP_Image[0x10]; // 0x6a0(0x10)
	/*struct TArray<struct TSoftObjectPtr<UTexture2D>>*/char Bp_Image2[0x10]; // 0x6b0(0x10)

	void SequenceEvent_1(); // Function WBP_Hero_MainPanel.WBP_Hero_MainPanel_C.SequenceEvent_1 // (BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
