
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Poster_Panel_Item.WBP_Poster_Panel_Item_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_Poster_Panel_Item_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Poster_Panel_in; // 0x558(0x08)
	struct UDFTextBlock* DFTextBlock; // 0x560(0x08)
	struct UDFTextBlock* DFTextBlock_67; // 0x568(0x08)
	struct UDFCDNImage* Image_Bg; // 0x570(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x578(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x580(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x588(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x590(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Poster_Panel_Item.WBP_Poster_Panel_Item_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1bfffffff
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
