
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_MsgCenter.WBP_MsgCenter_C
// Size: 0x5c0 (Inherited: 0x550)
class UWBP_MsgCenter_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_MsgCenter_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_MsgCenter_in; // 0x560(0x08)
	struct UCanvasPanel* CanvasPanel_2; // 0x568(0x08)
	struct UWBP_DFCommonButtonV2S2_C* CommonButton_V1; // 0x570(0x08)
	struct UDFImage* DFImage_157; // 0x578(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x580(0x08)
	struct UDFScrollGridBox* ScrollGridBox_Friend; // 0x588(0x08)
	struct UDFScrollGridBox* ScrollGridBox_Msg; // 0x590(0x08)
	struct UTextBlock* TextBlock; // 0x598(0x08)
	struct UTextBlock* TextBlock_4; // 0x5a0(0x08)
	struct UTextBlock* TextBlock_7; // 0x5a8(0x08)
	/*struct UWBP_Common_NoAnything_C**/char WBP_Common_NoAnything[0x8]; // 0x5b0(0x08)
	struct UTextBlock* TextBlock_1; // 0x5b8(0x08)

	void PC(); // Function WBP_MsgCenter.WBP_MsgCenter_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0918940
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
