
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Chat_Team.WBP_Chat_Team_C
// Size: 0x5b8 (Inherited: 0x550)
class UWBP_Chat_Team_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Chat_Team_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Chat_Team_in; // 0x560(0x08)
	struct UButton* Button_mention; // 0x568(0x08)
	struct UButton* Button_UnRead; // 0x570(0x08)
	struct UDFNamedSlot* EmptySlot; // 0x578(0x08)
	struct ULine* Image_341; // 0x580(0x08)
	struct UImage* Image_1095; // 0x588(0x08)
	struct UImage* Image_1149; // 0x590(0x08)
	struct UImage* Image_1176; // 0x598(0x08)
	struct UImage* Image_1401; // 0x5a0(0x08)
	struct UDFRichTextBlock* TextBlock_373; // 0x5a8(0x08)
	struct UDFWaterfallScrollView* WaterfallScrollView; // 0x5b0(0x08)

	void PC(); // Function WBP_Chat_Team.WBP_Chat_Team_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0740000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
