
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_WeaponSkinsBtn.WBP_Store_WeaponSkinsBtn_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_Store_WeaponSkinsBtn_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* HoverAni; // 0x558(0x08)
	struct UDFImage* DFImage_62; // 0x560(0x08)
	struct UImage* Image_30; // 0x568(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x570(0x08)
	struct UWBP_CommonHoverScaleOnly_C* WBP_CommonHoverScaleOnly; // 0x578(0x08)
	struct UDFButton* wtButtonSelect; // 0x580(0x08)
	struct UDFImage* wtImageItem; // 0x588(0x08)
	struct URichTextBlock* wtTextPrice; // 0x590(0x08)

	void PC(); // Function WBP_Store_WeaponSkinsBtn.WBP_Store_WeaponSkinsBtn_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c000003e
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
