
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Collections_GunTypeMain.WBP_Collections_GunTypeMain_C
// Size: 0x65d (Inherited: 0x550)
class UWBP_Collections_GunTypeMain_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Collections_GunTypeMain_in; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Collections_GunTypeMain_out; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Collections_GunTypeMain_in02; // 0x568(0x08)
	struct UDFBlurSlotReContainer* DFBlurSlotReContainer_Mask; // 0x570(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_UI; // 0x578(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_158; // 0x580(0x08)
	struct UDFImage* DFImage; // 0x588(0x08)
	struct UDFImage* DFImage_87; // 0x590(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox; // 0x598(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5a0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5a8(0x08)
	struct UDFCanvasPanel* wtAlertHintBox; // 0x5b0(0x08)
	struct UDFTextBlock* wtAlertHintTxt; // 0x5b8(0x08)
	/*struct UWBP_DFCommonButtonV1S1_C**/char wtApplyBtn[0x8]; // 0x5c0(0x08)
	struct UWBP_CommonDownload_C* wtCommonDownload; // 0x5c8(0x08)
	struct UWBP_DFCommonButtonV2S2_C* wtDetailBtn; // 0x5d0(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wtDetailBtn_PC[0x8]; // 0x5d8(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtDownloadBtn[0x8]; // 0x5e0(0x08)
	struct UDFCanvasPanel* wtEmptyBg; // 0x5e8(0x08)
	struct UDFNamedSlot* wtEmptySlot; // 0x5f0(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char wtFilterBtn[0x8]; // 0x5f8(0x08)
	struct UWBP_Collections_ProductionButton_C* wtFromAuctionBtn; // 0x600(0x08)
	struct UWBP_Collections_ProductionButton_C* wtFromMandelBrickBtn; // 0x608(0x08)
	struct UWBP_Collections_ProductionButton_C* wtFromMatrixWorkshopBtn; // 0x610(0x08)
	struct UDFButton* wtHideUIBtn; // 0x618(0x08)
	struct UDFVerticalBox* wtInfoPanel; // 0x620(0x08)
	/*struct UWBP_ItemDetailView_Streamline_C**/char wtItemDetailView[0x8]; // 0x628(0x08)
	struct UWBP_CommonItemViewDropDownBox_C* wtMysticalSkinDropDown; // 0x630(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtShareBtn[0x8]; // 0x638(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtTradeBtn[0x8]; // 0x640(0x08)
	struct UWBP_DFCommon_MissionUnlocked_C* wtWeaponSkinMissionProgressPanel; // 0x648(0x08)
	struct UDFWaterfallScrollView* wtWeaponSkinScrollView; // 0x650(0x08)
	int32_t Type; // 0x658(0x04)
	bool Hiding; // 0x65c(0x01)

	void HideUI(bool Hiding); // Function WBP_Collections_GunTypeMain.WBP_Collections_GunTypeMain_C.HideUI // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
