
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Collections_Main.WBP_Collections_Main_C
// Size: 0x598 (Inherited: 0x550)
class UWBP_Collections_Main_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_Collections_Main_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Collections_Main_in; // 0x558(0x08)
	struct UDFImage* DFImage_62; // 0x560(0x08)
	struct UNamedSlot* NamedSlot_ItemList; // 0x568(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x570(0x08)
	struct UDFCDNImage* wtPropImg_2; // 0x578(0x08)
	struct UDFCDNImage* wtPropImg_3; // 0x580(0x08)
	struct UDFCDNImage* wtPropImg_4; // 0x588(0x08)
	struct UDFScaleBox* wtPropImgBox_3; // 0x590(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
