
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Chat_Text.WBP_Chat_Text_C
// Size: 0x669 (Inherited: 0x550)
class UWBP_Chat_Text_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Chat_Text_Loading; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Chat_Text_out; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Chat_Text_in; // 0x568(0x08)
	struct UButton* Button_7; // 0x570(0x08)
	struct UDFButton* Button_Translation; // 0x578(0x08)
	struct UCanvasPanel* CanvasPanel_6; // 0x580(0x08)
	struct UCanvasPanel* CanvasPanel_Content; // 0x588(0x08)
	struct UImage* ChatImgBg; // 0x590(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_Loading; // 0x598(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_TranslationBtn; // 0x5a0(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_TranslationText; // 0x5a8(0x08)
	struct UDFImage* DFImage; // 0x5b0(0x08)
	struct UDFImage* DFImage_70; // 0x5b8(0x08)
	struct UDFNamedSlot* DFNamedSlot_167; // 0x5c0(0x08)
	struct UImage* Image; // 0x5c8(0x08)
	struct UImage* Image_2; // 0x5d0(0x08)
	struct UImage* Image_3; // 0x5d8(0x08)
	struct UImage* Image_5; // 0x5e0(0x08)
	struct UImage* Image_261; // 0x5e8(0x08)
	struct UImage* Image_356; // 0x5f0(0x08)
	struct URichTextBlock* RichTextBlock_1; // 0x5f8(0x08)
	struct URichTextBlock* RichTextBlock_Translation; // 0x600(0x08)
	struct UTextBlock* TextBlock_13; // 0x608(0x08)
	struct UTextBlock* TextBlock_85; // 0x610(0x08)
	struct UDFVerticalBox* VerticalBox_3; // 0x618(0x08)
	struct UWBP_Chat_Booking_C* WBP_Chat_Booking; // 0x620(0x08)
	struct UWBP_Chat_BtnBoxS2_C* WBP_Chat_BtnBoxS2_115; // 0x628(0x08)
	struct UWBP_Chat_VoiceBtn_C* WBP_Chat_VoiceBtn; // 0x630(0x08)
	/*struct UWBP_Common_SmallFlatRank_C**/char WBP_Common_SmallFlatRank_C_1[0x8]; // 0x638(0x08)
	struct UWBP_CommonHeadIcon_C* WBP_CommonHeadIcon; // 0x640(0x08)
	/*struct UWBP_CommonHover_C**/char WBP_CommonHover[0x8]; // 0x648(0x08)
	struct UWBP_RoleInfo_TitleItem_Small_C* WBP_RoleInfo_TitleItem_Small; // 0x650(0x08)
	struct UButton* wButton_1; // 0x658(0x08)
	struct UDFMLongPressButton* wtHeadBtn; // 0x660(0x08)
	bool Set_Scale; // 0x668(0x01)

	void BP_Set_Type(); // Function WBP_Chat_Text.WBP_Chat_Text_C.BP_Set_Type // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x63c0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
