
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_StaffLottery_Bg.WBP_StaffLottery_Bg_C
// Size: 0x360 (Inherited: 0x298)
class UWBP_StaffLottery_Bg_C : public UUserWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_Bg_loop_2; // 0x2a0(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_Bg_loop_3; // 0x2a8(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_Bg_loop_1; // 0x2b0(0x08)
	struct UWidgetAnimation* WBP_StaffLottery_Bg_loop; // 0x2b8(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_99; // 0x2c0(0x08)
	struct UDFImage* fx_arm; // 0x2c8(0x08)
	struct UDFImage* fx_arm_2; // 0x2d0(0x08)
	struct UDFImage* fx_arm_3; // 0x2d8(0x08)
	struct UDFImage* fx_BG1; // 0x2e0(0x08)
	struct UDFImage* fx_face; // 0x2e8(0x08)
	struct UDFImage* fx_guang; // 0x2f0(0x08)
	struct UDFImage* fx_guang_2; // 0x2f8(0x08)
	struct UDFImage* GunImg; // 0x300(0x08)
	struct UParticleWidget* ParticleWidget; // 0x308(0x08)
	struct UParticleWidget* ParticleWidget_87; // 0x310(0x08)
	struct UUIMeshWidget* UIMeshWidget_body; // 0x318(0x08)
	struct UUIMeshWidget* UIMeshWidget_body2; // 0x320(0x08)
	struct UUIMeshWidget* UIMeshWidget_body3; // 0x328(0x08)
	struct UUIMeshWidget* UIMeshWidget_body4; // 0x330(0x08)
	struct UUIMeshWidget* UIMeshWidget_face; // 0x338(0x08)
	struct UUIMeshWidget* UIMeshWidget_face_2; // 0x340(0x08)
	struct UUIMeshWidget* UIMeshWidget_smoke_2; // 0x348(0x08)
	struct UUIMeshWidget* UIMeshWidget_smoke1_2; // 0x350(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_UnScaleBg; // 0x358(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_StaffLottery_Bg.WBP_StaffLottery_Bg_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3f03a8f5fdc7211b
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
