
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Common_LobbyDraw.WBP_Common_LobbyDraw_C
// Size: 0x5d0 (Inherited: 0x550)
class UWBP_Common_LobbyDraw_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Common_LobbyDraw_drawClose_deprecated; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Common_LobbyDraw_drawOpen_deprecated; // 0x560(0x08)
	struct UDFButton* DFButton_switcher; // 0x568(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_All; // 0x570(0x08)
	struct UDFImage* DFImage_Arrow1; // 0x578(0x08)
	struct UDFImage* DFImage_Arrow2; // 0x580(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Activity; // 0x588(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_BP; // 0x590(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Class; // 0x598(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Collection; // 0x5a0(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Friend; // 0x5a8(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Mail; // 0x5b0(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Market; // 0x5b8(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Setting; // 0x5c0(0x08)
	struct UWBP_Common_TopBarV1_RightTop_Item_C* WBP_Com_Item_Store; // 0x5c8(0x08)

	void BndEvt__DFButton_switcher_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature(); // Function WBP_Common_LobbyDraw.WBP_Common_LobbyDraw_C.BndEvt__DFButton_switcher_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature // (BlueprintEvent) // @ game+0xffffffffc0000001
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
