
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_TheChestOpensMain.WBP_Store_TheChestOpensMain_C
// Size: 0x808 (Inherited: 0x550)
class UWBP_Store_TheChestOpensMain_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_Loop; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_PlayVideo; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_out; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Store_TheChestOpensMain_in; // 0x570(0x08)
	struct UDFButton* DFButton_150; // 0x578(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x580(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_4; // 0x588(0x08)
	struct UDFImage* DFImage_2; // 0x590(0x08)
	struct UDFImage* DFImage_3; // 0x598(0x08)
	struct UDFImage* DFImage_4; // 0x5a0(0x08)
	struct UDFImage* DFImage_5; // 0x5a8(0x08)
	struct UDFImage* DFImage_6; // 0x5b0(0x08)
	struct UDFImage* DFImage_7; // 0x5b8(0x08)
	struct UDFImage* DFImage_8; // 0x5c0(0x08)
	struct UDFImage* DFImage_68; // 0x5c8(0x08)
	struct UDFImage* DFImage_117; // 0x5d0(0x08)
	struct UDFImage* DFImage_119; // 0x5d8(0x08)
	struct UDFImage* DFImage_164; // 0x5e0(0x08)
	struct UDFImage* DFImage_242; // 0x5e8(0x08)
	struct UDFImage* DFImage_245; // 0x5f0(0x08)
	struct UDFImage* DFImage_276; // 0x5f8(0x08)
	struct UDFImage* DFImage_342; // 0x600(0x08)
	struct UDFImage* DFImage_403; // 0x608(0x08)
	struct UDFImage* DFImage11; // 0x610(0x08)
	struct UDFMCommonMediaImage* DFMCommonMediaImage_337; // 0x618(0x08)
	struct UDFScaleBox* DFScaleBox_1; // 0x620(0x08)
	struct UDFTextBlock* DFTextBlock_192; // 0x628(0x08)
	struct UDFTextBlock* DFTextBlock_DrawOne_Key; // 0x630(0x08)
	struct UDFTextBlock* DFTextBlock_DrawOne_Mandel; // 0x638(0x08)
	struct UDFTextBlock* DFTextBlock_DrawTen_Key; // 0x640(0x08)
	struct UDFTextBlock* DFTextBlock_DrawTen_Mandel; // 0x648(0x08)
	struct UDFVerticalBox* DFVerticalBox_1; // 0x650(0x08)
	struct UDFVerticalBox* DFVerticalBox_47; // 0x658(0x08)
	struct UDFWidgetSwitcher* DFWidgetSwitcher_212; // 0x660(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x668(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x670(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x678(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x680(0x08)
	struct UPlatformSizeBox* PlatformSizeBox_1; // 0x688(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_UnScaleBg; // 0x690(0x08)
	struct UWBP_CommonHoverBg_V2_C* WBP_CommonHoverBg_V2; // 0x698(0x08)
	struct UWBP_DFCommonIconCheckButton_C* WBP_CommonIconCheckBox; // 0x6a0(0x08)
	struct UWBP_CommonVideoComponent_C* WBP_CommonVideoComponent; // 0x6a8(0x08)
	struct UWBP_Store_ItemName_C* WBP_Store_ItemName; // 0x6b0(0x08)
	struct UWBP_Store_ItemName_C* WBP_Store_ItemName_2; // 0x6b8(0x08)
	struct UWBP_Store_RecommendHomepage_Medusa_C* WBP_Store_RecommendHomepage_Medusa_60; // 0x6c0(0x08)
	struct UWBP_Store_RecommendHomepage_VFX_PrismOffensive_C* WBP_Store_RecommendHomepage_VFX_PrismOffensive; // 0x6c8(0x08)
	struct UDFButton* wtAllPrizesCheckBtn_3; // 0x6d0(0x08)
	struct UComputeTextBlock* wtBoxNameText; // 0x6d8(0x08)
	struct UDFImage* wtCannotRestoreHintImg; // 0x6e0(0x08)
	struct UDFTextBlock* wtCannotRestoreHintText; // 0x6e8(0x08)
	struct UWBP_DFTabV3GroupBox_C* wtDFTabV3GroupBoxClass3Dynamic; // 0x6f0(0x08)
	struct UDFImage* wtFirearmImg; // 0x6f8(0x08)
	struct UDFImage* wtFirearmImg_2; // 0x700(0x08)
	struct UDFRichTextBlock* wtGuaranteedGroupHintText; // 0x708(0x08)
	struct UDFRichTextBlock* wtGuaranteedPropHintText; // 0x710(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wtMultipleActionBtn[0x8]; // 0x718(0x08)
	/*struct UWBP_DFCommonIconButton_C**/char wtPlayVideoBtn[0x8]; // 0x720(0x08)
	struct UDFCanvasPanel* wtPrizesPanel; // 0x728(0x08)
	struct UDFWaterfallScrollView* wtPrizesScrollBox_2; // 0x730(0x08)
	struct UWBP_DFCommonCheckButtonV3S1_C* wtProbOverallCheckBtn; // 0x738(0x08)
	/*struct UWBP_DFCommonButtonV1S2_C**/char wtSingleActionBtn[0x8]; // 0x740(0x08)
	struct UWBP_Common_JumpOver_C* wtSkipBtn; // 0x748(0x08)
	struct TMap<struct FString, struct FSoftObjectPath> IDToBackground; // 0x750(0x50)
	bool IsTab; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct TArray<struct FString> ID; // 0x7a8(0x10)
	struct TMap<struct FString, struct UTexture2D*> WordArtImage; // 0x7b8(0x50)

	void SetVfx(struct FString& ID); // Function WBP_Store_TheChestOpensMain.WBP_Store_TheChestOpensMain_C.SetVfx // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
