
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_GunStand_Misson.WBP_GunStand_Misson_C
// Size: 0x5a9 (Inherited: 0x550)
class UWBP_GunStand_Misson_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_GunStand_Misson_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_GunStand_Misson_in; // 0x560(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_148; // 0x568(0x08)
	struct UDFImage* DFImage_82; // 0x570(0x08)
	struct UDFImage* DFImage_144; // 0x578(0x08)
	struct UDFMCommonImage* DFImage_fx2_3; // 0x580(0x08)
	struct UDFTextBlock* DFTextBlock_147; // 0x588(0x08)
	struct UWBP_DFCommonFoldCheckBox_C* WBP_DFCommonFoldCheckBox; // 0x590(0x08)
	struct UWBP_ComplexWeaponDataItem_C* wComplexWeaponDataItem; // 0x598(0x08)
	struct UDFRichTextBlock* wtRichText; // 0x5a0(0x08)
	bool isShow; // 0x5a8(0x01)

	void SetType(); // Function WBP_GunStand_Misson.WBP_GunStand_Misson_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
