
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Hero_SkillInfoPop.WBP_Hero_SkillInfoPop_C
// Size: 0x5d4 (Inherited: 0x550)
class UWBP_Hero_SkillInfoPop_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Hero_SkillInfoPop_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Hero_SkillInfoPop_in; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_150; // 0x568(0x08)
	struct UDFImage* DFImage_31; // 0x570(0x08)
	struct UDFImage* DFImage_39; // 0x578(0x08)
	struct UComputeTextBlock* DFTextBlock_147; // 0x580(0x08)
	struct UImage* Image_55; // 0x588(0x08)
	struct UImage* Image_Icon; // 0x590(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x598(0x08)
	struct UPlatformSizeBox* PlatformSizeBox_2; // 0x5a0(0x08)
	/*struct UWBP_DFCommonButtonV3S1_C**/char WBP_DFCommonButtonV3S1[0x8]; // 0x5a8(0x08)
	struct UWBP_Hero_SkillInfo_C* WBP_Hero_SkillInfo; // 0x5b0(0x08)
	struct UWBP_Hero_SkillInfo_C* WBP_Hero_SkillInfo_121; // 0x5b8(0x08)
	struct UWBP_Hero_SkillInfo_C* WBP_Hero_SkillInfo_198; // 0x5c0(0x08)
	struct UWBP_Hero_SkillInfo_C* WBP_Hero_SkillInfo_353; // 0x5c8(0x08)
	int32_t Type; // 0x5d0(0x04)

	void BP_SetType(int32_t Type); // Function WBP_Hero_SkillInfoPop.WBP_Hero_SkillInfoPop_C.BP_SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
