
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Store_RechargePanel.WBP_Store_RechargePanel_C
// Size: 0x5b8 (Inherited: 0x550)
class UWBP_Store_RechargePanel_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Store_RechargePanel_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Store_RechargePanel_in; // 0x560(0x08)
	struct UDFWrapBox* DFWrapBox_163; // 0x568(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x570(0x08)
	struct UWBP_Store_RechargeBtn_C* RechargeItem1; // 0x578(0x08)
	struct UWBP_Store_RechargeBtn_C* RechargeItem2; // 0x580(0x08)
	struct UWBP_Store_RechargeBtn_C* RechargeItem3; // 0x588(0x08)
	struct UWBP_Store_RechargeBtn_C* RechargeItem4; // 0x590(0x08)
	struct UWBP_Store_RechargeBtn_C* RechargeItem5; // 0x598(0x08)
	struct UWBP_Store_RechargeBtn_C* RechargeItem6; // 0x5a0(0x08)
	struct UWBP_Common_ScaleBg_C* WBP_Common_ScaleBg; // 0x5a8(0x08)
	struct UDFImage* wtFirearmImg; // 0x5b0(0x08)

	void PC(); // Function WBP_Store_RechargePanel.WBP_Store_RechargePanel_C.PC // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x72c0650073
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
