
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_RoleInfo_Detail.WBP_RoleInfo_Detail_C
// Size: 0x694 (Inherited: 0x550)
class UWBP_RoleInfo_Detail_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_Detail_Out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_RoleInfo_Detail_In; // 0x560(0x08)
	struct UDFCanvasPanel* DFCanvasPanel_5; // 0x568(0x08)
	struct UDFHorizontalBox* DFHorizontalBox; // 0x570(0x08)
	struct UDFHorizontalBox* DFHorizontalBox_1; // 0x578(0x08)
	struct UDFImage* DFImage_2; // 0x580(0x08)
	struct UDFImage* DFImage_3; // 0x588(0x08)
	struct UDFImage* DFImage_4; // 0x590(0x08)
	struct UDFImage* DFImage_5; // 0x598(0x08)
	struct UDFImage* DFImage_6; // 0x5a0(0x08)
	struct UDFImage* DFImage_7; // 0x5a8(0x08)
	struct UDFImage* DFImage_146; // 0x5b0(0x08)
	struct UDFImage* DFImage_454; // 0x5b8(0x08)
	struct UDFImage* DFImage_Star; // 0x5c0(0x08)
	struct UComputeTextBlock* DFTextBlock_2; // 0x5c8(0x08)
	struct UDFTextBlock* DFTextBlock_NewRankName; // 0x5d0(0x08)
	struct UDFTextBlock* DFTextBlock_NewRankPoint; // 0x5d8(0x08)
	struct UDFTextBlock* DFTextBlockGame_Num; // 0x5e0(0x08)
	struct UDFTextBlock* DFTextBlockTime_Num; // 0x5e8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_1; // 0x5f0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x5f8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x600(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x608(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x610(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_7; // 0x618(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_11; // 0x620(0x08)
	struct UWBP_RoleInfo_DetailList_C* WBP_RoleInfo_DetailList01; // 0x628(0x08)
	struct UWBP_RoleInfo_DetailList_C* WBP_RoleInfo_DetailList01_MP; // 0x630(0x08)
	struct UWBP_RoleInfo_DetailList_C* WBP_RoleInfo_DetailList02; // 0x638(0x08)
	struct UWBP_RoleInfo_DetailList_C* WBP_RoleInfo_DetailList02_MP; // 0x640(0x08)
	struct UWBP_RoleInfo_DetailList_C* WBP_RoleInfo_DetailList03; // 0x648(0x08)
	struct UWBP_RoleInfo_DetailList_C* WBP_RoleInfo_DetailList03_MP; // 0x650(0x08)
	struct UWBP_RoleInfo_DetailPentagon_C* WBP_RoleInfo_DetailPentagon; // 0x658(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction01[0x8]; // 0x660(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction02[0x8]; // 0x668(0x08)
	/*struct UWBP_DFCommonCheckBoxWithText_C**/char wtDFCommonCheckBoxWithText[0x8]; // 0x670(0x08)
	struct UDFTextBlock* wtNickName; // 0x678(0x08)
	struct UWBP_Common_BigFlatRank_C* wtRankIcon; // 0x680(0x08)
	/*struct UWBP_DFCommonDropDownBox_C**/char wtSortDropDown[0x8]; // 0x688(0x08)
	int32_t Type; // 0x690(0x04)

	void SetType(int32_t Type); // Function WBP_RoleInfo_Detail.WBP_RoleInfo_Detail_C.SetType // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffec0000000
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
