
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_CommonPopWindowsV2_line.WBP_CommonPopWindowsV2_line_C
// Size: 0x2e8 (Inherited: 0x298)
class UWBP_CommonPopWindowsV2_line_C : public UUserWidget {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_line; // 0x2a0(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_lineloop_1; // 0x2a8(0x08)
	struct UWidgetAnimation* WBP_CommonPopWindowsV2_lineloop; // 0x2b0(0x08)
	struct UDFImage* DFImage_L; // 0x2b8(0x08)
	struct UDFImage* DFImage_L_2; // 0x2c0(0x08)
	struct UDFImage* DFImage_plusL_2; // 0x2c8(0x08)
	struct UDFImage* DFImage_plusR_2; // 0x2d0(0x08)
	struct UDFImage* DFImage_R; // 0x2d8(0x08)
	struct UDFImage* DFImage_R_2; // 0x2e0(0x08)

	void Construct(); // Function WBP_CommonPopWindowsV2_line.WBP_CommonPopWindowsV2_line_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xfffffffebfffffff
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
