
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUp_Privacy_Pc.WBP_SetUp_Privacy_Pc_C
// Size: 0x5d0 (Inherited: 0x550)
class UWBP_SetUp_Privacy_Pc_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_SetUp_Privacy_Pc_out; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUp_Privacy_Pc_in; // 0x558(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_Children_Privacy; // 0x560(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_Contract; // 0x568(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_Credit; // 0x570(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_DeleteAccount; // 0x578(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char CN_History_Check[0x8]; // 0x580(0x08)
	/*struct UWBP_SetUpComponent_Check_C**/char CN_History_Enhanced[0x8]; // 0x588(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char CN_ListTitle[0x8]; // 0x590(0x08)
	/*struct UWBP_SetUpComponent_keyboardTitle_C**/char CN_ListTitle_2[0x8]; // 0x598(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_PersonalInformation; // 0x5a0(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_Privacy; // 0x5a8(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* CN_Privacy_SDK; // 0x5b0(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* Oversea_PrivacyPolicy; // 0x5b8(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* Oversea_TermsOfUse; // 0x5c0(0x08)
	struct UWBP_SetUpComponent_Jump_Pc_C* WBP_SetUpComponent_Jump_Pc_7; // 0x5c8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
