
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SyncMain.WBP_SyncMain_C
// Size: 0x5f0 (Inherited: 0x550)
class UWBP_SyncMain_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SyncMain_AutoIn_2; // 0x558(0x08)
	struct UWidgetAnimation* WBP_SyncMain_AutoIn_1; // 0x560(0x08)
	struct UWidgetAnimation* WBP_SyncMain_Autout; // 0x568(0x08)
	struct UWidgetAnimation* WBP_SyncMain_Autoloop; // 0x570(0x08)
	struct UWidgetAnimation* WBP_SyncMain_AutoIn; // 0x578(0x08)
	struct UDFRetainerBox* DFRetainerBox_1; // 0x580(0x08)
	struct UImage* Image_1888; // 0x588(0x08)
	struct UTextBlock* Text_Back; // 0x590(0x08)
	struct UWBP_SyncBtn_Item_01_C* wtAuctionBtn; // 0x598(0x08)
	struct UDFButton* wtCloseBtn; // 0x5a0(0x08)
	struct UWBP_SyncBtn_Item_C* wtGalleryBtn; // 0x5a8(0x08)
	struct UWBP_SyncBtn_Item_C* wtHeroBtn; // 0x5b0(0x08)
	struct UWBP_SyncBtn_Item_01_C* wtInventoryBtn; // 0x5b8(0x08)
	struct UWBP_SyncBtn_Item_C* wtLoadoutBtn; // 0x5c0(0x08)
	struct UWBP_SyncBtn_Item_01_C* wtQuestBtn; // 0x5c8(0x08)
	struct UWBP_SyncBtn_Item_C* wtSafeHouseBtn; // 0x5d0(0x08)
	struct UWBP_SyncBtn_Item_C* wtSafeHouseProdBtn; // 0x5d8(0x08)
	struct UWBP_SyncBtn_Item_C* wtScavBtn; // 0x5e0(0x08)
	struct UWBP_SyncBtn_Item_01_C* wtShopBtn; // 0x5e8(0x08)

	void Construct(); // Function WBP_SyncMain.WBP_SyncMain_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1bfffffff
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
