
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Equipment_UpgradeMain.WBP_Equipment_UpgradeMain_C
// Size: 0x5f8 (Inherited: 0x550)
class UWBP_Equipment_UpgradeMain_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_Equipment_UpgradeMain1_anniu_pc; // 0x558(0x08)
	struct UWidgetAnimation* WBP_Equipment_UpgradeMain1_anniu; // 0x560(0x08)
	struct UWidgetAnimation* WBP_Equipment_UpgradeMain1_tiaozengzhang; // 0x568(0x08)
	struct UWidgetAnimation* WBP_Equipment_UpgradeMain1_out; // 0x570(0x08)
	struct UWidgetAnimation* WBP_Equipment_UpgradeMain1_in; // 0x578(0x08)
	struct UWidgetAnimation* Ani_AutoOut; // 0x580(0x08)
	struct UWidgetAnimation* Ani_Autoin; // 0x588(0x08)
	struct UDFImage* DFImage_135; // 0x590(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_2; // 0x598(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_3; // 0x5a0(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_4; // 0x5a8(0x08)
	struct UPlatformPaddingBox* PlatformPaddingBox_5; // 0x5b0(0x08)
	struct UWBP_DFCommonButtonV2S1_C* WBP_DFCommonButtonV2S1; // 0x5b8(0x08)
	struct UWBP_DFCommonProgressBarV1_C* WBP_DFCommonProgressBarV1; // 0x5c0(0x08)
	/*struct UWBP_GunStand_GunsmithDetailPartMainUI_C**/char WBP_GunStand_GunsmithDetailPartMainUI[0x8]; // 0x5c8(0x08)
	struct UWBP_GunStand_GunsmithSimulateStatePropmtUI_C* WBP_GunStand_GunsmithSimulateStatePropmtUI; // 0x5d0(0x08)
	struct UWBP_ItemDetailView_Equipped_C* WBP_ItemDetailView_Equipped_C_1; // 0x5d8(0x08)
	struct UDFWaterfallScrollView* wLvlScrollGridBox; // 0x5e0(0x08)
	struct UTextBlock* wNameLabel; // 0x5e8(0x08)
	struct UWBP_DFCommonIconCheckButton_C* wtCheckBoxLookWeaponModel; // 0x5f0(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Equipment_UpgradeMain.WBP_Equipment_UpgradeMain_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x69c06c0075
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
