
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_SetUpComponent_FunctionKeyChoiceItem.WBP_SetUpComponent_FunctionKeyChoiceItem_C
// Size: 0x5a9 (Inherited: 0x550)
class UWBP_SetUpComponent_FunctionKeyChoiceItem_C : public ULuaUIBaseView {
public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x550(0x08)
	struct UWidgetAnimation* WBP_SetUpComponent_FunctionKeyChoiceItem_out; // 0x558(0x08)
	struct UWidgetAnimation* WBP_SetUpComponent_FunctionKeyChoiceItem_in; // 0x560(0x08)
	struct UDFImage* DFImage_329; // 0x568(0x08)
	struct UDFImage* DFImage_Mask; // 0x570(0x08)
	struct UCanvasPanel* HoverPan; // 0x578(0x08)
	struct UTextBlock* TextBlock; // 0x580(0x08)
	struct UWBP_DFTabGroupDroDownBox_Pc_C* WBP_DFTabGroupDroDownBox_Pc; // 0x588(0x08)
	struct FText Title; // 0x590(0x18)
	bool Disabled; // 0x5a8(0x01)

	void SetDisabled(); // Function WBP_SetUpComponent_FunctionKeyChoiceItem.WBP_SetUpComponent_FunctionKeyChoiceItem_C.SetDisabled // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xfffffffcc0000044
	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
