
#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace Dumper {
// WidgetBlueprintGeneratedClass WBP_Assembly_Rental_PC.WBP_Assembly_Rental_PC_C
// Size: 0x5c0 (Inherited: 0x550)
class UWBP_Assembly_Rental_PC_C : public ULuaUIBaseView {
public:

	struct UWidgetAnimation* WBP_Assembly_Rental_PC_in; // 0x550(0x08)
	struct UDFImage* DFImage_62; // 0x558(0x08)
	struct UDFImage* DFImage_82; // 0x560(0x08)
	struct UDFRichTextBlock* DFRichTextBlock_1; // 0x568(0x08)
	struct UDFTipsAnchor* DFTipsAnchor_133; // 0x570(0x08)
	struct UWBP_Assembly_RentalPlan_PC_C* WBP_Assembly_RentalPlan_PC; // 0x578(0x08)
	struct UWBP_Assembly_RentalPlan_PC_C* WBP_Assembly_RentalPlan_PC_2; // 0x580(0x08)
	struct UWBP_Assembly_RentalPlan_PC_C* WBP_Assembly_RentalPlan_PC_3; // 0x588(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction[0x8]; // 0x590(0x08)
	/*struct UWBP_DFCommonCheckInstruction_C**/char wtCommonCheckInstruction_2[0x8]; // 0x598(0x08)
	struct UDFTipsAnchor* wtDFTipsAnchor; // 0x5a0(0x08)
	struct UDFRichTextBlock* wtVoucherNum_2; // 0x5a8(0x08)
	struct UDFRichTextBlock* wtVoucherNum_3; // 0x5b0(0x08)
	struct UDFRichTextBlock* wtVoucherNum_4; // 0x5b8(0x08)

	static UClass* StaticClass(); // Dumper_Generated_Function // () // @ game+0x000000
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
